{"ಕರ್ದು": [{"type": "verb", "defs": ["= ಕರ್ದುಂಕು - 1."]}], "ಕರ್ದುಂಕು": [{"type": "verb", "defs": ["to strike with beak or with a pointed object; to peck.", "to kiss (esp. a person's cheek) hastily or perfunctorily."]}], "ಕರ್ದುಕು": [{"type": "noun", "defs": ["= ಕರ್ದುಂಕು."]}], "ಕರ್ನ": [{"type": "noun", "defs": ["[rightly ಕರ್ಣ ] the organ of hearing and balance in humans and vertebrates, esp. the external part of this; the ear.", "corresponding organ in other animals."]}], "ಕರ್ನಲ": [{"type": "noun", "defs": ["= ಕರ್ನಲ್ಲು."]}], "ಕರ್ನಲ್ಲು": [{"type": "noun", "defs": ["a military officer ranking above a lieutenant colonel and below a brigadier general; a colonel."]}], "ಕರ್ನಾಟ": [{"type": "noun", "defs": ["= ಕರ್ನಾಟಕ - 2."]}], "ಕರ್ನಾಟಕ": [{"type": "noun", "defs": ["Kannaḍa one of the major Dravidian languages, and the official language of, and chiefly spoken by the people of, Karnāṭaka.", "Karnāṭaka, one of the major states of Indian republic, situated in the southern plateau."]}], "ಕರ್ನಾಲಿ": [{"type": "noun", "defs": ["a kind of plant.", "its bulbous root."]}], "ಕರ್ನಿಕೆ": [{"type": "noun", "defs": ["the enlarged, hollow part of the pistil or gynoecium, containing ovules; the ovary in a flower."]}], "ಕರ್ನೆ": [{"type": "noun", "defs": ["a long brass blow-pipe.", "a small hand-held tool with a flat pointed blade, used to apply and spread mortar etc by a mason; a trowel."]}], "ಕರ್ನೆತ್ತರ್": [{"type": "noun", "defs": ["blood that is dark red."]}], "ಕರ್ನೆಯ್ದಿಲ್": [{"type": "noun", "defs": ["= ಕರ್ನೈದಿಲು."]}], "ಕರ್ನೈದಿಲ": [{"type": "noun", "defs": ["= ಕರ್ನೈದಿಲು."]}], "ಕರ್ನೈದಿಲು": [{"type": "noun", "defs": ["the water lily plant Nymphaea alba of Nymphaeaceae family."]}], "ಕರ್ಪ": [{"type": "noun", "defs": ["the plant Lepisanthes deficiens of Sapindaceae family."]}], "ಕರ್ಪಟ": [{"type": "noun", "defs": ["a woven, knitted or pressed fabric of fibrous material, as cotton, wool, silk, synthetic fibers, etc. ; a cloth.", "a waste piece of cloth, esp. one that is old or torn; rag."]}], "ಕರ್ಪಟಿ": [{"type": "noun", "defs": ["a man in rags; a beggar."]}], "ಕರ್ಪಟಿಕ": [{"type": "noun", "defs": ["= ಕರ್ಪಟಿ."]}], "ಕರ್ಪಡ": [{"type": "noun", "defs": ["= ಕರ್ಪಟ - 1;", "a dirty piece of linen; a shabby dress."]}], "ಕರ್ಪಣ": [{"type": "noun", "defs": ["a kind of military weapon."]}], "ಕರ್ಪರ": [{"type": "noun", "defs": ["a large tank or other vessel, esp. for holding water or other liquids; a vat.", "the skeleton of the head of a human being.", "a wide, concave container or pan for frying.", "a broken piece of a pot; a potsherd.", "a kind of weapon.", "the back-bone (as of human)."]}], "ಕರ್ಪರಿ": [{"type": "noun", "defs": ["copper sulphate.", "zinc carbonate."]}], "ಕರ್ಪಾಸ": [{"type": "noun", "defs": ["the cotton plant (Gossypium herbaceum (= G. obtusifolium) of Malvaceae family)."]}], "ಕರ್ಪಾಸಿ": [{"type": "noun", "defs": ["= ಕರ್ಪಾಸ."]}], "ಕರ್ಪಿಡಿ": [{"type": "verb", "defs": ["to become black; to become darker (in complexion)."]}], "ಕರ್ಪಿಡು": [{"type": "verb", "defs": ["to become black; to become darker (in complexion)."]}], "ಕರ್ಪು": [{"type": "adjective", "defs": ["black - very dark, having no colour from the absorption of all or nearly all incident light; b) completely dark from the absence of a source of light."]}, {"type": "noun", "defs": ["the colour that is black; black colour.", "a medicated black lotion for the eyes.", "absence of light; darkness."]}, {"type": "noun", "defs": ["a hole, pit in the ground made to catch wild animals."]}], "ಕರ್ಪುರ": [{"type": "noun", "defs": ["= ಕರ್ಪೂರ."]}], "ಕರ್ಪುರಕಚರಿ": [{"type": "noun", "defs": ["a fragrant root of a plant used for medicinal purpose."]}], "ಕರ್ಪುರಚಿನ್ನಿ": [{"type": "noun", "defs": ["= ಕರ್ಪೂರಚಿನ್ನಿ."]}], "ಕರ್ಪುರವಳ್ಳಿ": [{"type": "noun", "defs": ["= ಕರ್ಪೂರವಳ್ಳಿ."]}], "ಕರ್ಪುರವಾಳೆ": [{"type": "noun", "defs": ["= ಕರ್ಪೂರಬಾಳೆ."]}], "ಕರ್ಪುರವೀಟಿಕೆ": [{"type": "noun", "defs": ["a preparation of betel leaves scented with edible camphor."]}], "ಕರ್ಪುರಶುಂಠಿ": [{"type": "noun", "defs": ["= ಕರ್ಪೂರಶುಂಠಿ."]}], "ಕರ್ಪುರಸುಂಟಿ": [{"type": "noun", "defs": ["= ಕರ್ಪೂರಶುಂಠಿ."]}], "ಕರ್ಪುವೀಱು": [{"type": "verb", "defs": ["to spread darkness; to make dark."]}], "ಕರ್ಪುವೆರಸು": [{"type": "verb", "defs": ["to have or be blended with black colour."]}], "ಕರ್ಪುವೆಱು": [{"type": "verb", "defs": ["to become black; to become darker (in complexion)."]}], "ಕರ್ಪೂರ": [{"type": "noun", "defs": ["a volatile, crystalline ketone, C10H16O, with a strong characteristic odor, derived from the wood of the camphor tree or synthetically from pinene, used to protect fabrics from moths, in manufacturing cellulose plastics, in medicine as an irritant and stimulant and for lights to be waved before a deity; camphor.", "the tree Cinnamomum camphora of Lauraceae family; camphor tree.", "the plant Anisochilus carnosus of Lamiaceae family."]}], "ಕರ್ಪೂರಅರಿಸಿನ": [{"type": "noun", "defs": ["the plant Curcuma amada of Zingiberaceae family; mango ginger."]}], "ಕರ್ಪೂರಚಿನ್ನಿ": [{"type": "noun", "defs": ["the vine Piper cubeba (= Cubeba officinalis) of Piperaceae family; Chinese pepper."]}], "ಕರ್ಪೂರತೈಲ": [{"type": "noun", "defs": ["a solution of camphor in any of various oils, used as a liniment; camphorated oil."]}], "ಕರ್ಪೂರಬಾಳೆ": [{"type": "noun", "defs": ["a variety in plantain."]}], "ಕರ್ಪೂರಬೆಂಡೆ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಕರ್ಪೂರಮಣಿ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಕರ್ಪೂರವಳ್ಳಿ": [{"type": "noun", "defs": ["the plant Anisochilus carnosus of Lamiaceae family."]}], "ಕರ್ಪೂರವಾಳೆ": [{"type": "noun", "defs": ["= ಕರ್ಪೂರಬಾಳೆ."]}], "ಕರ್ಪೂರವೀಳೆಯ": [{"type": "noun", "defs": ["a preparation of betel leaves scented with edible camphor."]}], "ಕರ್ಪೂರಶಿಲಾಜಿತು": [{"type": "noun", "defs": ["a foliated, crystalised gypsum, used for medicinal purpose."]}], "ಕರ್ಪೂರಶಿಲಾಜಿತ್ತು": [{"type": "noun", "defs": ["= ಕರ್ಪೂರಶಿಲಾಜಿತು."]}], "ಕರ್ಪೂರಶಿಲಾಧಾತು": [{"type": "noun", "defs": ["= ಕರ್ಪೂರಶಿಲಾಜಿತು."]}], "ಕರ್ಪೂರಶುಂಠಿ": [{"type": "noun", "defs": ["a variety in ginger (family: Zingiberaceae) known for its aromatic rhizome.", "the rhizome itself."]}], "ಕರ್ಪೂರಾರತಿ": [{"type": "noun", "defs": ["a lighted camphor for waving before an idol."]}], "ಕರ್ಪೇಱಿಸು": [{"type": "verb", "defs": ["to cause to become black (as by burning a wick)."]}], "ಕರ್ಪೇಱು": [{"type": "verb", "defs": ["to become black; to become darker (in complexion)."]}], "ಕರ್ಬ": [{"type": "noun", "defs": ["a large number (10,000,000,000)."]}], "ಕರ್ಬಕ್ಕಿ": [{"type": "noun", "defs": ["any of a number of large birds of prey with a naked, usu. brightly coloured head and dark plumage, which feed chiefly or entirely on carrion."]}], "ಕರ್ಬಟ್ಟೆ": [{"type": "noun", "defs": ["a black path; the path of smoke."]}], "ಕರ್ಬಟ್ಟೆಗ": [{"type": "noun", "defs": ["fire."]}], "ಕರ್ಬಡ": [{"type": "noun", "defs": ["a town that is smaller than a city but bigger than a village, surrounded by hills or mountains."]}], "ಕರ್ಬಣ್ಣ": [{"type": "noun", "defs": ["the colour of charcoal; black colour."]}], "ಕರ್ಬರಲ್": [{"type": "noun", "defs": ["a brilliant precious variety of corundum of beautiful blue; sapphire."]}], "ಕರ್ಬಲಾ": [{"type": "noun", "defs": ["a community performance of dance, singing, etc. held during Muharram, a Muslim festival."]}], "ಕರ್ಬಸಿರು": [{"type": "noun", "defs": ["a black belly.", "a mysterious thing which is difficult to understand."]}], "ಕರ್ಬಸು": [{"type": "noun", "defs": ["a black cow."]}, {"type": "noun", "defs": ["a large lobed glandular organ in the abdomen of vertebrates, functioning in many metabolic processes including the regulation of toxic materials in the blood, secreting bile, etc.; the liver."]}], "ಕರ್ಬಸುರಿ": [{"type": "noun", "defs": ["the tree Ficus tsakela (= F. venosa) of Moraceae family; a kind of fig tree."]}], "ಕರ್ಬಳ್ಳಿ": [{"type": "noun", "defs": ["the plant Carissa carandas of Apocynaceae family.", "the plant Anisomelus malabarica of Lamiaceae family.", "the plant Uvaria narum of Annonaceae family."]}], "ಕರ್ಬಾಳ": [{"type": "noun", "defs": ["an East Indian grass (akin to Vetiveria zizanioides)."]}], "ಕರ್ಬಾಳೆ": [{"type": "noun", "defs": ["the black variety of the sea-fish Trichiurus lepturus."]}, {"type": "noun", "defs": ["a plantain tree bearing small fruit of dark colour (from 200 to 400 in a bunch)."]}], "ಕರ್ಬಿತ್ತರ": [{"type": "noun", "defs": ["the extent the darkness has covered; the area that has no light at all."]}], "ಕರ್ಬು": [{"type": "noun", "defs": ["the perennial tropical grass of the genus Saccharum (family: Poaceae), Saccharum officinarum; its tall stout jointed stems from which sugar is made; sugar-cane."]}], "ಕರ್ಬುಗರ್ದೆ": [{"type": "noun", "defs": ["a field where sugar-cane is grown."]}], "ಕರ್ಬುಗುಳ್": [{"type": "noun", "defs": ["an abscess that is black (?)."]}], "ಕರ್ಬುಜ": [{"type": "noun", "defs": ["= ಕರ್ಬೂಜ."]}], "ಕರ್ಬುದ": [{"type": "noun", "defs": ["= ಕರ್ಬ."]}], "ಕರ್ಬುದೋಂಟ": [{"type": "noun", "defs": ["a sugar-cane field."]}], "ಕರ್ಬುನ": [{"type": "noun", "defs": ["a malleable, magnetic, readily oxidizable metal which is a chemical element of the transition series (atomic no. 26), widely used, chiefly in alloys such as steel, for tools, implements, structures, machinery, etc. (Symbol Fe.); iron."]}], "ಕರ್ಬುರ": [{"type": "adjective", "defs": ["of a colour intermediate between black and white, as of ashes or lead; grey."]}, {"type": "noun", "defs": ["the gray colour.", "a blend of different colours.", "the black colour.", "a precious yellow malleable ductile high-density metallic element resistant to chemical reaction; gold.", "a malignant supernatural being; a devil; a demon.", "the breaking of divine or moral law, esp. by a conscious act; a sin.", "the plant Datura stramonium of Solanaceae family.", "water.", "a mineral form of arsenic trisulphide, formerly used as a dye and artisṭs pigment; orpiment.", "Niruti, the regent of the south-west quarter."]}], "ಕರ್ಬುರತ್ವ": [{"type": "noun", "defs": ["the quality or fact of having a blend of different colours.", "a hard white metallic transition element, occurring naturally as chromite and used as a shiny decorative electroplated coating (symbol Cr); chromium.", "the quality, condition or fact of being a daemon."]}], "ಕರ್ಬುರಿತ": [{"type": "adjective", "defs": ["of different colours; variegated.", "of the colour of charcoal; black."]}], "ಕರ್ಬುರಿಸು": [{"type": "verb", "defs": ["to cause to become black; to blacken; to darken."]}], "ಕರ್ಬುಲಿ": [{"type": "noun", "defs": ["a tiger of slightly dark colour."]}], "ಕರ್ಬುವಿಲ್": [{"type": "noun", "defs": ["a bow of sugar-cane; the bow of Love-God, Manmatha."]}], "ಕರ್ಬುವಿಲ್ಲ": [{"type": "noun", "defs": ["Manmatha, whose bow is made of a sugar-cane."]}], "ಕರ್ಬೂಜ": [{"type": "noun", "defs": ["water melon - a) the trailing vine Citrullus vulgaris of Cucurbitaceae family widely cultivated for its gourd; b) its large, round or oblong, edible fruit with hard, green rind and sweet, juicy, red pulp containing many seeds."]}], "ಕರ್ಬೂರ": [{"type": "noun", "defs": ["= ಕರ್ಬುರ2 - 4 & 9.", "the plant Curcuma zeodariana (= C. zerumbet, = Amonum zerumbet) of Zngibrceae family."]}], "ಕರ್ಬೆಟ್ಟು": [{"type": "noun", "defs": ["a black mountain.", "the blue mlountain range in Tamiḷ Nāḍu, South India."]}], "ಕರ್ಬೊಂಗಲ್": [{"type": "noun", "defs": ["a piece of iron, steel, alloy ore, etc., usu. in the form of a bar or horseshoe, having properties of attracting or repelling iron; a magnet."]}], "ಕರ್ಬೊಂಜಲಾಕೆ": [{"type": "noun", "defs": ["a slender straight bar of iron."]}], "ಕರ್ಬೊಗರ್": [{"type": "noun", "defs": ["the glossiness of black colour."]}], "ಕರ್ಬೊಗೆ": [{"type": "noun", "defs": ["thick, black smoke."]}], "ಕರ್ಬೊನ್": [{"type": "noun", "defs": ["= ಕರ್ಬುನ."]}], "ಕರ್ಬೊನ್ಗಲ್": [{"type": "noun", "defs": ["= ಕರ್ಬೊಂಗಲ್."]}], "ಕರ್ಬೊನ್ನು": [{"type": "noun", "defs": ["= ಕರ್ಬುನ."]}], "ಕರ್ಮ": [{"type": "noun", "defs": ["the doing of something; state of being in motion or of working; an action; a work; a deed.", "a ceremonial or formal, solemn act, observance or procedure in accordance with prescribed rule or custom, as in religious use a religious rite.", "a deed or action that is supposed to have effect in one's future birth or births.", "in Dvaita phil. one of the ten basic elements; a natural or active property (as support of the earth).", "(gram.). a noun or other substantive that directly or indirectly receives the action of a verb; the object of an action.", "(astrol.) the tenth house in the zodiac diagram; the tenth lunar mansion.", "a symbol for the number six, 6."]}], "ಕರ್ಮಂದಿ": [{"type": "noun", "defs": ["a man who has renunciated his worldly attachments for religious purpose."]}], "ಕರ್ಮಕರ": [{"type": "noun", "defs": ["a man who works; a worker."]}], "ಕರ್ಮಕರಿ": [{"type": "noun", "defs": ["a woman worker."]}], "ಕರ್ಮಕಾಂಡ": [{"type": "noun", "defs": ["that part of the Vedās which deals with the riligious rites as sacrifices, etc.", "(fig.) a swindle or fraud esp. in a large scale in public administration."]}], "ಕರ್ಮಕಾಂಡಿ": [{"type": "noun", "defs": ["a man who observes strictly the religious rites."]}], "ಕರ್ಮಕಾರ": [{"type": "noun", "defs": ["a man who works; a worker.", "a skilled worker.", "a smith who works in iron; black-smith.", "a man who works on a machine."]}], "ಕರ್ಮಕೀಲಕ": [{"type": "noun", "defs": ["a man whose work is washing clothes, linens, etc.; a launderer; a washerman."]}], "ಕರ್ಮಕೌಶಲ": [{"type": "noun", "defs": ["expertness, practised ability, facility in an action; dexterity, skill or tact."]}], "ಕರ್ಮಕ್ಷಪಣ": [{"type": "noun", "defs": ["(Jain.) a religious observance intended to clear off or reduce the effects of one's past deeds."]}], "ಕರ್ಮಕ್ಷಮ": [{"type": "noun", "defs": ["a man having required expertness, ability in an action."]}], "ಕರ್ಮಕ್ಷಯ": [{"type": "noun", "defs": ["the act or process of destructing the effects (either good or bad) of one's past deeds.", "(Jain.) the act or process of destructing the effects of one's past actions and avoiding of its further accumulation."]}], "ಕರ್ಮಗತಿ": [{"type": "noun", "defs": ["the natural course of actions and effects."]}], "ಕರ್ಮಚಾಂಡಾಲ": [{"type": "noun", "defs": ["a man engaged or inclined to engage in a mean act or acts; he who commits or committed ommission of a mandatory religious act or acts."]}], "ಕರ್ಮಚಾಂಡಾಳ": [{"type": "noun", "defs": ["= ಕರ್ಮಚಾಂಡಾಲ."]}], "ಕರ್ಮಚಾಂಡಾಳೆ": [{"type": "noun", "defs": ["a woman engaged or inclined to engage in a mean act; she who commits or has committed ommission of a mandatory religious act or acts."]}], "ಕರ್ಮಚಾರ": [{"type": "noun", "defs": ["a worker; any labourer in gen."]}], "ಕರ್ಮಜ": [{"type": "noun", "defs": ["the tree Ficus religiosa of Moraceae family; peepul.", "the tree Ficus benghalensis (=F. indica) of Moraceae family; banyan tree.", "the fourth of the four mythological eras, Kaliyuga.", "(myth.) heaven, the abode for virtuous people after their death.", "(myth.) hell, the place for wicked, evil people after their death.", "in Dvaita phil. he who by virtuous actions attained the divinehood.", "the effects of action (in a religious sense)."]}], "ಕರ್ಮಜೀವಿ": [{"type": "noun", "defs": ["a person who leads a worldly life in ignorance."]}], "ಕರ್ಮಠ": [{"type": "adjective", "defs": ["observing religious rites strictly as per the rules."]}, {"type": "noun", "defs": ["an expert worker.", "a man observing religious rites strictly as per the rules.", "the director of a religious rite.", "one who attaches unduly excesive importance to religious rites and neglects practicality and reasoning."]}], "ಕರ್ಮಠತನ": [{"type": "noun", "defs": ["the quality or practice of observing the religious rites scrupulously."]}], "ಕರ್ಮಠತೆ": [{"type": "noun", "defs": ["= ಕರ್ಮಠತನ."]}], "ಕರ್ಮಡು": [{"type": "noun", "defs": ["a deep and still waters (that looks black or dark).", "the river Yamunā, one of the major and holy rivers of North India.", "ಕರ್ಮಡುವಿನಣ್ಣ karmaḍuvinaṇṇa (myth.) Yama, the Death-God, theelder brother of the personified Yamunā river."]}], "ಕರ್ಮಣಿ": [{"type": "noun", "defs": ["a brilliant precious variety of corundum of beautiful blue; sapphire.", "a small glass beed (these beeds are stringed as a necklace and worn by women)."]}, {"type": "noun", "defs": ["a devouted or sincere worker."]}], "ಕರ್ಮಣಿಪ್ರಯೋಗ": [{"type": "noun", "defs": ["(gram.) the voice or form of a verb whose subject is the recipient (object) of the action of the verb; active voice."]}], "ಕರ್ಮಣ್ಯ": [{"type": "noun", "defs": ["= ಕರ್ಮಣಿ2."]}], "ಕರ್ಮಣ್ಯೆ": [{"type": "noun", "defs": ["money paid to an employee for work done, and usu. figured on an hourly, daily or piecework basis; wages."]}], "ಕರ್ಮತ್ಯಾಗ": [{"type": "noun", "defs": ["renunciation of worldy duties or ceremonial acts."]}], "ಕರ್ಮತ್ರಯ": [{"type": "noun", "defs": ["(pl.) three kinds of deeds - a) of past birth or births, b) of the present birth so fr and c) of the ones that are going to happen in future in the present birth."]}], "ಕರ್ಮದಾನ": [{"type": "noun", "defs": ["a superintendent of a Budhist monastery."]}], "ಕರ್ಮದೋಷ": [{"type": "noun", "defs": ["a defect in one's action.", "an evil consequence of the deeds of one's past birth or of one's past actions in the present birth.", "an action that results in evil consequence."]}], "ಕರ್ಮಧಾರಯ": [{"type": "noun", "defs": ["(gram.) a compound in which the members of the compound are in apposition."]}], "ಕರ್ಮಧಾರೆ": [{"type": "noun", "defs": ["a series of actions (the consequence of which follows later)."]}], "ಕರ್ಮನಿರ್ಜರೆ": [{"type": "noun", "defs": ["destruction of the consequnce of one's past deeds."]}], "ಕರ್ಮಪದ": [{"type": "noun", "defs": ["(gram.) a noun or other substantive that directly or indirectly receives the action of a verb; the object of an action."]}], "ಕರ್ಮಪರಿಪಾಕ": [{"type": "noun", "defs": ["the consequence of deeds of past birth or births; reward of actions done in a former life or lives."]}], "ಕರ್ಮಪಾಕ": [{"type": "noun", "defs": ["= ಕರ್ಮಪರಿಪಾಕ."]}], "ಕರ್ಮಫಲ": [{"type": "noun", "defs": ["= ಕರ್ಮಪರಿಪಾಕ."]}], "ಕರ್ಮಫಳ": [{"type": "noun", "defs": ["= ಕರ್ಮಪರಿಪಾಕ."]}], "ಕರ್ಮಬಂದಿ": [{"type": "noun", "defs": ["one who is bound by a mandate for action; one who has to do something inevitably."]}], "ಕರ್ಮಬಂಧ": [{"type": "noun", "defs": ["confinement to repeated birth, as the consequence of religious acts, good or bad (by which the soul is attached to worldly pleasure, etc.)."]}], "ಕರ್ಮಬಂಧನ": [{"type": "noun", "defs": ["= ಕರ್ಮಬಂಧ."]}], "ಕರ್ಮಭೂಮಿ": [{"type": "noun", "defs": ["the land of religious rites; (usu. referred to India) 2) (Jain.) that part of the earth in which the life is carried on in avasarpiṇi stage (a condition or period of decline, as in morals, social life, quality of human life, etc.; deterioration; decay; decadence)."]}], "ಕರ್ಮಮಾರ್ಗ": [{"type": "noun", "defs": ["the manner in which an action is or is to be, carried out.", "(phil.) observance of one's duties, being one of three paths for realisation."]}], "ಕರ್ಮಯೋಗ": [{"type": "noun", "defs": ["performance of actions, worldly and religious rites, without having desire for the results."]}], "ಕರ್ಮಯೋಗಿ": [{"type": "noun", "defs": ["a man who performs his actions, worldly and religious rites, without having desire for the results."]}], "ಕರ್ಮಯೋಗಿನಿ": [{"type": "noun", "defs": ["a woman who performs her actions, worldly and religious rites, without having desire for the results."]}], "ಕರ್ಮರ": [{"type": "noun", "defs": ["the citrus tree, Citrus aurantium of Rutaceae family.", "its fruit."]}, {"type": "noun", "defs": ["the tree Hardwickia binata (= H. pinnata) of Caesalpiniaceae family; Malabar mahagony.", "the tree Hopea parviflora of Dipterocarpaceae family; Iron wood of Malbar."]}], "ಕರ್ಮರು": [{"type": "noun", "defs": ["a smith who works in iron; a blacksmith."]}], "ಕರ್ಮಲ್ಲಿಗೆ": [{"type": "noun", "defs": ["a sweet smelling jasmine flower."]}], "ಕರ್ಮವರ್ಗಣೆ": [{"type": "noun", "defs": ["(Jain.) consequnce of a past action supposed to be in the form of atoms."]}], "ಕರ್ಮವಲೆ": [{"type": "noun", "defs": ["a condition with yellowing of the skin or whites of the eyes, often caused by obstruction of the bile duct or by liver disease; jaundice."]}], "ಕರ್ಮವಶ": [{"type": "noun", "defs": ["that the happening of which is determind by one's past actions; the condition of being subject to the consequences of one's past deeds."]}], "ಕರ್ಮವಾದ": [{"type": "noun", "defs": ["a doctrine that the present happenings are nothing but the consequence of one's past actions."]}], "ಕರ್ಮವಾದಿ": [{"type": "noun", "defs": ["a peron who believes or upholds the doctrine that the present happenings are nothing but the consequence of one's past actions."]}], "ಕರ್ಮವಿದೂರ": [{"type": "noun", "defs": ["(masc.) one who does not or need not, perform any duty."]}], "ಕರ್ಮವಿದೂರೆ": [{"type": "noun", "defs": ["(fem.) one who does not or need not, perform any duty."]}], "ಕರ್ಮವಿಪಾಕ": [{"type": "noun", "defs": ["= ಕರ್ಮಪರಿಪಾಕ."]}], "ಕರ್ಮವಿಪಾಕಗತಿ": [{"type": "noun", "defs": ["the natural course of actions and effects."]}], "ಕರ್ಮವಿರಹಿತ": [{"type": "noun", "defs": ["(masc.) one who is not bound by actions."]}], "ಕರ್ಮವಿರಹಿತೆ": [{"type": "noun", "defs": ["(fem.) one who is not bound by actions."]}], "ಕರ್ಮವೀರ": [{"type": "noun", "defs": ["one who performs his duties dauntlessly and without desiring for its fruits; a sincere doer."]}], "ಕರ್ಮವ್ಯಸನಿ": [{"type": "noun", "defs": ["a person who observes strictly or obsessed in performing, religious rites as per the rules."]}], "ಕರ್ಮಶಾಲೆ": [{"type": "noun", "defs": ["a room or building in which a work is carried on or goods are manufactured; a workplace."]}], "ಕರ್ಮಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["a scripture on religious rites or its teachings."]}], "ಕರ್ಮಶೀಲ": [{"type": "adjective", "defs": ["assiduous - a) doing with constant and careful attention; b) diligent; persevering."]}, {"type": "noun", "defs": ["(masc.) an assiduous, active worker."]}], "ಕರ್ಮಶೀಲೆ": [{"type": "noun", "defs": ["(fem.) an assiduous, active worker."]}], "ಕರ್ಮಶೂರ": [{"type": "noun", "defs": ["= ಕರ್ಮವೀರ."]}], "ಕರ್ಮಸಂನ್ಯಾಸ": [{"type": "noun", "defs": ["= ಕರ್ಮಸನ್ಯಾಸ."]}], "ಕರ್ಮಸಂನ್ಯಾಸಿಕ": [{"type": "noun", "defs": ["= ಕರ್ಮಸನ್ಯಾಸಿ."]}], "ಕರ್ಮಸಚಿವ": [{"type": "noun", "defs": ["(masc.) an agent, minister, etc. who looks after performance or execution of a work."]}], "ಕರ್ಮಸನ್ಯಾಸ": [{"type": "noun", "defs": ["the renunciation of all kinds of worldly acts.", "absence of desire for the rewards of one's deeds."]}], "ಕರ್ಮಸನ್ಯಾಸಿ": [{"type": "noun", "defs": ["a religious man who has withdrawn from every kind of worldly acts.", "a man who performs religious deeds without aspiring for the reward."]}], "ಕರ್ಮಸಾಕ್ಷಿ": [{"type": "noun", "defs": ["an eye-witness of an action.", "the Supreme Omniscient Being that witnesses the action of all people in the universe.", "the Sun-god."]}], "ಕರ್ಮಸಾಧಕ": [{"type": "noun", "defs": ["one who accomplishes the work undertaken."]}], "ಕರ್ಮಸಾನ": [{"type": "noun", "defs": ["an iron pin in the bridle of a horse."]}], "ಕರ್ಮಸಿದ್ಧ": [{"type": "noun", "defs": ["an accomplished performer.", "an accomplished man in carrying out riligious rites."]}], "ಕರ್ಮಸಿದ್ಧಿ": [{"type": "noun", "defs": ["perfect accomplishment in an undertaking; success."]}], "ಕರ್ಮಸ್ಥಾನ": [{"type": "noun", "defs": ["the place, room or building where a work is carried on; a workplace.", "(astrol.) the tenth house from the house of birth (lagna) in the zodiac chart."]}], "ಕರ್ಮಸ್ಥಿತಿ": [{"type": "noun", "defs": ["the condition or state of being which is the result of one's past actions."]}], "ಕರ್ಮಾಂಗ": [{"type": "noun", "defs": ["a part of one's duty or process of performance.", "an inseparable part of a religious rite."]}], "ಕರ್ಮಾಂತರ": [{"type": "noun", "defs": ["difference or contrariety of action.", "an action different from the one to be or being done.", "an action done in penance for something.", "funeral rites or ceremonies."]}], "ಕರ್ಮಾಂತಿಕ": [{"type": "noun", "defs": ["= ಕರ್ಮಾಂತರ - 4."]}], "ಕರ್ಮಾಂತ್ಯ": [{"type": "noun", "defs": ["the end of a work or religious rite."]}], "ಕರ್ಮಾಣು": [{"type": "noun", "defs": ["(Jain.) consequnce of a past action supposed to be in the form of atoms."]}], "ಕರ್ಮಾಧಿಕಾರ": [{"type": "noun", "defs": ["the authority or eligibility of a person for doing a work, performing religious rites."]}], "ಕರ್ಮಾನುಷ್ಠಾನ": [{"type": "noun", "defs": ["the act of performing any act in gen.; execution, accomplishment, fulfillment, etc.", "the act or process of performing one's religious rites."]}], "ಕರ್ಮಾಯತ್ತ": [{"type": "adjective", "defs": ["subject to performance (of an act).", "subject to a religious rite or rites.", "subject to the consequence of a past act."]}], "ಕರ್ಮಾರ": [{"type": "noun", "defs": ["a man skilled in using tools or in making, operating, and repairing machines; a mechnic.", "a man working in iron; a blacksmith.", "a giant woody grass of the mainly tropical regions, belonging to the Poaceae family; bamboo."]}], "ಕರ್ಮಾರ್ಥ": [{"type": "noun", "defs": ["the sense of a verb or verbal phrase, any complements, in relation to the object in a sentence."]}], "ಕರ್ಮಾಲಯ": [{"type": "noun", "defs": ["a room or building in which a work is carried on or goods are manufactured; a workplace."]}], "ಕರ್ಮಿ": [{"type": "noun", "defs": ["a performer, doer or worker.", "a person whose actions result in either good or bad consequences.", "a wicked person; an evil doer; a sinner."]}], "ಕರ್ಮಿಗ": [{"type": "noun", "defs": ["a man who works, esp. a manual or industrial employee; a worker."]}], "ಕರ್ಮಿಷ್ಠ": [{"type": "noun", "defs": ["(masc.) an assiduous worker; a very active person.", "(masc.) one who attaches very much importance to action, performance.", "(phil.) a man who follows the path of religious rites rather than of knowledge or devotion."]}], "ಕರ್ಮೀನು": [{"type": "noun", "defs": ["dried and processed fish."]}], "ಕರ್ಮೀರ": [{"type": "adjective", "defs": ["having, blended with, many colour; variegated."]}, {"type": "noun", "defs": ["a blend of different colours."]}], "ಕರ್ಮೀಸೆ": [{"type": "noun", "defs": ["black moustache."]}], "ಕರ್ಮುಗಿಲ್": [{"type": "noun", "defs": ["a black, rain-giving cloud."]}], "ಕರ್ಮುಗಿಲು": [{"type": "noun", "defs": ["= ಕರ್ಮುಗಿಲ್."]}], "ಕರ್ಮೇಂದ್ರಿಯ": [{"type": "noun", "defs": ["any of the five organs of action (the hand, leg, tongue, genital organ, anus) of human being."]}], "ಕರ್ಮೋಡ": [{"type": "noun", "defs": ["= ಕರ್ಮುಗಿಲ್."]}], "ಕರ್ರಗೆ": [{"type": "adverb", "defs": ["darkly; blackly; gloomingly."]}], "ಕರ್ರನೆ": [{"type": "adverb", "defs": ["= ಕರ್ರಗೆ."]}], "ಕರ್ರಿಮರ": [{"type": "noun", "defs": ["the tree Eucalyptus diversicolor of Myrtaceae family."]}], "ಕರ್ಲಕ್ಕಿ": [{"type": "noun", "defs": ["the plant Justicia gendrussa (= Gendrusa vulgaris) of Acanthaceae family."]}], "ಕರ್ಲು": [{"type": "noun", "defs": ["salty, brackish earth (as a marshy or nearly marshy tract of land); saline soil."]}, {"type": "noun", "defs": ["stunted growth; dwarfish stature; the quality of being short of natural growth or development level."]}], "ಕರ್ಲುಮಾಳ": [{"type": "noun", "defs": ["a tract of brackish, saline soil."]}], "ಕರ್ವ": [{"type": "noun", "defs": ["an intense desire; tender feeling towards; love.", "any of numerous long-tailed rodents of various families (esp. Muridae and Cricetidae) resembling, but larger than, the mouse; a rat."]}], "ಕರ್ವಕ್ಕ": [{"type": "noun", "defs": ["the second half of a lunar month from the day after the full moon day to the new moon day, during which period the phases of moon grow darker."]}], "ಕರ್ವಟ": [{"type": "noun", "defs": ["(obs.) a centre of a district having two hundred to four hundred villages.", "a city in gen. 3) declivity of a mountain."]}], "ಕರ್ವಟ್ಟೆ": [{"type": "noun", "defs": ["a piece of black cloh."]}], "ಕರ್ವಣಿ": [{"type": "noun", "defs": ["a brilliant precious variety of corundum of beautiful blue; sapphire.", "a small glass beed (these beeds are stringed as a necklace and worn by women)."]}], "ಕರ್ವಣಿವಚ್ಚ": [{"type": "noun", "defs": ["an ormant inlayed with a saphire."]}], "ಕರ್ವಣ್ಣ": [{"type": "noun", "defs": ["the colour of charcoal; black colour."]}], "ಕರ್ವರ": [{"type": "noun", "defs": ["a devil; an evil spirit; a demon.", "a large, fierce Asian cat (Panthera tigris), having a tawny coat striped with black; a tiger."]}], "ಕರ್ವರಿ": [{"type": "noun", "defs": ["a female deon, evil spirit.", "a female tiger; a tigress.", "the duration of the day from the late evening till dawn; night."]}], "ಕರ್ವಸುರಿ": [{"type": "noun", "defs": ["the tree Ficus tsakela (= F. venosa) of Moraceae family; a kind of fig tree."]}], "ಕರ್ವಾಳ": [{"type": "noun", "defs": ["an East Indian grass (akin to Vetiveria zizanioides)."]}], "ಕರ್ವಾಳೆ": [{"type": "noun", "defs": ["the black variety of the sea-fish Trichiurus lepturus."]}, {"type": "noun", "defs": ["a plantain tree bearing small fruit of dark colour (from 200 to 400 in a bunch)."]}], "ಕರ್ವಿಲ್": [{"type": "noun", "defs": ["= ಕರ್ವುವಿಲ್."]}], "ಕರ್ವಿಲ್ಲ": [{"type": "noun", "defs": ["= ಕರ್ವುವಿಲ್ಲ."]}], "ಕರ್ವಿಲ್ಲು": [{"type": "noun", "defs": ["= ಕರ್ವುವಿಲ್."]}], "ಕರ್ವಿಲ್ಲುಗಾಱ": [{"type": "noun", "defs": ["= ಕರ್ವುವಿಲ್ಲ."]}], "ಕರ್ವು": [{"type": "noun", "defs": ["the perennial tropical grass of the genus Saccharum (family: Poaceae), Saccharum officinarum.", "its tall, stout, jointed stems from which sugar is made; sugar-cane."]}, {"type": "noun", "defs": ["a rising up against established authority; rebellion; revolt."]}], "ಕರ್ವುಗೋಲ": [{"type": "noun", "defs": ["the tall stout, jointed stem of Saccharum officinarum; a sugar-cane."]}], "ಕರ್ವುದೋಂಟ": [{"type": "noun", "defs": ["a sugar-cane field."]}], "ಕರ್ವುದೋಟ": [{"type": "noun", "defs": ["= ಕರ್ವುದೋಂಟ."]}], "ಕರ್ವುವಿಲ್": [{"type": "noun", "defs": ["a bow of sugar-cane; the bow of Love-God, Manmatha."]}], "ಕರ್ವುವಿಲ್ಲ": [{"type": "noun", "defs": ["Manmatha, whose bow is made of a sugar-cane."]}], "ಕರ್ವುವಿಲ್ಲು": [{"type": "noun", "defs": ["= ಕರ್ವುವಿಲ್."]}], "ಕರ್ವೆಟ್ಟು": [{"type": "noun", "defs": ["a black mountain.", "Nīlagiri, the blue mlountain range in Tamaḷ Nāḍu, South India."]}], "ಕರ್ವೆಳಗು": [{"type": "noun", "defs": ["the dark image made by a body intercepting the light rays; a dark shadow."]}], "ಕರ್ವೊಗೆ": [{"type": "noun", "defs": ["thick, black smoke."]}], "ಕರ್ವೊನ್": [{"type": "noun", "defs": ["a malleable, magnetic, readily oxidizable metal which is a chemical element of the transition series (atomic no. 26), widely used, chiefly in alloys such as steel, for tools, implements, structures, machinery, etc. (Symbol Fe.); iron.", "the part of a plough or other agricultural tool that cuts the soil; a plough-share."]}], "ಕರ್ವೊನಲು": [{"type": "noun", "defs": ["the river Yamunā, one of the major and holy rivers of North India."]}], "ಕರ್ಶಿತ": [{"type": "adjective", "defs": ["that has become thin or thinner; thinned; caused to lose fat; emaciated."]}, {"type": "noun", "defs": ["a very thin or emaciated man."]}], "ಕರ್ಶಿತೆ": [{"type": "noun", "defs": ["a very thin or emaciated woman."]}], "ಕರ್ಷ": [{"type": "noun", "defs": ["the act of attracting, pulling, drawing.", "the act of ploughing.", "an old unit of weight of gold or silver.", "the rubbing of gold on the touchstone for testing."]}], "ಕರ್ಷಕ": [{"type": "noun", "defs": ["a person, animal or thing that trails another.", "a powerful vehicle with a gasoline or diesel engine and large rear wheels or endless belt treads, used for pulling farm machinery, hauling loads, etc.; a tractor.", "one who ploughs the land; a farmer."]}], "ಕರ್ಷಣ": [{"type": "adjective", "defs": ["drawing; pulling; attracting towards.", "troubling; harrassing; annoying."]}, {"type": "noun", "defs": ["the act or an instance of attracting, pulling, drawing.", "the act of bending (a bow).", "the act of ploughing.", "the act or an instance of troubling; harrassing; annoying."]}], "ಕರ್ಷಣಿ": [{"type": "noun", "defs": ["an unchaste woman; a woman who has sexual relations with men other than her husband."]}], "ಕರ್ಷಣೀಯ": [{"type": "adjective", "defs": ["that is to be drawn, pulled.", "that can be drawn, pulled.", "fit to be drawn or pulled."]}, {"type": "noun", "defs": ["a man who has been pulled or drawn (towards or out)."]}], "ಕರ್ಷಫಲ": [{"type": "noun", "defs": ["the fruit of the tree Terminalia bellirica (=T. bellerica) of Combretaceae family; Belleric Myrobalan.", "the fruit of the tree Terminalia chebula of the same family; chebulic myrobalan."]}], "ಕರ್ಷು": [{"type": "noun", "defs": ["the burning cowdung-cake.", "a means of living; earning; salary.", "the act or profession of farming; agriculture.", "a furrow made by a plough.", "a river; a stream.", "a water-way; a canal."]}], "ಕರ್ಷೆ": [{"type": "noun", "defs": ["= ಕರ್ಷ -3"]}], "ಕರ್ಷೋಪಲ": [{"type": "noun", "defs": ["a type of black stone formerly used to test the purity of gold or silver by the streak left on it when it was rubbed with the metal; a touchstone.", "(fig.) any test of genuineness or value."]}], "ಕರ್ಹಾಡಸ್ಥ": [{"type": "noun", "defs": ["a brahmaṇa belonging to or from Karahāḍa country."]}], "ಕಲ್": [{"type": "verb", "defs": ["to gain knowledge of or skill in, by study, experience or being taught; to learn.", "ಕಲ್ತನ್ kaltan educated, a learned man."]}, {"type": "noun", "defs": ["the act, process or an instance of learning; the acquiring of knowledge or skill."]}, {"type": "noun", "defs": ["solid non-metallic mineral matter, of which rock is made; a piece of this, esp. a small piece; a stone.", "ಕಲ್ಲಂ ನಿಱಿಸು kallam nirisu to plant a stone pillar, as a symbol. 2. to establish an inscripted stone; ಕಲ್ಲ ಹಾಯು kalla hāyu to dash against a stone; ಕಲ್ಲ ಹುಯ್ಯಿಸು kalla huyyisu to cause to write, mark or engrave on the surface of a stone; 2. to cause to dress a stone."]}], "ಕಲ": [{"type": "noun", "defs": ["a round vessel of any size, made of earthenware; a pot.", "any vessel of considerable size navigating deep water; a ship."]}, {"type": "noun", "defs": ["an old unit of measure (of quantity)."]}, {"type": "noun", "defs": ["something made by mixing; a combination of ingredients (but not chemically integrated)."]}, {"type": "adjective", "defs": ["pleasing to hear; sounding sweet; melodious."]}, {"type": "noun", "defs": ["a pleasing note or notes; melodious sounds; a sound that has musical quality.", "physical strength; bodily power.", "a man lacking the power of speech; a dumb man.", "the palm tree Borassum flabellifer (=B. flabelliformis) of Arecaceae family; palmyra palm.", "the tree Shorea talura (= S. robusta,= Vatica robusta) of Dipterocarpaceae family; bastard sal.", "gold."]}], "ಕಲಂ": [{"type": "noun", "defs": ["any of various writing instrument; a pen.", "a device having bristles, hairs fastened into a hard back, with a handle attached, used for painting; a brush.", "a characteristic way of painting with a brush.", "the act or process of inserting a bud or shoot of a plant into the stem or trunk of another for purpose of grafting; graft."]}, {"type": "noun", "defs": ["a numbered paragraph of a writing, a law, etc.; a section."]}, {"type": "noun", "defs": ["the large, deciduous tree Stephegyne parviflora (= Mitragyna parviflora) of Rubiaceae family."]}], "ಕಲಂಕ": [{"type": "noun", "defs": ["a mark that mars the appearance, as a stain, spot, scar, etc.; a mark left on the skin or other tissue after a wound, burn, ulcer, pustule, lesion, etc. has healed; cicatrix; a scar.", "any flaw, defect, stigma or shortcoming; deficiency.", "sharp criticism.", "blame; accusation; condemnation; censure.", "a reddish- or yellowish-brown coating formed on iron or steel by oxidation, esp. as a result of moisture; rust.", "a visible mass of condensed watery vapour floating in the atmosphere high above the general level of the ground; a cloud.", "the quality or an instance of being intense or severe; intensty; severity."]}], "ಕಲಂಕಿ": [{"type": "noun", "defs": ["= ಕಲಂಕಿತ2."]}], "ಕಲಂಕಿತ": [{"type": "adjective", "defs": ["marked with or as with a scar.", "having blemish or blemishes; marred by some flaw or fault; defamed."]}, {"type": "noun", "defs": ["a man having moral, religious or social blemish, guilt, taint, etc."]}], "ಕಲಂಕಿತೆ": [{"type": "noun", "defs": ["a woman having moral, religious or social blemish, guilt, taint, etc."]}], "ಕಲಂಕಿನಿ": [{"type": "noun", "defs": ["= ಕಲಂಕಿತೆ."]}], "ಕಲಂಕು": [{"type": "verb", "defs": ["to stir (a liquid or pasty item) as to make the sediments suspend throughout; to agitate slightly.", "to beat, shake (milk or cream) in a churn.", "to get stirred, agitated, perturbed.", "to spoil the calmness, serenity; to rouse to violent action."]}, {"type": "noun", "defs": ["an unpleasant feeling on oneself; guilt; uncertainty or agitation of the mind; moral corruption."]}], "ಕಲಂಗಡಿ": [{"type": "noun", "defs": ["water melon - a) the trailing vine Citrullus vulgaris of Cucurbitaceae family widely cultivated for its gourd; b) its large, round or oblong, edible fruit with hard, green rind and sweet, juicy, red pulp containing many seeds."]}], "ಕಲಂಜ": [{"type": "noun", "defs": ["the soft, white seed-hairs filling the seedpods of the shrubby plant Gossypium herbaceum; cotton.", "a leaf of the plant Nicotina tabacum, mainly used for cigarettes, beedies, and for chewing."]}], "ಕಲಂದಾನಿ": [{"type": "noun", "defs": ["a small wooden stand for pen and ink bottle; a standish."]}], "ಕಲಂಧರ": [{"type": "noun", "defs": ["a man of mixed tribe or caste."]}], "ಕಲಂಬ": [{"type": "noun", "defs": ["the tree Anthocephalus indicus (= A. cadamba, = Nauclea cadamba) of Rubiaceae family; cadamba tree.", "a stem of a leaf in a plant.", "a shaft with a pointed end on one side and the feather end on the other, used as a missile, shot from a bow; an arrow.", "a ruddy goose.", "any of several large-bodied, web-footed waterfowl with a long, graceful neck and, typically, pure white feathers; a swan.", "a red lotus-flower."]}], "ಕಲಂಬಡೆ": [{"type": "verb", "defs": ["to get, gain physical strength; to become physically strong."]}], "ಕಲಂಬಾಸನ": [{"type": "noun", "defs": ["a device, made of curved, flexible strip of wood, metal, with a string tied tightly to both the ends, used for shooting arrows; a bow."]}], "ಕಲಂಬಿ": [{"type": "noun", "defs": ["a moveable cupboard or ward-robe.", "a long, narrow, open container of wood, stone, etc. for holding water or food for animals; a trough."]}, {"type": "noun", "defs": ["the herb Convolvulus repens."]}], "ಕಲಂಬು": [{"type": "verb", "defs": ["to make (a liquid) muddy by stirring the sediment; to perturb."]}, {"type": "noun", "defs": ["the tree Anthocephalus indicus (= A. cadamba, = Nauclea cadamba) of Rubiaceae family; cadamba tree."]}], "ಕಲಕ": [{"type": "noun", "defs": ["the resultant thing of mixing; something mixed; a combination; a mixture of heterogenous things without any chemical reaction taking place between the components."]}], "ಕಲಕಂಠ": [{"type": "noun", "defs": ["that which has a sweet sound; the Indian cuckoo (a long-tailed songbird of the family Cuculidae, which has a characteristic two or three-note call and deposits its eggs in the nests of crows which rear the young as their own).", "a bee (or wasp) which lays its eggs in the nest of another species; a cuckoo-bee.", "any of several large usu. grey and white birds of the family Columbidae, often domesticated and bred and trained to carry messages etc.; a dove; a pigeon.", "a large graceful waterbird of the genus Cygnus etc., having a long flexible neck, webbed feet, snow-white plumage; a swan.", "pleasant voice; melodious sounds."]}], "ಕಲಕಂಠಿ": [{"type": "noun", "defs": ["a female cuckoo.", "a female swan (a waterbird of the genus Cygnus).", "(mus.) in Karnāṭaka system, a mode derived from the main mode Gāyakapriya."]}], "ಕಲಕಂಡುಗ": [{"type": "noun", "defs": ["an old quantity-measure."]}], "ಕಲಕಲ": [{"type": "noun", "defs": ["a melodious blend of different tunes (as of different birds).", "loud or confused shouting; din of voices; clamor.", "the perturbed, agitated state of the mind."]}], "ಕಲಕಲಗುಟ್ಟು": [{"type": "verb", "defs": ["(a flock of birds) to make sounds.", "to make a loud, cofused outcry."]}], "ಕಲಕಲಾಟ": [{"type": "noun", "defs": ["= ಕಲಕಲ - 2."]}], "ಕಲಕಲಿಸು": [{"type": "verb", "defs": ["(a flock of birds) to make sounds.", "to make a loud, confused outcry.", "(fig.) to feel distressed in the mind; be anxious, troubled or uneasy.", "to act, move in haste; to hurry (unduly)."]}], "ಕಲಕಾಂಚಿ": [{"type": "noun", "defs": ["a woman's girdle with small chiming bells."]}], "ಕಲಕಾಟ": [{"type": "noun", "defs": ["any violent disturbance, as a social upheaval."]}], "ಕಲಕಾಡು": [{"type": "verb", "defs": ["to stir a liquid vehemently.", "to cause violent disturbance; to mar or impair peace."]}], "ಕಲಕಾಲ": [{"type": "adverb", "defs": ["at all time; always."]}], "ಕಲಕಿಸು": [{"type": "verb", "defs": ["to perturb; to stir; to agitte."]}], "ಕಲಕು": [{"type": "verb", "defs": ["to stir (a liquid or pasty item) as to make the sediments suspend throughout; to agitate slightly.", "to beat, shake (milk or cream) in a churn.", "to spoil the calmness, serenity; to rouse to violent action."]}, {"type": "noun", "defs": ["a thick mixture of mud and water.", "the perturbed, agitated mind.", "ಕಲಕಾಗು kalakāgu (the mind) to get perturbed; to become agitated."]}], "ಕಲಕುನೀರು": [{"type": "noun", "defs": ["water in which the sediments are disturbed.", "water mixed with vermilion or safron powder."]}], "ಕಲಕುಮಲಕು": [{"type": "noun", "defs": ["the state of being perturbed (as of the mind)."]}], "ಕಲಕೇತ": [{"type": "noun", "defs": ["a man who pretends to be what he is not; he who pretends to be better than is really so or to be pious, virtuous, etc. without really being so to cheat others; a hypocrite."]}], "ಕಲಕೇತಿ": [{"type": "noun", "defs": ["a pretending woman; she who cheats others with charming words; a hypocrite."]}], "ಕಲಕೇತಿತನ": [{"type": "noun", "defs": ["a pretending to be what one is not or to feel what one does not feel, esp., a pretence of virtue, piety, etc.for deceiving others; the quality of a person being so."]}], "ಕಲಗಂಚಿ": [{"type": "noun", "defs": ["= ಕಲಗಚ್ಚು."]}], "ಕಲಗಂಚು": [{"type": "noun", "defs": ["= ಕಲಗಚ್ಚು."]}], "ಕಲಗಚ್ಚು": [{"type": "noun", "defs": ["water with which rice is washed before being cooked.", "water mixed with kitchen waste which is used with chaff to feed cattle."]}], "ಕಲಗರಿಕೆ": [{"type": "noun", "defs": ["the treeSwietenia mahogani (= Soymida mahagoni) of Meliaceae family; West Indian Mahogony."]}], "ಕಲಗರ್ಚು": [{"type": "noun", "defs": ["= ಕಲಗಚ್ಚು."]}], "ಕಲಗಲ": [{"type": "noun", "defs": ["= ಕಲಕ."]}], "ಕಲಗಾತಿ": [{"type": "noun", "defs": ["a quarrelsome woman."]}], "ಕಲಗಿ": [{"type": "noun", "defs": ["a decorative thing fixed to a headgear or crown."]}], "ಕಲಗೆಯ್": [{"type": "verb", "defs": ["to quarrel or fight with."]}], "ಕಲಡು": [{"type": "verb", "defs": ["to become dirty; to be splashed with dirt or mud, 2) to be mentally distrubed, excited; to become anxious."]}, {"type": "noun", "defs": ["the perturbed, excited state of the mind."]}], "ಕಲತಾನ": [{"type": "noun", "defs": ["pleasant sounds."]}], "ಕಲತಾನಿ": [{"type": "noun", "defs": ["a closely woven, coarse cloth of hemp, cotton; canvas."]}], "ಕಲತಿ": [{"type": "noun", "defs": ["an earthen pot."]}], "ಕಲತ್ರ": [{"type": "noun", "defs": ["a married woman, as related to her husband; a wife.", "the hip and loins.", "(astrol.) the seventh house in the zodiac diagram (which is supposed to foretell about one's wife)."]}], "ಕಲಧೌತ": [{"type": "noun", "defs": ["a white, metallic chemical element that is extremely ductile and malleable, capable of a high polish, and the best metal conductor of heat and electricity, symbol Ag; silver.", "a heavy, yellow, inert, metallic chemical element with a high degree of ductility and malleability, symbol Au.; gold.", "the plant Datura stramonium (var. typica) of Solanaceae family.", "the white colour."]}], "ಕಲಧೌತಾಚಲ": [{"type": "noun", "defs": ["the mythological golden mountain, Mēru."]}], "ಕಲನ": [{"type": "noun", "defs": ["the act of doing or causing to happen.", "the act or an instance of joining or combining two or more things together.", "a mark, stigma; a stain.", "a fertilised mature female germ cell in the very early stage of developing into a new member.", "(math.) any system of calculation using special symbolic notations; calculus."]}], "ಕಲನಿ": [{"type": "noun", "defs": ["an irrigated piece of land (esp. where paddy is grown)."]}], "ಕಲನೆ": [{"type": "noun", "defs": ["the act or an instance of joining or combining two or more things together."]}], "ಕಲನೆಗೈ": [{"type": "verb", "defs": ["to cause or facilitate to happen."]}], "ಕಲಪರಟಿ": [{"type": "noun", "defs": ["a small stone-ware; a vesel made of soap-stone."]}]}