{"ಗೊಳ್": [{"type": "noun", "defs": ["the sound of a sudden and loud laugh.", "a sound imitating it.", "ಗೊಳ್ಳೆನ್ನು goḷḷennu to laugh with a loud sound."]}], "ಗೊಳಕೊಳಿಕೆ": [{"type": "noun", "defs": ["the plant Argemone mexicana of Papaverceae family; yellow thistle."]}], "ಗೊಳಗುಳಿಕೆ": [{"type": "noun", "defs": ["= ಗೊಳಗೊಳಿಕೆ."]}], "ಗೊಳಗೊಂಡೆ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಗೊಳಗೊಳಕೆ": [{"type": "noun", "defs": ["= ಗೊಳಗೊಳಿಕೆ."]}], "ಗೊಳಗೊಳಿಕೆ": [{"type": "noun", "defs": ["the plant Hygrophila auriculata ( = H. spinosa, = Asteracantha longifolia) of Acanthaceae family."]}], "ಗೊಳಲಿ": [{"type": "noun", "defs": ["= ಗೊಳಲೆ."]}], "ಗೊಳಲು": [{"type": "noun", "defs": ["= ಗೊಳಲೆ."]}], "ಗೊಳಲೆ": [{"type": "noun", "defs": ["the husks of paddy, wheat or other grain separated in hulling, threshing or winnowing; chaff; hull.", "the rind of a tamarind fruit."]}], "ಗೊಳಸು": [{"type": "noun", "defs": ["any of the series of rings or loops making up a chain; a link.", "a metal ornament tied round the legs of cow or oxen.", "a necklace made of several links; a chain."]}], "ಗೊಳಿಸೆ": [{"type": "noun", "defs": ["a kind of fish."]}], "ಗೊಳೆಗುದುರೆ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಗೊಳೋ": [{"type": "noun", "defs": ["a long, pitiful cry of grief and pain; a wailing sound.", "a sound imitating it."]}], "ಗೊಳ್ಳ": [{"type": "noun", "defs": ["a kind of fish."]}], "ಗೊಳ್ಳನೆ": [{"type": "adverb", "defs": ["(laughing) with a sudden, loud, hoarse sound."]}], "ಗೊಳ್ಳು": [{"type": "noun", "defs": ["a person or thing that is useless."]}], "ಗೊಳ್ಳೆ": [{"type": "noun", "defs": ["the opening at the lower end of the alimentary canal, through which the solid refuse of digestion is excreted; the anus."]}], "ಗೊಱಲೆ": [{"type": "noun", "defs": ["any of pale-coloured social insects of Isoptera order, having a soft body and living in colonies composed of winged forms that mate and wingless workers and soldiers that are usu. sterile or immature, and which are very destructive to wooden structures and are found in the temperate zones and esp. in the tropics; a white ant; a termite."]}], "ಗೊೞಸು": [{"type": "noun", "defs": ["= ಗೊಳಸು."]}], "ಗೋ": [{"type": "noun", "defs": ["the mature female of domestic cattle of the genus Bos.", "the mature male of domestic cattle; an ox.", "the sun.", "the moon.", "any of the luminous celestial objects in the sky; a star.", "any of the thin lines or beams, of light that appear to come from a bright source; a ray of light.", "the apparent blue arch over the earth; the sky.", "heaven or the celestial regions.", "the planet that we live on; the earth.", "a natural raised part of the earth's surface, usu. rising more or less abruptly; a hill or mountain.", "a woody perennial plant with one main stem or trunk which develops many branches, usu. at some height above the ground; a tree.", "water.", "a ridge or swell moving along the surface of a liquid or body of water as a result of disturbance, as by wind; a wave.", "any of a class (Aves) of warmblooded, two-legged, egg-laying vertebrates with feathers and wings; a bird.", "any of several gallinaceous birds of the genera Pavo, the male of which is distinguished by its long, erectile, greenish, iridescent tail coverts that are brilliantly marked with ocellated spots and that can be spread in a fan; the pea-fowl.", "(myth.) any of the regents or guardians of the quarters of the world.", "the Hindu Goddess of Learning and Speech; Sarasvati.", "something that is spoken; an utterance; a speech.", "the organ of sight; the eye.", "the front or under part of a vertebrate body from the breastbone to the pelvis, containing the abdominal viscera; the abdomen; the belly.", "hair growing on the body.", "one of the bony, permanent, hollow paired growths, often curved and pointed, that project from the upper part of the head of certain ungulate mammals, as cattle, sheep, goats, antelopes, etc.; a horn.", "the region of any of the principal points of the compass or divisions of the horizon; a quarter or direction.", "a slender, straight, usu. pointed, missile to be shot from a bow and equipped with feathers at the end of the shaft near the nock, for controlling flight; an arrow.", "(myth.) the weapon of Indra, the chief of gods, that can even split mountains.", "any of the sense organs of the body."]}], "ಗೋಂಕುರು": [{"type": "noun", "defs": ["that is large in size, rough, harsh, etc."]}, {"type": "noun", "defs": ["a kind of large frog with a very rough, warty skin."]}], "ಗೋಂಟು": [{"type": "noun", "defs": ["the point toward which something faces or the line along which something moves or lies; a direction.", "any of the directions (as pointed by the compass).", "the narrow inside space made by two walls of a building joined together forming an angle; a corner.", "the border of a garment or piece of cloth made by folding the edge and sewing it down; hem."]}], "ಗೋಂಡ": [{"type": "noun", "defs": ["a division of Dravidian race, who speak Gōṇḍi, in central India.", "a member of this race."]}], "ಗೋಂಡಿ": [{"type": "noun", "defs": ["one of the Dravidian languages spoken by Gōṇḍa people in central India."]}], "ಗೋಂದು": [{"type": "noun", "defs": ["a gum exuded by some kinds of acacia and used as glue; the gum acacia.", "(gen.) any synthetic gum used as glue."]}], "ಗೋಂಧಳ": [{"type": "noun", "defs": ["the traditional worshipping of Ambā Bhavāni, a form of Pārvati; prevalent in coastal Karnāṭaka and Mahāraṣṭra.", "the traditional group dance performed during that occasion."]}], "ಗೋಕಂಟಕ": [{"type": "noun", "defs": ["the thorny plant Tribulus terrestris of Zygophyllaceae family.", "the plant Hygrophila auriculata ( = H. spinosa, = Asteracantha longifolia) of Acanthaceae family."]}], "ಗೋಕರ್ಣ": [{"type": "noun", "defs": ["the deer Antilope picta (genus Connochaetes); with a fan-like tail.", "a snake.", "a unit of linear measure approx. equal to nine inches, based on the distance between the tips of the extended thumb and little finger; a span.", "similar measure equal to the distance between the tips of the thumb and the ring-finger."]}], "ಗೋಕರ್ಣಿ": [{"type": "noun", "defs": ["the plant Sansevieria roxburghiana of Liliaceae family; a kind of hemp."]}], "ಗೋಕಿ": [{"type": "noun", "defs": ["the medium-sized deciduous tree Schrebera swietenioides of Oleaceae family."]}], "ಗೋಕು": [{"type": "noun", "defs": ["the act, process or work of repeatedly revising (esp. a passage to commit it to memory)."]}], "ಗೋಕುಲ": [{"type": "noun", "defs": ["a number of cattle living or being driven together; a herd.", "a building, shed for cattle.", "a series of lines or rays coming to or spreading out from a point; a pencil of rays."]}], "ಗೋಕುಲಾಷ್ಟಮಿ": [{"type": "noun", "defs": ["the eighth day in the second fortnight of Śrāvaṇa, the fifth month in Hindu calendar, (the day observed as the birth-day of Křṣṇa)."]}], "ಗೋಕುಳ": [{"type": "noun", "defs": ["= ಗೋಕುಲ."]}], "ಗೋಕೆ": [{"type": "noun", "defs": ["the part, in human, between the body and head; the neck.", "the back of the neck; the nape.", "the shoulder - a) the joint connecting the arm or forelimb with the body b) the part of the body including this joint and extending to the base of the neck."]}], "ಗೋಕೇಶ": [{"type": "noun", "defs": ["Śiva whose hairs are spread all over and form the sky."]}], "ಗೋಕ್ಷೀರ": [{"type": "noun", "defs": ["milk secreted by cows; cow-milk."]}], "ಗೋಕ್ಷೀರಕ್ಷತಜತ್ವ": [{"type": "noun", "defs": ["(Jain.) the state of the highest spiritual teachership when the blood is believed to look milky-white."]}], "ಗೋಕ್ಷುರ": [{"type": "noun", "defs": ["= ಗೋಕಂಟಕ.", "any of the hoofs of a cow."]}], "ಗೋಕ್ಷುರಕ": [{"type": "noun", "defs": ["= ಗೋಕ್ಷುರ."]}], "ಗೋಖುರು": [{"type": "noun", "defs": ["= ಗೋಕಂಟಕ -1."]}], "ಗೋಗಟೆ": [{"type": "noun", "defs": ["a covering made of a blanket, gunny bag or reeds, for the head, neck and back, used as a protection against rain; a hood."]}], "ಗೋಗರೆ": [{"type": "verb", "defs": ["to utter a prolonged, inarticulate, mournful cry, as in grief or suffering; to wail.", "to beg piteously, as for aid or mercy; to beseech; to entreat; to implore."]}], "ಗೋಗರೆತ": [{"type": "noun", "defs": ["a wailing cry, as of grief, pain or despair.", "any similar mournful sound.", "a piteous begging for mercy, aid, etc.", "the act of making such a cry."]}], "ಗೋಗಲ್ಲು": [{"type": "noun", "defs": ["a stone planted in the ground, and worshipped for the welfare of cattle."]}], "ಗೋಗಹಳೆ": [{"type": "noun", "defs": ["a pipe in the shape of the horn of a cow, used to produce loud sound by blowing through."]}], "ಗೋಗಿ": [{"type": "noun", "defs": ["= ಗೋಗು."]}], "ಗೋಗಿನಾರು": [{"type": "noun", "defs": ["= ಗೋಗು."]}], "ಗೋಗು": [{"type": "noun", "defs": ["the Hemp Hibiscus cannabinus of Malvaceae family."]}], "ಗೋಗುಲಧೂಪ": [{"type": "noun", "defs": ["the tree Ailanthus malabarica of Simaroubaceae family.", "its resin, used as incense."]}], "ಗೋಗ್ರಹಣ": [{"type": "noun", "defs": ["a capturing of cattle (of another country)."]}], "ಗೋಗ್ರಾಸ": [{"type": "noun", "defs": ["coarse food for livestock, composed of entire plants, including leaves, stalks, and grain, of such forages as corn and sorghum; fodder.", "food offered to a cow, as a part of religious rites."]}], "ಗೋಘೃತ": [{"type": "noun", "defs": ["the clarified butter, made from the cow-milk."]}], "ಗೋಘ್ನ": [{"type": "noun", "defs": ["a man who has killed or butchered a cow."]}], "ಗೋಚರ": [{"type": "adjective", "defs": ["ranged, travelled over or through, roamed about, by cattle.", "that can be or is seen, perceived, observed; seen; visible; apparent."]}, {"type": "noun", "defs": ["a tract of grassland, whose grass is grown for use as hay; a meadow; a pasture-land.", "a large and indefinite part of the surface of the earth; a district; a region.", "a place of dwelling; a house.", "ಗೋಚರವಾಗು gōcaravāgu to be seen; to appear; to become visible."]}], "ಗೋಚರಾವು": [{"type": "noun", "defs": ["= ಗೋಚರ2 - 1.", "grass grown for use as fodder."]}], "ಗೋಚರಿಯೆ": [{"type": "noun", "defs": ["the act, behaviour or nature of cattle."]}], "ಗೋಚರಿಸು": [{"type": "verb", "defs": ["to become visible to the eyes; to appear; to be seen.", "to become perceptible or to be perceived by the mind.", "to cause or allow to be seen; to exhibit, display; to show."]}], "ಗೋಚಾರ": [{"type": "noun", "defs": ["the movement of cattle.", "(astrol.) a moving, actual or apparent, of celestial bodies esp. of those planets whose influence on human beings is believed to change according to such movements."]}], "ಗೋಚಾರನಿಯಮ": [{"type": "noun", "defs": ["(Jain.) a code of conduct for the ascetics restricting them to be wandering for alms without paying attention to the persons who give alms, their status, etc."]}], "ಗೋಚಾರಫಲ": [{"type": "noun", "defs": ["(astrol.) the grace, favour etc. supposed to get by one from the variation in the positions of the celestial bodies (as sun, moon, stars, etc.) in one's zodiac."]}], "ಗೋಚಿ": [{"type": "noun", "defs": ["a single long cloth used to cover the privy parts, as by a male ascetic or, poormen in warm climates; a loin cloth."]}], "ಗೋಚು": [{"type": "verb", "defs": ["to sweep (dust, mud, etc.) together as by brushing.", "to take (something) from another by force or fraud."]}, {"type": "noun", "defs": ["a man who robs, plunders another by force or fraud."]}], "ಗೋಜ": [{"type": "noun", "defs": ["that which is born in water; a lotus plant or its flower.", "a god, that is born in the heaven."]}], "ಗೋಜರು": [{"type": "noun", "defs": ["= ಗೋಜಲು."]}], "ಗೋಜಲ": [{"type": "noun", "defs": ["the urine of a cow."]}], "ಗೋಜಲು": [{"type": "noun", "defs": ["the condition of things, as thread, etc. being intertwined and setting right of which is difficult.", "(fig.) the condition of being jumbled, complicated or is perplexing, which is difficult to solve."]}], "ಗೋಜಳೆ": [{"type": "noun", "defs": ["a kind of fish."]}], "ಗೋಜಾಟ": [{"type": "noun", "defs": ["the act or fact of being entangled oneself with another or another's affairs."]}], "ಗೋಜಿ": [{"type": "noun", "defs": ["= ಗೋಜು2."]}], "ಗೋಜಿತ": [{"type": "noun", "defs": ["a man who has subdued his passions."]}], "ಗೋಜಿಹ್ವಿಕೆ": [{"type": "noun", "defs": ["a thin, valve-like, cartilaginous structure that covers the glottis during swallowing, preventing the entrance of food and drink into the larynx; the epiglottis."]}], "ಗೋಜಿಹ್ವೆ": [{"type": "noun", "defs": ["the plant Elephantopus scaber of Asteraceae family; elephant's foot.", "the tree Mallotus philippensis ( = Rottlera tinctoria) of Euphorbiaceae family."]}], "ಗೋಜು": [{"type": "verb", "defs": ["to get oneself involved in or as in a tangle; to be caught, as in a net, vine, etc., so that escape is difficult; to be ensnared.", "to become complex or intricate by intertwining (as thread, situation, etc.)."]}, {"type": "noun", "defs": ["the condition of things, as thread, etc. being intertwined and setting right of which is difficult.", "the condition of being jumbled, complicated or is perplexing, which is difficult to solve.", "the act or fact of being entangled oneself with another or another's affairs."]}], "ಗೋಜೆ": [{"type": "noun", "defs": ["the tree Bridelia retusa of Euphorbiaceae family."]}], "ಗೋಟಡಕೆ": [{"type": "noun", "defs": ["a ripe, dry, hard areca nut (of the Areca Catechu of Arecaceae family)."]}], "ಗೋಟಡಿಕೆ": [{"type": "noun", "defs": ["= ಗೋಟಡಕೆ."]}], "ಗೋಟಾಡಿಸು": [{"type": "verb", "defs": ["to stir well as to mix evenly."]}], "ಗೋಟಾಳಿ": [{"type": "noun", "defs": ["the state or condition of being puzzled, confused; a situation that is very complicated, problems in which are hard to untangle, understand, analyse, etc.", "dirty material as a semi or thick liquid mixture of decomposed, rotten material or wet, soggy mud, slush, etc."]}], "ಗೋಟಾಳೆ": [{"type": "noun", "defs": ["= ಗೋಟಾಳಿ."]}], "ಗೋಟಿಂಗ": [{"type": "noun", "defs": ["the large deciduous tree Terminalia belerica ( = T. bellirica, = T. bellerica) of Combretaceae family."]}], "ಗೋಟು": [{"type": "noun", "defs": ["the point toward which something faces or the line along which something moves or lies; a direction.", "any of the directions (as pointed by the compass).", "the narrow inside space made by two walls of a building joined together forming an angle; a corner.", "the border of a garment or piece of cloth made by folding the edge and sewing it down; hem."]}, {"type": "noun", "defs": ["that (as a nut) which is ripe, dry and hard.", "(fig.) a woman hard to deal with; an adamant woman.", "(fig.) an aged woman.", "ಗೋಟಿನ ಕಾಯಿ gōṭina kāyi the nut of the tree Sterculia foetida (family: Sterculiaceae); 2. the tree itself."]}, {"type": "noun", "defs": ["that which is circular; a disc.", "a kind of golden anklet."]}, {"type": "noun", "defs": ["a long-handled wooden cup-shaped bowl for dipping or conveying liquids; a wooden ladle.", "a portable shelter of canvas, plastic or the like, supported by one or more poles or a frame and often secured by ropes fastened to pegs in the ground, esp. the one used by military troops; a tent."]}], "ಗೋಟುಗೊಳಿಸು": [{"type": "verb", "defs": ["to render another become useless, sapless."]}], "ಗೋಟುವಾದ್ಯ": [{"type": "noun", "defs": ["the fretless Vīṇe, a long, stringed musical instrument, played by plucking the strings and pressing with a pad on the strings."]}], "ಗೋಟೆ": [{"type": "noun", "defs": ["a cap made of soft wool."]}], "ಗೋಡಂಬಿ": [{"type": "noun", "defs": ["the kidney-shaped nut of the tropical, evergreen tree Anacardium occidentale (family: Anacardiaceae); cashew nut."]}], "ಗೋಡಂಬೆ": [{"type": "noun", "defs": ["= ಗೋಡಂಬಿ."]}], "ಗೋಡರಗಪ್ಪೆ": [{"type": "noun", "defs": ["= ಗೋಡಾರಗಪ್ಪೆ."]}], "ಗೋಡಾರಗಪ್ಪೆ": [{"type": "noun", "defs": ["a kind of large frog with a very rough, warty skin."]}], "ಗೋಡಾಹ": [{"type": "noun", "defs": ["a large, solid-hoofed, herbivorous quadruped, Equus caballus, domesticated for carrying or pulling loads, for riding, and for racing; a horse."]}], "ಗೋಡು": [{"type": "noun", "defs": ["sediment suspended in stagnant water or carried by moving water, that often accumulates on the bottom of rivers, bays, etc., esp. such sediment with particles smaller than sand and larger than clay, used to fertilise farm-land."]}], "ಗೋಡುಂಬ": [{"type": "noun", "defs": ["the trailing vine Citrullus vulgaris of Cucurbitaceae family, water melon plant.", "its large, round or oblong, edible fruit with a hard, green rind and sweet, juicy, pink or red pulp containing many seeds; water melon.", "the perennial vine Citrullus colocynthis ( = Cucumis colocynthis) of Cucurbitaceae family; colocynth.", "its small, bitter fruit used in making a strong cathartic; colocynth."]}], "ಗೋಡುಂಬೆ": [{"type": "noun", "defs": ["= ಗೋಡುಂಬ."]}], "ಗೋಡುಗೊಬ್ಬರ": [{"type": "noun", "defs": ["= ಗೋಡು."]}], "ಗೋಡುಮಣ್ಣು": [{"type": "noun", "defs": ["= ಗೋಡು."]}], "ಗೋಡುವಲೆ": [{"type": "noun", "defs": ["a kind of net used for catching wild animals and fowls."]}], "ಗೋಡೆ": [{"type": "noun", "defs": ["an upright structure of stone, brick, etc., (having a length much greater than the thickness) being a support to the roof, upper floor or floors, serving as a partition of a building, serving to enclose an area, to separate fields, etc.; a wall.", "ಗೋಡೆಗೆ ಕಿವಿಯಿರು gōḍege kiviyiru (fig.) a place having persons who overhear and leak out; ಗೋಡೆಗೆ ತಲೆ ಚಚ್ಚಿಕೊ/ಹಾಯಿ gōḍege tale cacciko/hāyi to react helplessly in frustration."]}], "ಗೋಡೆಗನ್ನ": [{"type": "noun", "defs": ["a hole made in a wall by burglars to commit theft."]}], "ಗೋಣ್": [{"type": "noun", "defs": ["= ಗೋಣು."]}], "ಗೋಣ": [{"type": "noun", "defs": ["= ಗೋಣು."]}], "ಗೋಣಂನಾಳಿ": [{"type": "noun", "defs": ["= ಗೋಣ್ಣಾಳಿ."]}], "ಗೋಣಡಿಗೊಳ್": [{"type": "verb", "defs": ["to turn (a person) upside down."]}], "ಗೋಣಿ": [{"type": "noun", "defs": ["the large, deciduous tree Ficus mysorensis ( = F. drupaceae var. pubescens) of Moraceae family with ovate leaves and small round, red fruits.", "the tree Dalbergia lanceolaria of Papilionaceae family; bastard rose wood.", "the tree Salvadora persica of Salvadoraceae family."]}, {"type": "noun", "defs": ["the plant Corchorus capsularis of Tiliaceae family with strong fibre; Jute.", "its strong, glossy fibre used for making burlap, sacks, mats, rope etc.", "a sack made of this fibre.", "a coarse cloth made of jute used for making sacks, in upholstering furniture, as a backing for carpets, etc.; burlap.", "an old unit for measuring grain."]}, {"type": "noun", "defs": ["the domestic hog, Sus scrofa; a pig."]}], "ಗೋಣಿಗ": [{"type": "noun", "defs": ["a caste.", "a man belonging to this caste."]}], "ಗೋಣಿಚೀಲ": [{"type": "noun", "defs": ["= ಗೋಣಿ2 - 3."]}], "ಗೋಣಿತಟ್ಟು": [{"type": "noun", "defs": ["a kind of contagious, small pox characterised by red pustular eruptions on the skin."]}, {"type": "noun", "defs": ["= ಗೋಣಿ2 - 4."]}], "ಗೋಣಿತಾಟು": [{"type": "noun", "defs": ["= ಗೋಣಿ2 - 4."]}], "ಗೋಣಿದಡಾರ": [{"type": "noun", "defs": ["= ಗೋಣಿತಟ್ಟು1."]}], "ಗೋಣಿಪಟ್ಟೆ": [{"type": "noun", "defs": ["= ಗೋಣಿ2 - 4."]}], "ಗೋಣಿಯಾನ್": [{"type": "verb", "defs": ["to wait eagerly (to get something) holding a gunny bag."]}], "ಗೋಣಿಸೊಪ್ಪು": [{"type": "noun", "defs": ["the potherb Portulaca quadrifida of Portulaceae family."]}], "ಗೋಣು": [{"type": "noun", "defs": ["the part of the body of an animal or human being that connects the head and the trunk; the neck.", "ಗೋಣು ಆಡಿಸು gōṇu āḍisu = ಗೋಣು ಹಾಕು; ಗೋಣು ಕೊಯ್ಯು gōṇu koyyu to cut another's throat; to behead; 2. to cheat; to defraud; ಗೋಣು ಚೆಲ್ಲು gōṇu cellu to die; ಗೋಣು ಬಗ್ಗಿಸು gōṇu baggisu to bend one's head (as in respect, shame, etc.); ಗೋಣು ಹಾಕು gōṇu hāku to bend or swing one's head slightly as a sign of one's assent or dissent."]}], "ಗೋಣುಗೊಯ್ಕ": [{"type": "noun", "defs": ["a man who cuts throats; a cut-throat, murderer.", "(fig.) a man who habitually cheats others."]}], "ಗೋಣುಗೊಯ್ಕೆ": [{"type": "noun", "defs": ["a woman whocuts throats; a cut-throat, murderer.", "(fig.) a woman whohabitually cheats others."]}], "ಗೋಣುಮಾಱಿ": [{"type": "noun", "defs": ["a man who has the obligation to fight for his master at the risk of his life; a soldier."]}], "ಗೋಣುಮುರಿ": [{"type": "verb", "defs": ["= ಗೋಣ್ಮುರಿ."]}], "ಗೋಣ್ಗೊಱೆ": [{"type": "verb", "defs": ["to cut another's throat; to behead."]}], "ಗೋಣ್ಣವಿರ್": [{"type": "noun", "defs": ["the long hair growing from the top and sides of the neck of animals as the horse, loin, etc.; mane."]}], "ಗೋಣ್ಣಾಳಿ": [{"type": "noun", "defs": ["the portion of the body that joins the head the body; the neck.", "the respiratory tract or oesophagus; the wind-pipe or food-tube."]}], "ಗೋಣ್ಮುರಿ": [{"type": "verb", "defs": ["to turn or bend one's neck.", "to twist another's neck (as from anger)."]}, {"type": "noun", "defs": ["the act of twisting another's neck.", "the act of inflicting; infliction; suffering inflicted on another."]}], "ಗೋಣ್ಮುರಿಗೊಳ್": [{"type": "verb", "defs": ["to twist another's neck.", "to inflict pain; to trouble, annoy, harm."]}], "ಗೋಣ್ಮೊಳಗು": [{"type": "noun", "defs": ["any sound produced from the throat."]}], "ಗೋತ": [{"type": "noun", "defs": ["the urine of a cow."]}, {"type": "noun", "defs": ["a dip or turning upside down (as of a bird, paper-kite, etc.).", "the fact or an instance of a business incurring loss.", "(fig.) a failure in an examination."]}], "ಗೋತಹಾಕು": [{"type": "verb", "defs": ["to turn upside down; to dip (oneself) from a higher position down or downward.", "(fig.) to fail to qualify in an examination.", "(fig.) to die."]}], "ಗೋತಹೊಡೆ": [{"type": "verb", "defs": ["= ಗೋತಹಾಕು."]}], "ಗೋತಿ": [{"type": "noun", "defs": ["= ಗೋತ2."]}], "ಗೋತಿತಿನ್ನು": [{"type": "verb", "defs": ["= ಗೋತಹಾಕು -1."]}], "ಗೋತಿಹೊಡೆ": [{"type": "verb", "defs": ["= ಗೋತಹಾಕು."]}], "ಗೋತು": [{"type": "noun", "defs": ["= ಗೋತ2."]}], "ಗೋತುಹಾಕು": [{"type": "verb", "defs": ["= ಗೋತಹಾಕು."]}], "ಗೋತ್ರ": [{"type": "noun", "defs": ["a number of cattle living or being driven together; a herd.", "a building, shed for cattle; a cow-pen.", "the earth."]}, {"type": "noun", "defs": ["lineal descent from an ancestor; lineage; extraction.", "that by which a person, thing, place etc. is known, called or spoken of; an appellation; a name.", "a mountain.", "a large and indefinite part of the surface of the earth; a district; a region.", "a way made for travelling from one place to another; a path, road.", "an area of land cleared and prepared for raising crops; a farm land.", "the act, fact or state of knowing; acquaintance with facts; knowledge."]}], "ಗೋತ್ರಕಲಹ": [{"type": "noun", "defs": ["quarrels, bickering, intense conflict amongst the members of a family or close relatives (belonging to the same lineage)."]}], "ಗೋತ್ರಜ": [{"type": "noun", "defs": ["a man as related to another coming from the same lineage; one related (to another) by descent in a diverging line from a known common ancestor, as from one's grandparent; a cognate, cousin, etc."]}], "ಗೋತ್ರಜಕಳತ್ರ": [{"type": "noun", "defs": ["= (rightly) ಗೋತ್ರಜಾಕಳತ್ರ."]}], "ಗೋತ್ರಜಾಕಳತ್ರ": [{"type": "noun", "defs": ["Śiva, the consort of the daughter of the Mountain-king."]}], "ಗೋತ್ರಧರ": [{"type": "noun", "defs": ["Křṣṇa, who (once) up-held a mountain on his finger tip."]}], "ಗೋತ್ರಧವಳ": [{"type": "noun", "defs": ["a man of noble descent; a blue-blood."]}], "ಗೋತ್ರನಿಧಾನೆ": [{"type": "noun", "defs": ["a woman whobrings good name for her family; the pearl of the family."]}], "ಗೋತ್ರನಿಸ್ತಾರ": [{"type": "noun", "defs": ["a man who helps continue the lineage, brings fame to the family by his merit and worthy actions."]}], "ಗೋತ್ರಪತಿ": [{"type": "noun", "defs": ["Vřṣabha, the chief or best of oxen."]}], "ಗೋತ್ರಪತಿಪತ್ರ": [{"type": "noun", "defs": ["Śiva, whose vehicle is Vřṣabha, the best of bulls."]}], "ಗೋತ್ರಪ್ರವರ": [{"type": "noun", "defs": ["a person (usu. one of the Vedic sages) who is supposed to be the originator of a lineage or is its oldest known ancestor.", "a list of names of sages belonging to a lineage; ಗೋತ್ರಪ್ರವರ ಒದರು gōtra pravara odaru (sarc .) to give unnecessary details in a weary, uninteresting manner."]}], "ಗೋತ್ರಪ್ರವರ್ತಕ": [{"type": "noun", "defs": ["= ಗೋತ್ರಪ್ರವರ -1."]}], "ಗೋತ್ರಭಿತ್ತು": [{"type": "noun", "defs": ["(myth.) Indra, who cleaves mountains."]}], "ಗೋತ್ರಯ": [{"type": "noun", "defs": ["(pl.) the three eyes (of Śiva).", "(pl.) the three eye-like spots on the coconut shell.", "Śiva, who has three eyes (the third one being the fiery-eye with which he is supposed to destroy the universe)."]}], "ಗೋತ್ರವಧೆ": [{"type": "noun", "defs": ["a killing, putting out of existence of the members of one's own lineage (as one's kin); internecine slaughter."]}], "ಗೋತ್ರವಿರೋಧ": [{"type": "noun", "defs": ["= ಗೋತ್ರಕಲಹ."]}], "ಗೋತ್ರವಿಶಿಖಾಸನ": [{"type": "noun", "defs": ["(myth.) Śiva, who made the mountain Mēru, as his bow."]}], "ಗೋತ್ರವೈರಿ": [{"type": "noun", "defs": ["(myth.) Indra, the enemy of mountains."]}], "ಗೋತ್ರಸ್ಕಂಧ": [{"type": "noun", "defs": ["the pointed top of a mountain or ridge; the peak."]}], "ಗೋತ್ರಸ್ಖಲನೆ": [{"type": "noun", "defs": ["the act of applying a wrong name or epithet to some person or thing; an error in naming a person; a misnomer."]}], "ಗೋತ್ರಸ್ಖಲಿತ": [{"type": "noun", "defs": ["= ಗೋತ್ರಸ್ಖಲನೆ."]}], "ಗೋತ್ರಹರ": [{"type": "noun", "defs": ["= ಗೋತ್ರಭಿತ್ತು."]}], "ಗೋತ್ರಾಂಕಿತ": [{"type": "adjective", "defs": ["named as related to a family or lineage."]}], "ಗೋತ್ರಾಂತ": [{"type": "noun", "defs": ["the state or fact of a family, lineage becoming extinct."]}], "ಗೋತ್ರಿತಯ": [{"type": "noun", "defs": ["= ಗೋತ್ರಯ."]}], "ಗೋತ್ರೆ": [{"type": "noun", "defs": ["a herd of cattle.", "the earth."]}], "ಗೋದ": [{"type": "noun", "defs": ["= ಗೋಧ - 1."]}, {"type": "noun", "defs": ["the part of the central nervous system enclosed in the cranium of humans and other vertebrates, consisting of a soft, convoluted mass of grey and white matter and serving to control and coordinate the mental and physical actions; the brain."]}, {"type": "noun", "defs": ["a man suffering from a disease characterised by swollen testicles."]}], "ಗೋದಡಿ": [{"type": "noun", "defs": ["a sheet of cloth made by stitching small torn cloth pieces; a patched garment.", "a parti-coloured quilt."]}], "ಗೋದಣ": [{"type": "noun", "defs": ["a box, trough or a rectangular bin in a cow-pen to hold fodder for cattle to eat; a manger.", "a shed for housing cattle; a cow-pen."]}], "ಗೋದಣಿ": [{"type": "noun", "defs": ["= ಗೋದಣ."]}], "ಗೋದಣಿಕೆ": [{"type": "noun", "defs": ["= ಗೋದಣ - 1."]}], "ಗೋದಣಿಗೆ": [{"type": "noun", "defs": ["= ಗೋದಣ - 1."]}], "ಗೋದಣೆ": [{"type": "noun", "defs": ["a long-handled implement having a thin, flat blade usu. set transversely, used to break up and loosen the surface of the ground, destroy weeds, etc.; a hoe."]}], "ಗೋದಣೆವಲ್": [{"type": "noun", "defs": ["any of the front teeth that is broad like the blade of a hoe."]}], "ಗೋದನಿಕೆ": [{"type": "noun", "defs": ["= ಗೋದಣ - 1."]}], "ಗೋದನೆ": [{"type": "noun", "defs": ["= ಗೋದಣ."]}], "ಗೋದರುಡು": [{"type": "noun", "defs": ["inflammation of the testis; orchitis.", "the testis swollen from orchitis."]}], "ಗೋದಲ": [{"type": "noun", "defs": ["= ಗೋದಣ."]}], "ಗೋದಲಿ": [{"type": "noun", "defs": ["= ಗೋದಣ."]}], "ಗೋದಲಿಕೆ": [{"type": "noun", "defs": ["= ಗೋದಣ - 1."]}], "ಗೋದಲೆ": [{"type": "noun", "defs": ["= ಗೋದಣ."]}], "ಗೋದಾನ": [{"type": "noun", "defs": ["a giving of a milch cow as a gift (esp. for religious purpose).", "a religious rite performed on a boy, at the age of sixteen, by shaving the front portion of his head in elliptical shape."]}], "ಗೋದಾನವ್ರತ": [{"type": "noun", "defs": ["= ಗೋದಾನ - 2."]}], "ಗೋದಾಮು": [{"type": "noun", "defs": ["a building where wares or goods, are stored, as before distribution to retailers or are kept in reserve, in bond, etc; a godown."]}], "ಗೋದಾಮೆ": [{"type": "noun", "defs": ["a kind of insectivorous lizard Varanus dracaema of Varanidae family, that changes colour of its skin to adapt to the environment as a defence against enemies or to deceive its prey; Indian monitor."]}, {"type": "noun", "defs": ["= ಗೋದಿನಾಗರ."]}], "ಗೋದಾರಣ": [{"type": "noun", "defs": ["that which splits (the surface of) the earth; a plough, hoe, etc."]}], "ಗೋದಾರಣಕ": [{"type": "noun", "defs": ["= ಗೋದಾರಣ."]}], "ಗೋದಾವರಿ": [{"type": "noun", "defs": ["a river in central India, flowing from the Western Ghats into the Bay of Bengal (900 mi. 1,440 km)."]}], "ಗೋದಿ": [{"type": "noun", "defs": ["= ಗೋಧಿ."]}, {"type": "noun", "defs": ["a large structure or excavated basin for receiving ships, equipped with gates to keep water in or out; a dock."]}], "ಗೋದಿಗ": [{"type": "noun", "defs": ["a kind of bird."]}], "ಗೋದಿಗೆಂಪು": [{"type": "noun", "defs": ["the colour having the shades of brown and red."]}], "ಗೋದಿನಾಗರ": [{"type": "noun", "defs": ["the snake Naga tripudians."]}], "ಗೋದಿಬರ್ಸನ": [{"type": "noun", "defs": ["the plant Andrographis echioides of Acanthaceae family."]}], "ಗೋದಿಬಾರ್ಮೊಂಡ": [{"type": "noun", "defs": ["a kind of plant.", "its grain."]}], "ಗೋದು": [{"type": "noun", "defs": ["= ಗೋದರುಡು -2."]}], "ಗೋದುಂಬೆ": [{"type": "noun", "defs": ["the creeper Cucumis callosus ( = C. trigonus) of Cucurbitaceae family."]}], "ಗೋದುಮೆ": [{"type": "noun", "defs": ["= ಗೋಧಿ."]}], "ಗೋದುಮೆಹಾವು": [{"type": "noun", "defs": ["= ಗೋದಿನಾಗರ."]}], "ಗೋದುವೆ": [{"type": "noun", "defs": ["= ಗೋಧಿ."]}], "ಗೋದೆ": [{"type": "noun", "defs": ["a bulb-shaped root."]}, {"type": "noun", "defs": ["= ಗೋದಾವರಿ."]}], "ಗೋದೋಹನ": [{"type": "noun", "defs": ["the act drawing milk from the udder of a cow."]}], "ಗೋಧ": [{"type": "noun", "defs": ["a harmless, moderate-sized, tropical lizard, Iguana tuberculata of Iguanidae family, having a row of spines from neck to tail, which is known for its grip and used in scaling forts, and which feeds on insects or vegetation; the common iguana.", "a leather guard fastened round the left arm to prevent injury from the bow-string.", "any of the inelastic cords of tough, fibrous connective tissue in which muscle fibres end and by which muscles are attached to bones or other parts; a sinew; a tendon."]}], "ಗೋಧನ": [{"type": "noun", "defs": ["possession of cows which were considered as wealth.", "a number of cattle living or being driven together; a herd."]}], "ಗೋಧರ": [{"type": "noun", "defs": ["a hill or mountain."]}], "ಗೋಧಾಪದಿ": [{"type": "noun", "defs": ["the vine Cissus pedata of Vitaceae family; Iguana's foot vine."]}], "ಗೋಧಿ": [{"type": "noun", "defs": ["the cereal grass Triticum dicoccum ( = T. aestivum, = T. Vulgare) of Poaceae family; wheat.", "the grain of this grass used most widely in making flour, cereals, pastries, cakes etc.; wheat."]}, {"type": "noun", "defs": ["= ಗೋಧ - 1.", "the part of the face between the eyebrows and the line where the hair normally begins; the forehead.", "any of large crocodilian reptiles of Alligator genus, found in tropical rivers, esp. one in Gangā river; Gangetic alligator."]}], "ಗೋಧಿಕೃತ": [{"type": "noun", "defs": ["a man who tends grazing cattle; a cow-herd."]}], "ಗೋಧಿಕೆ": [{"type": "noun", "defs": ["= ಗೋಧ - 1."]}], "ಗೋಧಿಸರ": [{"type": "noun", "defs": ["a string of gold beads in the shape of wheat grains."]}], "ಗೋಧುವೆ": [{"type": "noun", "defs": ["= ಗೋಧಿ1."]}], "ಗೋಧೂಮ": [{"type": "noun", "defs": ["= ಗೋಧಿ1."]}], "ಗೋಧೂಮವರ್ಣ": [{"type": "noun", "defs": ["= ಗೋದಿನಾಗರ.", "the colour of wheat."]}], "ಗೋಧೂಲಿ": [{"type": "noun", "defs": ["dust raised by cattle on the road while coming home in the evening.", "evening, when the cattle return home.", "(astrol.) seventh house from the place of the sun."]}], "ಗೋಧೂಲಿಲಗ್ನ": [{"type": "noun", "defs": ["evening, when the cattle return home, considered as auspicious time."]}], "ಗೋಧೂಳಿ": [{"type": "noun", "defs": ["= ಗೋಧೂಲಿ."]}], "ಗೋಧೂಳಿಲಗ್ನ": [{"type": "noun", "defs": ["= ಗೋಧೂಲಿಲಗ್ನ."]}], "ಗೋಧೃತ": [{"type": "noun", "defs": ["Śiva, who has the symbol of Vřṣabha, the best of bulls, in his banner.", "Śiva, who has the moon on his head."]}], "ಗೋಧೆ": [{"type": "noun", "defs": ["= ಗೋಧ."]}], "ಗೋನಮರ": [{"type": "noun", "defs": ["= ಗೋನು - 1."]}], "ಗೋನರ್ದ": [{"type": "adjective", "defs": ["emitting a hollow, loud cry, like a bull or cow."]}, {"type": "noun", "defs": ["the bird Ardea sibirica of Ardeidae family.", "name of a country.", "people belonging to that country.", "the grass Cyperus rotundus ( = C. hexastachyus) of Cyperaceae family; sedge."]}], "ಗೋನಸ": [{"type": "noun", "defs": ["the snake Python molurus; the boa constrictor; the rock snake."]}], "ಗೋನಾಸ": [{"type": "noun", "defs": ["= ಗೋನಸ."]}], "ಗೋನಾಳಿ": [{"type": "noun", "defs": ["the portion of the body that joins the head the body; the neck.", "the respiratory tract or oesophagus; the wind-pipe or food-tube."]}], "ಗೋನಿಕಾಯ": [{"type": "noun", "defs": ["a number of cattle living or being driven, together; a herd."]}], "ಗೋನಿಯೋಗ": [{"type": "noun", "defs": ["the occupation of tending and herding of cows."]}], "ಗೋನಿವಾಸಿ": [{"type": "noun", "defs": ["an inhabitant of the heaven; a deity."]}], "ಗೋನು": [{"type": "noun", "defs": ["the tree Psidium guajava ( = P. pyriferum) of Myrtaceae family; guava tree.", "its edible fruit."]}], "ಗೋಪ": [{"type": "noun", "defs": ["Vřṣabha, the chief or best of bulls.", "one who tends cows; a cowherd.", "an epithet of Křṣṇa, a cowherd.", "the chief of a cow-pen.", "the sun (as the one having rays).", "the moon (who is mythologically said to be the lord of stars).", "Indra, the lord of the heaven.", "a male sovereign or monarch, who usu. holds by life tenure, and by hereditary right, the chief authority over a country and people; a king.", "(masc.) a government revenue official in-charge of or administrator of, a district or a group of villages.", "Mēru, regarded as chief of mountains.", "(myth.) Garuḍa, the chief of birds.", "Śiva, the master of Vřṣabha.", "Brahma, the consort of Speech-Goddess Sarasvati."]}], "ಗೋಪಟುತ್ವ": [{"type": "noun", "defs": ["the ability of using words effectively in speaking; the skill in speaking; oratory; rhetoric."]}], "ಗೋಪಟ್ಟಿ": [{"type": "noun", "defs": ["an enclosure, building for cattle; a cow-pen."]}], "ಗೋಪತಿ": [{"type": "noun", "defs": ["= ಗೋಪ - 1, 2, 3, 5, 7, 12 & 13.", "8) a bull set free.", "(myth.) Varuṇa, the lord of water.", "(astrol.) the second of the twelve zodiac parts.", "a castrated or impotent man."]}], "ಗೋಪಥ": [{"type": "noun", "defs": ["a pathway for cattle.", "name of a Brāhmaṇa, (one of the sacred works or Hindus), subsidiary to Atharva Vēda."]}], "ಗೋಪನ": [{"type": "noun", "defs": ["the act of guarding, protecting, preserving, keeping, etc.; preservation; protection.", "the act of keeping (something) from being seen by others; concealment."]}], "ಗೋಪರಸ": [{"type": "noun", "defs": ["a fragrant, bitter-tasting gum resin exuded from any of several plants, used in making incense, perfume, etc. gum myrrh."]}], "ಗೋಪರಾಗ": [{"type": "noun", "defs": ["dust raised by cattle on the road while coming home in the evening."]}], "ಗೋಪರಿನಿ": [{"type": "noun", "defs": ["the large, deciduous tree Bischofia javanica of Euphorbiaceae family, with trifoliate leaves, hard wood; red cedar."]}], "ಗೋಪವಲ್ಲಿ": [{"type": "noun", "defs": ["the creeper Ichnocarpus frutescens of Apocynaceae family; black creeper.", "the creeper Sensevieria roxburghiana of Liliaceae family.", "another plant."]}], "ಗೋಪಶಕಲ": [{"type": "noun", "defs": ["a phase of a planet or a moon, when it appears to have one concave edge and one convex edge; the crescent moon."]}], "ಗೋಪಳ್ಳಿ": [{"type": "noun", "defs": ["a village predominantly inhabited by cowherds."]}], "ಗೋಪಾಕರ್ಕಟಿ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಗೋಪಾನಸಿ": [{"type": "noun", "defs": ["a curved beam used as a support for the roof of a house."]}], "ಗೋಪಾನಸೀಕ": [{"type": "noun", "defs": ["= ಗೋಪಾನಸಿ."]}], "ಗೋಪಾಯನ": [{"type": "noun", "defs": ["= ಗೋಪನ."]}], "ಗೋಪಾಯಿತ": [{"type": "adjective", "defs": ["guarded; protected; saved.", "kept from the knowledge of others; secret."]}], "ಗೋಪಾಲ": [{"type": "noun", "defs": ["one who tends cows; a cowherd.", "an epithet of Lord Křṣṇa, a cowherd.", "Śiva.", "the act of begging; beggary.", "a religious sect the members of which live on alms.", "the vessel, basket or other container used for receiving alms.", "that which is of little or no value."]}], "ಗೋಪಾಲಕ": [{"type": "noun", "defs": ["= ಗೋಪಾಲ - 1."]}], "ಗೋಪಾಲನೆ": [{"type": "noun", "defs": ["the care, raising and management etc. of cattle."]}], "ಗೋಪಾಲಪುಟ್ಟಿ": [{"type": "noun", "defs": ["= ಗೋಪಾಲಬುಟ್ಟಿ."]}], "ಗೋಪಾಲಪುಟ್ಟಿ ತೊಪ್ಪಲು": [{"type": "noun", "defs": ["the twining shrub Aristolochia indica of Aristolochiaceae family; Indian birth wort; serpent root plant."]}], "ಗೋಪಾಲಬುಟ್ಟಿ": [{"type": "noun", "defs": ["a vessel, basket or other container, hung on to the shoulder, carried by mendicants for receiving alms."]}], "ಗೋಪಾಳ": [{"type": "noun", "defs": ["= ಗೋಪಾಲ."]}], "ಗೋಪಾಳಕ": [{"type": "noun", "defs": ["= ಗೋಪಾಲ - 1."]}], "ಗೋಪಾಳಕಾವಲಿ": [{"type": "noun", "defs": ["a religious celebration held during the ceremonial observation of Křṣṇa's birth day, in which pots filled with milk, curd, etc. and hung far above the ground, are broken by boys."]}], "ಗೋಪಾಳಬುಟ್ಟಿ": [{"type": "noun", "defs": ["= ಗೋಪಾಲಬುಟ್ಟಿ."]}], "ಗೋಪಿ": [{"type": "noun", "defs": ["= ಗೋಪಿಚಂದನ.", "a woman belonging to cowherd family or caste.", "the creeper Ichnocarpus frutescens of Apocynaceae family; black creeper.", "the pale or whitish yellow colour."]}], "ಗೋಪಿಕೆ": [{"type": "noun", "defs": ["= ಗೋಪಿ - 2."]}], "ಗೋಪಿಚಂದನ": [{"type": "noun", "defs": ["a yellowish clay used by Vaiṣṇavas for applying the sectarian marks on their forehead."]}], "ಗೋಪಿತ": [{"type": "noun", "defs": ["guarded; protected; saved.", "kept from the knowledge of others; secret."]}], "ಗೋಪಿತಕ್ರಿಯ": [{"type": "noun", "defs": ["(rhet.) a figure of speech, in which the verb or verbal clause is suggested indirectly or to be understood though not plainly expressed."]}], "ಗೋಪಿತಕ್ರಿಯಾಕಾರಕ": [{"type": "noun", "defs": ["(rhet.) a literary work in which a verb or the relation subsisting between a) a noun and a verb in a sentence or b) a noun and other words governing it, as subject, predicate, etc. is suggested indirectly or to be understood though not plainly expressed."]}], "ಗೋಪಿತಾರ್ಥ": [{"type": "noun", "defs": ["a meaning, intention, import that is not explicit or easily understood."]}], "ಗೋಪಿತ್ತೆ": [{"type": "noun", "defs": ["a bright yellow pigment prepared from the urine or bile of a cow or vomited by a cow in the form of scybala."]}], "ಗೋಪೀಚಂದನ": [{"type": "noun", "defs": ["= ಗೋಪಿಚಂದನ."]}], "ಗೋಪು": [{"type": "noun", "defs": ["the act, process or an instance of protecting, guarding or saving."]}, {"type": "noun", "defs": ["a kind of necklace.", "a thread made by twisting or intertwining several strings."]}], "ಗೋಪುಕಾರ": [{"type": "noun", "defs": ["a man who protects, saves or guards; a protector; a saviour."]}], "ಗೋಪುಚ್ಛ": [{"type": "noun", "defs": ["a cow's tail.", "a necklace of two, four or thirty-four strings."]}], "ಗೋಪುರ": [{"type": "noun", "defs": ["(gen.) a gate in gen.", "the main gate of a town.", "a structure that is relatively high for its length and width and of conical or pyramidal type standing on the main gate of a town or temple or on the sanctum sanctorum of a temple or on a palace building.", "the grass Cyperus rotundus ( = C. hexastachyus) of Cyperaceae family; sedge."]}], "ಗೋಪುರಾರತಿ": [{"type": "noun", "defs": ["a metal structure, with a handle, on which the votive lamps are fixed in a pyramidal fashion, for waiving before a deity.", "the act or an instance of waiving such votive lamps."]}], "ಗೋಪುಹೆಣೆ": [{"type": "verb", "defs": ["to intertwine a several strings of different colour, to make a thread or rope."]}], "ಗೋಪೆ": [{"type": "noun", "defs": ["a pit in the groundfor burying a dead body; a burial pit; a grave.", "a secret place."]}], "ಗೋಪ್ಯ": [{"type": "adjective", "defs": ["that is to be kept or meant to be secret."]}, {"type": "noun", "defs": ["something known only to a certain person or persons and purposely or meant to be a thing kept or meant to be kept secret.", "the son of a maid or female-slave."]}], "ಗೋಪ್ಯಕ": [{"type": "noun", "defs": ["= ಗೋಪ್ಯ2 - 2."]}], "ಗೋಪ್ಯಮಾನತೆ": [{"type": "noun", "defs": ["the act of hiding, concealing something.", "(rhet.) the writing in a style in which the meaning or intention is kept as suggestive rather than explicit."]}], "ಗೋಪ್ಯರಕ್ಷಣೆ": [{"type": "noun", "defs": ["a maintaining of a secret."]}], "ಗೋಪ್ರದಾನ": [{"type": "noun", "defs": ["a giving of a cow as a gift."]}], "ಗೋಭೂಮಿ": [{"type": "noun", "defs": ["= ಗೋಮಾಳ1."]}], "ಗೋಮ": [{"type": "noun", "defs": ["= ಗೋಮು1."]}, {"type": "noun", "defs": ["the excrement of a cow; cow-dung.", "a washing of the floor with water mixed with cow-dung.", "(loosely) a washing of the floor where one has taken one's meal; ಗೋಮಹಚ್ಚು gōma haccu to wash the floor where one has taken one's meal."]}], "ಗೋಮಂಡಲ": [{"type": "noun", "defs": ["a herd of cows.", "the entire earth."]}], "ಗೋಮಂಡಳ": [{"type": "noun", "defs": ["= ಗೋಮಂಡಲ."]}], "ಗೋಮಂಡಳಿಗ": [{"type": "noun", "defs": ["the owner of a cow-herd."]}], "ಗೋಮಜ್ಜಿಗೆ": [{"type": "noun", "defs": ["the plant Eriolaena candollei of Sterculiaceae family."]}], "ಗೋಮಟ": [{"type": "noun", "defs": ["a man with pleasing appearance; a handsome man.", "(Jain.) Bāhubali, one of the Kāmadēvas.", "the colossus of Bāhubali; installed on the hills of Śravaṇa Beḷagoḷa, in Karnāṭaka, in the tenth century A.D.", "an idol, icon.", "(fig.) an ideal or distinguished person or thing."]}], "ಗೋಮಟೇಶ್ವರ": [{"type": "noun", "defs": ["= ಗೋಮಟ - 3."]}], "ಗೋಮತಲ್ಲಿಕೆ": [{"type": "noun", "defs": ["a tractable or excellent cow."]}], "ಗೋಮನಾಳಿ": [{"type": "noun", "defs": ["= ಗೋಮಾಳಿ."]}], "ಗೋಮಯ": [{"type": "noun", "defs": ["the excrement of a cow; cow-dung."]}], "ಗೋಮಾಯಿ": [{"type": "noun", "defs": ["= ಗೋಮಾಯು -1."]}], "ಗೋಮಾಯು": [{"type": "noun", "defs": ["a kind of wild dogs, mostly yellowish-grey and smaller than the wolf, which hunt prey in packs, gen. at night, and also eat carrion; a jackal.", "a kind of frog."]}], "ಗೋಮಾರಿ": [{"type": "noun", "defs": ["an acute, highly contagious viral disease of cattle, characterised by fever and by blisters in the mouth and around the hoofs; the foot-and-mouth disease."]}], "ಗೋಮಾರಿಕಬ್ಬು": [{"type": "noun", "defs": ["the sugarcane Saccharum spontaneum of Poaceae family."]}], "ಗೋಮಾಳ": [{"type": "noun", "defs": ["a piece of land set aside for pasturing; pasture-land."]}, {"type": "noun", "defs": ["= ಗೋಮಾಳಿ."]}], "ಗೋಮಾಳಿ": [{"type": "noun", "defs": ["the portion of the body that joins the head the body; the neck.", "the respiratory tract or oesophagus; the wind-pipe or food-tube."]}], "ಗೋಮಾಳೆ": [{"type": "noun", "defs": ["= ಗೋಮಾಳಿ."]}], "ಗೋಮಿ": [{"type": "noun", "defs": ["a man owning a lot of cows; a herd-owner."]}], "ಗೋಮಿಕೆ": [{"type": "noun", "defs": ["the tree Psidium guajava ( = P. pyriferum) of Myrtaceae family; guava tree.", "its edible fruit."]}], "ಗೋಮಿನಿ": [{"type": "noun", "defs": ["Lakṣmi, the Goddess of wealth.", "the earth (personified as a woman)."]}], "ಗೋಮು": [{"type": "noun", "defs": ["a kind of centipede of the Chilopoda class, having an elongated, flattened body composed several segments, each with a pair of legs.", "a conspicuous line of reversed hair, resembling a centipede, on the body of a horse, considered as a blemish.", "(gen.) lack of something necessary for completeness or an imperfection or weakness; deficiency; a fault, flaw, blemish."]}, {"type": "noun", "defs": ["a hypocritical action, deceptive appearance, etc. ; sham; pretence."]}], "ಗೋಮುಖ": [{"type": "noun", "defs": ["the face of a cow.", "a vessel with a snout for serving liquid foods.", "the base, in the shape of a platter, for the idol of a deity, having a channel for the water and other liquids with which the idol is washed, flow out.", "the act of anointing unguents.", "a kind of musical instrument.", "a man given to the habit of drinking liquors.", "a hole, breach or chasm."]}], "ಗೋಮುಖವ್ಯಾಘ್ರ": [{"type": "noun", "defs": ["a wicked person pretending to be a pious, kind, virtuous; a wolf in sheep's clothing."]}], "ಗೋಮುಖಸೂತ್ರ": [{"type": "noun", "defs": ["a channel in the base structure for the water or other liquids with which the idol (kept on it) is washed flow out."]}], "ಗೋಮುಖಾಸನ": [{"type": "noun", "defs": ["a particular type of body posture, either as a part of physical exercise or for meditation."]}], "ಗೋಮುಖಿ": [{"type": "noun", "defs": ["a small, pouch, shaped like a cow's mouth, for covering the hand while telling beads."]}], "ಗೋಮುಳ್ಳಿ": [{"type": "noun", "defs": ["= ಗೋಮುಳ್ಳು."]}], "ಗೋಮುಳ್ಳು": [{"type": "noun", "defs": ["the plant Rubus idaeus of Rosaceae family; raspberry.", "its small, juicy, edible fruit; raspberry.", "another plant of the same family, Rubus niveus ( = R. lasiocarpus)."]}], "ಗೋಮೂತ್ರ": [{"type": "noun", "defs": ["the urine of cattle.", "the zigzag mark on the ground made by the urine passed out by a cow while walking.", "a particular stance or manner of striking in mace-fight."]}], "ಗೋಮೂತ್ರಕ": [{"type": "noun", "defs": ["= ಗೋಮೂತ್ರ - 3."]}], "ಗೋಮೂತ್ರಿಕೆ": [{"type": "noun", "defs": ["= ಗೋಮೂತ್ರ - 3.", "a type of verse the second of which repeats nearly all the syllables of the first."]}], "ಗೋಮೆ": [{"type": "noun", "defs": ["= ಗೋಮ2."]}], "ಗೋಮೇದಕ": [{"type": "noun", "defs": ["a silicate of zirconium, ZrSiO4, a mineral found in igneous and sedimentary rocks and occurring in tetragonal crystals coloured yellow, brown, red, etc., transparent varieties of which are used as gems; zircon."]}]}