{"ಪೆಣಲ್": [{"type": "noun", "defs": ["= ಪೆಣಲು."]}], "ಪೆಣಲಿಕ್ಕು": [{"type": "verb", "defs": ["to interweave three or more strands of hair; to braid."]}], "ಪೆಣಲು": [{"type": "noun", "defs": ["braided hair; a plait or braid of hair; a tress."]}], "ಪೆಣಸು": [{"type": "verb", "defs": ["= ಪೆಣಗು - 1."]}], "ಪೆಣಱಿಸು": [{"type": "verb", "defs": ["to cause to feel fright; to scare; to frighten; to terrify.", "(fig.) to drive out or ward off (an evil).", "to make lusterless, dim, dull or vigourless."]}], "ಪೆಣಱು": [{"type": "verb", "defs": ["to be afraid of; to feel fear; to fear."]}], "ಪೆಣೆ": [{"type": "verb", "defs": ["to interweave three or more strands (of hair, straw or any other flexible things); to braid.", "to be or become interwoven, intertwisted.", "to become a flat, broad, thin (like a screen).", "to be enveloped, encircled.", "to become one with.", "to joint (two or more things together).", "to spread (oneself) all over or over a wide area.", "to contend or fight violently with an opponent.", "to thread on or as on a string; to string.", "(fig.) to make up (a story, reason, lie, etc.) to fabricate.", "to plan (a plot) to make a scheme for."]}, {"type": "noun", "defs": ["the state of being interwoven, intertwined.", "a tying of a number of cattle together one byt the side of the another, for treading the threshed crop."]}], "ಪೆಣೆಗೊಳ್": [{"type": "verb", "defs": ["to get twisted, interwoven or intertwined with (another)."]}], "ಪೆಣೆಗೊಳಿಸು": [{"type": "verb", "defs": ["to cause to get twisted, interwoven or intertwined with (another)."]}], "ಪೆಣೆದಾವಣಿ": [{"type": "noun", "defs": ["a length of rope made twisting three or more cords."]}], "ಪೆಣ್ಗಾಡು": [{"type": "noun", "defs": ["a place where the number of women are abnormally more."]}], "ಪೆಣ್ಗೂಸು": [{"type": "noun", "defs": ["a baby girl; a young girl.", "an adult female human being; a woman."]}], "ಪೆಣ್ಗೂಳಿ": [{"type": "noun", "defs": ["= ಪೆಣ್ಣುಗ."]}], "ಪೆಣ್ಗೊಲೆ": [{"type": "noun", "defs": ["a killing of a woman or women."]}], "ಪೆಣ್ಣಾಳ್": [{"type": "noun", "defs": ["a woman.", "a woman worker (on daily wages, in construction work or farming)."]}], "ಪೆಣ್ಣು": [{"type": "noun", "defs": ["an adult female human being; a woman.", "a girl or woman as related to her parents; a daughter.", "a woman as related to the man whom she has married to.", "a woman who is about to be married; a bride."]}], "ಪೆಣ್ಣುಗ": [{"type": "noun", "defs": ["a man marked by the characterised by weakness, lack of courage, womanish behaviour, etc."]}], "ಪೆಣ್ಣೆ": [{"type": "noun", "defs": ["a river in southern Andhra Pradesh, that flows towards east and joins Bay of Bengal near Nellore."]}], "ಪೆಣ್ಣೆರ್ದೆ": [{"type": "noun", "defs": ["lack of courage; cowardice."]}], "ಪೆಣ್ತನ": [{"type": "noun", "defs": ["the state of being a woman; womanhood.", "womanly qualities; womanliness."]}], "ಪೆಣ್ದೊರೆ": [{"type": "noun", "defs": ["any of the rivers that flow towards east (the one's that join Bay of Bengal, which are considered female rivers)."]}], "ಪೆಣ್ಪು": [{"type": "noun", "defs": ["the state or quality of being sublime, majestic, noble, etc.; superiority in rank, position, character, achievement, etc.; greatness; eminence; sublimity.", "great fame or reputation; celebrity; renown.", "plentifulness; abundance; great plenty.", "the quality of being lovely; charmingness; beauty.", "a relatively great distance above a given level; height.", "prosperous condition; good fortune, wealth, success, etc.; prosperity.", "an unduly high opinion of oneself; exaggerated self-esteem; conceit; haughty behaviour; arrogance.", "great joy; delight."]}], "ಪೆಣ್ಮಣಿ": [{"type": "noun", "defs": ["an excellent woman."]}], "ಪೆಣ್ಮಾಣಿಕ": [{"type": "noun", "defs": ["= ಪೆಣ್ಮಣಿ."]}], "ಪೆಣ್ಮೆಯ್ಯ": [{"type": "noun", "defs": ["Śiva, who is regarded as the combination of his and Pārvati's powers."]}], "ಪೆದರು": [{"type": "verb", "defs": ["to fear; to be afraid of; to be scared of."]}], "ಪೆದೆ": [{"type": "noun", "defs": ["the string of a bow."]}], "ಪೆದ್ದ": [{"type": "noun", "defs": ["that which is bigger, larger or taller.", "that which is important, a thing of much consequence."]}, {"type": "adjective", "defs": ["lacking normal intelligence, ability to understand, forethought, caution, etc.; foolish."]}, {"type": "noun", "defs": ["a foolish man; a stupid fellow."]}], "ಪೆದ್ದಂಭಟ್ಟ": [{"type": "noun", "defs": ["an utterly foolish, stupid fellow."]}], "ಪೆದ್ದಕಾಪು": [{"type": "noun", "defs": ["the chief of a village."]}], "ಪೆದ್ದಕ್ಕ": [{"type": "noun", "defs": ["a large stone piece, used as a unit of heaviness; a weight."]}], "ಪೆದ್ದಣ್ಣ": [{"type": "noun", "defs": ["= ಪೆದ್ದ3."]}], "ಪೆದ್ದಭಟ್ಟ": [{"type": "noun", "defs": ["= ಪೆದ್ದಂಭಟ್ಟ."]}], "ಪೆದ್ದಿ": [{"type": "noun", "defs": ["an old, elderly man.", "a respectable, honorable man.", "a surname used by men as a part of their name in the past.", "a strong or wealthy man."]}, {"type": "noun", "defs": ["a foolish, stupid woman."]}], "ಪೆದ್ದಿಗ": [{"type": "noun", "defs": ["an elderly man.", "a strong or wealthy man."]}], "ಪೆದ್ದು": [{"type": "noun", "defs": ["= ಪೆದ್ದುತನ.", "a foolish, stupid person."]}], "ಪೆದ್ದುತನ": [{"type": "noun", "defs": ["the quality of a foolish, stupid man; stupidity; foolishness."]}], "ಪೆದ್ದೊರೆ": [{"type": "noun", "defs": ["a large river.", "Křshṇe, a river in South India, flowing from the Western Ghats eastward empties into the Bay of Bengal."]}], "ಪೆದ್ದೊಱೆ": [{"type": "noun", "defs": ["= ಪೆದ್ದೊರೆ."]}], "ಪೆನಸಲು": [{"type": "noun", "defs": ["= ಪೆನ್ಸಿಲ್ಲು."]}], "ಪೆನಾರಿ": [{"type": "noun", "defs": ["the tree Sterculia foetida of Sterculiaceae family; hill coconut."]}], "ಪೆನ್ನ": [{"type": "noun", "defs": ["= ಪೆಣ್ಣೆ."]}], "ಪೆನ್ನಜುಟ್ಟುವೆ ಗಿಡ": [{"type": "noun", "defs": ["the plant Orthosiphon diffusus (var. hispidus) of Lamiaceae family."]}], "ಪೆನ್ನಸ": [{"type": "noun", "defs": ["a land gifted to a person, exempting fifty per cent of the normal tax on it.", "that amount of tax."]}], "ಪೆನ್ನಾರೆ": [{"type": "noun", "defs": ["the tree Nothapodytes foetida ( = Mappia foetida) of Icacinaceae family; fetid holly."]}], "ಪೆನ್ನು": [{"type": "noun", "defs": ["a small device used in writing or drawing with ink; a pen."]}], "ಪೆನ್ನೇರು": [{"type": "noun", "defs": ["the plant Withania somnifera ( = Physalis flexuosa) of Solanaceae family."]}], "ಪೆನ್ಶನ್ನು": [{"type": "noun", "defs": ["= ಪೆನ್ಷನ್ನು."]}], "ಪೆನ್ಶನ್ನುದಾರ": [{"type": "noun", "defs": ["= ಪೆನ್ಷನ್ನುದಾರ."]}], "ಪೆನ್ಷನು": [{"type": "noun", "defs": ["= ಪೆನ್ಷನ್ನು."]}], "ಪೆನ್ಷನ್ನು": [{"type": "noun", "defs": ["a payment, not wages, made regularly to a person (or to his family) who has fulfilled certain conditions of service, reached a certain age, etc.; pension.", "a retiring or being retired, esp. withdrawal from work, business, etc. because of age; retirement."]}], "ಪೆನ್ಷನ್ನುದಾರ": [{"type": "noun", "defs": ["a man who receives a pension; a pensioner."]}], "ಪೆನ್ಸಿಲು": [{"type": "noun", "defs": ["= ಪೆನ್ಸಿಲ್ಲು."]}], "ಪೆನ್ಸಿಲ್ಲು": [{"type": "noun", "defs": ["a slender, rod-shaped instrument of wood, metal, etc. with a center stick of graphite, crayon, etc. that is sharpened to a point for marking, writing, and drawing; a pencil."]}], "ಪೆಪ್ಪರಮೆಂಟ್": [{"type": "noun", "defs": ["= ಪೆಪ್ಪರ್ಮೆಂಟು."]}], "ಪೆಪ್ಪರಮೆಂಟು": [{"type": "noun", "defs": ["= ಪೆಪ್ಪರ್ಮೆಂಟು."]}], "ಪೆಪ್ಪರ್ಮಿಂಟು": [{"type": "noun", "defs": ["= ಪೆಪ್ಪರ್ಮೆಂಟು."]}], "ಪೆಪ್ಪರ್ಮೆಂಟ್": [{"type": "noun", "defs": ["= ಪೆಪ್ಪರ್ಮೆಂಟು."]}], "ಪೆಪ್ಪರ್ಮೆಂಟು": [{"type": "noun", "defs": ["a hard, chewy candy made with sugar; a peppermint; a toffy."]}], "ಪೆಪ್ಪಳಿಸು": [{"type": "verb", "defs": ["to fear; to be afraid or scared of.", "to move or run away or try to escape from fear.", "to terrify or scare.", "to hesitate from fear, indecision, lack of confidence, etc."]}], "ಪೆಪ್ಪಿಡು": [{"type": "verb", "defs": ["to add a small quantity of buttermilk to milk to help it become curds."]}], "ಪೆಪ್ಪು": [{"type": "noun", "defs": ["a small quantity of buttermilk used as a flux to convert milk into curds.", "the coagulated part of something (as milk); curd.", "seriousness of quietness or of unbearably silent situation.", "a piece of the surface layer of earth containing grass plants with their matted roots; a turf."]}], "ಪೆಬ್ಬಾವು": [{"type": "noun", "defs": ["any of several large, non-poisonous snakes of Boidae family, that crushes their prey in their coils; a boa constrictor.", "(myth.) Ādiśeṣa, the king of serpents."]}], "ಪೆಬ್ಬೆಟ್ಟು": [{"type": "noun", "defs": ["the short, thick digit of the human hand that is the nearest one to the wrist and is opposable to the other fingers; the thumb.", "the thickest one of the five digits at the front of the human foot; the great toe."]}], "ಪೆಬ್ಬೞಲ್": [{"type": "noun", "defs": ["a large city."]}], "ಪೆಮ್ಮ": [{"type": "noun", "defs": ["an old, elderly or respectable, honourable man.", "the quality or condition of being available abundantly."]}], "ಪೆಮ್ಮಡಿ": [{"type": "noun", "defs": ["= ಪೆಮ್ಮ - 1."]}], "ಪೆಮ್ಮನಡಿ": [{"type": "noun", "defs": ["= ಪೆಮ್ಮ - 1."]}], "ಪೆಮ್ಮರ": [{"type": "noun", "defs": ["any enormously huge tree.", "the small-sized tree Oroxylum indicum ( = Bignonia indica) of Bignoniaceae family, the bark of which contains tannin.", "another large, deciduous tree Alanthus excelsa of Simarouceae family."]}], "ಪೆಮ್ಮರುಳ್": [{"type": "noun", "defs": ["a huge, monstrous ghost."]}], "ಪೆಮ್ಮಾಡಿ": [{"type": "noun", "defs": ["= ಪೆಮ್ಮ - 1."]}], "ಪೆಮ್ಮಾನಡಿ": [{"type": "noun", "defs": ["= ಪೆಮ್ಮ - 1."]}], "ಪೆಮ್ಮೆ": [{"type": "noun", "defs": ["the quality that makes one seem superior or worthy of special recognition; distinction; superiority.", "a proper pride about oneself or whatever that belongs to oneself; sense of one's own dignity or worth; self-respect; pride.", "an unduly high opinion of oneself; exaggerated self-esteem; conceit.", "haughty behavior resulting from this; arrogance.", "great joy; delight."]}], "ಪೆಯ್ಯ": [{"type": "noun", "defs": ["a boy; a lad.", "a young of a cow."]}], "ಪೆರ್": [{"type": "noun", "defs": ["(usu. as a prefix making a compound word) big; large; vast; tall."]}], "ಪೆರ": [{"type": "adjective", "defs": ["(in comp.) other; different; another."]}, {"type": "adjective", "defs": ["(in comp.) of, at or in the rear."]}], "ಪೆರಂಬ": [{"type": "noun", "defs": ["= ಪೆರುಂಬೆ."]}], "ಪೆರಂಬೆ": [{"type": "noun", "defs": ["= ಪೆರುಂಬೆÉ."]}], "ಪೆರಗಿಕ್ಕು": [{"type": "verb", "defs": ["to cause to remain backward or at the rear portion.", "to cause to back, retreat.", "to shield, protect (by keeping another at one's back).", "to leave for ever; abandon;5) to go beyond, act transgressing, the proper or usual limits.", "to ignore; to disregard deliberately."]}], "ಪೆರಗು": [{"type": "noun", "defs": ["the rear portion or region.", "an incident that happened in the past."]}], "ಪೆರಗೆ": [{"type": "adverb", "defs": ["at, to or toward the rear; backward.", "at, to or toward outside; outward.", "at a later time; after some time; subsequently.", "an excluding or being excluded from.", "in the absence of."]}], "ಪೆರತಿ": [{"type": "noun", "defs": ["a woman not belonging to a particular group, set, party, etc.; an outside woman."]}], "ಪೆರದೆಗೆ": [{"type": "verb", "defs": ["to go back to original or previous position or place; to retreat.", "to draw or pull out (as a sword from its sheath).", "to come out (from)."]}], "ಪೆರಮುಟಿಬೇರು": [{"type": "noun", "defs": ["the plant Pavonia odorata of Malvaceae family."]}], "ಪೆರಸಾರು": [{"type": "verb", "defs": ["to go back to original or previous position or place; to retreat."]}], "ಪೆರಸು": [{"type": "verb", "defs": ["the tree Ziziphus mauritiana ( = Z. jujuba) of Rhamnaceae family); jujube.", "its edible fruit; Indian plum; jujube."]}], "ಪೆರು": [{"type": "verb", "defs": ["to have (a thing in one's possession); to possess or contain as a part, characteristic, attribute, etc.", "to receive (salary, wages, etc.) for one's labor or service.", "to get or deserve as a result of something one has done.", "to gain (interest, etc.) as profit.", "to take or own a responsibility of or for.", "to give birth; to bring forth a young into life; to beget.", "(in gen.) to produce or bring into existence; to generate.", "to send out; give forth; discharge.", "(a female bird, fish, reptile, insect, etc.) to lay egg or eggs.", "to be got; to come into possession of.", "ಪೆತ್ತ ತಂದೆ petta tande a man who has begotten a child; a man as related to his child or children; ಪೆತ್ತ ತಾಯ್ petta tāy a woman who has begotten a child; a woman as related to her child or children; ಪೆತ್ತ ಮಗ petta maga one's own son; ಪೆತ್ತಯ್ಯ pettayya = ಪೆತ್ತ ತಂದೆ; ಪೆತ್ತವರ್ pettavar (pl.) one's parents."]}, {"type": "adjective", "defs": ["(usu. as a prefix making a compound word) big; large; vast; tall."]}, {"type": "verb", "defs": ["to become a soft, semi-solid mass; to become coagulated, curds."]}], "ಪೆರುಂಬೆ": [{"type": "noun", "defs": ["the tree Prosopis cineraria ( = P. spicigera) of Mimosaceae family; the sponge tree."]}], "ಪೆರುಮಾಳ್": [{"type": "noun", "defs": ["= ಪೆರುಮಾಳು."]}], "ಪೆರುಮಾಳು": [{"type": "noun", "defs": ["the Supreme Being.", "a person of eminence."]}], "ಪೆರುಮಾಳ್ತನ": [{"type": "noun", "defs": ["the state or quality of being the Supreme Being.", "superiority in character; greatness; eminence."]}], "ಪೆರೆ": [{"type": "noun", "defs": ["the moon, esp. the crescent moon.", "a crescent-shaped ornament worn by women on their forehead."]}, {"type": "noun", "defs": ["that which covers, veils something; a cover; a veil.", "a fold of a cloth, paper, etc.", "the thin, outer layer of the skin of a snake that is periodically cast off.", "the opaqueness of the crystalline lense or its capsule, as caused by cataract, resulting in partial or total blindness.", "the innermost coat of the posterior part of the eyeball that receives the image produced by the lens, is continuous with the optic nerve, and consists of several layers, one of which contains the rods and cones that are sensitive to light; the retina.", "a thin membrane that separates the middle ear from the external ear and vibrates when struck by sound waves; the eardrum; tympanic membrane.", "a fault; a flaw.", "deception; double-dealing; duplicity; dishonest dealing.", "a resinous substance secreted by a species of insect, Laccifer lacca, that live on certain fig, soapberry, and acacia trees; lac.", "an unreal, deceptive or misleading appearance or image.", "the thin cover that envelops the faetus during its gestation period and which is discharged shortly after birth; placenta.", "little scales or flakes of dead skin formed on the scalp; dandruff.", "the outside covering of the stems and roots of trees and woody plants; the bark.", "the amount or quantity by which one thing differes from another; difference.", "the tube, in the respiratory tract of most land vertebrates, extending from the larynx to the two bronchi; the windpipe: trachea."]}], "ಪೆರೆಗಳೆ": [{"type": "verb", "defs": ["(a snake) to cast of the outer skin.", "(the outer layer, as of the skin, bark, etc.) to be stripped off or removed."]}], "ಪೆರೆಗೊಡೆಯ": [{"type": "noun", "defs": ["(myth.) Manmatha, the Love-God, who has the moon as his umbrella."]}], "ಪೆರೆದಲೆ": [{"type": "noun", "defs": ["a head wearing the crescent moon (or a crescent-shaped ornament).", "the day on which the entire face of the moon on the side of the earth is reflecting sunlight to the earth; a full-moon-day."]}], "ಪೆರೆದಲೆಯ": [{"type": "noun", "defs": ["Śiva, who wears the crescent moon on his head."]}], "ಪೆರೆನೀಲಬಿರುದು": [{"type": "noun", "defs": ["the creeper Meyenia hawtayaneana ( = Thunbergia hawtayneana of Acanthaceae family."]}], "ಪೆರೆನೊಸಲು": [{"type": "noun", "defs": ["a crescent-shaped forehead (considered beautiful)."]}], "ಪೆರೆಯಿಕ್ಕು": [{"type": "verb", "defs": ["= ಪೆರೆಗಳೆ - 1."]}], "ಪೆರೆಯುಚ್ಚು": [{"type": "verb", "defs": ["(a snake) to cast of the outer skin.", "to overcome shyness, tendency of being inert and inactive; to restart with a renewed vigour."]}], "ಪೆರೆಯುರ್ಚು": [{"type": "verb", "defs": ["= ಪೆರೆಯುಚ್ಚು."]}], "ಪೆರೆಸುಲಿ": [{"type": "verb", "defs": ["= ಪೆರೆಗಳೆ - 1."]}], "ಪೆರೇಡು": [{"type": "noun", "defs": ["any organised procession, march or display, by a military or police force."]}], "ಪೆರೋಲು": [{"type": "noun", "defs": ["the promise made by a prisoner that he or she would abide by good, prescribed behaviour, for getting released from the confinement; parole."]}], "ಪೆರ್ಕಣ": [{"type": "noun", "defs": ["something seen; view; sight.", "rhythmic movement of the body and feet, to music; dance.", "a particular kind of dance.", "a mode of playing percussion instruments."]}], "ಪೆರ್ಕಳ": [{"type": "noun", "defs": ["superiority in quality or quantity or numbers; pre-eminence; eminence; excellence.", "great joy or happiness; delight.", "an excessively favorable opinion of one's own ability, importance, wit, etc.; character or quality of being vain; conceit; vanity.", "majestic and imposing magnificence or elegance.", "the condition of being or becoming swollen in size; a swelling."]}], "ಪೆರ್ಕಳಂಗೊಳ್": [{"type": "verb", "defs": ["to have great pleasure; take pleasure; to delight in.", "to spread profusely (over a wide area).", "to be proud of; to be delighted with one's success, merit, etc."]}], "ಪೆರ್ಕಳಿಕೆ": [{"type": "noun", "defs": ["the quality of being or the state that makes, one distinct, superior.", "an overweening opinion of oneself, one's position, etc.; arrogance; pride; conceit.", "gladness; joy; happiness.", "pompous, often worthless, display of one's status, wealth, importance, etc."]}], "ಪೆರ್ಕಳಿಸು": [{"type": "verb", "defs": ["to become more in size, quantity, number or extent.", "to be elated from joy; to get delighted.", "to behave in a conceited or arrogant manner.", "to rush forward with force or anxiously.", "to shrink from fear.", "to overcome, master or subdue by superior force; to overpower.", "to inspire with courage, spirit or confidence; to encourage.", "to open the mouth (of something) widely.", "to rise, leap, move or act suddenly and swiftly, as by a sudden dart or thrust forward or outward; to spring."]}], "ಪೆರ್ಗಟ್ಟ": [{"type": "noun", "defs": ["the steep slope of a mountain or in a mountainous region."]}], "ಪೆರ್ಗಡಹು": [{"type": "noun", "defs": ["a broad, but shallow place in a river where once can cross by wading; a broad ford."]}], "ಪೆರ್ಗಡಿತಿ": [{"type": "noun", "defs": ["the female superintendent in a palace.", "the wife of the chief officer of a village.", "a woman who is the chief of a village.", "a bold, quarrelsome woman."]}], "ಪೆರ್ಗಡೆ": [{"type": "noun", "defs": ["the chief officer of a village.", "the superintendent in a palace, temple, etc.", "a senior or chief officer (in gen.).", "a person appointed by or under the authority of a sovereign or head of a government to some high office of state, esp. to that of head of an administrative department; a minister.", "the chief diplomatic representative appointed by a government to represent in another nation; an ambassador.", "a sub-caste among Gauḍa Sārasvata Brāhmaṇas.", "a surname used by some families."]}, {"type": "noun", "defs": ["well grown stem of a plant ( as of amaranth).", "a long stick or staff."]}], "ಪೆರ್ಗಡೆತನ": [{"type": "noun", "defs": ["the office, status or duties of the chief of a village.", "the position, guidance of a leader."]}], "ಪೆರ್ಗಡೆತನಂಗೆಯ್": [{"type": "verb", "defs": ["= ಪೆರ್ಗಡೆತನಕೆಯ್."]}], "ಪೆರ್ಗಡೆತನಕೆಯ್": [{"type": "verb", "defs": ["to act as a superintendent of; to supervise; to manage.", "to lead or guide a group of people; to be a leader."]}], "ಪೆರ್ಗಣ": [{"type": "noun", "defs": ["a member of either genus (Bandicota and Nesokia, family Muridae) of large rats that destroys grain and root crops; a bandicoot."]}], "ಪೆರ್ಗಣಿಗಿಲ್": [{"type": "noun", "defs": ["the tree Garcinia xanthochymus ( = G. pictoria, = G. tinctoria, = Xanthochymus pictorius) of Guttiferae famiy; Mysore Gamboge tree."]}], "ಪೆರ್ಗವತೆ": [{"type": "noun", "defs": ["(dance.) hand with fingers stretched and spread apart."]}], "ಪೆರ್ಗಳೆ": [{"type": "noun", "defs": ["= ಪೆರ್ಗಡೆ2."]}], "ಪೆರ್ಗುಡಿ": [{"type": "noun", "defs": ["= ಪೆರ್ಗುಡಿಹಿ."]}], "ಪೆರ್ಗುಡಿಹಿ": [{"type": "noun", "defs": ["a man very addicted to alcoholic drinks."]}], "ಪೆರ್ಗುರುಂಟಿಗೆ": [{"type": "noun", "defs": ["the plant Sansevieria roxburghiana of Liliaceae family; Indian bow string hemp."]}], "ಪೆರ್ಗೂರಿಕ್ಕು": [{"type": "verb", "defs": ["= ಪೆರ್ಗೂರಿಡು."]}], "ಪೆರ್ಗೂರಿಡು": [{"type": "verb", "defs": ["to keep wheezing, coughing; to be suffering from asthma."]}], "ಪೆರ್ಗೂರು": [{"type": "noun", "defs": ["a chronic disorder by severe coughing and wheezing and difficulty in breathing; severe asthma."]}], "ಪೆರ್ಗೆಡೆ": [{"type": "noun", "defs": ["= ಪೆರ್ಗಡೆ1."]}], "ಪೆರ್ಗೆಡೆತನ": [{"type": "noun", "defs": ["= ಪೆರ್ಗಡೆತನ."]}], "ಪೆರ್ಗೆಡೆತನಂಗೆಯ್": [{"type": "verb", "defs": ["= ಪೆರ್ಗಡೆತನಕೆಯ್."]}], "ಪೆರ್ಗೊಲ್ಲಿ": [{"type": "noun", "defs": ["a wide inlet of a water body indenting the shoreline or the adjacent land."]}], "ಪೆರ್ಗೊಸರ್ಕೆ": [{"type": "noun", "defs": ["excessive affection, love."]}], "ಪೆರ್ಗೋಣಿ": [{"type": "noun", "defs": ["a variety of Ficus tree (prob. Ficus drupaceae)."]}], "ಪೆರ್ಚಾಳ್": [{"type": "noun", "defs": ["a man of excellence."]}], "ಪೆರ್ಚಿಸು": [{"type": "verb", "defs": ["to make greater, as in size, quantity or strength; to increase; to enlarge; to augment.", "to cause to spread over a wide area.", "to cause to flow over the bounds.", "to make wide or wider; to widen.", "(fig.) to cut; to remove by cutting.", "to cause to elate by delighting, praising or favouring.", "(math.) to find the product of two quantities by multiplying one with the other.", "(fig.) to put off a candle, lamp, etc."]}], "ಪೆರ್ಚು": [{"type": "verb", "defs": ["to become greater in size, amount, degree etc.; to grow; to increase.", "to develop toward maturity (as a plant or animal).", "to flow in flood.", "to become wider or broader.", "to be or become filled with pride, indignation, selfimportance, etc.", "to become delighted.", "to be elongated; to become longer or stretched.", "to behave triumphantly or in exulted manner.", "to progress; to prosper; to thrive vigorously.", "to cause to increase or become greater in size, amount, degree etc.", "to excel another in quality, power, size, etc.", "to shine well; to become eminent, conspicuous or brillant.", "to become zealous, enthusiastic.", "(said in respect of auspicious things like bangles, the marriage string, etc.) to break into pieces; to get severed.", "to be used up or expended completely.", "to cut or sever (something) into pieces."]}, {"type": "noun", "defs": ["an increasing or becoming increased; growth; increase; the quality of being big, great or large.", "the quality that makes one seem superior or worthy of special recognition; distinction; superiority.", "a successful, flourishing or thriving condition, esp. in financial terms; good fortune; prosperity.", "a great flow or outpouring.", "great joy or pleasure; delight.", "the act or fact of cutting, severing.", "excessive pride in one's appearance, qualities, abilities, achievements, etc.; character or quality of being vain; conceit; vanity.", "a ritual observed at the threshing floor before the grain are moved."]}], "ಪೆರ್ಚುಗೆ": [{"type": "noun", "defs": ["the fact or state of (something) being available in abundance.", "largeness; hugeness.", "the quality or fact of being long or longer than (something); lengthiness.", "the quality of excelling or surpassing another in some qualities; excellence.", "the act or state of flowing in great quantity; a great outpouring.", "the condition of being successful or thriving; prosperoty.", "largeness of extent or scope; width.", "strength of mind or spirit that enables a person to encounter danger with firmness; personal bravery; valour.", "the quality or state of being distinguished or worthy; distinction."]}], "ಪೆರ್ಚುಗೆಗೊಳ್": [{"type": "verb", "defs": ["to be or become glad; to be delighted.", "to become excellent.", "to progress well; to prosper; to become successful in one's endeavour or venture.", "to become strong or stronger."]}], "ಪೆರ್ಚುಗೆಗೊಳಿಸು": [{"type": "verb", "defs": ["to gladden; to make another happy; to delight.", "to help (another) become excellent.", "to cause or help another progress well or prosper.", "to cause to become strong or stronger."]}], "ಪೆರ್ಚುಗೆಡು": [{"type": "verb", "defs": ["to grow less in extent, degree, power, influence; to lose strength, brightness, importance, etc."]}], "ಪೆರ್ಚುಗೆವಡೆ": [{"type": "verb", "defs": ["= ಪೆರ್ಚುಗೆಗೊಳ್."]}], "ಪೆರ್ಚುವಡೆ": [{"type": "verb", "defs": ["= ಪೆರ್ಚುಗೆಗೊಳ್."]}], "ಪೆರ್ಚುವೆಱು": [{"type": "verb", "defs": ["= ಪೆರ್ಚುಗೆಗೊಳ್."]}], "ಪೆರ್ಜುಂಕ": [{"type": "noun", "defs": ["(hist.) a kind of tax levied on valuable commodities, animals, grain, shops etc."]}], "ಪೆರ್ಜೊಡರ್": [{"type": "noun", "defs": ["a big lamp, esp. a big votive lamp.", "a big burning torch.", "(phil.) the height of spiritual knowledge."]}], "ಪೆರ್ದಲೆ": [{"type": "noun", "defs": ["(fig.) a leader or an important person in a clan, society, village, etc."]}], "ಪೆರ್ದಿನಿ": [{"type": "noun", "defs": ["he who consumes anything; a greedy, voracious person."]}], "ಪೆರ್ದೊರೆ": [{"type": "noun", "defs": ["a large river.", "Křshṇe, a river in South India, flowing from the Western Ghats eastward empties into the Bay of Bengal."]}], "ಪೆರ್ದೊಱೆ": [{"type": "noun", "defs": ["= ಪೆರ್ದೊರೆ."]}], "ಪೆರ್ಬಡಿಕೆ": [{"type": "noun", "defs": ["a highly offensive smell.", "anything that is rotton and foul-smelling; a putrid thing."]}], "ಪೆರ್ಬಡಿಸು": [{"type": "verb", "defs": ["to make a very loud sound."]}], "ಪೆರ್ಬರಿ": [{"type": "noun", "defs": ["the upper portion of the flank."]}], "ಪೆರ್ಬಸ": [{"type": "noun", "defs": ["a famine and drought continuing for relatively a very long period."]}], "ಪೆರ್ಬಸವು": [{"type": "noun", "defs": ["= ಪೆರ್ಬಸ."]}], "ಪೆರ್ಬಾರವ": [{"type": "noun", "defs": ["an excellent brāhmaṇa.", "sub-caste among Śrīvaiṣṇavas, the followers of Śri Rāmānujācārya."]}], "ಪೆರ್ಬಾರ್ವ": [{"type": "noun", "defs": ["= ಪೆರ್ಬಾರವ."]}], "ಪೆರ್ಬಾವು": [{"type": "noun", "defs": ["any of several large, non-poisonous snakes of Boidae family, that crushes their prey in their coils; a boa constrictor.", "(myth.) Ādiśeṣa, the king of serpents."]}], "ಪೆರ್ಬಾವುಗ": [{"type": "noun", "defs": ["a fat, male cat."]}], "ಪೆರ್ಬಿಟ್ಟಿ": [{"type": "noun", "defs": ["service as physical work, toiling, labouring, got from another by force without any compensation."]}], "ಪೆರ್ಬುಡಿಕೆ": [{"type": "noun", "defs": ["a big basket."]}], "ಪೆರ್ಬೊಟ್ಟು": [{"type": "noun", "defs": ["the short, thick digit of the human hand that is the nearest the one to wrist and is opposable to the other fingers; the thumb.", "the thickest one of the five digits at the front of the human foot; the great toe."]}], "ಪೆರ್ಬೊಡೆಯ": [{"type": "noun", "defs": ["Gaṇeśa, who has a large belly.", "(fig.) a pot-bellied man."]}], "ಪೆರ್ಮ": [{"type": "noun", "defs": ["an old, elderly or respectable, honourable man.", "the quality or condition of being available abundantly."]}, {"type": "noun", "defs": ["riches; wealth."]}], "ಪೆರ್ಮಗ": [{"type": "noun", "defs": ["one's eldest son."]}], "ಪೆರ್ಮಗಳ್": [{"type": "noun", "defs": ["one's eldest daughter."]}], "ಪೆರ್ಮಗು": [{"type": "noun", "defs": ["one's eldest child."]}], "ಪೆರ್ಮಡಿ": [{"type": "noun", "defs": ["= ಪೆರ್ಮ1 - 1."]}], "ಪೆರ್ಮಡಿಯ": [{"type": "noun", "defs": ["= ಪೆರ್ಮ1 - 1."]}], "ಪೆರ್ಮಡಿವಟ್ಟ": [{"type": "noun", "defs": ["the respect, honour a person deserves or commands."]}], "ಪೆರ್ಮನಡಿ": [{"type": "noun", "defs": ["= ಪೆರ್ಮ1 - 1."]}], "ಪೆರ್ಮನೆ": [{"type": "noun", "defs": ["a large house.", "(fig.) a wealthy or respectable family."]}], "ಪೆರ್ಮಲ": [{"type": "noun", "defs": ["excessive frequency and looseness of bowel movements; diarrhoea."]}], "ಪೆರ್ಮಱವೆ": [{"type": "noun", "defs": ["a complete or abnormally severe forgetfulness.", "a ceasing to be alive; death.", "deplorable negligence or carelessness."]}], "ಪೆರ್ಮಱವೆಗೊಳ್": [{"type": "verb", "defs": ["to lose consciousness temporarily; to become unconscious."]}], "ಪೆರ್ಮಱಿ": [{"type": "noun", "defs": ["= ಪೆರ್ಬಾವು - 1."]}], "ಪೆರ್ಮಾಡಿ": [{"type": "noun", "defs": ["= ಪೆರ್ಮ1 - 1."]}], "ಪೆರ್ಮಾನಡಿ": [{"type": "noun", "defs": ["= ಪೆರ್ಮ1 - 1."]}], "ಪೆರ್ಮುಸುಂಡೆ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಪೆರ್ಮೆ": [{"type": "noun", "defs": ["the quality that makes one seem superior or worthy of special recognition; distinction; superiority.", "a proper pride about oneself or whatever that belongs to oneself; sense of one's own dignity or worth; self-respect; pride.", "an unduly high opinion of oneself; exaggerated self-esteem; conceit.", "haughty behavior resulting from this; arrogance.", "great joy; delight."]}], "ಪೆರ್ಮೆಗಿಡು": [{"type": "verb", "defs": ["= ಪೆರ್ಮೆಗೆಡು."]}], "ಪೆರ್ಮೆಗೆಡು": [{"type": "verb", "defs": ["to lose one's pride, self respect.", "to lose one's haughtiness; to become humble, modest."]}], "ಪೆರ್ಮೆಗೊಳ್": [{"type": "verb", "defs": ["to become proud; to feel elated with the success, merit, etc. of oneself, one's family, countrymen, etc."]}], "ಪೆರ್ಮೆಯೊಡೆಯ": [{"type": "noun", "defs": ["a man of distinction."]}], "ಪೆರ್ಮೆವಡೆ": [{"type": "verb", "defs": ["= ಪೆರ್ಮೆಗೊಳ್."]}], "ಪೆರ್ಮೆವೆಱು": [{"type": "verb", "defs": ["= ಪೆರ್ಮೆಗೊಳ್."]}], "ಪೆರ್ವಕ್ಕಿ": [{"type": "noun", "defs": ["the kite, Haliastur indus of Accipitridae family, with white head, neck and breast, strong, curved beak, bright brown wings, forked tail, (regarded as the vehicle of Viṣṇu); Brahmini kite."]}], "ಪೆರ್ವಡಹ": [{"type": "noun", "defs": ["incessant rain."]}], "ಪೆರ್ವಡಿ": [{"type": "noun", "defs": ["= ಪೆರ್ಮ1 - 1."]}], "ಪೆರ್ವಡಿಕೆ": [{"type": "noun", "defs": ["= ಪೆರ್ಬಡಿಕೆ."]}], "ಪೆರ್ವಡುಕೆ": [{"type": "noun", "defs": ["= ಪೆರ್ಬಡಿಕೆ."]}], "ಪೆರ್ವಡುಕೆನಾತ": [{"type": "noun", "defs": ["= ಪೆರ್ಬಡಿಕೆ - 1."]}], "ಪೆರ್ವರ": [{"type": "noun", "defs": ["any enormously huge tree.", "the small-sized tree Oroxylum indicum ( = Bignonia indica) of Bignoniaceae family, the bark of which contains tannin.", "another large, deciduous tree Ailanthus excelsa of Simaroubaceae family."]}], "ಪೆರ್ವಸ": [{"type": "noun", "defs": ["= ಪೆರ್ಬಸ."]}], "ಪೆರ್ವಾರವ": [{"type": "noun", "defs": ["= ಪೆರ್ಬಾರವ."]}], "ಪೆರ್ವಾರ್ವ": [{"type": "noun", "defs": ["= ಪೆರ್ಬಾರವ."]}], "ಪೆರ್ವಾವು": [{"type": "noun", "defs": ["= ಪೆರ್ಬಾವು."]}], "ಪೆರ್ವೊಡೆಯ": [{"type": "noun", "defs": ["= ಪೆರ್ಬೊಡೆಯ."]}], "ಪೆರ್ಸಂಪಗೆ": [{"type": "noun", "defs": ["the gree Michelia nilagirica of Magnoliaceae family.", "its flower."]}], "ಪೆಲ್ಲಯಿಸು": [{"type": "verb", "defs": ["= ಪೆಲ್ಲಿಸು."]}], "ಪೆಲ್ಲಿಸು": [{"type": "verb", "defs": ["to be collected in large number, quanity or to a great degree.", "to gather (a large number of things, people, etc.) at a place."]}], "ಪೆವಡಿ": [{"type": "noun", "defs": ["yellowish earth.", "yellow colour."]}], "ಪೆವ್ವಳಿಸು": [{"type": "verb", "defs": ["= ಪೆಳ್ವಳಿಸು."]}], "ಪೆಸರ್": [{"type": "noun", "defs": ["= ಪೆಸರು1.", "ಪೆಸರೆತ್ತು pesarettu to utter another's name (in reverence, appreciation, etc.); ಪೆಸರಾಗು pesarāgu (fame) to be made; 2. to become famous; ಪೆಸರುಬರ್ pesaru bar (a name) to be got; 3. (fame) to be made; ಪೆಸರ್ಮಾಡು pesarmāḍu to get fame; ಪೆಸರುಳಿಸು pesaruḷisu to uphold one's, one's family's or country's fame (as by good deeds)."]}], "ಪೆಸರಾನ್": [{"type": "verb", "defs": ["to have name; to be known by a name.", "to get fame; to become renowned."]}], "ಪೆಸರಿಡು": [{"type": "verb", "defs": ["to give a name or title to; to name.", "to appreciate (another's) quality.", "to blame; to accuse.", "to express clearly; to make known."]}], "ಪೆಸರಿಲಿ": [{"type": "noun", "defs": ["a person having name; a nameless person.", "the finger next to the little finger; the ring finger."]}], "ಪೆಸರಿಸು": [{"type": "verb", "defs": ["= ಪೆಸರಿಡು - 1 & 2.", "to propose (a person's) name for.", "to set or fix; to specify; to name.", "to gain popularity, fame."]}], "ಪೆಸರೀ": [{"type": "verb", "defs": ["= ಪೆಸರಿಡು - 1."]}], "ಪೆಸರು": [{"type": "noun", "defs": ["a word or a combination of words by which a person, place or thing, a body or class or any object of thought is designated, called or known; a name.", "widespread reputation, esp. of a favorable character; renown.", "an appellation given to a person or family as a sign of privilege, distinction, rank or profession; a title.", "accusation; blame."]}, {"type": "noun", "defs": ["the plant Phaseolus aureus ( = P. radiatus) of Papilionaceae family, grown for its pea.", "its pea, widely used as food."]}], "ಪೆಸರುಗೊಳ್": [{"type": "verb", "defs": ["to have name; to be known by one's name.", "to utter a name.", "to call or address by name.", "to describe, delineate in words, in detail.", "to gain popularity; to become famous.", "to chose or select (good ones from a lot).", "to praise; to extol."]}], "ಪೆಸರುವಡೆ": [{"type": "verb", "defs": ["= ಪೆಸರುಗೊಳ್ - 1 & 5."]}], "ಪೆಸರುವೆಱು": [{"type": "verb", "defs": ["= ಪೆಸರುಗೊಳ್ - 1 & 5."]}], "ಪೆರಸರ್ಗಿಡು": [{"type": "verb", "defs": ["to lose one's reputation; to contract discredit, bad reputation."]}], "ಪೆಸರ್ಗೇಳ್": [{"type": "verb", "defs": ["to come to know another's name; to be aware of fame, popularity, credit, etc. of another."]}], "ಪೆಸರ್ಗೊಳ್": [{"type": "verb", "defs": ["= ಪೆಸರುಗೊಳ್."]}], "ಪೆಸರ್ಪು": [{"type": "verb", "defs": ["to blame; to accuse."]}], "ಪೆಸರ್ವಡೆ": [{"type": "verb", "defs": ["= ಪೆಸರುಗೊಳ್ - 1 & 5."]}], "ಪೆಸರ್ವಾಸಿ": [{"type": "noun", "defs": ["good reputation; fame; renown."]}], "ಪೆಸರ್ವಿಡಿ": [{"type": "verb", "defs": ["to utter another's name."]}], "ಪೆಸರ್ವೆಱು": [{"type": "verb", "defs": ["= ಪೆಸರುಗೊಳ್ - 1 & 5."]}], "ಪೆಸಱ್": [{"type": "noun", "defs": ["= ಪೆಸರು2."]}], "ಪೆಸಱು": [{"type": "noun", "defs": ["= ಪೆಸರು2."]}], "ಪೆಹೆಲವಾನ್": [{"type": "noun", "defs": ["a professional wrestler."]}], "ಪೆಳಕು": [{"type": "noun", "defs": ["a pre-appointed place for meeting or carrying on a business."]}], "ಪೆಳಕೆ": [{"type": "noun", "defs": ["the thin hard, but breakable outer part of something that has become dry and crisp (as the crust that has formed on a wound).", "a thin piece taken out, broken from (as of a stone by chipping)."]}], "ಪೆಳರ್": [{"type": "verb", "defs": ["= ಪೆಳರು1."]}], "ಪೆಳರು": [{"type": "verb", "defs": ["to be afraid of; to feel fear; to fear."]}, {"type": "noun", "defs": ["fear; fright; panic; terror."]}], "ಪೆಳರ್ಚಿಸು": [{"type": "verb", "defs": ["to cause panic, terror; to frighten; to panic."]}], "ಪೆಳರ್ಚು": [{"type": "verb", "defs": ["= ಪೆಳರ್ಚಿಸು."]}], "ಪೆಳರ್ವಡು": [{"type": "verb", "defs": ["= ಪೆಳರು1."]}], "ಪೆಳವ": [{"type": "noun", "defs": ["a man having an injured leg or foot that makes him limp; a lame man.", "(myth.) Aruṇa, the driver of the Sun God's chariot."]}], "ಪೆಳವಳಿಸು": [{"type": "verb", "defs": ["= ಪೆಳ್ವಳಿಸು."]}], "ಪೆಳವಿ": [{"type": "noun", "defs": ["a woman having an injured leg or foot that makes her limp; a lame woman."]}], "ಪೆಳಱ್": [{"type": "noun", "defs": ["= ಪೆಳರು2."]}], "ಪೆಳಱಿಸು": [{"type": "verb", "defs": ["to cause to feel fright; to scare; to frighten; to terrify.", "(fig.) to drive out or ward off (an evil).", "to make lusterless, dim, dull or vigourless."]}], "ಪೆಳಱು": [{"type": "verb", "defs": ["= ಪೆಳರು1."]}, {"type": "noun", "defs": ["= ಪೆಳರು2."]}], "ಪೆಳಱುಗೊಳ್": [{"type": "verb", "defs": ["= ಪೆಳರು1."]}], "ಪೆಳಱುಗೊಳಿಸು": [{"type": "verb", "defs": ["= ಪೆಳರ್ಚಿಸು."]}], "ಪೆಳೆ": [{"type": "noun", "defs": ["a woody plant smaller than a tree, usu. having multiple permanent stems branching from or near the ground; a shrub."]}], "ಪೆಳ್ಪಳ": [{"type": "noun", "defs": ["= ಪೆಳರು2."]}], "ಪೆಳ್ಪಳಿಸು": [{"type": "verb", "defs": ["= ಪೆಳ್ವಳಿಸು."]}], "ಪೆಳ್ವಳಿಸು": [{"type": "verb", "defs": ["to fear; to be afraid or scared of.", "to move or run away or try to escape from fear.", "to terrify; to scare.", "to hesitate from fear, indecision, lack of confidence, etc."]}], "ಪೆಳ್ಳಗಿಸು": [{"type": "verb", "defs": ["to pull or draw out."]}], "ಪೆಱ": [{"type": "adjective", "defs": ["(in comp.) other; different; another."]}, {"type": "adjective", "defs": ["(in comp.) of, at or in the rear."]}], "ಪೆಱಂಟೆ": [{"type": "noun", "defs": ["the iron share of a plough."]}], "ಪೆಱಕಣ್ದೆಱವು": [{"type": "noun", "defs": ["the knowledge, remembrances of one's past birth."]}], "ಪೆಱಕಾಲ್": [{"type": "noun", "defs": ["the hind legs (of any four-legged animals)."]}], "ಪೆಱಕಾಲ್ಗೊಳಿಸು": [{"type": "verb", "defs": ["to make (a four-legged animal) stand on its hind legs."]}], "ಪೆಱಗಣ್": [{"type": "noun", "defs": ["the rear side.", "the outside; the portion, region, district that is outside."]}], "ಪೆಱಗಣ": [{"type": "adjective", "defs": ["of, at or in the rear.", "happened, completed at a former time; past."]}], "ಪೆಱಗನೆ": [{"type": "adverb", "defs": ["following; running after or behind."]}], "ಪೆಱಗಾಲ್": [{"type": "noun", "defs": ["= ಪೆಱಕಾಲ್."]}], "ಪೆಱಗಿಕ್ಕು": [{"type": "verb", "defs": ["to cause to remain backward or at the rear portion.", "to cause to back, retreat.", "to shield, protect (by keeping another at one's back).", "to leave for ever; abandon.", "to go beyond, act transgressing, the proper or usual limits.", "to ignore; to disregard deliberately."]}], "ಪೆಱಗಿಡು": [{"type": "verb", "defs": ["to keep at the back.", "to go back or retreat (as from facing a danger, fight, etc.)."]}], "ಪೆಱಗು": [{"type": "noun", "defs": ["the rear portion or region.", "an incident that happened in the past.", "ಪೆಱಗು ಮಾಡು peṛagu māḍu to exclude and leave behind; to overtake; ಪೆಱಗಾಗು peṛagāgu to remain behind or outside; 2. to be excluded from; 3. to get rid of (confinement); ಪೆಱಗಂ ತಗುಳ್ peṛagm taguḷ to follow; to run behind (as to catch)."]}], "ಪೆಱಗುಗುಡು": [{"type": "verb", "defs": ["to turn one's back; to go away from."]}], "ಪೆಱಗುಗೆಯ್": [{"type": "verb", "defs": ["= ಪೆಱಗುಗುಡು.", "to go out of sight; to disappear.", "(fig.) to treat disdainfully, scornfully."]}], "ಪೆಱಗೆ": [{"type": "adverb", "defs": ["at, to or toward the rear; backward.", "at, to or toward outside; outward.", "at a later time; after some time; subsequently.", "excluding or excluded from.", "in the absence of."]}], "ಪೆಱಗೆಡೆ": [{"type": "verb", "defs": ["to go back; to retreat."]}], "ಪೆಱತು": [{"type": "adjective", "defs": ["that is not belonging to (the group being considered); different from a group, class of)."]}, {"type": "noun", "defs": ["a thing that is not belonging to or is different from (a particular group, class, etc.)."]}], "ಪೆಱತೆಗೆ": [{"type": "verb", "defs": ["to go back to original or previous position or place; to retreat.", "to draw or pull out (as a sword from its sheath).", "to come out (from)."]}], "ಪೆಱದು": [{"type": "adjective", "defs": ["= ಪೆಱತು1."]}, {"type": "noun", "defs": ["= ಪೆಱತು2."]}], "ಪೆಱದೆಗೆ": [{"type": "verb", "defs": ["= ಪೆಱತೆಗೆ."]}], "ಪೆಱದೆಗೆಯಿಸು": [{"type": "verb", "defs": ["to cause to retreat, go back to previous or original place or position."]}], "ಪೆಱನಡು": [{"type": "verb", "defs": ["to go back to previous or original place or position; to retreat."]}], "ಪೆಱಪಿಂಗಿಸು": [{"type": "verb", "defs": ["to push backward.", "to ward off; to prevent from happening or advancing."]}], "ಪೆಱಪಿಂಗು": [{"type": "verb", "defs": ["to go back; to retreat.", "to come out; to be emitted.", "to become less in extent, degree, intensity, etc.", "to go away from; to be at a distant place.", "to be destroyed or erased completely.", "to ward off; to prevent; to keep from happening or troubling.", "to be warded off; to be prevented; to be kept from happening or troubling.", "to be separated or disconnected from."]}], "ಪೆಱಭಾಗ": [{"type": "noun", "defs": ["the rear side or portion."]}], "ಪೆಱಮೆಟ್ಟು": [{"type": "verb", "defs": ["to step backward; to go back."]}], "ಪೆಱಮೆಯ್": [{"type": "noun", "defs": ["the part of the body from the nape to the end of the spine."]}], "ಪೆಱವಕ್ಕ": [{"type": "noun", "defs": ["= ಪೆಱಭಾಗ."]}], "ಪೆಱವುೞಿ": [{"type": "verb", "defs": ["to remain outside or as a balance (after some part, portion is removed)."]}, {"type": "noun", "defs": ["a secluded place.", "a place other than the one being referred to or considered; elsewhere."]}, {"type": "adverb", "defs": ["at some other place; elsewhere."]}], "ಪೆಱವೋಗು": [{"type": "verb", "defs": ["= ಪೆಱಸಾರು."]}], "ಪೆಱಸಾರ್": [{"type": "verb", "defs": ["= ಪೆಱಸಾರು."]}], "ಪೆಱಸಾರಿಸು": [{"type": "verb", "defs": ["to cause to retreat.", "to cause to go away from."]}], "ಪೆಱಸಾರು": [{"type": "verb", "defs": ["to go back to original or previous place; to retreat.", "to go away from."]}], "ಪೆಱಸಾರ್ಚು": [{"type": "verb", "defs": ["= ಪೆಱಸಾರಿಸು."]}], "ಪೆಱಹೋಗು": [{"type": "verb", "defs": ["= ಪೆಱಸಾರು."]}], "ಪೆಱಿಸು": [{"type": "verb", "defs": ["to cause to give birth (to a child); to help a woman in childbirth."]}], "ಪೆಱು": [{"type": "verb", "defs": ["to have (a thing in one's possession); to possess or contain as a part, characteristic, attribute, etc.", "to receive (salary, wages, etc.) for one's labor or service.", "to get or deserve as a result of something one has done.", "to gain (interest, etc.) as profit.", "to take or own a responsibility of or for.", "to give birth; to bring forth a young into life; to beget.", "(in gen.) to produce or bring into existence; to generate.", "to send out; give forth; discharge.", "(a female bird, fish, reptile, insect, etc.) to lay egg or eggs.", "to be got; to come into possession of."]}, {"type": "verb", "defs": ["to become a soft, semisolid mass; to become coagulated, curds."]}], "ಪೆಱುಕು": [{"type": "verb", "defs": ["to pick up; to take up one by one (from a lot).", "to scratch or scrape.", "to scratch with a tooth or teeth."]}], "ಪೆಱೆ": [{"type": "noun", "defs": ["the moon, esp. the crescent moon.", "a crescent-shaped ornament worn by women on their forehead."]}], "ಪೆಱೆಗೊಂಕು": [{"type": "noun", "defs": ["a figure like the crescent moon."]}], "ಪೆಱೆಗೊಡೆಯ": [{"type": "noun", "defs": ["(myth.) Manmatha, the Love-God, who has the moon as his umbrella."]}], "ಪೆಱೆದಲೆ": [{"type": "noun", "defs": ["a head wearing the crescent moon (or a crescent-shaped ornament).", "the day on which the entire face of the moon on the side of the earth is reflecting sunlight to the earth; a full-moon-day."]}], "ಪೆಱೆದಲೆಯ": [{"type": "noun", "defs": ["Śiva, who wears the crescent moon on his head."]}], "ಪೆಱೆನೊಸಲ್": [{"type": "noun", "defs": ["= ಪೆಱೆನೊಸಲು."]}], "ಪೆಱೆನೊಸಲು": [{"type": "noun", "defs": ["a crescent-shaped forehead (considered beautiful)."]}], "ಪೆಱೆಮುಖಿ": [{"type": "noun", "defs": ["a woman whose face is beautiful (like the moon)."]}], "ಪೆಱೆಯಂಬು": [{"type": "noun", "defs": ["an arrow with a crescent shaped blade at the front end."]}], "ಪೆಱೆವಣೆ": [{"type": "noun", "defs": ["= ಪೆಱೆನೊಸಲು."]}], "ಪೆೞಕು": [{"type": "noun", "defs": ["a struggle or fight; a conflict."]}], "ಪೆೞಗಾಲ್": [{"type": "noun", "defs": ["a crippled leg."]}], "ಪೆೞವ": [{"type": "noun", "defs": ["= ಪೆಳವ."]}], "ಪೆೞವಿ": [{"type": "noun", "defs": ["= ಪೆಳವಿ."]}], "ಪೆೞವು": [{"type": "noun", "defs": ["the state of being crippled; lameness."]}], "ಪೆೞವುಗೊಳ್": [{"type": "verb", "defs": ["(a leg) to become crippled."]}], "ಪೆೞವೆ": [{"type": "noun", "defs": ["= ಪೆಳವಿ."]}], "ಪೆೞಸು": [{"type": "noun", "defs": ["the state or quality of being hard (as a metal).", "the quality of being easily broken, apt to break; fragility.", "the quality of being difficult to deal with or being unfeeling, lacking pity, etc.", "the condition or fact of being difficult.", "vanity; vainglory.", "the state or quality of being viscous; viscosity.", "little scales or flakes of dead skin formed on the scalp; dandruff."]}], "ಪೆೞ್ಚಿಸು": [{"type": "verb", "defs": ["to make greater, as in size, quantity or strength; to increase; to enlarge; to augment.", "to cause to spread over a wide area.", "to cause to flow over the bounds.", "to make wide or wider; to widen.", "(fig.) to cut; to remove by cutting.", "to cause to elate by delighting, praising or favouring.", "(math.) to find the product of two quantities by multiplying one with the other.", "(fig.) to put off a candle, lamp, etc."]}], "ಪೆೞ್ಚು": [{"type": "verb", "defs": ["to become greater in size, amount, degree etc.; to grow; to increase.", "to develop toward maturity (as a plant or animal).", "to flow in flood.", "to become wider or broader.", "to be or become filled with pride, indignation, selfimportance, etc.", "to become delighted.", "to be elongated; to become longer or stretched.", "to behave triumphantly or in exulted manner.", "to progress; to prosper; to thrie vigorously.", "to cause to increase or become greater in size, amount, degree etc.", "to excel another in quality, power, size, etc.", "to shine well; to become eminent, conspicuous or brillant.", "to become zealous, enthusiastic.", "(auspicious things like bangles, the marriage string, etc.) to break into pieces; to get severed.", "to be used up or expended completely.", "to cut or sever (something) into pieces."]}]}