{"ಅದೂಷ್ಯ": [{"type": "adjective", "defs": ["not to be blamed, indicted; incorrupt; irreproachable."]}], "ಅಧೃಢ": [{"type": "adjective", "defs": ["not firm or strong physically; lacking strength.", "not firm in mind or purpose; not resolute; vacillating."]}, {"type": "noun", "defs": ["a man having infirm mind or lacking resoluteness."]}], "ಅಧೃಢತೆ": [{"type": "noun", "defs": ["want of physical strength.", "the quality or condition of being mentally frail; frailty."]}], "ಅಧೃಢೆ": [{"type": "noun", "defs": ["a woman having infirm mind or lacking resoluteness."]}], "ಅದೃಶ್ಯ": [{"type": "adjective", "defs": ["that cannot be perceived by eyes; invisible.", "out of sight; not apparent; unseen.", "that must not be seen; not to be seen."]}], "ಅದೃಶ್ಯವಾಗು": [{"type": "verb", "defs": ["to disappear from sight; to cease from being seen."]}], "ಅದೃಶ್ಯಂದಳೆ": [{"type": "verb", "defs": ["to cease to be seen; to go out of sight; to disappear."]}], "ಅದೃಶ್ಯತೆ": [{"type": "noun", "defs": ["the state of being not seen; disappearance."]}], "ಅದೃಶ್ಯಮಸಿ": [{"type": "noun", "defs": ["(a wrong euphonic combination ) a colourless ink that cannot be seen on paper until it is treated with heat, vapour or a chemical; invisible ink."]}], "ಅದೃಶ್ಯರೂಪ": [{"type": "noun", "defs": ["a form, figure or structure that cannot be seen by others ( as in mysticism, magic etc.).", "one who has gone away from being seen, disappeared or vanished."]}], "ಅದೃಶ್ಯೆ": [{"type": "noun", "defs": ["a woman who cannot be seen."]}], "ಅದೃಷ್ಟ": [{"type": "adjective", "defs": ["that cannot be seen; unseen; invisible."]}, {"type": "noun", "defs": ["the seemingly inevitable happening of events that affect someone; fortune or fate that cannot be predicted or foreseen.", "good fortune; success, prosperity, advantage, etc. 3) the force believed to cause things, esp. good things, to happen to a person by chance and not as a result of his or her own efforts or abilities; destiny;", "ಅದೃಷ್ಟದ ಆಟ adřṣṭada āṭa a game of chance, as gambling etc. 2. (fig.) the ups and downs in one's life believed to have been caused by the destiny; ಅದೃಷ್ಟದ ಏಣಿ ಏರು adřṣṭada ēṇi ēru (fig.) to achieve something or progress mainly by the luck of the draw; to have luck on one's side; ಅದೃಷ್ಟ ಖುಲಾಯಿಸು adřṣṭa khulāyisu (something good) to happen (usu. unexpectedly)."]}], "ಅದೃಷ್ಟಪರೀಕ್ಷೆ": [{"type": "noun", "defs": ["a trial of ones fortune; a test of one's luck."]}], "ಅದೃಷ್ಟಪುರುಷಸಂಧಿ": [{"type": "noun", "defs": ["one of the twenty (sixteen, according to some) ways of peace-making, in which the treaty is concluded by both the parties concerned without having a third person as a mediator."]}], "ಅದೃಷ್ಟಪೂರ್ವ": [{"type": "adjective", "defs": ["not seen ever before; being seen for the first time."]}], "ಅದೃಷ್ಟಫಲ": [{"type": "noun", "defs": ["the (future) result of a good or bad actions; the result or consequence hidden in the future.", "the consequence or result that begets one independent of his or her effort or merit."]}], "ಅದೃಷ್ಟರೇಖೆ": [{"type": "noun", "defs": ["(palmistry) a particular line on the palm of a person, which supposedly indicates his fortune; the line of fortune."]}], "ಅದೃಷ್ಟವಂತ": [{"type": "noun", "defs": ["a man who gets or got success, prosperity, position etc. purely by chance and not as a result of his efforts or abilities; a lucky or fortunate man."]}], "ಅದೃಷ್ಟವಂತೆ": [{"type": "noun", "defs": ["a woman who gets or got success, prosperity, position etc. purely by chance and not as a result of his efforts or abilities; a lucky or fortunate woman."]}], "ಅದೃಷ್ಟವಶ": [{"type": "adjective", "defs": ["not achieving, getting by one's effort or ability, but, subject to the destiny; being in the hands of fate."]}, {"type": "noun", "defs": ["success, position or prosperity got by luck, but not by one's ability or effort; good luck; stroke of luck."]}], "ಅದೃಷ್ಟವಶಾತ್": [{"type": "adverb", "defs": ["luckily; by chance."]}], "ಅದೃಷ್ಟವಾದ": [{"type": "noun", "defs": ["the doctrine that all events are subject to fate, and happen by unavoidable necessity; fatalism.", "acceptance of every event as inevitable."]}], "ಅದೃಷ್ಟವಾದಿ": [{"type": "noun", "defs": ["one who believes in or advocates the doctrine that fate decides happening of all events, and one's efforts, abilities have nothing in this regard; a fatalist.", "one who accepts every event as inevitable."]}], "ಅದೃಷ್ಟಶಕ್ತಿ": [{"type": "noun", "defs": ["the invisible power, either divine or fate, that is believed to cause all the events."]}], "ಅದೃಷ್ಟಶಾಲಿ": [{"type": "noun", "defs": ["= ಅದೃಷ್ಟವಂತ."]}], "ಅದೃಷ್ಟಸಂಧಿ": [{"type": "noun", "defs": ["= ಅದೃಷ್ಟಪುರುಷಸಂಧಿ."]}], "ಅದೃಷ್ಟಹೀನ": [{"type": "adjective", "defs": ["not having good luck; missing what one deserves by his or her merit or ability; unlucky."]}, {"type": "noun", "defs": ["a man who is deprived of his due reward, success, etc.; an unlucky man."]}], "ಅದೃಷ್ಟಹೀನೆ": [{"type": "noun", "defs": ["an unlucky woman."]}], "ಅದೆ": [{"type": "verb", "defs": ["to be available; to be got."]}, {"type": "adverb", "defs": ["the opposite of 'no' and used to express confirmation; aye; yea; yes; it is so."]}, {"type": "interjection", "defs": ["an interjection used to call attention to a distant object; lo!.", "an interjection used to confirm \"the same', 'as it was', 'the very one'."]}, {"type": "noun", "defs": ["(dial.) the inner space of a box, shelf or an almirah."]}], "ಅದೆಕೊಳ್": [{"type": "interjection", "defs": ["an interjection used to call attention to a distant object; lo!."]}], "ಅದೆಬದೆ": [{"type": "noun", "defs": ["a woman faithful to her husband; a chaste wife."]}], "ಅದೇ": [{"type": "interjection", "defs": ["= ಅದೆ3."]}], "ಅದೇಯ": [{"type": "adjective", "defs": ["not to be given; that ought not to be given as gift; unfit to be donated."]}], "ಅದೈವೆ": [{"type": "noun", "defs": ["a woman deprived of the divine grace; an unlucky woman."]}], "ಅದೊ": [{"type": "interjection", "defs": ["an interjection used to call attention to a distant object; lo!; 'look there'!."]}], "ಅದೋಷ": [{"type": "noun", "defs": ["absence of fault or blemishness; faultlessness."]}], "ಅದ್ಗಡಿ": [{"type": "noun", "defs": ["loud and violent noise as of shouting; uproar."]}], "ಅದ್ಗಣಿ": [{"type": "noun", "defs": ["= ಅದ್ದಗಣಿ."]}], "ಅದ್ದ": [{"type": "noun", "defs": ["either of two equal parts into which a thing is divisible; a half."]}], "ಅದ್ದಕ": [{"type": "noun", "defs": ["act of thrusting, dropping or dipping into water or any other liquid so as to make it covered completely; immersion."]}], "ಅದ್ದಕಾಣಿ": [{"type": "noun", "defs": ["= ಅದ್ದಗಣಿ."]}], "ಅದ್ದಗಣಿ": [{"type": "noun", "defs": ["an iron or steel block on which metal objects are hammered into shape; an anvil."]}], "ಅದ್ದಗಾಣಿ": [{"type": "noun", "defs": ["an old coin (now obsolete) of a very low value; a half-kāṇi."]}], "ಅದ್ದಣ": [{"type": "noun", "defs": ["= ಅದ್ದನ¹."]}], "ಅದ್ದನ": [{"type": "noun", "defs": ["an old measure of volume, a half-seer (a little less than half a litre)."]}, {"type": "noun", "defs": ["= ಅದ್ದಗಣಿ."]}], "ಅದ್ದಯಿಸು": [{"type": "verb", "defs": ["to thrust a thing into another (esp. water) by force."]}], "ಅದ್ದರ": [{"type": "noun", "defs": ["= ಅದ್ದಲ."]}, {"type": "adjective", "defs": ["(dial.) markedly lacking in strength; weak; feeble; infirm."]}], "ಅದ್ದರಚಿದ್ದರ": [{"type": "noun", "defs": ["a person or thing very much like another; a copy; a counterpart.", "likeness in form and structure."]}], "ಅದ್ದರಣೆ": [{"type": "noun", "defs": ["a medicinal plant."]}], "ಅದ್ದರಿಸು": [{"type": "verb", "defs": ["= ಅದ್ದಲಿಸು."]}], "ಅದ್ದಲ": [{"type": "noun", "defs": ["a vehement noise. a loud shouting; an uproar.", "a feeling of anxiety and agitation caused by the presence or nearness of danger, evil, pain, etc; fear."]}], "ಅದ್ದಲಿಸು": [{"type": "verb", "defs": ["to shout aloud; to roar with rumbling sound.", "to tremble, quiver, as from fear.", "to cause to tremble; to shake (an object)."]}], "ಅದ್ದಳ": [{"type": "noun", "defs": ["= ಅದ್ದಲ."]}], "ಅದ್ದಳಂಗೈ": [{"type": "verb", "defs": ["(lion) to roar.", "to roar like a lion."]}], "ಅದ್ದಳವೇಳು": [{"type": "verb", "defs": ["(loud sound, violent noise) to be made."]}], "ಅದ್ದಳಿಸು": [{"type": "verb", "defs": ["= ಅದ್ದಲಿಸು."]}], "ಅದ್ದಾನ": [{"type": "noun", "defs": ["a difficult situation; hard time or condition."]}], "ಅದ್ದಿಕ": [{"type": "noun", "defs": ["a person who supervises; a superintendent; a manager; a presiding officer.", "the act or responsibility of supervising; supervision.", "a coming together of persons face to face; a meeting."]}], "ಅದ್ದಿಕದವನು": [{"type": "noun", "defs": ["one who is in charge of or who has the responsibility of, supervision."]}], "ಅದ್ದಿಕೆ": [{"type": "noun", "defs": ["= ಅದ್ದುಗೆ."]}], "ಅದ್ದಿಗ": [{"type": "noun", "defs": ["= ಅದ್ದಿಕ."]}], "ಅದ್ದಿಟ್ಟು": [{"type": "noun", "defs": ["dry flour used for making the round small raw sheets of ಹಪ್ಪಳ, ಪೂರಿ, ಚಪಾತಿ etc. non-sticky.", "a raw flour of certain cereals prepared with spices, water for making ಬೋಂಡ, an eatable fried in oil."]}], "ಅದ್ದಿಸು": [{"type": "verb", "defs": ["to (cause to) thrust, drop or dip into water or any other liquid so as to make it covered completely; immerse."]}, {"type": "verb", "defs": ["to cause great physical pain or mental anguish in; to torment.", "to annoy, harass or tease.", "to defeat; to overpower; to subdue.", "to keep under check; to control; to regulate."]}], "ಅದ್ದು": [{"type": "verb", "defs": ["to thrust, drop or dip into water or any other liquid so as to make it covered completely; to immerse."]}], "ಅದ್ದುಗಾಣಿ": [{"type": "noun", "defs": ["= ಅದ್ದಗಣಿ."]}], "ಅದ್ದುಗೆ": [{"type": "noun", "defs": ["act of going into a liquid; an immersing of oneself.", "act of dipping, thrusting an object into water or any other liquid; immersion.", "act of giving colour to, impregnate or cover with colour as with paint, stain or dye."]}], "ಅದ್ದೂರಿ": [{"type": "adjective", "defs": ["= ಅದ್ಧೂರಿ¹."]}, {"type": "noun", "defs": ["= ಅದ್ಧೂರಿ²."]}], "ಅದ್ದೆ": [{"type": "adjective", "defs": ["performing the duties of another's office; performing functions of another person."]}], "ಅದ್ದೇಕೆಲಸ": [{"type": "noun", "defs": ["the act of working for another in the latteṛs capacity or position; the duty so performed."]}], "ಅದ್ದೇಚಾಕರಿ": [{"type": "noun", "defs": ["= ಅದ್ದೇಕೆಲಸ."]}], "ಅದ್ದೇಲಿ": [{"type": "noun", "defs": ["(dial.) any small coin, hence worthless."]}], "ಅದ್ಧಾಪಲ್ಯ": [{"type": "noun", "defs": ["(jain.) a division of time, as a unit of measurement."]}], "ಅದ್ಧುರಿ": [{"type": "adjective", "defs": ["= ಅದ್ಧೂರಿ¹."]}, {"type": "noun", "defs": ["= ಅದ್ಧೂರಿ²."]}], "ಅದ್ಧೂರಿ": [{"type": "adjective", "defs": ["stately or brilliant; splendid; magnificent.", "ostentatious; showy; pompous.", "extravagantly out-pouring; lavish (in spending money, esp. for ostentatious purpose).", "excelling others in quality; excellent."]}, {"type": "noun", "defs": ["a stately or brilliant display; splendour; magnificence.", "an ostentatious show or display.", "extravagant out-pouring; lavishness (in spending money, esp. for ostentatious purpose).", "the quality by which one excels others; excellence."]}], "ಅದ್ಬೋದ": [{"type": "noun", "defs": ["name of a rāga (musical scale) derived from the main scale Hanuma Tōḍi, in Karnāṭaka music system."]}], "ಅದ್ಭುತ": [{"type": "adjective", "defs": ["causing wonder; surprising, astonishing or extraordinary.", "so extraordinary as to be improbable, incredible or miraculous; marvellous."]}, {"type": "noun", "defs": ["= ಅದ್ಭುತರಸ; 2) a wonderful or astonishing thing; prodigy or miracle; a marvellous person or fact; a marvel."]}], "ಅದ್ಭುತಚಿತ್ತ": [{"type": "adjective", "defs": ["having (the mind which has) been struck by the wonder of a marvellous thing."]}], "ಅದ್ಭುತತೆ": [{"type": "noun", "defs": ["the quality of being wonderful or marvellous; marvellousness."]}], "ಅದ್ಭುತರಸ": [{"type": "noun", "defs": ["one of the sentiments that creates marvellousness, awesome reverence etc., in a poetical work or in dance; the sentiment of marvel."]}], "ಅದ್ಭುತಾಕೃತಿ": [{"type": "noun", "defs": ["great, awesome size; a form that is gigantic or colossal."]}], "ಅದ್ಭುತೋಪಮೆ": [{"type": "noun", "defs": ["figure of speech in which one thing is likened to another dissimilar thing by the use of ಅಂತೆ, ಓಲ್, ವೋಲ್ (like, as) etc. with an element of marvel."]}], "ಅದ್ಭೂತ": [{"type": "adjective", "defs": ["= ಅದ್ಭುತ¹."]}, {"type": "noun", "defs": ["= ಅದ್ಭುತ²."]}], "ಅದ್ಮರ": [{"type": "noun", "defs": ["a man who greedily eats too much; a glutton."]}], "ಅದ್ಯತನ": [{"type": "adjective", "defs": ["of or belonging to the latest time; recent; done, made, etc. just before the present time; modern; new."]}, {"type": "noun", "defs": ["a man belonging to the latest time."]}], "ಅದ್ಯಾಪಿ": [{"type": "adverb", "defs": ["till recently; till to-day; up to this time; so far (in time)."]}], "ಅದ್ಯಾವತ್ತು": [{"type": "noun", "defs": ["the condition of being abreast of time; updatedness."]}], "ಅದ್ರ": [{"type": "noun", "defs": ["(dial.) markedly lacking in strength; weak; feeble; infirm."]}], "ಅದ್ರವ್ಯ": [{"type": "noun", "defs": ["that which does not occupy space and is not perceptible to the senses in any way; a thing which cannot be considered as 'matteṛ.", "a worthless thing; an object which or a person who, is good for nothing."]}, {"type": "adjective", "defs": ["that cannot be dissolved; not dissolving; not soluble; insoluble."]}], "ಅದ್ರವ್ಯತೆ": [{"type": "noun", "defs": ["the quality of not being dissolved; insolubility."]}], "ಅದ್ರಿ": [{"type": "noun", "defs": ["a natural raised part of the earth's surface, usu. rising more or less abruptly; a mountain.", "a large mass of stone; a rock.", "a tall plant which has a thick trunk and branches that grow from its upper part; a tree.", "the central star of the solar system; the sun.", "the number seven and the symbol that represents it.", "a kind of measure (?).", "a flash of lightning and the sound of thunder together; a thunderbolt.", "a visible mass of tiny, condensed water droplets or ice crystals suspended in the atmosphere; a cloud."]}], "ಅದ್ರಿಕನ್ಯೆ": [{"type": "noun", "defs": ["Goddess Pārvati, daughter of the mountain-king."]}], "ಅದ್ರಿಕೀಲೆ": [{"type": "noun", "defs": ["the earth."]}], "ಅದ್ರಿಜ": [{"type": "noun", "defs": ["that which is mountain-born.", "asphalt found in a natural state; bitumen."]}], "ಅದ್ರಿಜಾತ": [{"type": "noun", "defs": ["= ಅದ್ರಿಜ;", "a fire spread out in, and consuming large part of, a forest; a forest-fire; a wild-fire."]}], "ಅದ್ರಿಜೆ": [{"type": "noun", "defs": ["= ಅದ್ರಿಕನ್ಯೆ."]}], "ಅದ್ರಿತನಯೆ": [{"type": "noun", "defs": ["= ಅದ್ರಿಕನ್ಯೆ."]}], "ಅದ್ರಿದಳನ": [{"type": "noun", "defs": ["a splitting of mountains.", "one who splits the mountains, Indra, the lord of the Heavens.", "a weapon made of diamond, that can split the mountains; Indra's sword-like weapon."]}], "ಅದ್ರಿಧರ": [{"type": "noun", "defs": ["Lord Křṣṇa, who upheld the mountain Gōvardhana."]}], "ಅದ್ರಿಭೇದನ": [{"type": "noun", "defs": ["= ಅದ್ರಿದಳನ."]}], "ಅದ್ರಿರಾಜ": [{"type": "noun", "defs": ["the king of mountains.", "the mountain Himālaya which is considered as the king of all mountains."]}], "ಅದ್ರಿಶತ್ರು": [{"type": "noun", "defs": ["Indra, the Lord of the Heavens, as the enemy of mountains."]}], "ಅದ್ರಿಸಾರ": [{"type": "adjective", "defs": ["mountain-like strong."]}, {"type": "noun", "defs": ["iron, the widely used metal having atomic number 26."]}], "ಅದ್ರೀಶ": [{"type": "noun", "defs": ["= ಅದ್ರಿರಾಜ."]}], "ಅದ್ರುತ": [{"type": "adjective", "defs": ["slow in moving, acting, etc.; not quick; slow; tardy."]}], "ಅದ್ರೋಹ": [{"type": "noun", "defs": ["absence of fraud or crookedness; honesty; straightforwardness."]}], "ಅದ್ಲೆ": [{"type": "noun", "defs": ["a thin, long split of a bamboo; a bamboo splint."]}], "ಅದ್ಲೆಪಟ್ಟೆ": [{"type": "noun", "defs": ["the side walls, of about two feet high, made of bamboo laths and fixed on a cart."]}], "ಅದ್ವಂತಿಕೆ": [{"type": "noun", "defs": ["a false reason or motive put forth to hide the real one; an excuse; a pretext.", "ಅದ್ವಂತಿಕೆ ಹೇಳು advantike hēḷu to give a false reason with a view to cheating."]}], "ಅದ್ವಂದ್ವ": [{"type": "adjective", "defs": ["free from being or not suffering from the defects of, dualistic nature ; non-dual; one and alone.", "having no second; one and only."]}], "ಅದ್ವಯ": [{"type": "adjective", "defs": ["not being two.", "being one and one only.", "being second to none; unique."]}, {"type": "noun", "defs": ["= ಅದ್ವಯವಾದ.", "the highest or ultimate truth.", "(phil.) the Soul.", "(phil.) the Supreme being."]}], "ಅದ್ವಯವಾದ": [{"type": "noun", "defs": ["the doctrine that the Supreme and the universe and the individual soul are nothing but one; non-dualism."]}], "ಅದ್ವಯವಾದಿ": [{"type": "noun", "defs": ["an advocate or follower of the doctrine that the Supreme and the universe and the individual soul are nothing but one.", "Gautama Buddha, the founder of Buddhism, which emphasise non-violence and human love.", "any of the twenty four teachers who propagated Jainism, a Hindu religion resembling Buddhism founded in the 6th century B.C which emphasise asceticism and reverence for all living things.", "a believer, follower or a member of Jainism."]}], "ಅದ್ವಯಿತ": [{"type": "adjective", "defs": ["= ಅದ್ವಯ1 - 1."]}], "ಅದ್ವಾನ": [{"type": "adjective", "defs": ["(wrong form of ಅಧ್ವಾನ) 1. devoid of sound.", "having a bad or unpleasant voice."]}, {"type": "noun", "defs": ["(wrong form of ಅಧ್ವಾನ) 1. the condition or fact of being difficult; difficulty.", "trouble; distress."]}], "ಅದ್ವಾರ": [{"type": "noun", "defs": ["a doorway, usu. at the backside of a building, not intended to serve as a regular door; a back door."]}], "ಅದ್ವಾರಪ್ರವೇಶ": [{"type": "noun", "defs": ["an entering stealthily from a back door."]}], "ಅದ್ವಿಜ": [{"type": "adjective", "defs": ["not belonging to Brāhmaṇa community in Hinduism.", "destitute of Brāhmaṇas.", "not having teeth; toothless."]}, {"type": "noun", "defs": ["a man belonging to community other than Brāhmaṇa community.", "a Brāhmaṇa who lost his Brāhmaṇahood, owing to lapse in observing the regular rituals."]}], "ಅದ್ವಿತಯ": [{"type": "adjective", "defs": ["= ಅದ್ವಿತೀಯ1."]}], "ಅದ್ವಿತೀಯ": [{"type": "adjective", "defs": ["unequalled; without a second; matchless; unique."]}, {"type": "noun", "defs": ["that which or one who is, second to none or who is not equalled; a matchless, peerless man or thing."]}], "ಅದ್ವಿತೀಯೆ": [{"type": "noun", "defs": ["a woman who is second to none or who is not equalled; a matchless, peerless woman."]}], "ಅದ್ವಿತ್ವ": [{"type": "noun", "defs": ["absence of duplicity; the quality, state or fact of being one; uniqueness.", "the state or fact of a consonant not being compounded with the same consonant."]}], "ಅದ್ವೈತ": [{"type": "adjective", "defs": ["not dual; of one or uniform nature; equable.", "not susceptible to change; unchanging.", "matchless; peerless; incomparable; sole; unique."]}, {"type": "noun", "defs": ["= ಅದ್ವೈತಿ;", "perfect identify; sameness; absence of difference.", "the quality or state of not being susceptible to change; immutability.", "(Phil.) the most famous of the Indian philosophies which propounds that there is one Reality known as Brahman or the Absolute which always existed and always will exist beyond time and space and the individualātman (soul) is identical with That; the philosophy of Oneness or non-duality."]}, {"type": "noun", "defs": ["the quality or nature of being what one is and not posing or assuming what is not; uprightness in one's being what is within.", "a man with these qualities; a man of truthfulness."]}], "ಅದ್ವೈತದರ್ಶನ": [{"type": "noun", "defs": ["the realisation that the Supreme and the individual self are not different but one."]}], "ಅದ್ವೈತಭಕ್ತಿ": [{"type": "noun", "defs": ["a single-minded devotion to or becoming one with, the God."]}], "ಅದ್ವೈತಮತಿ": [{"type": "noun", "defs": ["the absolute oneness of the mind with the thing being thought.", "absence of dualism, biasedness or prejudice.", "a man not having biasedness or prejudice."]}], "ಅದ್ವೈತವಾದ": [{"type": "noun", "defs": ["(phil.) the doctrine that the Supreme, the individual soul and the phenomenal universe are basically one and are the expression of the same in different ways which was strongly propounded and advocated by Śankara."]}], "ಅದ್ವೈತಿ": [{"type": "noun", "defs": ["a follower of the Hindu non-dualism philosophy; a person belonging to that sect."]}], "ಅಧಃಕರಣ": [{"type": "noun", "defs": ["the act or an instance of treating with slight, disregard or contempt; a contemptuous look; a strong feeling of combined dislike and lack of respect."]}], "ಅಧಃಕರಿಯಿಸು": [{"type": "verb", "defs": ["= ಅಧಃಕರಿಸು."]}], "ಅಧಃಕರಿಸು": [{"type": "verb", "defs": ["to treat with disrespect, contempt; to look down.", "to cross over; to pass over."]}], "ಅಧಃಕೃತ": [{"type": "adjective", "defs": ["thrown, pushed down.", "treated with lack of due respect or with indifference; overlooked; slighted."]}], "ಅಧಃಕ್ಷಿಪ್ತ": [{"type": "adjective", "defs": ["thrown down; pushed from above.", "gone down; dented."]}], "ಅಧಃಕ್ಷೇಪ": [{"type": "noun", "defs": ["act of throwing or pushing down.", "matter that settles to the bottom of a liquid; sediment.", "(Geol.) matter deposited by water or wind; a sedimentary deposit."]}], "ಅಧಃಪತನ": [{"type": "noun", "defs": ["a falling down; a displacement from above.", "a sudden fall, as from prosperity or power.", "a degrading or being degraded in rank, status or condition; degradation.", "a degenerate, esp. morally, condition; degeneration."]}], "ಅಧಃಪಾತ": [{"type": "noun", "defs": ["= ಅಧಃಪತನ."]}], "ಅಧಃಪಾತಾಳ": [{"type": "noun", "defs": ["(myth.) the lowest of the regions or worlds under the earth; the lowest, hence the worst, hell.", "the worst or meanest state or condition of being; deplorably ruined condition."]}], "ಅಧಃಪಾತಿಸು": [{"type": "verb", "defs": ["to throw or drop down.", "to cause a downfall, degradation or degeneration."]}], "ಅಧಃಪ್ರಭಾವ": [{"type": "adjective", "defs": ["having reduced or almost lost, influence or power."]}, {"type": "noun", "defs": ["reduced power or influence.", "a man whose influence, power etc. are curtailed."]}], "ಅಧಃಸ್ಥಲ": [{"type": "noun", "defs": ["land that is below the level of the surrounding land; low-land."]}], "ಅಧಃಸ್ಥಳ": [{"type": "noun", "defs": ["= ಅಧಃಸ್ಥಲ."]}], "ಅಧಃಸ್ಥಳಂಬಿಡಿ": [{"type": "verb", "defs": ["to be in or grasp the bottom portion."]}], "ಅಧಃಸ್ಥಿತ": [{"type": "adjective", "defs": ["situated or kept below."]}], "ಅಧಃಸ್ಪರ್ಶಕ": [{"type": "adjective", "defs": ["touching, passing very close to, the lower portion (esp. of a geometrical figure)."]}, {"type": "noun", "defs": ["(geom.) the segment of the x-axis included between the ordinate of a given point on a curve and the tangent at that point."]}], "ಅಧಃಸ್ರಂಸನ": [{"type": "noun", "defs": ["a falling down; down fall; an act of sliding."]}], "ಅಧಟ": [{"type": "noun", "defs": ["a man of prowess; a hero; a valorous man."]}], "ಅಧಟರಾಯರಾವುತ": [{"type": "noun", "defs": ["a cavalry man known for his valour."]}], "ಅಧಟು": [{"type": "noun", "defs": ["the quality of being brave; bravery; strength that enables one to face danger undauntedly; boldness; daring; heroism.", "a feeling or an impressing of superiority manifested in an overbearing manner or presumptuous claims; arrogance; haughtiness.", "a boisterous or deep cry.", "forcible restraint; compulsion by threat; coercion."]}], "ಅಧಟುದೋಱು": [{"type": "verb", "defs": ["to exhibit great power; to fight bravely."]}], "ಅಧನ": [{"type": "adjective", "defs": ["having no money; lacking material possessions; poor."]}, {"type": "noun", "defs": ["a destitute; an indigent man; a poor.", "a state of deep distress; calamity."]}], "ಅಧನದ": [{"type": "noun", "defs": ["a man who is extremely stingy with money; a miser."]}], "ಅಧಮ": [{"type": "adjective", "defs": ["being at a lower level; inferior; placed at bottom.", "of inferior quality; mean; lacking social or moral values."]}, {"type": "noun", "defs": ["a man of inferior quality; a man lacking basic values; a rascal; rogue; wretch.", "an impudent and lustful man; a lecher.", "(astrol.) a combination of planets foreboding an impending evil or calamity."]}], "ಅಧಮಕಾವ್ಯ": [{"type": "noun", "defs": ["a poetical work having no merits."]}], "ಅಧಮಕುಲ": [{"type": "noun", "defs": ["a family or clan not having noble character, quality; a dishonourable family."]}], "ಅಧಮತನ": [{"type": "noun", "defs": ["the state or condition of being at the bottom.", "the quality of being distinguishably or utterly bad; vileness; wickedness."]}], "ಅಧಮಬಿಸಿಗೆ": [{"type": "noun", "defs": ["= ಅಧಮಬೀಸಿಗೆ."]}], "ಅಧಮಬೀಸಿಗೆ": [{"type": "noun", "defs": ["a period of last twenty years in the cycle of 60 years in Hindu system."]}], "ಅಧಮರ್ಣ": [{"type": "noun", "defs": ["one who owes a debt; a debtor."]}], "ಅಧಮೆ": [{"type": "noun", "defs": ["a vile woman; a bad mistress.", "a quarrelsome heroine (in a drama)."]}], "ಅಧಮೋಪಮೆ": [{"type": "noun", "defs": ["a simile in which a better object is likened with another object of defective merit, considered as a demerit in the composition."]}], "ಅಧರ": [{"type": "adjective", "defs": ["lying or thought of as lying, below ; nether.", "low or lower in order, status, rank, etc.; inferior.", "lower in quality or value than; base; contemptible."]}, {"type": "noun", "defs": ["lower one of the two fleshy folds forming the edges of the mouth and important in speech; the lower lip.", "(in gen.) any of the two lips; the lip.", "that point of the celestial sphere directly opposite to the zenith and directly below the observer; the nadir.", "the lowest portion of any thing.", "one who has been silenced in argument; he who cannot argue any more.", "equality; likeness.", "the colour of human blood; red colour."]}], "ಅಧರಂ ಮಾಡು": [{"type": "verb", "defs": ["to treat with disrespect, contempt; to look down."]}], "ಅಧರತಾವಾಪ್ತಿ": [{"type": "noun", "defs": ["a degrading or being degraded in rank, status or condition; degradation."]}], "ಅಧರತೆ": [{"type": "noun", "defs": ["the state of being at the lowest point.", "a degraded condition."]}], "ಅಧರಪಾನ": [{"type": "noun", "defs": ["act of pressing one's lips on the lips of a person of other sex, with some pressure and suction, as in amorous act; kissing; a kiss."]}], "ಅಧರರಾಗ": [{"type": "noun", "defs": ["the colour of the lips.", "a cosmetic paste for colouring the lips."]}], "ಅಧರಾಮೃತ": [{"type": "noun", "defs": ["the sweetness or pleasure got in kissing a person of other sex."]}], "ಅಧರಿತ": [{"type": "adjective", "defs": ["placed, pushed or kept low.", "treated disrespectfully."]}], "ಅಧರಿಸು": [{"type": "verb", "defs": ["to keep down; to place below.", "to treat with lack of regard or respect; to slight."]}], "ಅಧರೀಕೃತ": [{"type": "noun", "defs": ["= ಅಧರಿತ."]}], "ಅಧರೋಷ್ಠ": [{"type": "noun", "defs": ["= ಅಧರ2 - 1."]}], "ಅಧರ್ಮ": [{"type": "noun", "defs": ["unrighteousness; that which is against the a) original nature, b) established religious or moral rules.", "an act, intention or a thought which is not justifiable morally; moral or spiritual decadence.", "(Jain.) that which impedes the freeness of the soul."]}], "ಅಧರ್ಮದ್ರವ್ಯ": [{"type": "noun", "defs": ["(Jain.) a passive substance through which any effect is transmitted or a passive enveloping substance in which a thing exists or lives; a medium of rest."]}], "ಅಧರ್ಮನಿಷ್ಠ": [{"type": "noun", "defs": ["= ಅಧರ್ಮಿ."]}], "ಅಧರ್ಮಿ": [{"type": "noun", "defs": ["one whose actions, thoughts or intentions are against the established norms of a religion; a man lacking respect for God or the religion; a wicked man.", "ಅಧರ್ಮಿ ಅಧಮನಿಗಿಂತಲೂ ಕಡೆ adharmi adhamanigintalū kaḍe (prov.) a sinner is worst among all types of men."]}], "ಅಧವ": [{"type": "noun", "defs": ["a man having no master or a natural protector."]}], "ಅಧವೆ": [{"type": "noun", "defs": ["a woman who has lost her husband by death and not remarried."]}], "ಅಧಶ್ಚರ": [{"type": "adjective", "defs": ["moving below or moves downwards; not going, moving or flying high."]}, {"type": "noun", "defs": ["one who goes downwards.", "one who moves stealthily; a thief."]}], "ಅಧಸ್ತನ": [{"type": "adjective", "defs": ["situated or kept below."]}], "ಅಧಸ್ಸ್ಥಲ": [{"type": "noun", "defs": ["land that is below the level of the surrounding land; low-land."]}], "ಅಧಸ್ಸ್ಥಳ": [{"type": "noun", "defs": ["= ಅಧಸ್ಸ್ಥಲ."]}], "ಅಧಾರ್ಮಿಕ": [{"type": "adjective", "defs": ["not according or not conforming, to the religious rules; being against to the natural qualities (as human qualities); unrighteous; impious; wicked."]}, {"type": "noun", "defs": ["an impious, wicked man."]}], "ಅಧಿ": [{"type": "suffix", "defs": ["a prefix to denote superiority in place, quality or quantity meaning 'over', ' super', 'chief', 'superintending' etc."]}], "ಅಧಿಕ": [{"type": "adjective", "defs": ["greater in amount, degree or number; big; large in size, value or importance; substantial.", "surpassing others in quality; excellent; superior.", "more, bigger, larger or greater than required, expected or natural; ಅಧಿಕವಾಗು adhikavāgu to become more, excessive."]}, {"type": "noun", "defs": ["= ಅಧಿಕಪ್ರಸಂಗಿ.", "an ample quantity; more than sufficient quantity; abundance; plentifulness.", "a figure of speech equivalent to hyperbole.", "a great man; a knowledgeable man."]}], "ಅಧಿಕಂ": [{"type": "adverb", "defs": ["in or to a greater quantity, number, extent or vehemence; excessively."]}], "ಅಧಿಕಕಟ್ಟಳೆ": [{"type": "noun", "defs": ["a ceremony, a religious rite, in reverence to the dead parents, usu. an annual one."]}], "ಅಧಿಕಕೋಣ": [{"type": "noun", "defs": ["an angle of more than 90 degrees."]}], "ಅಧಿಕತಮ": [{"type": "adjective", "defs": ["superlative form, in degree, of ಅಧಿಕ."]}], "ಅಧಿಕತರ": [{"type": "adjective", "defs": ["comparative form, in degree, of ಅಧಿಕ."]}], "ಅಧಿಕತಾದ್ರೂಪ್ಯರೂಪಕ": [{"type": "noun", "defs": ["a figure of speech, a metaphor, in which an object is represented by another of higher or better quality or status."]}], "ಅಧಿಕತೆ": [{"type": "noun", "defs": ["excessiveness; abundance; plentifulness."]}], "ಅಧಿಕದಿನ": [{"type": "noun", "defs": ["an extra day in February in Gregorian calendar, occuring every fourth year, to make up for the one quarter of a day lost when the year is computed as 365 days; February 29th day in a leap-year."]}], "ಅಧಿಕಪದ": [{"type": "noun", "defs": ["use of extra, redundant or unnecessary words in a poetical work, considered as a poetical fault."]}], "ಅಧಿಕಪಾಠ": [{"type": "noun", "defs": ["an insertion or interpolation in to a (usu. an old) work by a person other than the original author."]}], "ಅಧಿಕಪ್ರಸಂಗ": [{"type": "noun", "defs": ["officiousness i.e. a) the act of offering unnecessary and unwanted advice or services; b) an intrusion into, and meddling of, otheṛs affairs; impudently and impertinently concerning oneself with or taking part in otheṛs affairs without being asked or needed; sauciness."]}], "ಅಧಿಕಪ್ರಸಂಗಿ": [{"type": "noun", "defs": ["a person with the quality of officiousness or sauciness."]}], "ಅಧಿಕಪ್ರಸಂಗಿತನ": [{"type": "noun", "defs": ["the quality or nature of being officiousness; impertinent sauciness."]}], "ಅಧಿಕಬೀಳುಬಳ್ಳಿ": [{"type": "noun", "defs": ["the climber Pothos scandens of Araceae family; elephant creeper; arecanut climbing arum."]}], "ಅಧಿಕಮಾಸ": [{"type": "noun", "defs": ["the thirteenth, intercalary, lunar month inserted in the Lunar calendar after every thirty lunar months to make up for the approximately eleven day difference between the lunar and solar years.", "ದುರ್ಭಿಕ್ಷದಲ್ಲಿ ಅಧಿಕಮಾಸ ಬರು durbhikṣadalli adhikamāsa baru (prov.) to worsen further one's economic condition, which is already in worst condition, with an additional worry or difficulty."]}], "ಅಧಿಕರ": [{"type": "noun", "defs": ["an extra or additional tax; a super tax."]}], "ಅಧಿಕರಣ": [{"type": "noun", "defs": ["the power or right to give commands, enforce obedience, take action or make final decisions; jurisdiction; authority.", "(gram.) the sense of the locative case (the seventh case) suggesting the location of action.", "a main division of book, which, usu. deals with a subject or episode exclusively; a chapter.", "supreme power or authority; supremacy.", "a person or a body having supreme authority.", "a generally accepted and established system of political administration of a state, country; government.", "a department or a division of a government in charge of a particular affair, esp. dispensation of justice."]}], "ಅಧಿಕರಿಸು": [{"type": "verb", "defs": ["to secure, gain governing or administering power.", "to study deeply a branch of science or art.", "to rely (on) for support or aid; to depend.", "to aim at or to strive for; to keep in mind as an aim of objective.", "to be, become, supreme; to go beyond another's grip."]}], "ಅಧಿಕರ್ತ": [{"type": "noun", "defs": ["a man having the power or right to enforce orders, laws or right over something."]}], "ಅಧಿಕರ್ತೆ": [{"type": "noun", "defs": ["a woman having the power or right to enforce orders, laws or right over something."]}], "ಅಧಿಕರ್ಧಿ": [{"type": "noun", "defs": ["the condition of being well prospered; good prosperity."]}], "ಅಧಿಕರ್ಮ": [{"type": "noun", "defs": ["duty or office of a person in charge of a department, institution, market etc.; superintdence."]}], "ಅಧಿಕರ್ಮಿಕ": [{"type": "noun", "defs": ["an overseer or revenue collector of a market."]}], "ಅಧಿಕವರ್ಷ": [{"type": "noun", "defs": ["a year of 366 days in the Gregorian calendar, occurring every fourth year: (a year whose number is exactly divisible by 4 or, in case of the final year of a century, by 400); a leap year."]}], "ಅಧಿಕಹುಣ್ಣಿಮೆ": [{"type": "noun", "defs": ["the full moon day in the extra month added to the lunar year approximately once in 3 years to synchronise it with the solar year."]}], "ಅಧಿಕಾಂಗ": [{"type": "noun", "defs": ["the extra or redundant limb or part of a limb (e.g. a sixth finger like growth in the hand).", "a sash, girdle or belt worn over the mail coat."]}], "ಅಧಿಕಾಂಶ": [{"type": "noun", "defs": ["extra information, fact or statistics, that is more than required or considered."]}], "ಅಧಿಕಾಕ್ಷರ": [{"type": "noun", "defs": ["a syllable in excess of requirement of the prosody.", "a stanza or the foot of such stanza which has an excessive syllable or syllables.", "in a poetical work, a fault of having more letters than required in a foot."]}], "ಅಧಿಕಾರ": [{"type": "noun", "defs": ["the power or right to give commands, enforce obedience, take action or make final decisions; authority.", "the position of one having such power.", "such power as delegated to another; authorisation; a warrant.", "the act, manner, function or power of a government; governance.", "a right or title to something; claim; ownership.", "required legal or moral qualification; fitness required to be chosen; eligibility; worthiness.", "any of the main divisions of a book or other writing; a chapter.", "(gram.) a definition which extends its applicability on the definitions that follow.", "the skill, knowledge, judgment, etc. of an expert; expertise; proficiency;", "ಅಧಿಕಾರಕ್ಕೆ ಬರು adhikārakke baru to come to power; to enter upon the duties of an office; to accede; ಅಧಿಕಾರ ನಡಸು adhikāra naḍasu to exercise one's official or legal authority; 2. to rule or control by superior power or influence; to dominate."]}], "ಅಧಿಕಾರಕ್ಷೇತ್ರ": [{"type": "noun", "defs": ["the limits or territory within which one's authority may be exercised; the territorial range of authority; jurisdiction."]}], "ಅಧಿಕಾರಚ್ಯುತ": [{"type": "adjective", "defs": ["deprived of office or power."]}, {"type": "noun", "defs": ["a man deprived of office or power."]}], "ಅಧಿಕಾರಚ್ಯುತಿ": [{"type": "noun", "defs": ["loss of one's power or office."]}], "ಅಧಿಕಾರಚ್ಯುತೆ": [{"type": "noun", "defs": ["a woman who has lost her power or office."]}], "ಅಧಿಕಾರದರ್ಜೆ": [{"type": "noun", "defs": ["a classification of authority in graded sub-division; hierarchy."]}], "ಅಧಿಕಾರನಿಮಿತ್ತ": [{"type": "adverb", "defs": ["by virtue of one's office or position; ex-officio."]}], "ಅಧಿಕಾರಪತ್ರ": [{"type": "noun", "defs": ["a letter or certificate given to a person to show that he has a right to confidence or to the exercise of a certain position or authority; a credential."]}], "ಅಧಿಕಾರಪೃಚ್ಛೆ": [{"type": "noun", "defs": ["a writ calling upon one to show by what warrant he hold or claims a franchise or an office."]}], "ಅಧಿಕಾರಪ್ರಯುಕ್ತ": [{"type": "adverb", "defs": ["ex-officio - a) by virtue of one's office or position; b) because of one's office or position."]}], "ಅಧಿಕಾರಭ್ರಷ್ಟ": [{"type": "adjective", "defs": ["= ಅಧಿಕಾರಚ್ಯುತ1."]}, {"type": "noun", "defs": ["= ಅಧಿಕಾರಚ್ಯುತ2."]}], "ಅಧಿಕಾರಭ್ರಷ್ಟತೆ": [{"type": "noun", "defs": ["= ಅಧಿಕಾರಚ್ಯುತಿ."]}], "ಅಧಿಕಾರಭ್ರಷ್ಟೆ": [{"type": "noun", "defs": ["= ಅಧಿಕಾರಚ್ಯುತೆ."]}], "ಅಧಿಕಾರಯುತ": [{"type": "adjective", "defs": ["authoritative a) having sanction of or showing authority; b) having power or influence resulting from knowledge."]}, {"type": "noun", "defs": ["a man having sanction of authority.", "a man having commendable knowledge on a subject."]}], "ಅಧಿಕಾರಯುತೆ": [{"type": "noun", "defs": ["a woman having sanction of authority.", "a woman having commendable knowledge on a subject."]}], "ಅಧಿಕಾರರಾಹಿತ್ಯ": [{"type": "noun", "defs": ["the state of having no authority or office of power; powerlessness."]}], "ಅಧಿಕಾರಲೇಖ": [{"type": "noun", "defs": ["= ಅಧಿಕಾರಪೃಚ್ಛೆ."]}], "ಅಧಿಕಾರವಾಣಿ": [{"type": "noun", "defs": ["a speaking with legal or moral authority; an authoritative pronouncement or command.", "opinion of a person having authoritative knowledge on a subject."]}], "ಅಧಿಕಾರವ್ಯಾಪ್ತಿ": [{"type": "noun", "defs": ["= ಅಧಿಕಾರಕ್ಷೇತ್ರ."]}], "ಅಧಿಕಾರಶಾಹಿ": [{"type": "noun", "defs": ["bureaucracy - a) the administration of government through departments and subdivisions managed by sets of appointed officials following an inflexible routine; b) the officials collectively; c) governmental officialism or inflexible routine, and hence (contemp.) rigid application of regulations and routine in the government administration, resulting in delay in getting business done."]}], "ಅಧಿಕಾರಸೂತ್ರ": [{"type": "noun", "defs": ["a short sentence or aphoristic rule in works of philosophy, grammar or rituals, giving concise rules to be observed strictly and repeatedly.", "controlling or guiding power; a means of guiding, controlling, checking or restraining in ruling and the responsibilities attached to it; reins of management."]}], "ಅಧಿಕಾರಸ್ಥ": [{"type": "adjective", "defs": ["having the position, authority in a government or business organization; being in incumbent of an office."]}, {"type": "noun", "defs": ["a man who has a position of authority in a government or business organisation; an officer.", "a man who inherits or is legally entitled to inherit, through the natural action of the law, another's property or title upon the latter's death; a heir."]}], "ಅಧಿಕಾರಸ್ಥಾನ": [{"type": "noun", "defs": ["a position of authority or trust, esp. in a government business, institution, etc; a recognised position or status authorising intervention, application to a court etc.; locus standi."]}], "ಅಧಿಕಾರಸ್ಥೆ": [{"type": "noun", "defs": ["a woman who has a position of authority in a government or business organisation. 2) a woman who inherits or is legally entitled to inherit, through the natural action of the law, another's property or title upon the otheṛs death; a heir."]}], "ಅಧಿಕಾರಿ": [{"type": "noun", "defs": ["= ಅಧಿಕಾರಸ್ಥ2.", "a person morally or by the authority of religion, eligible for possessing a thing, observing or performing a ritual or studying a scripture etc."]}, {"type": "noun", "defs": ["a highly hostile person."]}], "ಅಧಿಕಾರಿಣಿ": [{"type": "noun", "defs": ["a woman in a position of authority."]}], "ಅಧಿಕಾರಿತಿ": [{"type": "noun", "defs": ["= ಅಧಿಕಾರಿಣಿ."]}], "ಅಧಿಕಾರಿವರ್ಗ": [{"type": "noun", "defs": ["(collectively) the officials in the administration of a government or of a business enterprise."]}], "ಅಧಿಕಾರ್ತಿ": [{"type": "noun", "defs": ["= ಅಧಿಕಾರಿಣಿ."]}], "ಅಧಿಕೃತ": [{"type": "adjective", "defs": ["named for an office or duty; appointed; commissioned; designated.", "vested with official or legal authority; authoritative.", "said about; talked about.", "backed up or supported by facts; issued out or announced, by proper authority; official."]}, {"type": "noun", "defs": ["a man who has a position of authority in a government or business organisation; an officer.", "(phil.) a person having the required eligibility to get spiritual knowledge."]}], "ಅಧಿಕೃತಗ್ರಂಥ": [{"type": "noun", "defs": ["an authoritative or dependable literary work; a book or manuscript free from subsequent alterations, corruptions or interpolations etc."]}], "ಅಧಿಕೃತತೆ": [{"type": "noun", "defs": ["authoritativeness of a work, information or news; the quality or state of being authentic; reliability; genuineness; authenticity."]}], "ಅಧಿಕೃತನಿವಾಸ": [{"type": "noun", "defs": ["the official residence, esp. of a person in high public office."]}], "ಅಧಿಕೃತ ಪಾಠ": [{"type": "noun", "defs": ["the genuine text of a literary work, communication, etc."]}], "ಅಧಿಕೃತಭಾಷೆ": [{"type": "noun", "defs": ["the language used by a government or an organisation; official language of the state."]}], "ಅಧಿಕೃತಮುದ್ರಣ": [{"type": "noun", "defs": ["an edition of a book, with the original writing free from corruption, alteration or interpolation; a print with dependable version."]}], "ಅಧಿಕೇಂದ್ರ": [{"type": "noun", "defs": ["the part of the earth's surface directly above the place of origin or focus, of an earthquake; the epicentre."]}], "ಅಧಿಕೋಪಮೆ": [{"type": "noun", "defs": ["a simile in which an inferior object is likened with another object of merit, considered as a demerit in the composition."]}], "ಅಧಿಕೋಷ್ಣ": [{"type": "noun", "defs": ["superheat - a) the number of degrees by which the temperature of superheated steam exceeds the temperature of the steam at its saturation point; b) the state of being superheated."]}], "ಅಧಿಕೋಷ್ಣಕ": [{"type": "noun", "defs": ["an apparatus to heat above the temperature of saturation or normal boiling point without vaporisation; a super-heater."]}], "ಅಧಿಕ್ರಮ": [{"type": "noun", "defs": ["a going forward; an advancement.", "a sudden hostile incursion; an inroad; an attack or invasion."]}], "ಅಧಿಕ್ಷಿಪ್ತ": [{"type": "adjective", "defs": ["abused; insulted.", "damaged by spreading false charges against.", "rejected; not accepted.", "thrown down; dropped.", "put in a particular place, condition or relation; placed.", "sent; despatched; conveyed."]}], "ಅಧಿಕ್ಷೇಪ": [{"type": "noun", "defs": ["a censure; an abuse; insulting or coarse language.", "the feeling or attitude of one who looks down on somebody or something as being low, mean or unworthy; act of seeing a person or a thing with that feeling.", "placing one above the other; stalking; a piling up.", "act of throwing upwards.", "a despatch; act of sending out."]}], "ಅಧಿಗಣಿತ": [{"type": "noun", "defs": ["the logical study of the nature and validity of mathematical reasoning and proof; the philosophy of higher mathematics; meta-mathematics."]}], "ಅಧಿಗತ": [{"type": "adjective", "defs": ["acquired; obtained.", "learnt; studied; known; mastered."]}], "ಅಧಿಗಮ": [{"type": "noun", "defs": ["act or process of obtaining; acquisition.", "mercantile return; profit.", "act or process of studying or acquiring knowledge; a study, learning."]}], "ಅಧಿಗಮನ": [{"type": "noun", "defs": ["= ಅಧಿಗಮ."]}], "ಅಧಿಗಮಜಸಮ್ಯಕ್ತ್ವ": [{"type": "noun", "defs": ["acquisition, with the aid of external helps such as discussion, questioning, argument, sermon, advice etc, of the knowledge that leads to the realisation of the truth, (as opp. to self-realisation)."]}], "ಅಧಿಗಮಜಸಮ್ಯಕ್ತ್ವಿ": [{"type": "noun", "defs": ["a person who realised the truth by ಅಧಿಗಮಜಸಮ್ಯಕ್ತ್ವ."]}], "ಅಧಿಗೃಹ": [{"type": "noun", "defs": ["a big residential house, esp. a multi-storeyed one."]}], "ಅಧಿಚಕ್ರ": [{"type": "noun", "defs": ["a circle whose centre moves along the circumference of another, larger circle (a term used to describe planetary motions in the Ptolemaic system); epicycle."]}], "ಅಧಿಜಿಹ್ವೆ": [{"type": "noun", "defs": ["a disease of the tongue marked by swelling (either of the tongue or the epiglottis)."]}], "ಅಧಿಜ್ಯ": [{"type": "noun", "defs": ["(the bow-string) having been stretched; well strung."]}], "ಅಧಿಜ್ಯಧನು": [{"type": "adjective", "defs": ["equipped with or holding a well-strung bow."]}], "ಅಧಿತ್ಯಕ": [{"type": "noun", "defs": ["a high-land; an expanse of land on a mountain, usu. covered by the wild growth of plants."]}], "ಅಧಿತ್ಯಕೆ": [{"type": "noun", "defs": ["= ಅಧಿತ್ಯಕ."]}], "ಅಧಿದೇವತೆ": [{"type": "noun", "defs": ["a deity that watches over or protects; a tutelary deity; a presiding or patron deity.", "the supreme or highest god; the Almighty."]}], "ಅಧಿದೇವಿ": [{"type": "noun", "defs": ["a goddess that watches over or protects.", "a principal goddess."]}], "ಅಧಿದೈವ": [{"type": "noun", "defs": ["= ಅಧಿದೇವತೆ."]}], "ಅಧಿದೈವತ": [{"type": "noun", "defs": ["= ಅಧಿದೇವತೆ."]}], "ಅಧಿನಾಥ": [{"type": "noun", "defs": ["the supreme lord; a king of kings.", "a commanding officer, esp. one in charge of all the military forces of a state; a commandant."]}], "ಅಧಿನಾಯಕ": [{"type": "noun", "defs": ["= ಅಧಿನಾಥ."]}], "ಅಧಿನಾಯಕಿ": [{"type": "noun", "defs": ["a woman with supreme power."]}], "ಅಧಿನಾಯಿಕಿ": [{"type": "noun", "defs": ["a woman with supreme power."]}], "ಅಧಿನಿಯಮ": [{"type": "noun", "defs": ["a law enacted by the legislative branch of a government; a legislative enactment; a statute; an act."]}], "ಅಧಿನಿಯಮನ": [{"type": "noun", "defs": ["the enactment of a law by the legislative branch of a government; the process involved in it."]}], "ಅಧಿನಿಯಮಿತ": [{"type": "adjective", "defs": ["enacted by a legislature; statutory; mandatory."]}], "ಅಧಿನೇತೃ": [{"type": "noun", "defs": ["= ಅಧಿನಾಥ."]}], "ಅಧಿಪ": [{"type": "noun", "defs": ["= ಅಧಿನಾಥ."]}], "ಅಧಿಪಟ್ಟ": [{"type": "noun", "defs": ["administrative jurisdiction."]}], "ಅಧಿಪತಿ": [{"type": "noun", "defs": ["= ಅಧಿನಾಥ.", "(astrol.) the lord of an astrological house."]}], "ಅಧಿಪತಿತನ": [{"type": "noun", "defs": ["the state or condition of being the Supreme Lord, his office and authority."]}], "ಅಧಿಪತಿಪ್ರತ್ಯಯ": [{"type": "noun", "defs": ["(Bhud.) any of the organs (eye etc.) through which knowledge is received."]}], "ಅಧಿಪತ್ರ": [{"type": "noun", "defs": ["a letter or certificate given to a person to show that he has a right to confidence or to the exercise of a certain position or authority; a credential.", "a written communication, command, rule etc. issued by a competent authority; a warrant."]}], "ಅಧಿಪಾಲ": [{"type": "noun", "defs": ["= ಅಧಿನಾಥ."]}], "ಅಧಿಭಾರ": [{"type": "noun", "defs": ["a load in excess of the limit; an extra charge."]}], "ಅಧಿಭಾಷೆ": [{"type": "noun", "defs": ["a language or system of symbols used to discuss another language or symbolic system."]}], "ಅಧಿಭೂತ": [{"type": "noun", "defs": ["the highest being; the Supreme Spirit and its all-pervading influence.", "(pl.) the five basic elements which all universal things are supposed to be made of (i.e. air, earth, water, fire, and space)."]}], "ಅಧಿಭೌಮ": [{"type": "adjective", "defs": ["existing, taking place or coming from outside the limits of the earth; extra-terrestrial."]}], "ಅಧಿಮಾಂಸ": [{"type": "noun", "defs": ["a kind of cancer causing protuberance of flesh in the white of the eye or at the root of the tooth."]}], "ಅಧಿಮಾನವ": [{"type": "noun", "defs": ["a being higher than man; an ideal man.", "a person who possesses sovereign authority or power."]}], "ಅಧಿಮಾನಸ": [{"type": "adjective", "defs": ["surpassing the powers of all the possible experience; belonging to supramind."]}], "ಅಧಿಮಾಸ": [{"type": "noun", "defs": ["an extra month added to the lunar year approximately once in 3 years to synchronise it with the solar year; an intercalated month."]}], "ಅಧಿಯಜ್ಞ": [{"type": "adjective", "defs": ["pertaining to a sacrifice."]}, {"type": "noun", "defs": ["the chief or principal sacrifice.", "the agency effecting or causing such sacrifice."]}], "ಅಧಿರಾಜ": [{"type": "noun", "defs": ["a supreme king who possesses sovereign authority, power over several kings; a sovereign king."]}], "ಅಧಿರೂಢ": [{"type": "adjective", "defs": ["gone up; climbed; mounted; ascended."]}], "ಅಧಿರೋಹಣ": [{"type": "noun", "defs": ["act of mounting; a going up; ascension."]}], "ಅಧಿರೋಹಿಣಿ": [{"type": "noun", "defs": ["a framework consisting of two parallel sidepieces connected by a series of rungs or cross pieces on which a person steps for climbing up or down; a ladder."]}], "ಅಧಿವಾಸ": [{"type": "noun", "defs": ["the place where one abides; a dwelling place; a house.", "the place where one was born or reared; one's own city, state or country.", "(law.) one's fixed place of dwelling, where one intends to reside more or less permanently; domicile.", "consecration of an idol of a deity in the heap of grain or in a water tank, before installing in a temple.", "the area and environment including the conditions, circumstances, and people; environment.", "act of anointing perfume to the human body.", "a perfumery or an ointment used to perfume the body.", "the scent of something sweet-smelling; perfume; good odour."]}, {"type": "noun", "defs": ["a cloth used for covering."]}]}