{"ಅರಾಷ್ಟ್ರಿಕತೆ": [{"type": "noun", "defs": ["= ಅರಾಷ್ಟ್ರಕತೆ."]}], "ಅರಾಸ": [{"type": "noun", "defs": ["a male ruler of a nation or state usually called a kingdom; a male sovereign, limited or absolute; a monarch; a king.", "a respectable, elderly man."]}, {"type": "noun", "defs": ["an unpleasant feeling caused by impending defeat, danger, pain, disgrace, loss, etc.; fear.", "(dial.) the total of what one remembers; remembrance; memory; recollection."]}], "ಅರಾಸು": [{"type": "noun", "defs": ["= ಅರಾಸ2."]}], "ಅರಾಳ": [{"type": "noun", "defs": ["= ಅರಾಲ2."]}, {"type": "noun", "defs": ["an elephant in rut.", "a class of elephants (classified on their physical size and strength)."]}], "ಅರಾಳಕಟಕಾಮುಖ": [{"type": "noun", "defs": ["(dance) a gesture of both hands, in which the forefinger curved like a bow, the thumb also curved and the others kept one behind the other, while all the fingers of the other hand are bent but the ring finger and the little finger are raised a little, but not straightened."]}], "ಅರಿ": [{"type": "verb", "defs": ["to remove or divide into parts with a sharp-edged instrument; to cut off; to sever.", "to mow or reap with a scythe, sickle, etc.", "ಅರಿದುಹೋಗು aridu hōgu to be, become or get, severed."]}, {"type": "verb", "defs": ["to know; to learn; to understand; to have a clear perception; to be aware of; to get knowledge of or skill in by study, experience, instruction.", "to come to know.", "ಅರಿಯೆ ಎನ್ನುವುದನ್ನು ಆನೆ ಕೊಟ್ಟು ಕಲಿ ariye ennuvudannu āne koṭṭu kali (prov.) it is better to say 'I do not now' rather than inviting problems by volunteering to be a public witness; 2. the more you acquire knowledge, the more you must be humble; ಅರಿಯದೆ ಮಾಡಿದ ಪಾಪ ಅರಿತಂದು ಪರಿಹಾರ ariyade māḍida pāpa aritandu parihāra (prov.) realisation of one's sin expiates him from it."]}, {"type": "verb", "defs": ["to cleanse (grains) in water."]}, {"type": "noun", "defs": ["the crop (of paddy, rāgi, etc.) reaped, not threshed, but left on the field in handful quantities.", "that much handful of reaped crop taken at a time, for threshing."]}, {"type": "noun", "defs": ["a disease of the eye, with an extra growth inside the eye-lid."]}, {"type": "noun", "defs": ["one that is antagonistic to another, esp. one seeking to injure, harm, overthrow; a foe; an enemy.", "a symbol for the number six.", "(astrol.) (in the horoscope) sixth house from the birth place."]}, {"type": "noun", "defs": ["a circular weapon with sharp blades, a disc."]}, {"type": "verb", "defs": ["(dial.) to flow or let flow, in drops or driblets; to trickle; to dribble; to leak."]}], "ಅರಿಂಜಯ": [{"type": "noun", "defs": ["he who can defeat his enemies."]}], "ಅರಿಂದಮ": [{"type": "noun", "defs": ["he that can subdue his enemies."]}], "ಅರಿಕಟಕ": [{"type": "noun", "defs": ["the military force of an enemy."]}], "ಅರಿಕಟ್ಟು": [{"type": "verb", "defs": ["to bundle the reaped crop, for threshing."]}], "ಅರಿಕಾಮಧ್ವಂಸಿ": [{"type": "noun", "defs": ["Śiva, who destroyed his enemy Manmatha."]}], "ಅರಿಕುಠಾರ": [{"type": "noun", "defs": ["a title 'one who chops of his enemies'."]}], "ಅರಿಕೆ": [{"type": "noun", "defs": ["a solemn, earnest supplication or request to a superior or deity or to a person or group in authority; prayer or entreaty; a petition.", "great fame; reputation; celebrity; renown."]}], "ಅರಿಕೆಗೊಳ್": [{"type": "verb", "defs": ["to get or earn, fame; to become renown."]}], "ಅರಿಕೆನಾಯಕ": [{"type": "noun", "defs": ["a leader of fame; a famous hero."]}], "ಅರಿಕೆಲು": [{"type": "noun", "defs": ["(dial.) a small bundle of grass, firewood, etc. which can be carried in one's arms."]}], "ಅರಿಕೇಸರಿ": [{"type": "noun", "defs": ["a title 'one who causes intense fear among his enemies'."]}], "ಅರಿಕೋಲು": [{"type": "noun", "defs": ["a long thin stick used while thrashing the corns."]}], "ಅರಿಗಂಟು": [{"type": "noun", "defs": ["a knot that is difficult to untie; a complex knot.", "a tangle; difficulty."]}], "ಅರಿಗಣ್ಣು": [{"type": "noun", "defs": ["an eye afflicted with the disease characterised by an extra growth inside the eye-lid."]}], "ಅರಿಗಲ್ಲು": [{"type": "noun", "defs": ["a particular stone which is used in treating the eye disease, characterised by an extra grown inside the eye-lid."]}], "ಅರಿಘಟೆ": [{"type": "noun", "defs": ["= ಅರಿಕಟಕ."]}], "ಅರಿಘಟೆಮಲ್ಲ": [{"type": "noun", "defs": ["a title 'a champion destroyer of the armies of enemies'."]}], "ಅರಿಟಣ": [{"type": "noun", "defs": ["= ಅರಿಟಾಳ."]}], "ಅರಿಟಾಳ": [{"type": "noun", "defs": ["the tree Sapindus emarginates of Sapindaceae family; the soapnut tree.", "its nut."]}], "ಅರಿಟ್ಟನೇಮಿ": [{"type": "noun", "defs": ["the twenty second spiritual teacher of Jainas."]}], "ಅರಿಣೆ": [{"type": "noun", "defs": ["a decorated pot worshipped in marriages.", "a worshipping of such a pot."]}], "ಅರಿತ": [{"type": "noun", "defs": ["the act of cutting in to pieces; a cutting off; incision.", "a cutting or being cut; a cut."]}], "ಅರಿತ್ರ": [{"type": "noun", "defs": ["a small, open vessel or watercraft propelled by oars; a boat.", "a long pole with a broad blade at one end, used to row a boat; an oar."]}], "ಅರಿದಲ": [{"type": "noun", "defs": ["= ಅರಿದಾಳ."]}], "ಅರಿದಲೆ": [{"type": "noun", "defs": ["an emblem having a picture of a severed human head."]}], "ಅರಿದಲ್ಲಣ": [{"type": "noun", "defs": ["a title 'one who causes intense fear among his enemies'."]}], "ಅರಿದಳ": [{"type": "noun", "defs": ["= ಅರಿದಾಳ."]}], "ಅರಿದಾಳ": [{"type": "noun", "defs": ["arsenic trisulfide, As2S3, having a lemon-yellow colour and a resinous lustre which is used as a pigment; orpiment."]}], "ಅರಿದು": [{"type": "adjective", "defs": ["that is not possible; that cannot be achieved or understood; impossible.", "not having a similar in the past; being without a precedent; unparalleled; unprecedented."]}, {"type": "noun", "defs": ["that which is impossible to achieve or to understand."]}], "ಅದಿದೋಟಿ": [{"type": "noun", "defs": ["a long staff with a sickle hooked at one end."]}], "ಅರಿಧೀರ": [{"type": "noun", "defs": ["a title 'one who faces enemies boldly'."]}], "ಅರಿಧ್ವಜಿನಿ": [{"type": "noun", "defs": ["the military force of an enemy."]}], "ಅರಿನಿರ್ದಾರಣ": [{"type": "noun", "defs": ["he who slays his enemies."]}], "ಅರಿಪದ": [{"type": "noun", "defs": ["(gram.) a heterogeneous compound (esp. a compound of a Kannaḍa word and a Samskřta word, which has no literary sanction, (popularly known as ari samāsa)."]}], "ಅರಿಪರದೂಷಣಸಂಧಿ": [{"type": "noun", "defs": ["a formal agreement made with an enemy relating to peace as per the terms of which valuable fertile lands are given to the latter."]}], "ಅರಿಪೀಠ": [{"type": "noun", "defs": ["a seat of honour."]}], "ಅರಿಪು": [{"type": "verb", "defs": ["to communicate knowledge to, to tell (of, about); to disclose facts about someone; to make another know."]}], "ಅರಿಪೂ": [{"type": "noun", "defs": ["a hedge plant, Lantana camara, of verbenaceae family; yellow lantana."]}], "ಅರಿಬಲ": [{"type": "noun", "defs": ["the military force of an enemy."]}], "ಅರಿಬಳ": [{"type": "noun", "defs": ["= ಅರಿಬಲ."]}], "ಅರಿಬಳಜೈತ್ರ": [{"type": "noun", "defs": ["a conqueror of enemy force."]}], "ಅರಿಬಿರಿದು": [{"type": "noun", "defs": ["an excellent title."]}], "ಅರಿಬಿರುದ": [{"type": "noun", "defs": ["a man with an excellent title."]}], "ಅರಿಭಟ": [{"type": "noun", "defs": ["a soldier in the enemy force."]}], "ಅರಿಭಯಂಕರ": [{"type": "noun", "defs": ["he who is a terror to his enemies."]}], "ಅರಿಭಾರಣೆ": [{"type": "noun", "defs": ["the way or manner in which one deals with his enemies."]}], "ಅರಿಮಣ": [{"type": "noun", "defs": ["a member of a Zoroastrian religious sect in India descended from a group of Persian refugees who fled from the Muslim persecutions of the 7th and 8th centuries; a Parsee.", "the Persian country (now known as Iran, South West Asia)."]}], "ಅರಿಮಣಿ": [{"type": "noun", "defs": ["a small tree. Solanum verbascifolium."]}], "ಅರಿಮರಿಸು": [{"type": "verb", "defs": ["to think about; to determine, resolve, work out, etc. by reasoning.", "to ignore or disregard; to neglect."]}], "ಅರಿಮೆ": [{"type": "noun", "defs": ["= ಅರಿವು."]}], "ಅರಿಮೇದ": [{"type": "noun", "defs": ["a variety of Catechu tree of Mimosae family."]}], "ಅರಿಯ": [{"type": "noun", "defs": ["one who cannot be conquered, overpowered or challenged; an invincible man."]}], "ಅರಿಯಮ": [{"type": "noun", "defs": ["the sun or the Sun God."]}], "ಅರಿಯಮಾನ್ವಯ": [{"type": "noun", "defs": ["the family or race claimed to be the descendant of the Sun God."]}], "ಅರಿಯಿಸು": [{"type": "verb", "defs": ["to cause to cut, pierce or incise."]}, {"type": "verb", "defs": ["to cause to understand; to help one know; to inform."]}], "ಅರಿಯೆಪಡು": [{"type": "verb", "defs": ["to be cut; to be incised."]}], "ಅರಿರಾಯ": [{"type": "noun", "defs": ["a king who is hostile."]}, {"type": "noun", "defs": ["the military force of an enemy."]}], "ಅರಿಲ್": [{"type": "noun", "defs": ["any of the luminous celestial objects seen as points of light in the sky; esp., any self-luminous, celestial body having continuous nuclear reactions which send heat, light, etc. in all directions; a star."]}, {"type": "noun", "defs": ["a thick mixture of clay, and sometimes sand, with water; wet soft earth; slime."]}], "ಅರಿಲಭೇಡಿ": [{"type": "noun", "defs": ["the plant Citrus maxima of Rutaceae family."]}], "ಅರಿಲು": [{"type": "noun", "defs": ["= ಅರಿಲ್1."]}, {"type": "noun", "defs": ["= ಅರಿಲ್2."]}], "ಅರಿಲುಂಬ": [{"type": "noun", "defs": ["a variety of fish."]}], "ಅರಿಲ್ವಟ್ಟೆ": [{"type": "noun", "defs": ["the sky, as the path for the movement of stars."]}], "ಅರಿವಡೆ": [{"type": "noun", "defs": ["the military force of an enemy."]}], "ಅರಿವರ್ಗ": [{"type": "noun", "defs": ["a multitude of enemies.", "a set of six vices (they being lust, anger, avarice, infatuation, arrogance and jealousy) considered as the enemies."]}], "ಅರಿವಳಿಕ": [{"type": "noun", "defs": ["a drug, gas, etc. used to produce anaesthesia, as before surgery; an anaesthetic."]}], "ಅರಿವಳಿಕೆ": [{"type": "noun", "defs": ["the act of causing loss of sensation by an anesthetic, hypnosis or acupuncture and limited to a specific area or involving a loss of consciousness."]}], "ಅರಿವಳಿಕೆತಜ್ಞ": [{"type": "noun", "defs": ["a man who has specialised in administrating medicine to a patient for causing loss of sensation by an anesthetic in a specific area or for the loss of consciousness."]}], "ಅರಿವಳಿಕೆತಜ್ಞೆ": [{"type": "noun", "defs": ["a woman who has specialised in administrating medicine to a patient for causing loss of sensation by an anesthetic in a specific area or for the loss of consciousness."]}], "ಅರಿವಾಹಿನಿ": [{"type": "noun", "defs": ["= ಅರಿವಡೆ."]}], "ಅರಿವಾಳ್": [{"type": "noun", "defs": ["a cutting tool consisting of a crescent-shaped blade with a short handle: used for cutting down tall grasses and weeds; a sickle."]}], "ಅರಿವಿಕೆ": [{"type": "noun", "defs": ["the act of knowing.", "all that has been perceived or grasped by the mind; learning; enlightenment."]}], "ಅರಿವಿಲಿ": [{"type": "noun", "defs": ["one not having knowledge, in general or in a particular field of knowledge; an ignorant, stupid person."]}], "ಅರಿವಿಲಿತನ": [{"type": "noun", "defs": ["want of knowledge or normal intelligence; the quality or condition of being stupid; stupidity."]}], "ಅರಿವಿದಾರ": [{"type": "noun", "defs": ["(Masc.) one who slays his enemies."]}], "ಅರಿವಿಧುಂತುದ": [{"type": "noun", "defs": ["(astrol.) Rāhu considered as the eighth of the nine planets that affect the life of individual persons."]}], "ಅರಿವಿರಾಮ": [{"type": "noun", "defs": ["he who obliterates his enemies."]}], "ಅರಿವು": [{"type": "noun", "defs": ["knowledge - a) acquaintance with facts; range of information, awareness or understanding; b) all that has been perceived or grasped by the mind; learning; enlightenment.", "conscious feeling or sense impression; sensation.", "the state of being conscious; awareness of one's own feelings, what is happening around one, etc.; consciousness.", "the power or process of receiving conscious sense impressions through direct stimulation of the bodily organism; sensation; the act of perceiving; perception."]}], "ಅರಿವುಗೇಡಿ": [{"type": "noun", "defs": ["one who lacks normal intelligence or knowledge; a person lacking in judgement or prudence; a fool."]}], "ಅರಿವುಗೊಡು": [{"type": "verb", "defs": ["to impart knowledge; to make known; to teach."]}], "ಅರಿವುದಪ್ಪು": [{"type": "verb", "defs": ["to lose temporarily one's consciousness; to become unconscious.", "to lose one's ability of responding consciously to the out side fact or stimuli.", "to be stunned, bewildered."]}], "ಅರಿವೆ": [{"type": "noun", "defs": ["a woven or knitted fabric of fibrous material, as cotton, wool, silk, hair, synthetic fibres, etc.; a cloth.", "a piece of such fabric for a specific use (as dhōti)."]}], "ಅರಿವೆ ಅಂಚಡಿ": [{"type": "noun", "defs": ["(dupl.) (gen.) a cloth."]}], "ಅರಿವೆಕಾಲು": [{"type": "noun", "defs": ["a police man (who, as a part of his uniform, used to strap his leg below the knee with a narrow band of thick cloth).", "(dial.) a weak leg."]}], "ಅರಿವೇಣಿ": [{"type": "noun", "defs": ["a decorated pot worshipped in marriages.", "a worshipping of such a pot."]}], "ಅರಿಶಿಣ": [{"type": "noun", "defs": ["= ಅರಿಸಿನ."]}], "ಅರಿಶಿನಂಟಿಕೆ": [{"type": "noun", "defs": ["the tree, Bauhinia variegata (var. candida) of Caescelpiniaceae family; white ebony."]}], "ಅರಿಶಿನಾರಿಗೆ": [{"type": "noun", "defs": ["a degenerative disease in an organ of the body, esp. the liver, marked by excess formation of connective tissue and, usually, subsequent painful swelling; cirrhosis."]}], "ಅರಿಷಟ್ಕ": [{"type": "noun", "defs": ["= ಅರಿಷಡ್ವರ್ಗ."]}], "ಅರಿಷಡ್ವರ್ಗ": [{"type": "noun", "defs": ["a set of six vices (as lust, anger, avarice, fondness (infatuation), arrogance and jealousy) considered as the enemies within."]}], "ಅರಿಷಡ್ವರ್ಗದೂರ": [{"type": "noun", "defs": ["a man who is not subject to the six vices ಅರಿಷಡ್ವರ್ಗ (see above)."]}], "ಅರಿಷ್ಟ": [{"type": "noun", "defs": ["absence of difficulty, impediment.", "good fortune; favourable situation.", "bad or ill luck; an extreme misfortune bringing loss, sorrow; a calamity.", "a portentous phenomenon foreboding misfortune; an unlucky omen.", "a symptom of approaching death.", "the largest crow (Corvus corax), with a sharp beak, found in Asia; a raven.", "the liquid left after churning butter from milk; buttermilk.", "the tree Azardirachta indica of Meliaceae family, whose trunk exudes a tenacious gum and has a bitter bark used for medicinal purpose; neem.", "the tree Sapindus emarginates of Sapindaceae family; the soapnut tree.", "its nuts.", "a bulbous herb (Allium sativum) of the lily family and its stong smelling bulb used as a seasoning in meats, salads, etc.; garlic.", "a hostile person; an enemy.", "a lying-in-chamber; a delivery-room; a room for confinement in childbirth.", "(masc.) a person having tendency to commit crimes; an evil or wicked person; scoundrel.", "(Jan.) a class of demi-gods.", "(Jain.) a kind of precious gem.", "an extract produced by decocting; a decoction, sometimes added with sugar, honey, jaggery etc. for medicinal purposes.", "a spirituous liquor.", "name of a hell."]}], "ಅರಿಷ್ಟಗೃಹ": [{"type": "noun", "defs": ["a room for confinement in childbirth; a lying-in-chamber."]}], "ಅರಿಷ್ಟಗೇಡಿ": [{"type": "noun", "defs": ["that which or he who brings loss, calamity, danger or bad luck."]}], "ಅರಿಷ್ಟಘರಟ್ಟ": [{"type": "noun", "defs": ["a destroyer of scoundrels."]}], "ಅರಿಷ್ಟನಿವಾರಕ": [{"type": "adjective", "defs": ["preventing, having the tendency to prevent, misfortune from happening."]}], "ಅರಿಷ್ಟನೇಮಿ": [{"type": "noun", "defs": ["(myth.) brother of Garuḍa, the king of birds.", "(Jain.) name of the twenty second spiritual teacher."]}], "ಅರಿಷ್ಟಪತಿ": [{"type": "noun", "defs": ["Lord Ganēśa, the lord (and remover) of obstacles."]}], "ಅರಿಷ್ಟಶಾಂತಿ": [{"type": "noun", "defs": ["a worship, religious ritual, to prevent misfortune."]}], "ಅರಿಷ್ಟಸದ್ಮ": [{"type": "noun", "defs": ["= ಅರಿಷ್ಟಗೃಹ."]}], "ಅರಿಷ್ಟಾಂಶ": [{"type": "noun", "defs": ["(astrol.) an inauspicious moment."]}], "ಅರಿಷ್ಟೆ": [{"type": "noun", "defs": ["name of a hell.", "an inauspicious woman who brings bad luck."]}], "ಅರಿಸಮಾಸ": [{"type": "noun", "defs": ["(gram.) a heterogeneous compound (esp. a compound of a Kannaḍa word and a Samskřta word, which has no literary sanction."]}], "ಅರಿಸಿಣ": [{"type": "noun", "defs": ["= ಅರಿಸಿನ."]}], "ಅರಿಸಿನ": [{"type": "noun", "defs": ["turmeric - a) the plant Curcuma longa of the Zingiberaceae family; b) its root stock and the yellow powder made from it.", "hot water mixed with turmeric powder.", "the yellow colour.", "a yellow cloth, esp. a long, unstitched one, used by women, the one end as a skirt the other a cover to the breast and shoulder; a sari.", "ಅರಿಸಿನದ ಕೊನೆ arisnada kone = ಅರಿಸಿನ ಕೊಂಬು; ಅರಿಸಿನದ ಮೈ arisinada mai a person who has just married (so said, as it is customary to smear the body of such a person with turmeric powder)."]}], "ಅರಿಸಿನ ಕೊಂಬು": [{"type": "noun", "defs": ["the rootstock of the plant Curcuma longa."]}], "ಅರಿಸಿನಕುಂಕುಮ": [{"type": "noun", "defs": ["a part of religious functions in a house, where women (whose husbands are alive) are invited and turmeric and vermilion powders are distributed as a mark of propitiousness.", "ಅರಿಸಿನಕುಂಕುಮದ ಭಾಗ್ಯ arisina kuŋkumada bhāgya the woman's fortune of having her husband alive during her life period, considered auspicious;"]}], "ಅರಿಸಿನ ಉಮ್ಮತ್ತಿ": [{"type": "noun", "defs": ["the prickly composite plant, Argemone mexicana of Papaveraceae family; yellow thistle."]}], "ಅರಿಸಿನಂಟಿಕೆ": [{"type": "noun", "defs": ["the tree, Bauhinia variegata (var. candida) of Caescelpiniaceae family; white ebony."]}], "ಅರಿಸಿನಕಮ್ಮಾಟ": [{"type": "noun", "defs": ["= ಅರಿಸಿನ ಉಮ್ಮತ್ತಿ."]}], "ಅರಿಸಿನಕಾಮಾಲೆ": [{"type": "noun", "defs": ["a condition due to obstruction of the bile or absorption of the colouring matter into the blood, characterised by yellowness of the skin, diarrhoea and general debility; the disease causing this condition; jaundice."]}], "ಅರಿಸಿನಕುತ್ತ": [{"type": "noun", "defs": ["= ಅರಿಸಿನಕಾಮಾಲೆ."]}], "ಅರಿಸಿನಗಂಬ": [{"type": "noun", "defs": ["(dial.) a small branch of a fig tree worshipped with turmeric, dry and ripe coconut, etc. on the occasion of marriages."]}], "ಅರಿಸಿನಗುರುಗ": [{"type": "noun", "defs": ["the plant Garcenia indica ( = G. purpurea) of Guttiferae family; kokum.", "the small, evergreen tree Garcinia morella of Guttiferae family, that yields gum resin which is used as a yellow pigment and as a cathartic; the true gamboge tree."]}], "ಅರಿಸಿನಗುರುಗಿ": [{"type": "noun", "defs": ["= ಅರಿಸಿನಗುರುಗ."]}], "ಅರಿಸಿನ ಜಡ್ಡು": [{"type": "noun", "defs": ["= ಅರಿಸಿನಕಾಮಾಲೆ."]}], "ಅರಿಸಿನಜೀರಂಗಿ": [{"type": "noun", "defs": ["the plant Sesbania sesban (S. aegyptiaca) of Papilionaceae family; common sesban."]}], "ಅರಿಸಿನತೇಗ": [{"type": "noun", "defs": ["the tree Adina cardifolia of Rubiaceae family; yellow-oak."]}], "ಅರಿಸಿನದತ್ತೂರ": [{"type": "noun", "defs": ["= ಅರಿಸಿನ ಉಮ್ಮತ್ತಿ."]}], "ಅರಿಸಿನಬೂರುಗ": [{"type": "noun", "defs": ["an ornamental tropical tree Cochlospermum religiosum ( = C. gossypium) of Cochlospermaceae family, a tropical ornamental tree."]}], "ಅರಿಸಿನಮುಂಡ": [{"type": "noun", "defs": ["= ಅರಿಸಿನಕಾಮಾಲೆ."]}], "ಅರಿಸಿನಮುಂಡಿಗೆ": [{"type": "noun", "defs": ["= ಅರಿಸಿನಕಾಮಾಲೆ."]}], "ಅರಿಸಿನಸಾಸಿವೆ": [{"type": "noun", "defs": ["the plant Plycorpeae aurea of Caryophyllaceae family."]}], "ಅರಿಸಿನಹರಳು": [{"type": "noun", "defs": ["= ಅರಿಸಿನಗುರುಗ."]}], "ಅರಿಸಿನಹೂಗಿಡ": [{"type": "noun", "defs": ["the plant Allamanda Cathartica of Apocynaceae family."]}], "ಅರಿಸಿನೆಣ್ಣೆ": [{"type": "noun", "defs": ["a rite of anointing the bride and the groom oil and turmeric powder before marriage."]}], "ಅರಿಸು": [{"type": "verb", "defs": ["to cause to cut, pierce or incise."]}, {"type": "verb", "defs": ["to remove seeds from (cotton) with a gin; to gin."]}], "ಅರಿಸೆ": [{"type": "noun", "defs": ["a painful swelling of a vein in the region of the anus, often with bleeding; haemorrhoids; piles."]}], "ಅರಿಹ": [{"type": "noun", "defs": ["the act of cutting in to pieces; a cutting off; incision.", "a cutting or being cut; a cut."]}, {"type": "noun", "defs": ["= ಅರಿಹಂತ."]}], "ಅರಿಹಂತ": [{"type": "noun", "defs": ["any of the twenty four Jaina spiritual teachers."]}], "ಅರಿಹಕೊಱ": [{"type": "noun", "defs": ["one who reaps the crop; a reaper."]}], "ಅರಿಹುಲ್ಲು": [{"type": "noun", "defs": ["a reaped, but not thrashed, crop."]}], "ಅರು": [{"type": "verb", "defs": ["to have a longing for; to want; to desire; to crave; to wish."]}, {"type": "noun", "defs": ["the tropical hot red pepper plant, Capsicum annuum of Solanaceae family, common chilli.", "its pod;(?)."]}, {"type": "noun", "defs": ["a sore, usu. infected spot on the body, as an ulcer, boil or blister.", "a critical or indispensable part (of the body)."]}], "ಅರುಂಗಳ": [{"type": "noun", "defs": ["(Jain.) an order of ascetics."]}], "ಅರುಂತುದ": [{"type": "adjective", "defs": ["causing pain; infecting wounds.", "cutting or sarcastic in speaking; making biting remarks; bitter and caustic in temper, manner or speech; acrimonious."]}, {"type": "noun", "defs": ["he who is acrimonious."]}], "ಅರುಂಧತಿ": [{"type": "noun", "defs": ["(myth.) name of sage Vasiśṭha's wife, renowned for her chastity.", "(fig.) a chaste woman.", "one of several visible stars in most conspicuous north constellation Ursa Major (between Lynx and Draco constellations)."]}], "ಅರುಂಧತೀನ್ಯಾಯ": [{"type": "noun", "defs": ["the maxim of viewing ಅರುಂಧತಿ star used to point out to a minute or precise object or subject, by referring to an obvious or gross object or subject."]}], "ಅರುಂಪೆಱಲ": [{"type": "noun", "defs": ["that which is difficult to achieve or to understand."]}], "ಅರುಂಬು": [{"type": "noun", "defs": ["an unexpanded flower; a flower-bud."]}], "ಅರುಕಡ್ಡಿ": [{"type": "noun", "defs": ["a bamboo stick."]}], "ಅರುಕಾಣಿಕೆ": [{"type": "noun", "defs": ["(obs.) a tax levied on farmers depending on the number of ploughs they had."]}], "ಅರುಗ": [{"type": "noun", "defs": ["a kind of insect."]}], "ಅರುಗಿಸು": [{"type": "verb", "defs": ["= ಅರುಗುಮಾಡು."]}], "ಅರುಗು": [{"type": "verb", "defs": ["to go aside; to give way to another."]}, {"type": "noun", "defs": ["an outer edge; a border; a margin; a fringe.", "a position or space beside one; a side.", "ಅರುಗಾಗು arugāgu to go aside; to give way to another."]}], "ಅರುಗುಮಾಡು": [{"type": "verb", "defs": ["to keep aside; to take away from one's path.", "to cause to go; to send."]}], "ಅರುಚಿ": [{"type": "noun", "defs": ["lack of taste; tastelessness.", "want of appetite.", "dislike; disrelish.", "a sickening distaste or dislike; deep aversion; repugnance; disgust.", "lack of brightness; dullness.", "absence of interest."]}], "ಅರುಜ": [{"type": "noun", "defs": ["a healthy man; a man free from diseases."]}], "ಅರುಟಾಲ": [{"type": "noun", "defs": ["= ಅರುಟಾಳ."]}], "ಅರುಟಾಳ": [{"type": "noun", "defs": ["the tree Sapindus emarginatus of Sapindaceae tree; soapnut tree.", "its nut."]}], "ಅರುಟಾಳಕ": [{"type": "noun", "defs": ["= ಅರುಟಾಳ."]}], "ಅರುಠಾಳ": [{"type": "noun", "defs": ["= ಅರುಟಾಳ."]}], "ಅರುಣ": [{"type": "noun", "defs": ["the colour of the dawn or morning twilight.", "the reddish brown, tawny or red colour.", "(myth.) name of the charioteer of the Sun God.", "the sun.", "a ray of light.", "a variety in leprosy characterised by red spots and insensibility.", "the tree Calophyllum inophyllum of Guttifereae family.", "name of a mountain, situated to the west of Kailāsa mountain in the Himalayan belt.", "a light, fine, stringlike length of material made up of two or more fibers or strands of spun cotton, flax, silk, etc. twisted together and used in sewing; a thread.", "a river rising in Goṇḍavana and joining the river Gangā near Pāṭna in north India (also called Śoṇa).", "powdery earth or other matter in bits fine enough to be easily suspended in air; dust.", "gold.", "a kind of little poisonous creature.", "the red metal, copper.", "one of the Upaniṣats, the sacred scriptures of Hindūs.", "(Jain.) a class among the demigods."]}], "ಅರುಣಕಮಲ": [{"type": "noun", "defs": ["the red lotus - plant Nymphaea pubescens of Nymphaeceae family.", "flower."]}], "ಅರುಣಕಮಲಾಂಬಕ": [{"type": "noun", "defs": ["one whose eyes resemble the red-lotus flower.", "Křṣṇa, who has lotus-like beautiful eyes."]}], "ಅರುಣಚ್ಛವಿ": [{"type": "noun", "defs": ["the colour of the morning twilight."]}], "ಅರುಣಜಲ": [{"type": "noun", "defs": ["the red liquid that circulates through the heart, arteries and veins of vertebrates; the blood."]}], "ಅರುಣಜಲವರುಷ": [{"type": "noun", "defs": ["a down pour of blood."]}], "ಅರುಣಜಲಂಬೊರೆ": [{"type": "verb", "defs": ["to pour oneself with the blood (as in a battlefield)."]}], "ಅರುಣಜಳ": [{"type": "noun", "defs": ["= ಅರುಣಜಲ."]}], "ಅರುಣತೆ": [{"type": "noun", "defs": ["the quality or state of being red; redness."]}], "ಅರುಣದಾವರೆ": [{"type": "noun", "defs": ["= ಅರುಣಕಮಲ."]}], "ಅರುಣದಿನಮಣಿ": [{"type": "noun", "defs": ["the sun looking red, as either while rising or setting."]}], "ಅರುಣಮುಳ್ಳು": [{"type": "noun", "defs": ["the tree Feronia limonia ( = F. elephantum) of Rutaceae family; elephant apple; wood apple."]}], "ಅರುಣಮೂಲ": [{"type": "noun", "defs": ["the plant Plecospermum spinosum of Moraceae family."]}], "ಅರುಣರಿಪು": [{"type": "noun", "defs": ["a variety in cardamom plant.", "its capsule of seeds or a seed; black cardamom."]}], "ಅರುಣವಸ್ತ್ರ": [{"type": "noun", "defs": ["a red cloth."]}], "ಅರುಣವಾರಿ": [{"type": "noun", "defs": ["= ಅರುಣಜಲ."]}], "ಅರುಣಶಾಲಿ": [{"type": "noun", "defs": ["a variety in paddy."]}], "ಅರುಣಸಾರಥಿ": [{"type": "noun", "defs": ["the Sun-God, who has Aruṇa as his charioteer."]}], "ಅರುಣಾಂಗ": [{"type": "noun", "defs": ["the big red ant."]}], "ಅರುಣಾಂಬು": [{"type": "noun", "defs": ["= ಅರುಣಜಲ."]}], "ಅರುಣಾಕ್ಷಿ": [{"type": "noun", "defs": ["a woman whose eyes have turned red (either in anger or from intoxication)."]}], "ಅರುಣಾಧರ": [{"type": "noun", "defs": ["the red lip (esp. of a woman)."]}], "ಅರುಣಾಧರೆ": [{"type": "noun", "defs": ["a woman with red lips."]}], "ಅರುಣಾಬ್ಜ": [{"type": "noun", "defs": ["= ಅರುಣಕಮಲ."]}], "ಅರುಣಾವರಜ": [{"type": "noun", "defs": ["(myth.) Brahmini kite personified as Garuḍa, brother of Aruṇa."]}], "ಅರುಣಾಶ್ಮ": [{"type": "noun", "defs": ["a clear, deep-red variety of corundum, valued as a precious stone; the ruby."]}], "ಅರುಣಿ": [{"type": "noun", "defs": ["a defence wall; a wall as a protection."]}], "ಅರುಣಿತ": [{"type": "adjective", "defs": ["being red; dyed red; reddened; empurpled."]}], "ಅರುಣಿಮೆ": [{"type": "noun", "defs": ["the red colour."]}], "ಅರುಣಿಸು": [{"type": "verb", "defs": ["(the morning light) to begin to grow.", "to cause to rise; to raise; to make appear in public."]}], "ಅರುಣೀಭೂತ": [{"type": "adjective", "defs": ["being red; turned red."]}], "ಅರುಣೆ": [{"type": "noun", "defs": ["the medicinal plant Aconitum heterophyllum of Ranunculaceae family.", "the substance obtained from this plant, for medicinal purpose.", "the creeper Rubia cordifolia, of Rubiaceae family.", "the plant Citrullus colocynthis of Cucurbitaceae family.", "the plant Abrus precatorius of Papilionaceae family; crab's eye; wild liquorice."]}], "ಅರುಣೋದಯ": [{"type": "noun", "defs": ["the break of the day.", "appearance of subdued light just before sunrise."]}], "ಅರುಣೋಪಲ": [{"type": "noun", "defs": ["= ಅರುಣಾಶ್ಮ."]}], "ಅರುಣೋಪಳ": [{"type": "noun", "defs": ["= ಅರುಣಾಶ್ಮ."]}], "ಅರುದಿಂಗಳ್": [{"type": "noun", "defs": ["a period of six months; a half-year duration."]}], "ಅರುದು": [{"type": "noun", "defs": ["the feeling of surprise, admiration, and awe aroused by something strange, unexpected, incredible, etc.; a wonder."]}], "ಅರುನೂರು": [{"type": "adjective", "defs": ["six times hundred."]}, {"type": "noun", "defs": ["the cardinal number between fifty-nine and sixty-one; six hundred."]}], "ಅರುಪು": [{"type": "verb", "defs": ["to communicate knowledge to, to tell (of or about); to disclose facts about someone or something; to make another know."]}], "ಅರುಪಿಸು": [{"type": "verb", "defs": ["to offer for acceptance; to tender.", "to dedicate; to address or inscribe (a book, an act etc.) to someone as a mark of honour or affection.", "to symbolically offer food, flowers, etc. to a deity."]}], "ಅರುಬು": [{"type": "noun", "defs": ["condition, quality, fact or instance of being responsible; obligation, accountability, dependability, etc.; responsibility; dutifulness."]}, {"type": "noun", "defs": ["a prolonged period of dry weather; lack of rain; serious shortage of water; drought."]}], "ಅರುಬೆ": [{"type": "noun", "defs": ["= ಅರುವೆ."]}], "ಅರುಮಾಸಿ": [{"type": "noun", "defs": ["any valuable thing."]}], "ಅರುಮಾಸಿಪರಮಾಸಿ": [{"type": "noun", "defs": ["dupl. of ಅರುಮಾಸಿ."]}], "ಅರುಮೆ": [{"type": "noun", "defs": ["fond or tender feeling; warm liking; affection.", "a light, quick, jerky movement; the quality or state of being infirm, unsteady; unsteadiness.", "the quality or fact of being fond of play or fun; lack of seriousness."]}], "ಅರುವಡಿ": [{"type": "adjective", "defs": ["being six times more than a given quantity or number."]}, {"type": "noun", "defs": ["the quantity or number which six times more than another quantity or number."]}], "ಅರುವಣ": [{"type": "noun", "defs": ["(obs.) a tax levied on farmers depending on the number of ploughs they had."]}], "ಅರುವತ್ತು": [{"type": "adjective", "defs": ["totalling to sixty."]}, {"type": "noun", "defs": ["the cardinal number sixty; 60."]}], "ಅರುವಾರ": [{"type": "noun", "defs": ["the pledging of property to a creditor as security for the payment of a debt; mortgage."]}], "ಅರುವು": [{"type": "noun", "defs": ["the act of observing; attention; regard; heed; cognisance; notice.", "all that has been perceived or grasped by the mind; learning; enlightenment; knowledge.", "the power or process of receiving conscious sense impressions through direct stimulation of the bodily organism; sensation."]}], "ಅರುವೆ": [{"type": "noun", "defs": ["a woven, knitted or pressed fabric of fibrous material, as cotton, wool, silk, hair, synthetic fibres, etc.; a cloth."]}], "ಅರುಷ್ಕರ": [{"type": "adjective", "defs": ["causing or inflicting wounds or pain.", "the tree Semecarpus anacardium of Anacardiaceae family.", "its nut; marking nut."]}], "ಅರುಸೆ": [{"type": "noun", "defs": ["a painful swelling of a vein in the region of the anus, often with bleeding; haemorrhoids; piles."]}], "ಅರುಹ": [{"type": "adjective", "defs": ["having enough power, skill, etc. to do something; able.", "fit to be chosen; legally or morally qualified; eligible."]}, {"type": "noun", "defs": ["= ಅರುಹಂತ.", "a man having required power, skill, etc. to do something; an able man.", "a man fit to be chosen on the basis of his qualification, eligibility."]}], "ಅರುಹಂತ": [{"type": "noun", "defs": ["a Jaina spiritual teacher, chiefly any of the twenty four such persons regarded."]}], "ಅರುಹಮಂದಿರ": [{"type": "noun", "defs": ["a Jaina temple."]}], "ಅರುಹು": [{"type": "verb", "defs": ["to give knowledge of something to; to tell; to inform; to teach; to make known; to reveal."]}, {"type": "noun", "defs": ["all that has been perceived or grasped by the mind; learning; enlightenment; knowledge."]}], "ಅರುಳ್": [{"type": "noun", "defs": ["a feeling of grief or tenderness aroused by the sufferings or distress of others, compassion; sympathy for otheṛs sorrows; pity."]}, {"type": "noun", "defs": ["= ಅರುಳು2."]}], "ಅರುಳಪಾಡು": [{"type": "noun", "defs": ["a song in praise of Lorḍs compassion or sympathy."]}], "ಅರುಳಾಳು": [{"type": "noun", "defs": ["a compassionate person."]}], "ಅರುಳಿ": [{"type": "noun", "defs": ["a flower or a floret."]}, {"type": "noun", "defs": ["a variety in fish."]}], "ಅರುಳು": [{"type": "noun", "defs": ["= ಅರುಳ್1."]}, {"type": "noun", "defs": ["feeble and childish state due to old age; senility; dotage."]}], "ಅರುಳುದೋರು": [{"type": "verb", "defs": ["to show compassion; to sympathise."]}], "ಅರುಳುಮರಳು": [{"type": "noun", "defs": ["dupl. of ಅರುಳು2."]}], "ಅರುಳ್ಗೈ": [{"type": "verb", "defs": ["to extend sympathy; to be compassionate."]}], "ಅರೂಢಿ": [{"type": "noun", "defs": ["the fact or state of being or becoming unused; the condition of not being used or practiced any more; disuse; desuetude."]}], "ಅರೂಪ": [{"type": "adjective", "defs": ["having no shape or form; formless; shapeless."]}], "ಅರೆ": [{"type": "verb", "defs": ["to reduce to powder or fine particles by crushing and friction; to grind; to powder; to pulverise.", "to crush or squeeze (as a sugar cane, leaves, to get juice out); to work up (flour, clay etc.) into a plastic mass (dough) by pressing and folding it with the hands; to knead.", "to be reduced to powder.", "to be distorted; to lose one's original form or shape.", "to cause to study laboriously; to teach thoroughly.", "ಅರೆದುಕುಡಿ aredukuḍi to learn or study thoroughly; ಅರೆದುಕುಡಿಸು aredukuḍisu to teach thoroughly; ಅರೆದುಹೊಯ(ಯ್ಯಿ) areduhoy(yyi) to teach thoroughly; ಅರೆದವ ಕುಡಿದಾನು aredava kuḍidānu (prov.) as you brew, so you must drink."]}, {"type": "noun", "defs": ["a large mass of stone.", "an open excavation for building stone, slate etc.; any source of building stone; a quarry;", "ಅರೆ ಆಳು are āḷu half the turnover or quantum of work a normal person can do in a day; ಅರೆ ಉಣಿಸು are uṇisu insufficient food; ಅರೆಮಾಡು aremāḍu to make incomplete; to stop a job without completing; ಅರೆಯಾಗು areyāgu to become deficient; to be incomplete."]}, {"type": "noun", "defs": ["either of two equal parts into which a thing or quantity is or may be divided; a half.", "that which is not a whole (not necessarily being half).", "a few things (uncertain ones).", "a falling short; deficit, insufficiency; deficiency."]}, {"type": "noun", "defs": ["a recess or hollow in a wall, as for a statue, bust or vase; a niche.", "a space within a building enclosed by walls or separated from other similar spaces by walls or partitions; a room.", "a sliding box in a table, bureau, chest, etc., that can be drawn out and then pushed back into place; a drawer.", "a kind of percussion instrument, used in folk-dance."]}, {"type": "noun", "defs": ["want of digestive power; inability to digest food."]}, {"type": "noun", "defs": ["any one of the rods connecting the hub with the rim of a wheel; a spoke."]}, {"type": "adverb", "defs": ["somewhere; at some place.", "sometime; at some unspecified time.", "a few; not many; in small, limited or restricted number.", "ಅರೆಬರ್ arebar (pl.) a few people."]}, {"type": "adjective", "defs": ["half - a) being either of the two equal parts; b) being about a half of the amount, length, etc.", "incomplete; fragmentary; partial."]}, {"type": "interjection", "defs": ["an interjection expressing wonder or objection."]}, {"type": "verb", "defs": ["to be missed; to be lost."]}, {"type": "noun", "defs": ["a sand bank."]}, {"type": "noun", "defs": ["the plant Grislea tomentosa."]}], "ಅರೆ ಉೞಿ": [{"type": "noun", "defs": ["(pl.) some places.", "(pl.) a few persons."]}], "ಅರೆ ಎಡೆ": [{"type": "noun", "defs": ["(pl.) some places."]}], "ಅರೆಕಟ್ಟು": [{"type": "verb", "defs": ["to stop on the way; to bring to halt.", "to offer opposition, physically or verbally."]}], "ಅರೆಕದ": [{"type": "noun", "defs": ["a slightly or half opened door."]}], "ಅರೆಕಲ್ಲು": [{"type": "noun", "defs": ["a huge rock."]}], "ಅರೆಕಸುಬಿ": [{"type": "noun", "defs": ["he that abandons an undertaking before completing it; a non-accomplisher; one who lacks correct knowledge for accomplishing a work."]}], "ಅರೆಕಾಣಿ": [{"type": "noun", "defs": ["an old coin; half of a kāṇi."]}], "ಅರೆಕಾರ": [{"type": "noun", "defs": ["a former cultivating the land on lease, for which half the produce is to be given as lease-rent to the land owner."]}], "ಅರೆಕಾಲ್": [{"type": "noun", "defs": ["= ಅರೆಕಾಲು."]}], "ಅರೆಕಾಲು": [{"type": "noun", "defs": ["eighth part."]}], "ಅರೆಕಾಲ್ಚಿಟ್ಟೆ": [{"type": "noun", "defs": ["eighth part of a seer; arepāvu."]}], "ಅರೆಕಾಸು": [{"type": "noun", "defs": ["an old coin; half a kāsu.", "a negligible amount or value.", "ರಾವಣನ ಹೊಟ್ಟೆಗೆ ಅರೆಕಾಸಿನ ಮಜ್ಜಿಗೆ Rāvaṇana hoṭṭege arekāsina majjige (prov.) too little for a huge need; a glutton is not satisfied with spoonful of food."]}], "ಅರೆಕೆಂಪು": [{"type": "noun", "defs": ["the reddish colour, but not dark."]}], "ಅರೆಕೊರೆ": [{"type": "noun", "defs": ["want of something to be a whole; incompleteness; deficiency."]}], "ಅರೆಗಂಜಿ": [{"type": "noun", "defs": ["any insufficient quantity of food."]}, {"type": "noun", "defs": ["the lines on the thumb at the joint of two digits."]}], "ಅರೆಗಂಟು": [{"type": "noun", "defs": ["a loose knot.", "a knot of hair on the back, below the nape."]}], "ಅರೆಗಂದು": [{"type": "verb", "defs": ["to lose slightly one's natural colour; to wither slightly."]}], "ಅರೆಗಚ್ಚು": [{"type": "verb", "defs": ["to bite with teeth, but lightly."]}, {"type": "noun", "defs": ["a half-done or incomplete work."]}], "ಅರೆಗಟ್ಟು": [{"type": "verb", "defs": ["to tie loosely; to bind in a loose manner."]}], "ಅರೆಗಡಿ": [{"type": "verb", "defs": ["to cut into two halves.", "to get severed; to become two."]}], "ಅರೆಗಡೆ": [{"type": "verb", "defs": ["to churn, but incompletely."]}, {"type": "noun", "defs": ["the act of becoming reduced in size, number or extent; a reducing or being reduced."]}], "ಅರೆಗಣ್": [{"type": "noun", "defs": ["= ಅರೆಗಣ್ಣು."]}], "ಅರೆಗಣ್ಣು": [{"type": "noun", "defs": ["half-opened eye.", "blindness over half the field of vision; hemianopsia."]}], "ಅರೆಗಣ್ಬೀಡು": [{"type": "noun", "defs": ["the state of the eye being opened half."]}], "ಅರೆಗಣ್ಮುಗಿ": [{"type": "verb", "defs": ["to half close the eye."]}], "ಅರೆಗದ": [{"type": "noun", "defs": ["a slightly or half opened door."]}], "ಅರೆಗಪ್ಪು": [{"type": "noun", "defs": ["black in colour, but not jet black; greyish black; ash colour."]}], "ಅರೆಗರಿ": [{"type": "verb", "defs": ["to half-burn; to parch slightly."]}], "ಅರೆಗರಿಂಕುವೋಗು": [{"type": "verb", "defs": ["(half the portion) to get charred.", "to get burnt incompletely."]}], "ಅರೆಗಲ್": [{"type": "noun", "defs": ["= ಅರೆಗಲ್ಲು."]}], "ಅರೆಗಲ್ಲು": [{"type": "noun", "defs": ["a stone on which something (esp. spices) is ground; a grinding stone.", "a hard stone used to sharpen cutting tools; hone; a whetstone.", "a large mass of stone.", "an open excavation for building stone, slate etc.; any source of building stone; a quarry."]}], "ಅರೆಗವಚ": [{"type": "noun", "defs": ["a short mail-coat or garment, usu. without sleeves or collar, extending from the neck to the waist."]}], "ಅರೆಗವಡಿಕೆ": [{"type": "noun", "defs": ["half-the value of a cowrie (formerly used as money)."]}], "ಅರೆಗಳಿಗೆ": [{"type": "noun", "defs": ["a period of time equal to half the gaḷige; a duration of 12 minutes.", "a very short period of time."]}], "ಅರೆಗಳ್ತಲೆ": [{"type": "noun", "defs": ["the state of being dim; dimness; the time of the evening when it is starts becoming dark."]}], "ಅರೆಗೞಿಗೆ": [{"type": "noun", "defs": ["= ಅರೆಗಳಿಗೆ."]}], "ಅರೆಗಾಣಿ": [{"type": "noun", "defs": ["an old coin; half of a kāṇi."]}], "ಅರೆಗಾಯ": [{"type": "noun", "defs": ["a superficial wound."]}], "ಅರೆಗಾಲ": [{"type": "noun", "defs": ["(dial.) the season of the year when the sun shines most directly upon a region; the warmest season of the year; summer."]}], "ಅರೆಗಾವು": [{"type": "noun", "defs": ["moderate heat ( i.e. less than the required degree of heat)."]}], "ಅರೆಗಾವುದ": [{"type": "noun", "defs": ["a linear measure of six miles; a half-gāvuda."]}], "ಅರೆಗಿರಿ": [{"type": "verb", "defs": ["to open the mouth as to show only a portion of the teeth."]}], "ಅರೆಗುಂಡಿಗೆ": [{"type": "noun", "defs": ["lack of courage; timidity; cowardice."]}], "ಅರೆಗುಂದು": [{"type": "verb", "defs": ["to become slightly less; to lose vigour to some extent."]}], "ಅರೆಗುದಿ": [{"type": "verb", "defs": ["to be heated moderately; to be half-cooked."]}], "ಅರೆಗುದಿಯಿಸು": [{"type": "verb", "defs": ["to heat moderately; to half-cook."]}], "ಅರೆಗುರಿಕ": [{"type": "noun", "defs": ["the state of a work being half-done; incompleteness of an undertaking.", "he who does not complete the work undertaken."]}], "ಅರೆಗೆಯ್": [{"type": "verb", "defs": ["to leave the work incomplete; to render defective."]}], "ಅರೆಗೆಲಸ": [{"type": "noun", "defs": ["a half-done, incomplete deed, action or performance."]}, {"type": "noun", "defs": ["the work of excavation from a quarry; quarrying."]}], "ಅರೆಗೆಲಸಿ": [{"type": "noun", "defs": ["he who abandons an undertaking before completing it; a non-accomplisher."]}], "ಅರೆಗೆಱೆ": [{"type": "noun", "defs": ["an excellent water tank."]}], "ಅರೆಗೇಣ್": [{"type": "noun", "defs": ["= ಅರೆಗೇಣು."]}], "ಅರೆಗೇಣು": [{"type": "noun", "defs": ["half the distance from the tip of the thumb to the tip of the little finger stretched apart (about 4.5 to 5 inches)."]}], "ಅರೆಗೊಡು": [{"type": "verb", "defs": ["to give less than the required or due quanity or number."]}], "ಅರೆಗೊಯ್": [{"type": "verb", "defs": ["to cut to some extent but not separate."]}], "ಅರೆಗೊರಡು": [{"type": "noun", "defs": ["a relatively huge log lying like a rock."]}], "ಅರೆಗೊರತೆ": [{"type": "noun", "defs": ["a falling short; deficit, lack, want, insufficiency.", "the amount lacking to make complete or sufficient."]}], "ಅರೆಗೊಲೆ": [{"type": "noun", "defs": ["seriou injury or injuries caused to a person (with an intention of killing)."]}], "ಅರೆಗೊರೆ": [{"type": "verb", "defs": ["to cause to be deficient or incomplete."]}], "ಅರೆಚಡ್ಡಿ": [{"type": "noun", "defs": ["short underpants worn by men or boys."]}], "ಅರೆಚಣ": [{"type": "noun", "defs": ["a fraction of a moment; a very short period of time."]}], "ಅರೆಜಲಾನಿಲ": [{"type": "noun", "defs": ["a mixed gas obtained by passing steam and air over incandescent coke or other source of carbon; semi-water gas."]}], "ಅರೆಜಾವ": [{"type": "noun", "defs": ["the state of being seriously injured, wasted or completely exhausted; the half-dead condition."]}], "ಅರೆತಲೆನೋವು": [{"type": "noun", "defs": ["= ಅರೆದಲೆನೋವು."]}], "ಅರೆತಿಳಿವು": [{"type": "noun", "defs": ["incomplete knowledge; a falling short of complete cognition of fact.", "anything indistinct or hazy to the sight or the mind."]}], "ಅರೆತುಂಬು": [{"type": "verb", "defs": ["to fill half the capacity."]}, {"type": "noun", "defs": ["a falling short from fullness.", "the condition of being so."]}], "ಅರೆತೆರೆ": [{"type": "verb", "defs": ["= ಅರೆದೆಱೆ."]}], "ಅರೆತೊಡೆಚಲ್ಲಣ": [{"type": "noun", "defs": ["short underpants covering only the upper portion of thighs."]}], "ಅರೆತ್ರುಟಿ": [{"type": "noun", "defs": ["a very minute space of time equal to six minutes."]}], "ಅರೆದಪ್ಪಲು": [{"type": "noun", "defs": ["the area, covered partially with boulders, close to the slope of a mountain."]}], "ಅರೆದಲೆನೋವು": [{"type": "noun", "defs": ["a recurrent severe headache, esp. on one side of the head only, often accompanied by nausea and visual disturbances; migraine."]}], "ಅರೆದಲೆಬೇನೆ": [{"type": "noun", "defs": ["= ಅರೆದಲೆನೋವು."]}], "ಅರೆದಿಂಗಳು": [{"type": "noun", "defs": ["the moon when it appears to have one concave edge and one convex edge; the crescent moon."]}], "ಅರೆದಿಟ್ಟಿ": [{"type": "noun", "defs": ["a half-opened eye.", "a hasty, superficial look with little attention to detail."]}], "ಅರೆದುಱುಗು": [{"type": "verb", "defs": ["to pervade or be diffused, incompletely."]}], "ಅರೆದೆಱೆ": [{"type": "verb", "defs": ["to open incompletely; to half-open."]}]}