{"ಆರಂಬಿಗ": [{"type": "noun", "defs": ["= ಆರಂಬಗಾರ.", "2) a man who initiates, commences or begins."]}], "ಆರಂಭ": [{"type": "noun", "defs": ["a starting or beginning; a getting into action or motion; commencement; a start.", "occupation, profession, business, trade, craft, etc.; a work.", "the profession of a cultivator; agriculture.", "(Jain.) an act, work or business that results in committing harm to the living beings."]}], "ಆರಂಭಂಗೆಯ್": [{"type": "verb", "defs": ["= ಆರಂಬಂಗೆಯ್.", "= ಆರಂಭಿಸು."]}], "ಆರಂಭಕ": [{"type": "noun", "defs": ["= ಆರಂಬಗಾರ.", "a man who initiates, commences or begins.", "a class of Jaina saints or votaries."]}], "ಆರಂಭಕಾಱ": [{"type": "noun", "defs": ["= ಆರಂಭಿಗ."]}], "ಆರಂಭಗಾರ": [{"type": "noun", "defs": ["= ಆರಂಭಿಗ."]}], "ಆರಂಭಗಾರಿಕೆ": [{"type": "noun", "defs": ["the profession of cultivating plants or crops; farming.", "the act, fact or process of beginning or the tendency to begin; initiation."]}], "ಆರಂಭಣ": [{"type": "noun", "defs": ["the thing at which one is employed; an occupation; a profession; an employment."]}], "ಆರಂಭತ್ಯಾಗ": [{"type": "noun", "defs": ["(Jain.) an abandoning of profession, service, trade, etc. which harm the living beings."]}], "ಆರಂಭನಿವೃತ್ತ": [{"type": "noun", "defs": ["= ಆರಂಭವಿರತ."]}], "ಆರಂಭಭಾಷಣ": [{"type": "noun", "defs": ["a speech made at an inauguration; an inaugural address."]}], "ಆರಂಭವಿರತ": [{"type": "noun", "defs": ["a man who gave up cultivation or farming.", "(Jain.) a Jaina votary who has given up agriculture, trade, service, with a view not to harming the living beings."]}], "ಆರಂಭಶೂರ": [{"type": "noun", "defs": ["he who shows super enthusiasm only at the beginning."]}], "ಆರಂಭಶೂರತನ": [{"type": "noun", "defs": ["the quality of being enthusiastic only at the beginning of an undertaking."]}], "ಆರಂಭಶೂರತ್ವ": [{"type": "noun", "defs": ["= ಆರಂಭಶೂರತನ."]}], "ಆರಂಭಿಕ": [{"type": "adjective", "defs": ["being in the initial stage; initial."]}], "ಆರಂಭಿಗ": [{"type": "noun", "defs": ["one who initiates or begins; one who ventures ahead of others; a pioneer.", "he whose profession is cultivation, farming, etc."]}], "ಆರಂಭಿಸು": [{"type": "verb", "defs": ["to start doing, acting, going, etc.; to get under way; to begin; to initiate."]}], "ಆರಂಭೋತ್ಸವ": [{"type": "noun", "defs": ["a ceremony held at the inauguration; an inaugural function."]}], "ಆರಕ": [{"type": "noun", "defs": ["(masc.) one who protects, saves; a protector."]}], "ಆರಕ್ತ": [{"type": "adjective", "defs": ["of the colour of the blood; red; reddish; ruddy."]}], "ಆರಕ್ತತೆ": [{"type": "noun", "defs": ["the quality or state of being red; ruddiness."]}], "ಆರಕ್ತೇಕ್ಷಣ": [{"type": "noun", "defs": ["a man with red eyes."]}], "ಆರಕ್ತೇಕ್ಷಣೆ": [{"type": "noun", "defs": ["a woman whose eyes have turned red."]}], "ಆರಕ್ಷ": [{"type": "noun", "defs": ["an act of protecting or the state of being protected; protection.", "the junction of the frontal sinuses of an elephant."]}], "ಆರಕ್ಷಕ": [{"type": "noun", "defs": ["one who prevents from hazards, danger; a policeman; a watchman."]}], "ಆರಗಿನ": [{"type": "noun", "defs": ["the plant Cassia fistula ( = Cathartocarpus fistula) of Caesalpiniaceae family."]}], "ಆರಗ್ವಧ": [{"type": "noun", "defs": ["= ಆರಗಿನ."]}], "ಆರಜ": [{"type": "noun", "defs": ["a holding back oneself from doing, taking decision, etc. (?)."]}], "ಆರಟ": [{"type": "noun", "defs": ["the act of robbing a person or a place by force; plunder.", "goods taken by robbing; plunders."]}], "ಆರಟಗೊಳ್": [{"type": "verb", "defs": ["to take personal property from another unlawfully by using or threatening force and violence; to commit robbery upon; to rob; to plunder."]}], "ಆರಟಿ": [{"type": "noun", "defs": ["= ಆರಟ."]}], "ಆರಟಿಗೊಳ್": [{"type": "verb", "defs": ["= ಆರಟಗೊಳ್."]}], "ಆರಟ್ಟ": [{"type": "noun", "defs": ["a country to the north-west of Punjab, known for horses of good breed.", "a horse of that country."]}], "ಆರಡಿ": [{"type": "noun", "defs": ["any of broad-bodied, four-winged, six-footed, hairy hymenopteran insects which belong to a large super family Apoidea, which gather pollen and nectar, have biting as well as sucking mouthparts, and often live in organised colonies.", "(vīr.) (pl.) the six stages in the path of realisation of Śiva."]}, {"type": "noun", "defs": ["the act of plundering (esp. during wartime).", "very great mental or physical pain; agony.", "the bitter attitude or feelings of an enemy or of mutual enemies; hostility; antagonism; enmity."]}], "ಆರಡಿಗೊಳ್": [{"type": "verb", "defs": ["to collect, and readily accept, knowledge from different sources, as the honeybee gathers nectar from different flowers.", "(vīr.) to gain knowledge through ṣaṭsthala, the six stages."]}, {"type": "verb", "defs": ["to inflict pain and agony; to annoy; to assault.", "to dislike intensely; to hate."]}], "ಆರಣ": [{"type": "noun", "defs": ["a division in the Vēdas.", "(Jain.) one of the sixteen heavens."]}, {"type": "noun", "defs": ["six haṇas (an old Indian currency coin)."]}], "ಆರಣ ಅಡ್ಡ": [{"type": "noun", "defs": ["six and a half haṇas (an old Indian currency coin)."]}], "ಆರಣವಿಮಾನ": [{"type": "noun", "defs": ["(Jain.) the abode of Indra, in the heaven āraṇa."]}], "ಆರಣಿ": [{"type": "noun", "defs": ["= ಆರಣ1 - 2."]}], "ಆರಣೀಂದ್ರ": [{"type": "noun", "defs": ["(Jain.) the Indra of the heaven āraṇa (āraṇi)."]}], "ಆರಣ್ಯ": [{"type": "adjective", "defs": ["sylvan - a) of or characteristic of the woods or forest; b) living or found in the woods or forest."]}, {"type": "noun", "defs": ["a vast tract of uncultivated land abounding in wild growth of trees, under-bushes, etc. ; a forest."]}], "ಆರಣ್ಯಕ": [{"type": "adjective", "defs": ["= ಆರಣ್ಯ1."]}, {"type": "noun", "defs": ["one who lives in a forest; a forest-dweller.", "that part of the Vēdas relating to Brāhmaṇa dealing mainly with the cosmic significance of the Vedic rituals and also contain mythological, legendary materials."]}], "ಆರಣ್ಯೆ": [{"type": "noun", "defs": ["the tree Antiaris toxicaria of Moraceae family, whose whitish bark yields a poisonous, milky juice used as an arrow poison; upas tree."]}], "ಆರತ": [{"type": "noun", "defs": ["great suffering, as from worry, grief or pain; mental agony."]}, {"type": "adjective", "defs": ["mild; amicable; friendly.", "engaged in; interested or absorbed in."]}], "ಆರತಕ್ಷತೆ": [{"type": "noun", "defs": ["a social function, often formal, for the guests to bless or give good wishes to the newly wedded couple."]}], "ಆರತಿ": [{"type": "noun", "defs": ["a waving of lights before a person or an idol of a deity.", "the lights used or camphor burned for this purpose.", "ಆರತಿ ಎತ್ತು ārati ettu = ಆರತಿಯೆತ್ತು; ಆರತಿಬೆಳಗು ārati beḷagu = ಆರತಿಯೆತ್ತು; 2) to welcome in a traditional manner; ಆರತಿಯೆತ್ತು āratiyettu to wave the lights or burning camphor before the idol of a deity or the lights before a person; 2. (fig.) to treat with dislike or repugnance; ಆರತಿತಟ್ಟೆ ārati taṭṭe a plate, with or without a handle used to wave the lights before an idol."]}, {"type": "noun", "defs": ["a ceasing or stopping, either forever or for some time; cessation."]}], "ಆರತಿಹಾಡು": [{"type": "noun", "defs": ["a song sung while waving lights before a person or an idol of a deity."]}], "ಆರನಾಲ": [{"type": "noun", "defs": ["a thin food made from the fermentation of the boiled rice; rice-gruel."]}], "ಆರನಾಲಕ": [{"type": "noun", "defs": ["= ಆರನಾಲ."]}], "ಆರನಾಳ": [{"type": "noun", "defs": ["= ಆರನಾಲ."]}], "ಆರನಾಳಕ": [{"type": "noun", "defs": ["= ಆರನಾಲ."]}], "ಆರನಾಳಾಂಬು": [{"type": "noun", "defs": ["= ಆರನಾಲ.", "2) the water in which rice is washed before being cooked."]}], "ಆರಪಾರ": [{"type": "adverb", "defs": ["(dial.) from end to end; (moving) without any obstruction; unimpedingly."]}], "ಆರಬ್ದ": [{"type": "adjective", "defs": ["that is begun; commenced; started."]}], "ಆರಭಟಿ": [{"type": "noun", "defs": ["(rhet. & dance.) the classical or vehement way of expounding or presenting on the stage, a few sentiments such as wrath or furiousness, fear, etc."]}], "ಆರಭಟೀವೃತ್ತಿ": [{"type": "noun", "defs": ["= ಆರಭಟಿ."]}], "ಆರಭಟೆ": [{"type": "noun", "defs": ["a loud roaring sound; bluster."]}], "ಆರಭಾರ": [{"type": "noun", "defs": ["the act of managing; management; supervision.", "the regular house-hold expenditure."]}], "ಆರಭಿ": [{"type": "noun", "defs": ["a rāga (musical mode), derived from the main scale Dhīira Śaŋkarābharaṇa, and having five and seven notes in the ascending and descending orders respectively."]}], "ಆರಭ್ಯ": [{"type": "adverb", "defs": ["since beginning; (happening, continuing) ever since the commencement."]}], "ಆರಮೆ": [{"type": "noun", "defs": ["= ಆರವೆ."]}], "ಆರಮೆಕ್ಕೆ": [{"type": "noun", "defs": ["the creeper Cucumis callosus ( = c. trigonus) of Cucurbitaceae family."]}], "ಆರಯ್": [{"type": "verb", "defs": ["to look through for purpose of finding something; to search; to enquire about; to investigate.", "to think seriously and deeply; to ponder; to cogitate.", "to critically examine; to analyse deeply and thoroughly.", "to save; to protect; to foster."]}], "ಆರಯಿ": [{"type": "verb", "defs": ["= ಆರಯ್."]}], "ಆರಯಿಕೆ": [{"type": "noun", "defs": ["= ಆರಯ್ಕೆ."]}], "ಆರಯಿಸು": [{"type": "verb", "defs": ["to get looked through for purpose of finding something; to cause to search.", "to cause to examine critically.", "to show respect or treat with courtesy and hospitaliity; to regard."]}], "ಆರಯು": [{"type": "verb", "defs": ["= ಆರಯ್."]}], "ಆರಯ್ಕೆ": [{"type": "noun", "defs": ["the act or process of examining or analysing.", "the act or an instance of thinking seriously and deeply.", "the act or an instance of giving protection.", "the act or process of tending the sick, injured, etc.; nursing.", "(used as a word giving caution) 'attention', 'beware'."]}], "ಆರಯ್ಯು": [{"type": "verb", "defs": ["= ಆರಯ್."]}], "ಆರಯ್ವು": [{"type": "noun", "defs": ["the act of considering; consideration; examination."]}], "ಆರಯ್ಸು": [{"type": "verb", "defs": ["= ಆರಯಿಸು."]}], "ಆರವ": [{"type": "noun", "defs": ["sound - a) vibrations in air, water, etc. that stimulate the auditory nerves and produce the sensation of hearing; b) the auditory sensation produced by such vibrations.", "a loud cry; a shouting; a howling."]}], "ಆರವಾರ": [{"type": "noun", "defs": ["a crying or shouting aloud for a trivial pain."]}, {"type": "noun", "defs": ["a mortgaging of one's real estate for the repayment of a loan."]}], "ಆರವೆ": [{"type": "noun", "defs": ["a pleasure grove; a garden; a park."]}], "ಆರಾಗ್ರ": [{"type": "noun", "defs": ["an arrow with an awl-like tip.", "the sharp tip of a leather cutting instrument."]}], "ಆರಾಘಾತ": [{"type": "noun", "defs": ["a blow or a punch given, standing close to one's opponent."]}], "ಆರಾಜಿತ": [{"type": "adjective", "defs": ["decorated; bedecked; embellished."]}], "ಆರಾಜಿಸು": [{"type": "verb", "defs": ["to be splendid; to shine brilliantly."]}], "ಆರಾಟ": [{"type": "noun", "defs": ["loud or confused shouting; din of voices; clamour; noise."]}, {"type": "noun", "defs": ["a playing in water; water-sport.", "(dial.) the ceremony of immersing the idol of a deity in water."]}], "ಆರಾತಿಯ": [{"type": "adjective", "defs": ["= ಆರಾತೀಯ - 1."]}], "ಆರಾತೀಯ": [{"type": "adjective", "defs": ["distant in space; far off; far away; remote.", "of past time; former; ancient.", "situated closely; proximate.", "of recent times; current."]}], "ಆರಾತ್ರಿಕ": [{"type": "noun", "defs": ["a waving of lights before a person or an idol of a deity.", "the lights used for the purpose or camphor burned so.", "(dance.) the bending of the head as to touch both the shoulders alternatively to express amazement, inferring others' opinion, etc."]}], "ಆರಾತ್ರಿಕಕ್ರಿಯೆ": [{"type": "noun", "defs": ["the act or process of waving lights before a person or a deity."]}], "ಆರಾಧಕ": [{"type": "noun", "defs": ["a man who shows or has religious devotion or reverence for; he who adores or venerates another as a deity ; a worshipper.", "a man who has intense love or admiration for (another person, a line of thinking, etc.); an admirer; a fan.", "a votary - a) a devoted or ardent supporter, as of a cause, ideal, etc; b) a man who is devoted to any game, study, pursuit, etc."]}], "ಆರಾಧಕಿ": [{"type": "noun", "defs": ["a woman who shows or has religious devotion or reverence for; she who adores or venerates another as a deity ; a worshipper.", "a woman who has intense love or admiration for (another person, a line of thinking, etc.); an admirer; a fan.", "(fem.) a votary - a) a devoted or ardent supporter, as of a cause, ideal, etc; b) she who is devoted to any game, study, pursuit, etc."]}], "ಆರಾಧನ": [{"type": "noun", "defs": ["adoration paid to a god; a worshipping; a religious service.", "the act of pleasing, entertaining or propitiating; propitiation.", "work done for a master or feudal lord; b) work done or duty performed for another or others; service.", "an assiduous practice or study.", "something accomplished or done successfully; work completed; achievement."]}], "ಆರಾಧನೀಯ": [{"type": "adjective", "defs": ["worthy of being adored, worshipped or revered; adorable."]}], "ಆರಾಧನೆ": [{"type": "noun", "defs": ["= ಆರಾಧನ; 6) the annual death rituals of a religious monk, and the ceremony for it."]}], "ಆರಾಧಿಸು": [{"type": "verb", "defs": ["to worship; to pay divine honours.", "to love greatly or honour highly; to idolise; to adore.", "to successfully complete; to achieve the desired result.", "to protect; to foster; to rear."]}], "ಆರಾಧ್ಯ": [{"type": "adjective", "defs": ["worthy of being adored, worshipped or revered; adorable."]}, {"type": "noun", "defs": ["a sect in Vīraśaiva religion.", "a member of this sect.", "a man worthy of respect; a venerable man."]}], "ಆರಾಧ್ಯೆ": [{"type": "noun", "defs": ["a venerable woman."]}], "ಆರಾನುಂ": [{"type": "pronoun", "defs": ["(an emphatic form ) - whosoever - a) any person that; whatever person; b) no matter what person."]}], "ಆರಾಭಾರ": [{"type": "noun", "defs": ["the act of managing; management; supervision.", "the regular house-hold expenditure."]}], "ಆರಾಮ": [{"type": "noun", "defs": ["that which is delightful.", "the state of being delighted; delight; pleasure.", "a pleasure- garden or grove.", "the tree Ficus tomentosa of Moraceae family."]}, {"type": "noun", "defs": ["a reposing inactively; repose; rest.", "freedom from disease; good health.", "freedom from disturbance.", "ಆರಾಮವಾಗಿ ārāmavāgi, in a manner characterised by or having leisure; without haste; slowly; unhurriedly; leisurely; 2. without having mental tension or strain; tautless."]}], "ಆರಾಮಕುರ್ಚಿ": [{"type": "noun", "defs": ["a stuffed or padded armchair with a lean-back; an easy chair."]}], "ಆರಾಮತೆ": [{"type": "noun", "defs": ["the state of being free from disturbance, disease, etc.", "the slow pace (as in music)."]}], "ಆರಾಮಶೀತಲ": [{"type": "adjective", "defs": ["cool and pleasant (as in a pleasure-grove)."]}, {"type": "noun", "defs": ["the plant Rungia repens of Acanthaceae family (?)."]}], "ಆರಾಮು": [{"type": "noun", "defs": ["= ಆರಾಮ2."]}], "ಆರಾಮೆ": [{"type": "noun", "defs": ["a pleasure-grove; a park; a garden."]}], "ಆರಾಲಿಕ": [{"type": "noun", "defs": ["he whose profession is cooking food; a cook."]}], "ಆರಾವ": [{"type": "noun", "defs": ["sound - a) vibrations in air, water, etc. that stimulate the auditory nerves and produce the sensation of hearing; b) the auditory sensation produced by such vibrations."]}], "ಆರಾಳಿಕ": [{"type": "noun", "defs": ["= ಆರಾಲಿಕ."]}], "ಆರಿ": [{"type": "noun", "defs": ["= ಆರಿಕಲ್ಲು."]}, {"type": "noun", "defs": ["the plant Acacia pennata of Mimosae family; rushy mimosa."]}], "ಆರಿಕಲ್ಲು": [{"type": "noun", "defs": ["rounded pieces of ice that are larger than 5 mm and sometimes fall during thunderstorms; frozen raindrops; hailstone."]}], "ಆರಿಕೆ": [{"type": "noun", "defs": ["a Jaina woman under solemn vows."]}], "ಆರಿಡು": [{"type": "verb", "defs": ["to utter a loud, deep, rumbling sound, as from pain, anger, etc.;"]}], "ಆರಿದಗೋತ್ರಜ": [{"type": "noun", "defs": ["(correctly ಹಾರಿದಗೋತ್ರಜ) a descendant of the sage ಹಾರೀತ."]}], "ಆರಿದಾಳ್ಕೆ": [{"type": "noun", "defs": ["= ಆರಿದ್ರಾ."]}], "ಆರಿದ್ರ": [{"type": "noun", "defs": ["= ಆರಿದ್ರಾ."]}], "ಆರಿದ್ರಪುಳು": [{"type": "noun", "defs": ["a small winged-insect that propagates its breed during ಆರಿದ್ರಾ rains."]}], "ಆರಿದ್ರಾ": [{"type": "", "defs": ["a reddish first magnitude star in Orion's shoulder.", "the rains received during the period when this star is apparently associated with the moon. star."]}], "ಆರಿದ್ರೆ": [{"type": "noun", "defs": ["= ಆರಿದ್ರಾ."]}], "ಆರಿನಿಪಟ್ಟಿ": [{"type": "noun", "defs": ["a government document that has the details of the number of ploughs each farmer in a particular area or village has."]}], "ಆರಿಯ": [{"type": "noun", "defs": ["a person of noble family or noble conduct.", "name of a sect or a sub-caste.", "a member of Marāṭha military caste, settled in Karnāṭaka."]}], "ಆರಿವಾಳ": [{"type": "noun", "defs": ["(correctly ಪಾರಿವಾಳ )a bird of the family Columbidae order Columbiformes with a small head, plump body, long, pointed wings, and short legs; pigeon.", "the tree Erythrina variegata = E. indica) of Papilionaceae family; Variegated Indian coral tree."]}], "ಆರಿಸು": [{"type": "verb", "defs": ["to pick up.", "to pick out by preference from what is available; to take as a choice; to select; to choose.", "to gather together.", "to select for some office by voting; to elect."]}, {"type": "verb", "defs": ["to cause to extinguish; to put out (a lamp, fire, etc.).", "to make calm; to calm down; to pacify; to alleviate.", "to make (a liquid or moisture) dried up; to dry.", "to make cool or colder.", "to appease; to satisfy; to please."]}], "ಆರೀಮಣಿ": [{"type": "noun", "defs": ["the plant Solanum verbascifolium of Solanaceae family."]}], "ಆರೀಯ": [{"type": "adjective", "defs": ["of or relating to radius; radial."]}], "ಆರೀಯವೇಗ": [{"type": "noun", "defs": ["the component of velocity along the observeṛs line of sight; radial velocity."]}], "ಆರೀಯಸಮಾಂಗತೆ": [{"type": "noun", "defs": ["the symmetry about several planes intersecting in a common axis; radial symmetry."]}], "ಆರು": [{"type": "verb", "defs": ["to cry or shout aloud; to roar."]}, {"type": "verb", "defs": ["to be satisfied; to get satisfaction.", "to be filled; to become full."]}, {"type": "verb", "defs": ["to be able to; to be capable of.", "to bear; to endure."]}, {"type": "verb", "defs": ["(lamp, fire etc.) to be put of; to become extinguished.", "to become calm.", "to become cool or colder.", "to become dry; to lose water contents.", "to be pacified.", "(wound) to get healed up.", "ಆರಿಹೋಗುವ ದೀಪ (ಜೋರಾಗಿ ಉರಿಯುತ್ತದೆ) ārihōguva dīpa (jōrāgi uriyuttade) (fig.) a dying person (who seemingly looks brighter or more active than actually he or she is)."]}, {"type": "noun", "defs": ["a plough yoked to a pair of oxen."]}, {"type": "adjective", "defs": ["totalling one more than five; six."]}, {"type": "noun", "defs": ["the cardinal number between five and seven; six.", "ಆರಕ್ಕೆ ಏರದೆ, ಮೂರಕ್ಕೆ ಇಳಿಯದೆ ಇರು ārakke ērade mūrakke iḷiyade iru to have no ups and downs; to be in or maintain, an optimum level; ಆರು ದೋಸೆ ಕೊಟ್ಟರೆ ಅತ್ತೆಯ ಕಡೆ, ಮೂರು ದೋಸೆ ಕೊಟ್ಟರೆ ಸೊಸೆಯ ಕಡೆ āru dōse koṭṭare a tteya kaḍe, mūru dōse koṭṭare soseya kaḍe to have no firm conviction of one's own; to be susceptible easily to bribe in giving the judgement, in giving a witness, etc. ಆರು ಹೆತ್ತವಳಿಗೆ ಮೂರು ಹೆತ್ತವಳು ಮುಲುಕು ಕಲಿಸಿದಳಂತೆ āṛu hettavaḷige mūru hettavaḷu muluku kalisidaḷante teach your grand mother to suck eggs; ಆರು ಯತ್ನ ತನ್ನದು, ಏಳನೆಯದು ದೈವೇಚ್ಛೆ āṛu yatna tannadu, ēḷaneyadu daivēcche do all you can, and leave the rest to providence."]}, {"type": "noun", "defs": ["any swine, esp. the unweaned young of the thick-bodied domesticated species (Sus scrofa); pig.", "a decapod with four pairs of legs, one pair of pincers, a flattish shell, and a short, broad abdomen folded under its thorax; a crab.", "a utensil for holding something, as a bowl, pot, kettle, etc."]}, {"type": "pronoun", "defs": ["what or which person or persons.", "a or the person or persons (used in relative clauses) ."]}, {"type": "noun", "defs": ["the drawing of inferences or conclusions from known or assumed facts; use of reason."]}, {"type": "verb", "defs": ["to put yoke on a pair of oxen.", "to carry on agricultural activity."]}], "ಆರುಕಾರು": [{"type": "noun", "defs": ["(pl.) plough and other agricultural implements."]}], "ಆರುಕೆಲಸ": [{"type": "noun", "defs": ["= ಆರುಗೆಲಸ."]}], "ಆರುಕೋರು": [{"type": "noun", "defs": ["= ಆರುಕಾರು."]}], "ಆರುಗಾಲ": [{"type": "noun", "defs": ["the six seasons (of 2 months each).", "ಆರುಗಾಲ ಮಳೆಹೊಯ್ದರೂ ಮುತ್ತುಗಕ್ಕೆ ಮೂರೇ ಎಲೆ ārugāla maḷehoydarū muttugakke mūrē ele he with bad luck, starves amidst plenty."]}], "ಆರುಗೆಲಸ": [{"type": "noun", "defs": ["the work related to agriculture, as ploughing etc."]}], "ಆರುಗೋಲು": [{"type": "noun", "defs": ["a long pole with a broad blade at one end, held in place by an oarlock and used to row a boat; oar."]}], "ಆರುಣ್ಯ": [{"type": "noun", "defs": ["the red colour."]}], "ಆರುಪಾರ": [{"type": "adverb", "defs": ["(dial.) from end to end; (moving) without any obstruction; unimpedingly."]}], "ಆರುಬಟಿ": [{"type": "noun", "defs": ["= ಆರುಭಟೆ."]}], "ಆರುಬಟೆ": [{"type": "noun", "defs": ["= ಆರುಭಟೆ."]}], "ಆರುಭಟ": [{"type": "noun", "defs": ["= ಆರುಭಟೆ."]}], "ಆರುಭಟೆ": [{"type": "noun", "defs": ["a loud roaring sound; bluster."]}], "ಆರುಮೊಗ": [{"type": "noun", "defs": ["the six-faced god, Ṣaṇmukha, son of Śiva."]}], "ಆರುವಾರ": [{"type": "noun", "defs": ["a mortgage of a real estate for the repayment of a loan."]}], "ಆರುವಾರಿ": [{"type": "noun", "defs": ["a person to whom property is mortgaged; a mortgagee."]}], "ಆರುವೆ": [{"type": "noun", "defs": ["a pleasure grove; a garden; a park."]}], "ಆರುಷಣ": [{"type": "noun", "defs": ["the strong-smelling, seed-like fruit of the herb Coriandrum sativum, used in flavouring food; coriander."]}], "ಆರುಷ್ಕರ": [{"type": "adjective", "defs": ["of or relating to cashew tree or its fruit; made of cashew fruit."]}], "ಆರುಷ್ಕರದ್ರವ": [{"type": "noun", "defs": ["an oil-like extract got from the seeds of cashew."]}], "ಆರುಹ": [{"type": "noun", "defs": ["a shouting aloud."]}], "ಆರುಹತ": [{"type": "noun", "defs": ["Jainism, a Hindu religion resembling Buddhism, founded in the 6th century B.C, which emphasises asceticism and reverence for all living things.", "a member of or believer in, Jainism."]}], "ಆರೂಕ": [{"type": "noun", "defs": ["the plant Prunus insititia ( = P. bokhariensis) of Rosaceae family.", "its plum; cherry plum."]}], "ಆರೂಢ": [{"type": "adjective", "defs": ["mounted on; climbed.", "got; obtained.", "undertaken; ventured."]}, {"type": "noun", "defs": ["(phil.) one who has realised the self-knowledge; a mystic.", "the art of domesticating the wild animals like elephant, horse etc. for human use."]}], "ಆರೂಢಕೋಪ": [{"type": "noun", "defs": ["a man in rage; a furious man."]}], "ಆರೂಢತಪ": [{"type": "adjective", "defs": ["that has undertaken the penance."]}], "ಆರೂಢಪಥ": [{"type": "noun", "defs": ["the way of a mystic."]}], "ಆರೂಢಪದವಿ": [{"type": "noun", "defs": ["the destination that has been reached."]}], "ಆರೂಢಪ್ರತಿಜ್ಞ": [{"type": "noun", "defs": ["he who has taken a (religious, social or moral) oath."]}], "ಆರೂಢಯೋಗಿ": [{"type": "noun", "defs": ["an accomplished mystic."]}], "ಆರೂಢವಿದ್ಯೆ": [{"type": "noun", "defs": ["= ಆರೂಢ2- 2."]}], "ಆರೂಢಸರ್ವಜ್ಞ": [{"type": "noun", "defs": ["an expert in the art of domesticating the wild animals like elephant, horse, for human use."]}], "ಆರೂಢಸ್ಥಲ": [{"type": "noun", "defs": ["(vīr.) the state of an accomplished mystic."]}], "ಆರೂಢೆ": [{"type": "noun", "defs": ["a woman who has mounted on.", "an accomplished mystic woman."]}], "ಆರೆ": [{"type": "noun", "defs": ["a long metal bar with wedge-shaped end on one side, used to dig the earth; a crow-bar."]}, {"type": "noun", "defs": ["a small hoof attached behind the hoofs of cattle, horse etc.; a mini-hoof."]}, {"type": "noun", "defs": ["a leather cutting tool; an awl.", "a small knife.", "a sharp-pointed stick used in driving and controlling elephants; a goad."]}, {"type": "noun", "defs": ["one of the radiating bars of a wheel of a cart; a spoke.", "(arith.) a straight line joining the centre and any point on the circumference of a circle; a radius.", "a line joining the origin (i.e. observer's point) and the object moving on a curved line; a line from a fixed point to a point on a curve; a radius."]}, {"type": "noun", "defs": ["a person of noble family or noble conduct.", "name of a sect or a sub-caste.", "a member of Marāṭha military caste, settled in Karnāṭaka."]}, {"type": "noun", "defs": ["a bushy plant Woodfordia fruticosa ( = W. floribunda, = Lythrum fructicosum of Lythraceae family; fire flame bush."]}], "ಆರೆಕಾರ": [{"type": "noun", "defs": ["= ಆರೆ5 - 3."]}], "ಆರೆಕಾಱ": [{"type": "noun", "defs": ["one who controls elephants."]}], "ಆರೆಗಟ್ಟಿಗೆ": [{"type": "noun", "defs": ["a weapon consisting of a long wooden shaft with a sharp point, usually of metal or stone, for thrusting or throwing.", "a long metal bar, with a sharp point, used as a lever for prying, etc. or for digging the earth; a crowbar."]}], "ಆರೆಗಾಱ": [{"type": "noun", "defs": ["= ಆರೆಕಾಱ."]}], "ಆರೆಗೊಂಬು": [{"type": "noun", "defs": ["= ಆರೆಗಟ್ಟಿಗೆ - 1."]}], "ಆರೆಗೋಲು": [{"type": "noun", "defs": ["(dial.) a long 'Y'-shaped wooden piece for handling thorny bushes cut for fuel purpose."]}], "ಆರೆಯ": [{"type": "noun", "defs": ["= = ಆರೆ5."]}], "ಆರೆಲು": [{"type": "noun", "defs": ["(anot.) the outer bone (in supine position) of the fore-arm in man or its homologue in other animals; radius bone."]}], "ಆರೆಲುಬು": [{"type": "noun", "defs": ["= ಆರೆಲು."]}], "ಆರೈ": [{"type": "verb", "defs": ["to look through for the purpose of finding something; to search; to enquire about; to investigate.", "to think seriously and deeply; to ponder; to cogitate.", "to critically examine; to analyse deeply and thoroughly.", "to save; to protect; to foster."]}], "ಆರೈಕೆ": [{"type": "noun", "defs": ["the act or process of examining or analysing.", "the act, instance of thinking seriously and deeply.", "the act or instance of giving protection.", "the act or processing of tending the sick, injured, etc.); nursing."]}], "ಆರೈಕೆಗೊಳ್": [{"type": "verb", "defs": ["to oversee, direct or manage (work, workers, a project, etc.); to superintend; to supervise."]}], "ಆರೈಸು": [{"type": "verb", "defs": ["= ಆರೋಗಿಸು."]}, {"type": "verb", "defs": ["to get looked through for the purpose of finding something; to cause to search.", "to cause to examine critically.", "to show respect; to regard."]}], "ಆರೊಗಿಸು": [{"type": "verb", "defs": ["= (rightly) ಆರೋಗಿಸು."]}], "ಆರೋಗಣ": [{"type": "noun", "defs": ["= (rightly) ಆರೋಗಣೆ."]}], "ಆರೋಗಣಂಗೆಯ್": [{"type": "verb", "defs": ["= ಆರೋಗಣೆಗೆಯ್."]}], "ಆರೋಗಣೆ": [{"type": "noun", "defs": ["the act of taking food; dining."]}], "ಆರೋಗಣೆಗೆಯ್": [{"type": "verb", "defs": ["to take food; to dine."]}], "ಆರೋಗಿಸು": [{"type": "verb", "defs": ["to take meal."]}], "ಆರೋಗ್ಯ": [{"type": "noun", "defs": ["absence of sickness or disease; sound bodily or mental condition; the condition of wholesomeness; health.", "ಆರೋಗ್ಯವೇ ಭಾಗ್ಯ ārōgyavē bhāgya (saying) good health is wealth, while poor health is poverty."]}], "ಆರೋಗ್ಯಕರ": [{"type": "adjective", "defs": ["helping to produce, promote or maintain health; salutary; wholesome; healthful."]}], "ಆರೋಗ್ಯಕಾರಕ1": [{"type": "adjective", "defs": ["= ಆರೋಗ್ಯಕರ."]}], "ಆರೋಗ್ಯಕಾರಕ2": [{"type": "", "defs": ["that which helps to produce, promote or maintain good health."]}], "ಆರೋಗ್ಯಕೇಂದ್ರ": [{"type": "noun", "defs": ["an institution providing medical treatment for people who are ill, injured, pregnant, etc. on an inpatient, outpatient or emergency care basis; a hospital."]}], "ಆರೋಗ್ಯಗೃಹ": [{"type": "noun", "defs": ["= ಆರೋಗ್ಯಕೇಂದ್ರ.", "2) a shop where medicines and medical supplies are sold; a drugstore."]}], "ಆರೋಗ್ಯಗೊಳಿಸು": [{"type": "verb", "defs": ["to cause to get good health; to cure disease, pain, etc."]}], "ಆರೋಗ್ಯಚಕ್ರ": [{"type": "noun", "defs": ["(myst.) a diagram or an amulet worshipped for gaining or regaining good health."]}], "ಆರೋಗ್ಯಧಾಮ": [{"type": "noun", "defs": ["a place which is conducive to health for sick people; a health-resort."]}], "ಆರೋಗ್ಯಭಾಗ್ಯ": [{"type": "noun", "defs": ["health, considered as wealth."]}], "ಆರೋಗ್ಯಮಣಿ": [{"type": "noun", "defs": ["a pearl or a stone, water with which it is bathed is supposed to help regaining the health."]}], "ಆರೋಗ್ಯವಂತ": [{"type": "noun", "defs": ["a healthy man."]}], "ಆರೋಗ್ಯವಂತೆ": [{"type": "noun", "defs": ["a healthy woman."]}], "ಆರೋಗ್ಯಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["the science of preserving health; sanitary principle."]}], "ಆರೋಗ್ಯಸ್ಥಾನ": [{"type": "noun", "defs": ["= ಆರೋಗ್ಯಧಾಮ."]}], "ಆರೋಚಕ": [{"type": "adjective", "defs": ["that stimulates the taste buds."]}, {"type": "noun", "defs": ["that which stimulates the taste buds.", "a bit of something that excites a desire for more."]}], "ಆರೋಪ": [{"type": "noun", "defs": ["an attributing the nature or property of one thing to the another.", "a charge; accusation, formally written or oral charging one with the commission of a crime.", "an act of attacking; an inroad; invasion."]}], "ಆರೋಪಣ": [{"type": "noun", "defs": ["the act of putting, laying or stacking on top of something else; superimposition.", "an indictment; an accusation.", "the act of stringing a bow."]}], "ಆರೋಪಣಂಗೆಯ್": [{"type": "verb", "defs": ["to sprinkle the rice grains mixed with kumkum, saffron. etc. as a mark of blessing.", "to charge with accusation; to accuse."]}], "ಆರೋಪಣೆ": [{"type": "noun", "defs": ["= ಆರೋಪಣ."]}], "ಆರೋಪ ಪಟ್ಟಿ": [{"type": "noun", "defs": ["a formal list of charges, usu. written, made against a person (usu. submitted to a magistrate or other legal officer for enquiring and taking action against; a charge sheet."]}], "ಆರೋಪಿ": [{"type": "noun", "defs": ["a person who is charged with imputation; an accused."]}], "ಆರೋಪಿತ": [{"type": "adjective", "defs": ["laid or stacked on top of something; superimposed.", "(a bow) tied with the string.", "indicted; accused (with a fault, crime, etc.); charged.", "(force) applied, exerted on."]}, {"type": "noun", "defs": ["= ಆರೋಪಿ.", "2) (phil.) an object mistook for some other object."]}], "ಆರೋಪಿಸು": [{"type": "verb", "defs": ["to bring formal charges against (of doing wrong, breaking the law, etc.); to accuse; to charge."]}], "ಆರೋಮಿ": [{"type": "noun", "defs": ["a kind of deer whose bushy tail is used to make chowries."]}], "ಆರೋಹ": [{"type": "noun", "defs": ["= ಆರೋಹಿ2 - 1.", "the act of ascending; a climbing; a mounting on.", "an elevated place.", "length.", "the waist of a woman.", "the buttocks."]}], "ಆರೋಹಕ": [{"type": "noun", "defs": ["= ಆರೋಹಿ2 - 1.", "2) one who climbs; a climber."]}], "ಆರೋಹಕತನ": [{"type": "noun", "defs": ["the act of riding (a horse, etc.).", "the profession of a (horse) rider."]}], "ಆರೋಹಕೌಶಲ": [{"type": "noun", "defs": ["the skill of riding (a horse)."]}], "ಆರೋಹಣ": [{"type": "noun", "defs": ["the act, fact or an instance of climbing, rising; mounting.", "the condition or fact of being dependent.", "a flight of steps or one of the step forming a stairway.", "framework consisting of two parallel sidepieces connected by a series of rungs or crosspieces on which a person steps in climbing up or down; a ladder.", "the upward movement of musical notes.", "the ascending order of the musical notes."]}], "ಆರೋಹಣಂಗೆಯ್": [{"type": "verb", "defs": ["to go up; to move upward; to rise; to ascend."]}], "ಆರೋಹಿ": [{"type": "adjective", "defs": ["scansorial - a) of or adapted for climbing; b) that climbs or can climb."]}, {"type": "noun", "defs": ["one who is mounted or mounts in the course of his profession, on a horse, elephant etc.; a rider of a motor-cycle, cycle, etc.", "a mountain climber.", "(astrol.) a star or a planet, that is moving from a lower position to a higher one."]}], "ಆರೋಹಿಗ್ರಹ": [{"type": "noun", "defs": ["= ಆರೋಹಿ2 - 3."]}], "ಆರೋಹಿಣಿ": [{"type": "noun", "defs": ["a woman who climbs, moves upward.", "(astrol.) the path of stars or planets that move from a lower to a higher position."]}], "ಆರೋಹಿದಶೆ": [{"type": "noun", "defs": ["the course or an instance of going upward.", "(astrol.) the course or instance of stars, plants, moving towards a higher position."]}], "ಆರೋಹಿಪಕ್ಷಿ": [{"type": "noun", "defs": ["a member of an order of birds (in old classification) climber with two toes before and two behind; scansores."]}], "ಆರೋಹಿಸು": [{"type": "verb", "defs": ["to go or come from a lower to a higher place, position or degree; to rise or to be raised; to climb; to ascend."]}], "ಆರ್ಕಾಟಿ": [{"type": "noun", "defs": ["a pilot - a) a person licensed to direct ships into or out of a harbour or through difficult waters; b) a person qualified to operate the controls of an aircraft or spacecraft."]}], "ಆರ್ಕಾಲು": [{"type": "noun", "defs": ["any of broad-bodied, four-winged, six-footed, hairy hymenopteran insects which belong to a large super family Apoidea, which gather pollen and nectar, have biting as well as sucking mouthparts, and often live in organised colonies; a bee."]}], "ಆರ್ಕ್ಯ": [{"type": "adjective", "defs": ["of or relating to the god Saturn."]}], "ಆರ್ಕ್ಯವಾರ": [{"type": "noun", "defs": ["the seventh and last day of the week; Saturday."]}], "ಆರ್ಗಳ್": [{"type": "noun", "defs": ["(pl.) people whose mother tongue is Tuḷu."]}], "ಆರ್ಘ": [{"type": "noun", "defs": ["materials used in offering service to the god.", "the holy water meant for bathing the idol of a deity."]}], "ಆರ್ಜನ": [{"type": "noun", "defs": ["= ಆರ್ಜನೆ."]}], "ಆರ್ಜನಶೀಲ": [{"type": "adjective", "defs": ["inclined to, interested in, acquiring (wealth, knowledge, etc.); acquisitive."]}, {"type": "noun", "defs": ["a man eager to acquire or good at getting, wealth, knowledge etc. an acquisitive man."]}], "ಆರ್ಜನಶೀಲತೆ": [{"type": "noun", "defs": ["the quality of being acquisitive; acquisitiveness."]}], "ಆರ್ಜನಶೀಲೆ": [{"type": "noun", "defs": ["a woman eager to acquire or good at getting, wealth, knowledge etc. an acquisitive woman."]}], "ಆರ್ಜನೆ": [{"type": "noun", "defs": ["the act of gaining; acquisition; earning.", "that which is earned; earnings."]}], "ಆರ್ಜವ": [{"type": "noun", "defs": ["the state or quality of being honest; honesty - a) a refraining from lying, cheating or stealing; a being truthful, trustworthy or upright; b) sincerity; fairness; straightforwardness; c) chastity.", "balance of mind; steadfastness.", "an observing delightfully of one's daily rituals.", "the state or quality of being humble; absence of pride or self-assertion; humility; humbleness.", "a man of rectitude, uprightness or humility.", "a following humbly another for favour, protection, etc."]}], "ಆರ್ಜವವೃತ್ತಿ": [{"type": "noun", "defs": ["the state or quality of being humble; absence of pride or self-assertion; humility."]}], "ಆರ್ಜಿಕೆ": [{"type": "noun", "defs": ["a Jaina religious woman under solemn vows."]}], "ಆರ್ಜಿತ": [{"type": "adjective", "defs": ["that is earned; acquired; gained; obtained."]}], "ಆರ್ಜಿಸು": [{"type": "verb", "defs": ["to earn - a) to receive (salary, wages, etc.) for one's labour or service; b) to get or deserve as a result of something one has done; c) to gain (interest, etc.) as profit; d) to acquire; to have the possession of."]}], "ಆರ್ತ": [{"type": "adjective", "defs": ["afflicted with; struck by; suffering from.", "being sick; diseased."]}, {"type": "noun", "defs": ["= ಆರ್ತಧ್ಯಾನ.", "an afflicted, distressed man.", "a sick man.", "a man who has a or some desires.", "the state of being distressed; pain, suffering, discomfort, etc.; distress; affliction.", "a desire; a wish."]}, {"type": "noun", "defs": ["an able man; a competent man."]}], "ಆರ್ತಂಗಿಡು": [{"type": "verb", "defs": ["to lose hope; to get disappointed; to become desperate."]}], "ಆರ್ತಂಗೊಳ್": [{"type": "verb", "defs": ["to become distressed; to undergo affliction; to become sad."]}], "ಆರ್ತಗಲ": [{"type": "noun", "defs": ["the plant Barleria polytricha of Acanthaceae family."]}], "ಆರ್ತಗಳ": [{"type": "noun", "defs": ["= ಆರ್ತಗಲ."]}], "ಆರ್ತಜನ": [{"type": "noun", "defs": ["distressed or afflicted people."]}], "ಆರ್ತತೆ": [{"type": "noun", "defs": ["the condition of being afflicted.", "the state or quality of being humble; humility; humbleness."]}], "ಆರ್ತಧ್ಯಾನ": [{"type": "noun", "defs": ["(Jain.) the tendency of the mind in, while longing for absorbing itself in comfortable and pleasant indulgences, rejecting unwanted and uncomfortable ones."]}], "ಆರ್ತಧ್ವನಿ": [{"type": "noun", "defs": ["the voice of a person in distress or affliction; a yelling for help."]}], "ಆರ್ತನಾದ": [{"type": "noun", "defs": ["= ಆರ್ತಧ್ವನಿ."]}], "ಆರ್ತರೌದ್ರ": [{"type": "noun", "defs": ["(Jain.) a contemplating to inflict damage, injury or punishment in return for an injury, insult, distress."]}], "ಆರ್ತವ": [{"type": "adjective", "defs": ["relating to or depending on, the seasons.", "of or relating to the menstrual flow or a menstrual period; menstrual.", "of or having the menses; menstrual."]}, {"type": "noun", "defs": ["the periodic flow of blood and sloughed-off tissue from the uterus, discharged through the genital tract, which normally occurs about every four weeks in a woman who is not pregnant, from menarche to menopause; menses."]}], "ಆರ್ತವೆ": [{"type": "noun", "defs": ["a girl or woman inher menses period."]}], "ಆರ್ತಸ್ವರ": [{"type": "noun", "defs": ["= ಆರ್ತಧ್ವನಿ."]}], "ಆರ್ತಿ": [{"type": "noun", "defs": ["a reddish first magnitude star in Orion's shoulder.", "the rains during the period of this star."]}, {"type": "noun", "defs": ["very great mental or physical pain; the state of being distressed; pain, suffering, discomfort, etc.", "anything that distresses; agony; distress; affliction.", "the state or fact of being low in condition, rank, position. etc.", "the end of a bow.", "want of health; sickness; disease.", "a strong liking to have, possess, enjoy, etc.; desire.", "the state of being destroyed; ruin; destruction."]}], "ಆರ್ತು": [{"type": "pronoun", "defs": ["whose; of whom."]}, {"type": "noun", "defs": ["ability, competence - a) a being able; power to do (something physical or mental); b) skill, expertness or talent required for that."]}], "ಆರ್ತೆ": [{"type": "noun", "defs": ["a woman in distress or affliction."]}], "ಆರ್ತ್ಯ": [{"type": "adjective", "defs": ["wished for; desired."]}], "ಆರ್ತ್ವಿಜ್ಯ": [{"type": "noun", "defs": ["the office and business of a priest; his rank."]}], "ಆರ್ಥಪರಿಚ್ಛೇದ": [{"type": "noun", "defs": ["money given as an equivalent to or to make amends for a loss, damage, etc.; recompense; financial compensation."]}], "ಆರ್ಥಿಕ": [{"type": "noun", "defs": ["economic - a) of or having to do with the management of the income, expenditures, etc. of a household, business, community or government; b) of or having to do with the production, distribution, and consumption of wealth; c) of or having to do with economics."]}], "ಆರ್ಥಿಕಕ್ಷೋಭೆ": [{"type": "noun", "defs": ["an unstable time with the distinct possibility of a highly undesirable outcome in the economics esp. of a state; economic crisis."]}], "ಆರ್ಥಿಕತೆ": [{"type": "noun", "defs": ["the condition, management etc. of the material resources of a country; economics.", "the pecuniary position of a state organisation or an individual person."]}], "ಆರ್ಥಿಕನ್ಯಾಯ": [{"type": "noun", "defs": ["a policy or rule made based on the material resources available, and their distribution; economic laws."]}], "ಆರ್ಥಿಕಭೂಗೋಳ": [{"type": "noun", "defs": ["= ಆರ್ಥಿಕಭೂಗೋಳ ಶಾಸ್ತ್ರ."]}], "ಆರ್ಥಿಕಭೂಗೋಳ ಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["the study of geography in relation to economics; economic geography."]}], "ಆರ್ದರಕ": [{"type": "noun", "defs": ["= ಆರ್ದ್ರ2."]}], "ಆರ್ದ್ರ": [{"type": "adjective", "defs": ["suggestive of the presence of water; slightly wet; damp; moist.", "recently produced, obtained or arrived; newly made; fresh; new.", "not hard or harsh; soft.", "immersed in; absorbed in; deeply interested in."]}, {"type": "noun", "defs": ["the herb Zingiber officinale of Zingiberaceae family.", "its aromatic rhizome used as a spice or perfume; common ginger."]}], "ಆರ್ದ್ರಕ": [{"type": "noun", "defs": ["= ಆರ್ದ್ರ2.", "an apparatus for dampening; a device that dampens; a damper."]}], "ಆರ್ದ್ರಕ್ಷತ": [{"type": "noun", "defs": ["a wound that is still un-healed."]}], "ಆರ್ದ್ರಜಲ": [{"type": "noun", "defs": ["fresh or undefiled water.", "cold water."]}], "ಆರ್ದ್ರತಾದರ್ಶಕ": [{"type": "noun", "defs": ["an instrument that indicates, without actually measuring, changes in atmospheric humidity, as by swelling or colour change; a hygroscope."]}], "ಆರ್ದ್ರತಾಭಾವ": [{"type": "noun", "defs": ["tenderness; softness.", "kindliness; softness of feelings."]}], "ಆರ್ದ್ರತಾಮಾಪಕ": [{"type": "noun", "defs": ["any of various instruments for measuring the absolute or relative amount of moisture in the air; hygrometer."]}], "ಆರ್ದ್ರತಾಮಾಪನ": [{"type": "noun", "defs": ["a measuring of the humidity of the air or other gases; hydrometry."]}], "ಆರ್ದ್ರತೆ": [{"type": "noun", "defs": ["the condition of being wet; dampness; humidity.", "softness (of feelings); kindliness; tender-heartedness."]}], "ಆರ್ದ್ರತ್ವ": [{"type": "noun", "defs": ["= ಆರ್ದ್ರತೆ."]}], "ಆರ್ದ್ರದೇಶಕ": [{"type": "noun", "defs": ["a musical mode, derived from the main mode Māyāmāḷavagauḷa, in Karnāṭaka system."]}], "ಆರ್ದ್ರದೇಶಿ": [{"type": "noun", "defs": ["= ಆರ್ದ್ರದೇಶಕ."]}], "ಆರ್ದ್ರಭಾವ": [{"type": "noun", "defs": ["= ಆರ್ದ್ರತಾಭಾವ - 1 & 2; 3) the state of being damp; wet-condition."]}], "ಆರ್ದ್ರಮತಿ": [{"type": "noun", "defs": ["tender-heartedness; kindliness.", "a person with tender-heartedness."]}], "ಆರ್ದ್ರಹೃದಯ": [{"type": "noun", "defs": ["= ಆರ್ದ್ರಮತಿ."]}], "ಆರ್ದ್ರಾಂತರಂಗ": [{"type": "noun", "defs": ["= ಆರ್ದ್ರಮತಿ."]}], "ಆರ್ದ್ರಾಂಬರಿ": [{"type": "noun", "defs": ["a musical mode, derived from the main mode Māyāmāḷavagauḷa, in Karnāṭaka system."]}], "ಆರ್ದ್ರಾಕ್ಷತ": [{"type": "noun", "defs": ["full grains of wet rice mixed with turmeric, which is still wet."]}], "ಆರ್ದ್ರಾಶಯ": [{"type": "noun", "defs": ["= ಆರ್ದ್ರಮತಿ."]}], "ಆರ್ದ್ರಿ": [{"type": "noun", "defs": ["the plant Callicalpa tomentosa (=C. lantana) of Verbenaceae family."]}], "ಆರ್ದ್ರೀಕರಣ": [{"type": "noun", "defs": ["the act of humidifying; humidification.", "the act or process of becoming liquid by absorbing moisture from the air; deliquescence."]}], "ಆರ್ದ್ರೀಕರಿಸು": [{"type": "verb", "defs": ["to make humid; to humidify.", "to cause to become tender or soft.", "to cause to melt and become liquid by absorbing moisture, as certain salts; to deliquesce."]}], "ಆರ್ದ್ರೀಭೂತ": [{"type": "adjective", "defs": ["humidified; moistened; dampened.", "that has become soft; tender."]}], "ಆರ್ದ್ರೆ": [{"type": "noun", "defs": ["a reddish first magnitude star in Orion's shoulder.", "the rains received during the period when this star is apparently associated with the moon. star."]}], "ಆರ್ಪನ್": [{"type": "noun", "defs": ["an able, capable man."]}], "ಆರ್ಪರ್": [{"type": "noun", "defs": ["(pl.) able, capable persons."]}], "ಆರ್ಪಳ್": [{"type": "noun", "defs": ["an able, capable woman."]}], "ಆರ್ಪಳಿ": [{"type": "verb", "defs": ["to lose one's courage, self-confidence; to become nervous."]}], "ಆರ್ಪಿಗ": [{"type": "noun", "defs": ["a valorous man; a hero."]}], "ಆರ್ಪು": [{"type": "noun", "defs": ["bravery; prowess; valour; might.", "the quality of being intense; esp. a) extreme degree of anything; b) great energy or vehemence of emotion, thought or activity; intensity; impetuousness.", "the state, quality or habit of being kind; kindness."]}, {"type": "noun", "defs": ["a loud, deep, rumbling sound, as of a lion; roar."]}], "ಆರ್ಪುಗಾರ": [{"type": "noun", "defs": ["= ಆರ್ಪಿಗ."]}], "ಆರ್ಪುಗುಂದು": [{"type": "verb", "defs": ["to lose one's strength; to become weak."]}], "ಆರ್ಪುಗೆಯ್ತ": [{"type": "noun", "defs": ["an act of or fit to be of, a hero; a gallant act."]}], "ಆರ್ಪೊಡೆ": [{"type": "conjunction", "defs": ["if possible.", "if so, but."]}], "ಆರ್ಬಟ": [{"type": "noun", "defs": ["= ಆರ್ಭಟೆ."]}], "ಆರ್ಬಟಿಸು": [{"type": "verb", "defs": ["= ಆರ್ಭಟಿಸು."]}], "ಆರ್ಬಟೆ": [{"type": "noun", "defs": ["= ಆರ್ಭಟೆ."]}], "ಆರ್ಭಟ": [{"type": "noun", "defs": ["= ಆರ್ಭಟೆ."]}], "ಆರ್ಭಟಂಗೊಡು": [{"type": "verb", "defs": ["to roar like a lion or a bull."]}], "ಆರ್ಭಟಿಸು": [{"type": "verb", "defs": ["to cry aloud; to roar; to bluster."]}], "ಆರ್ಭಟೆ": [{"type": "noun", "defs": ["a loud roaring sound; bluster."]}], "ಆರ್ಭಡಿಸು": [{"type": "verb", "defs": ["= ಆರ್ಭಟಿಸು."]}], "ಆರ್ಮ": [{"type": "noun", "defs": ["a place of protection; a resort.", "a place of natural availability; an abode.", "that which is favourable.", "that which causes happiness and prosperity."]}], "ಆರ್ಮೊಗ": [{"type": "noun", "defs": ["the god with six faces, Ṣaṇmukha, son of Śiva."]}], "ಆರ್ಯ": [{"type": "adjective", "defs": ["Indo-Germanic; Indo-European, Indo-Iranian - now generally Indian.", "of or belonging to their languages.", "worthy; respectable; noble; honourable."]}, {"type": "noun", "defs": ["a man with good behaviour.", "a respectable man.", "a man of noble birth.", "a man of Brāhmaṇa caste.", "a man of traders' caste.", "a man who leads a life of contemplation and rigorous self-denial for religious purposes; an ascetic.", "a teacher; a preceptor.", "a sect among Śaivas, also known as ārādhya.", "an elderly man.", "the sun.", "(masc.) a friend; a pal.", "a man who is born in land considered to be the land for comforts, enjoyments.", "a member of the Indo-Germanic, Indo-European or Indo-Iranian race, (now, esp. belonging to India).", "that race race.", "an officer in the women-quarters in a palace.", "a sect among weavers.", "the parent Indo-European language.", "a metre, regulated by the number of syllabic instants, having twelve syllable instants each in the first and third quarters and eighteen in the second, and fifteen in the fourth quarters."]}]}