{"ಪಂಕಿಳಿಸು": [{"type": "verb", "defs": ["to dissolve mud, dirt or such other matter in water.", "to stir up the mud, mire that is at the bottom of water, as to make the water dirty."]}], "ಪಂಕೇಜ": [{"type": "noun", "defs": ["= ಪಂಕಜ - 1 & 2."]}], "ಪಂಕೇರುಹ": [{"type": "noun", "defs": ["= ಪಂಕಜ - 1 & 2."]}], "ಪಂಕ್ತಿ": [{"type": "noun", "defs": ["a number of people or things arranged so as to form a line; a row; a file.", "a group, flock, herd, multitude or troop.", "people sitting down in a row for taking meals.", "any of a series of such horizontal lines in parallel, as of seats in a theatre or airplane, lines of plants in a field, etc.", "a row of written or printed characters extending across or part way across a page; a line.", "a single row of words or characters making up a unit of poetry, often, of a specified number of feet.", "fame; reputation; renown.", "a group, set or row of five.", "(math.) a symbol for the number five.", "(math.) a symbol for the number ten.", "(pros.) a class of meters having ten syllables in each line.", "a Vedic metre having five lines of eight syllables each."]}], "ಪಂಕ್ತಿಕೆ": [{"type": "noun", "defs": ["= ಪಂಕ್ತಿ - 1."]}], "ಪಂಕ್ತಿಭೇದ": [{"type": "noun", "defs": ["partiality in serving guests.", "ಪಂಕ್ತಿಭೇದ ಮಾಡು paŋkti bhēda māḍu to treat different people sitting in the same row differently or to treat a few preferentially or biasedly."]}], "ಪಂಕ್ತಿಭೋಜನ": [{"type": "noun", "defs": ["a community meal taken sitting down in a single row.", "a meal taken sitting down with another person."]}], "ಪಂಕ್ತಿಭ್ರಷ್ಟ": [{"type": "noun", "defs": ["a man who is unfit to sit for taking meals with others in the same row."]}], "ಪಂಕ್ತಿಯೋಗ್ಯ": [{"type": "noun", "defs": ["a man who is fit to sit for taking meals with others in the same row."]}], "ಪಂಖ": [{"type": "noun", "defs": ["any device for producing a current of air by the movement of a broad blades or a number of such surfaces; a fan."]}], "ಪಂಖಾ": [{"type": "noun", "defs": ["= ಪಂಖ."]}], "ಪಂಗ": [{"type": "noun", "defs": ["a part of one's income, produce, etc. that is to be given to the ruler as tax."]}, {"type": "noun", "defs": ["any woody extension growing from the trunk or main stem or from a main limb, of a tree or shrub; a branch.", "anything of \"U\" or \"V\" shape."]}, {"type": "noun", "defs": ["= ಪಂಗುಳ."]}, {"type": "noun", "defs": ["any of several birds of the family Coraciidae that tumble or roll over in flight as Coracias indica, Boracus Indica the flight of which is consulted as an omen or Coracias benghalensis, etc.; the Indian roller."]}], "ಪಂಗಡ": [{"type": "noun", "defs": ["a large number of people gathered closely together; a crowd.", "a group of people constituting one side in a contest or competition; a team of players.", "a group of people working together in a coordinated effort; a team of workers, doctors, etc.", "that which is distinct, entirely different from another.", "a group of people belonging to a particular tribe, social, religious class, etc.; a clan or sub-caste."]}], "ಪಂಗಣಿಗಪ್ಪು": [{"type": "noun", "defs": ["a deep, wide pit for catching wild elephants."]}], "ಪಂಗತಪ್ಪು": [{"type": "noun", "defs": ["a penalty imposed on an individual who has defaulted in paying the tax to the king."]}], "ಪಂಗತಿ": [{"type": "noun", "defs": ["= ಪಂಕ್ತಿ - 1."]}], "ಪಂಗನಾಮ": [{"type": "noun", "defs": ["the fork-shaped sectarian mark the Śrīvaiṣṇavas put on their forehead.", "(fig.) an action or device designed to deceive, cheat, outwit, etc.; artifice; a trick.", "ಪಂಗನಾಮ ಹಾಕು paŋga nāma hāku to deceive or swindle; to trick."]}], "ಪಂಗಲು": [{"type": "noun", "defs": ["= ಪಂಗ2."]}], "ಪಂಗಾಗೆ": [{"type": "noun", "defs": ["= ಪಂಗ4."]}], "ಪಂಗಾಯ್": [{"type": "noun", "defs": ["a green, hence unripe, fruit."]}], "ಪಂಗಾವಣ": [{"type": "noun", "defs": ["a temporary roof of green leaves (as of coconut, mango leaves) erected on four poles, for a religious or social celebration."]}], "ಪಂಗಿಗ": [{"type": "noun", "defs": ["a man who is indebted or obliged to another under obligation, moral responsibility or gratitude.", "a man depending, relying on another."]}], "ಪಂಗು": [{"type": "noun", "defs": ["= ಪಂಗ1."]}, {"type": "noun", "defs": ["the condition or fact of being indebted to another for a favour or service received; indebtedness; gratitude.", "anything that is inevitable, unavoidable, etc.; necessity.", "a favour, support, help, etc. received from another.", "a strong wish or craving; a desire.", "the fact of depending, relying on another; dependence.", "a being connected or related; relation; connection."]}, {"type": "adjective", "defs": ["crippled; impaired; not moving or functioning properly."]}, {"type": "noun", "defs": ["= ಪಂಗುಳ."]}], "ಪಂಗುತ್ವ": [{"type": "noun", "defs": ["the state of being crippled; lameness."]}], "ಪಂಗುನಿ": [{"type": "noun", "defs": ["Mīna, the twelfth month in the Hindu solar calendar."]}], "ಪಂಗುಳ": [{"type": "noun", "defs": ["a man having a crippled leg or legs; a lame man."]}], "ಪಂಗುಳೆ": [{"type": "noun", "defs": ["= ಪಂಗೋಳಿ."]}], "ಪಂಗೂಳಿ": [{"type": "noun", "defs": ["= ಪಂಗೋಳಿ."]}], "ಪಂಗೋಳಿ": [{"type": "noun", "defs": ["a contemptible or useless man."]}], "ಪಂಚ": [{"type": "noun", "defs": ["a thing that is not frequently encountered or is scarce; a rare thing."]}, {"type": "adjective", "defs": ["amounting to five in number; five."]}, {"type": "noun", "defs": ["the cardinal number five.", "a member of the group of people who hear the evidence and inquire into the facts in a litigation in a village or town; a jury.", "a member of a commission authorised to perform certain duties or tasks."]}, {"type": "adjective", "defs": ["extending over a larger area from side to side than is usual or normal; wide; broad."]}], "ಪಂಚಕ": [{"type": "noun", "defs": ["a group or set of five people, things or values.", "that which is made of or consisting of five elements.", "the site of a battle; battlefield.", "a bundle (as of paper).", "a measure of grains equal to five Koḷagas.", "a land got as a tax-free gift.", "(math.) a symbol for the number five.", "(astrol.) a group of five consecutive lunar mansions (Mřgaśirā, ārdrā, Punarvasu, Puṣya, and āślēṣā)."]}], "ಪಂಚಕಚೇರಿ": [{"type": "noun", "defs": ["the office of village juries."]}], "ಪಂಚಕಚ್ಚೆ": [{"type": "noun", "defs": ["a manner of wearing dhōti, tucking up at points."]}], "ಪಂಚಕಜ್ಜಾಯ": [{"type": "noun", "defs": ["a kind of sweet cake made using groundnut, jaggery, copra, fried Bengal gram, and sesame, for offering to a god."]}], "ಪಂಚಕಠಾರಿ": [{"type": "noun", "defs": ["a kind of dagger."]}], "ಪಂಚಕರಣ": [{"type": "noun", "defs": ["(pl.) the five organs - the eyes, ears, nose, tongue and skin.", "(pl.) the five functional organs - speech, hands, feet, anus and sexual organs.", "(pl.) the five internal organs, - the thoughts, intellect, ego, mind, and knowledge."]}], "ಪಂಚಕರ್ಣ": [{"type": "noun", "defs": ["a closed plane figure with five angles and five sides; a pentagon."]}], "ಪಂಚಕರ್ಮ": [{"type": "noun", "defs": ["a treatment that includes emetics, purgative medicines, sternutatories and enemas of two kinds (oily and non-oily)."]}], "¥Àಂಚಕಲಶ": [{"type": "noun", "defs": ["(pl.) five small water vessels with a small mouths, used in worshipping and other auspicious occasions, as a symbol of the universe (or cosmic waters) and its generative power."]}], "ಪಂಚಕಲ್ಯಾಣ": [{"type": "noun", "defs": ["a horse with whose feet and mouth are white.", "an elephant having auspicious features.", "(Jain.) the five religious ceremonies observed during the life of a spiritual Jain teacher (from his birth to death)."]}], "ಪಂಚಕಲ್ಯಾಣಿ": [{"type": "noun", "defs": ["= ಪಂಚಕಲ್ಯಾಣ - 1."]}], "ಪಂಚಕಸೆ": [{"type": "noun", "defs": ["= ಪಂಚಕಚ್ಚೆ."]}], "ಪಂಚಕಳಶ": [{"type": "noun", "defs": ["= ಪಂಚಕಲಶ."]}], "ಪಂಚಕಾರುಕ": [{"type": "noun", "defs": ["(pl.) the five artisans of a village - carpenters, goldsmiths, blacksmiths, masons and braziers (or, according to some, carpenters, weavers, barbers, washermen and cobblers).", "a tax levied on the professions of these artisans."]}], "ಪಂಚಕೃತ್ಯ": [{"type": "noun", "defs": ["(pl.) the five functions designed by the Divine Grace - creation, maintenance, final destruction, a being out of sight (disappearance) and benevolence (or bestowal).", "(pl.) the five professions - swordsmanship, writing, agriculture, commerce and sculpture [?]."]}], "ಪಂಚಕೋಣ": [{"type": "noun", "defs": ["(geom.) a closed plane figure with five angles and five sides; a pentagon.", "(myth.) one of the hells."]}], "ಪಂಚಕೋಲ": [{"type": "noun", "defs": ["(pl.) the five spices - long pepper, its root, Piper chaba, plumbago and dry ginger."]}], "ಪಂಚಕೋಶ": [{"type": "noun", "defs": ["(yoga.) (pl.) the five sheaths or vestures of the soul (the five layers forming the gross, subtle and causal bodies in the complex structure of the human personality)."]}], "ಪಂಚಕ್ಲೇಶ": [{"type": "noun", "defs": ["(pl.) the five kinds of pains that afflict the soul."]}], "ಪಂಚಕ್ಷೇತ್ರ": [{"type": "noun", "defs": ["(pl.) the five holiest Śaiva pilgrim centres in India - Sri Śaila, Kāśi, Kēdāra, Kāḷahasti, and Paṭṭisa."]}], "ಪಂಚಗಜ್ಜಾಯ": [{"type": "noun", "defs": ["= ಪಂಚಕಜ್ಜಾಯ."]}], "ಪಂಚಗಟ್ಟೆ": [{"type": "noun", "defs": ["a place where village juries generally meet to hear and decide the disputes of local people."]}], "ಪಂಚಗವ್ಯ": [{"type": "noun", "defs": ["(pl.) the five things derived from the cow - milk, curds, clarified butter, urine and dung (held as auspicious).", "a mixture of these things."]}], "ಪಂಚಗಾರ್ತಿ": [{"type": "noun", "defs": ["the wife of any of the men belonging to panca kāruka, the five kinds of artisans.", "a woman belonging to any of these artisanś castes."]}], "ಪಂಚಗಾಲು": [{"type": "noun", "defs": ["= ಪಂಚಕಲ್ಯಾಣ - 1."]}], "ಪಂಚಗುಂಡಿಗೆ": [{"type": "noun", "defs": ["(fig.) extra-ordinary courage."]}], "ಪಂಚಗುಪ್ತ": [{"type": "noun", "defs": ["a tortoise that hides its four legs and the head in its hard shell.", "the philosophic doctrine that matter is the only reality and that everything in the world, including thought, will, and feeling, can be explained only in terms of it; materialism."]}], "ಪಂಚಗುಲ್ಮ": [{"type": "noun", "defs": ["a disease characterised by the enlargement of the spleen."]}], "ಪಂಚಗೌಡ": [{"type": "noun", "defs": ["the five regions in ancient India - Sārasvata, Kānyākubja, Gauḍa, Utkala and Maithila.", "(pl.) the five Brāhmaṇa clans originated from these regions.", "(pl.) the languages of these five regions."]}], "ಪಂಚಗೌಳ": [{"type": "noun", "defs": ["= ಪಂಚಗೌಡ."]}], "ಪಂಚಘಂಟೆ": [{"type": "noun", "defs": ["an ornament for elephants, consisting of large bells."]}], "ಪಂಚಜನ": [{"type": "noun", "defs": ["(pl.) the five classes of beings - gods, human beings, Gandharvas, serpents and manes.", "a human being."]}], "ಪಂಚತಂತ್ರ": [{"type": "noun", "defs": ["(pl.) the five expedients used in politics.", "the well-known collection of moral stories and fables by Durgasimha."]}], "ಪಂಚತತ್ತ್ವ": [{"type": "noun", "defs": ["= ಪಂಚಭೂತ."]}], "ಪಂಚತತ್ವ": [{"type": "noun", "defs": ["= ಪಂಚಭೂತ."]}], "ಪಂಚತನ್ಮಾತ್ರ": [{"type": "noun", "defs": ["the five subtle rudiments (sound, taste, physical feeling, sight, and smell) of the five basic elements."]}], "ಪಂಚತನ್ಮಾತ್ರೆ": [{"type": "noun", "defs": ["= ಪಂಚತನ್ಮಾತ್ರ."]}], "ಪಂಚತಾರೆ": [{"type": "noun", "defs": ["= ಪಂಚಕ - 8.", "one of the grades awarded to hotels depending on the facilities they offer to their customers."]}], "ಪಂಚತಾವಡ": [{"type": "noun", "defs": ["a necklace having five strings."]}], "ಪಂಚತಿಕ್ತ": [{"type": "noun", "defs": ["(pl.) the five bitter things, - neem leaves, Indian gooseberry (of Emblica officinalis), justice wort (Adhatoda vasica), snake gourd (of Trichosanthes cucumerina) and brinjal (of Solanum indicum)."]}], "ಪಂಚತೆ": [{"type": "noun", "defs": ["= ಪಂಚಭೂತ.", "the aggregate of five.", "the five elements collectively.", "five-foldness.", "cessation of life; death."]}], "ಪಂಚತ್ವ": [{"type": "noun", "defs": ["= ಪಂಚತೆ - 4 & 5."]}], "ಪಂಚದಶ": [{"type": "adjective", "defs": ["amounting to fifteen in number; fifteen.", "next after the fourteenth in a consecutive series; fifteenth."]}, {"type": "noun", "defs": ["the cardinal number fifteen; 15."]}], "ಪಂಚದಶಿ": [{"type": "noun", "defs": ["the last of a lunar fortnight (either full moon-day or new moon-day)."]}], "ಪಂಚದಶೀತೋಪು": [{"type": "noun", "defs": ["a kind of large mounted gun; a cannon."]}], "ಪಂಚದಾರ": [{"type": "noun", "defs": ["= ಪಂಚಧಾರೆ1."]}], "ಪಂಚದ್ರಾವಿಡ": [{"type": "noun", "defs": ["(pl.) the five Dravidian languages - Kannaḍa, Tamil, Telugu, Malayāḷa and Tuḷu."]}], "ಪಂಚಧಾರೆ": [{"type": "noun", "defs": ["pure cane-sugar; refined sugar."]}, {"type": "noun", "defs": ["the five paces of a horse."]}], "ಪಂಚನಾಮೆ": [{"type": "noun", "defs": ["the decision of the juries or a report written in the presence of juries.", "a list of things recovered from a thief or details written about a murder, confiscation, etc. written in detail, and attested by the concerned officials along with the persons who witnessed the process."]}], "ಪಂಚಪತ್ರ": [{"type": "noun", "defs": ["(pl.) the five kinds of leaves - of mango, Beal (Aegle marmelos), Indian gooseberry (Emblica officinalis), a king of grass (Saccharum spontaneum) and chaff plant (Achyranthes aspera)."]}], "ಪಂಚಪತ್ರೆ": [{"type": "noun", "defs": ["the plant Blumea lacera (var. glandulosa) of Astraceae family (?)."]}], "ಪಂಚಪರ್ಬ": [{"type": "noun", "defs": ["= ಪಂಚಪರ್ವ."]}], "ಪಂಚಪರ್ವ": [{"type": "noun", "defs": ["(pl.) the five days - the eighth and fourteenth days of lunar fortnight, full moon-day, new moon-day and sankrānti - considered auspicious for special types of services to the god.", "(pl.) five types of religious services conducted in a temple.", "(phil.) (pl.) five types of ignorance."]}], "ಪಂಚಪಾತ್ರೆ": [{"type": "noun", "defs": ["a vessel having five cups attached together with a handle, used to serve different types of foods simultaneously."]}, {"type": "noun", "defs": ["any utensil or container having a wide mouth."]}], "ಪಂಚಪಾಳೆ": [{"type": "noun", "defs": ["a kind of container having five small cups welded together, with a handle, used to keep the five auspicious things - saffron, turmeric powder, sandal paste, coloured grains of rice and vermilion dye."]}], "ಪಂಚಪಿತೃ": [{"type": "noun", "defs": ["(pl.) (pl.) the five venerable persons to whom one must be grateful in life - father, spiritual teacher, general teacher (or, according to some, father-in-law), he who fed, and he who protected."]}], "ಪಂಚಪೀರ": [{"type": "noun", "defs": ["the five Muslim Souls who are believed to be the protectors on the sea."]}], "ಪಂಚಪ್ರಮೆ": [{"type": "noun", "defs": ["(pl.) five kinds of proofs that we get from five organs (the eyes, ears, nose, tongue and skin).", "(pl.) the knowledge got from these five organs."]}], "ಪಂಚಪ್ರಾಣ": [{"type": "noun", "defs": ["the five vital airs that maintain the functions of the body.", "(fig.) that which one likes, loves too much."]}], "ಪಂಚಫಕೀರ": [{"type": "noun", "defs": ["a highly mischievous boy or man."]}], "ಪಂಚಬಲಿ": [{"type": "noun", "defs": ["(pl.) five things offered to the Goddess Kāḷi, - buffalo, sheep, goat, sugar-cane and pumpkin."]}], "ಪಂಚಬಾಣ": [{"type": "noun", "defs": ["(pl.) the five types of sexual incitements or influences (figuratively conceived as five arrows of flowers, that inflicts pleasant pain) the Love-God Manmatha, has on human beings.", "Manmatha, himself."]}], "ಪಂಚಬಾಬು": [{"type": "noun", "defs": ["(pl.) the five items that accounts for a major share in the total revenue of a government (toddy, liquor, opium, marijuana and tax)."]}], "ಪಂಚಭಕ್ಷ": [{"type": "noun", "defs": ["= ಪಂಚಭಕ್ಷ್ಯ."]}], "ಪಂಚಭಕ್ಷ್ಯ": [{"type": "noun", "defs": ["(pl.) five kinds of foods.", "five kinds of sweets."]}], "ಪಂಚಭುಜ": [{"type": "noun", "defs": ["= ಪಂಚಕೋಣ."]}], "ಪಂಚಭುಜಾಕೃತಿ": [{"type": "noun", "defs": ["= ಪಂಚಕೋಣ."]}], "ಪಂಚಭುಜಿ": [{"type": "noun", "defs": ["= ಪಂಚಕೋಣ."]}], "ಪಂಚಭೂತ": [{"type": "noun", "defs": ["(pl.) the five basic elements - the earth, air, fire, water and ether (or space)."]}], "ಪಂಚಭೂತಾತ್ಮಕ": [{"type": "adjective", "defs": ["made of the five basic elements (pancabhūtas)."]}], "ಪಂಚಮ": [{"type": "adjective", "defs": ["next after the fourth in a consecutive series; fifth.", "favourable; propitious; auspicious."]}, {"type": "noun", "defs": ["the fifth one in a consecutive series.", "the fifth letter in any of the five classified consonants (ಙ, ಞ, ಣ, ನ and ಮ).", "a member of Śudra class.", "that which is beautiful, lovely.", "a skilful man; an expert.", "sexual intercourse.", "a man belonging to the lowest caste, caṇḍāla.", "(mus.) the fifth note in the ascending scale in the classical music systems of India (corresponding to \"G\" of C-Major of western system), which does not have a sharp or flat variations.", "either of the two strings of a musical instrument that produce this note when played or plucked allowing it to be free.", "(mus.) a mode in Karnāṭaka system derived from the mode Mālava Gauḷa (as per some classification).", "(mus.) a mode in Hindūstāni system, derived from the main mode Śuddhabhairav."]}], "ಪಂಚಮಕಾರ": [{"type": "noun", "defs": ["(pl.) the five practices some Śaiva cults profess - eating of fish and flesh, liquor, particular countenances for meditation, and sexual intercourse (all of which in Samskřta starts with the letter 'ಮ')."]}], "ಪಂಚಮಗಾಂಧಾರ": [{"type": "noun", "defs": ["(mus.) name of a musical mode."]}], "ಪಂಚಮಗಾಂಧಾರಿ": [{"type": "noun", "defs": ["(mus.) name of a musical mode."]}], "ಪಂಚಮಲ": [{"type": "noun", "defs": ["(pl.) the five types of wastes exuded by the body through eyes, ears, nose, tongue and skin (as rheum, phlegm; sweat, etc.)."]}], "ಪಂಚಮವೇದ": [{"type": "noun", "defs": ["Mahābhārata, which is considered as an additional Veda."]}], "ಪಂಚಮಶ್ರುತಿ": [{"type": "noun", "defs": ["= ಪಂಚಮವೇದ."]}], "ಪಂಚಮಹಾಪಾತಕ": [{"type": "noun", "defs": ["(pl.) five hideous sins - killing a Brāhmaṇa, drinking liquor or toddy, stealing of gold, having sexual relations with the wife of one's teacher and associating with he who commits these or any of these sins."]}], "ಪಂಚಮಹಾಪಾತಕಿ": [{"type": "noun", "defs": ["a person who commits any of the five hideous sins (ಪಂಚಮಹಾಪಾತಕ)."]}], "ಪಂಚಮಹಾಭೂತ": [{"type": "noun", "defs": ["= ಪಂಚಭೂತ."]}], "ಪಂಚಮಹಾಯಜ್ಞ": [{"type": "noun", "defs": ["(pl.) the five sacrifices that a brāhmaṇa, has to perform every day."]}], "ಪಂಚಮಾಯೆ": [{"type": "noun", "defs": ["name of a petty goddess."]}], "ಪಂಚಮಿ": [{"type": "adjective", "defs": ["falling on, related to the fifth day of lunar fortnights."]}, {"type": "noun", "defs": ["the fifth day of lunar fortnights.", "the fifth day of the first fortnight in Śravaṇa, the fifth month in Hindu lunar calendar.", "a festival observed on that day worshipping serpents.", "the chequered cloth or board having sixty four squares of two alternate colours to play chess on.", "(gram.) a case expressing removal, deprivation, direction from, source, cause or agency; the ablative case."]}], "ಪಂಚಮಿಗ": [{"type": "noun", "defs": ["a man belonging to the lowest caste, caṇḍāla."]}], "ಪಂಚಮಿಗಿತಿ": [{"type": "noun", "defs": ["a woman belonging to the lowest caste, caṇḍāla."]}], "ಪಂಚಮಿಸೆ": [{"type": "noun", "defs": ["the cardinal number twenty five; 25."]}], "ಪಂಚಮೀವಿಭಕ್ತಿ": [{"type": "noun", "defs": ["= ಪಂಚಮಿ2- 5."]}], "ಪಂಚಮುಖ": [{"type": "noun", "defs": ["(pl.) the five faces of Śiva, - Sadyōjāta, Vāmadēva, Aghōra, Tatpuruṣa and Īśāna.", "one of several names of Śiva.", "(pl.) the five sides, surfaces of a thing.", "a plate, designed to have five votive-lamp shaped depressions at one end and a handle at the other, used to wave light before a deity."]}, {"type": "noun", "defs": ["a lion which has a broad face."]}], "ಪಂಚಮುಖಿ": [{"type": "noun", "defs": ["anything that has five faces (as an idol of a deity)."]}], "ಪಂಚಮೂಲ": [{"type": "noun", "defs": ["(pl.) the fibrous roots of five different plants -."]}], "ಪಂಚಯಜ್ಞ": [{"type": "noun", "defs": ["= ಪಂಚಮಹಾಯಜ್ಞ."]}], "ಪಂಚರಂಗ": [{"type": "noun", "defs": ["(pl.) the five colours - white, black, red, yellow and green."]}], "ಪಂಚರಂಗಿ": [{"type": "noun", "defs": ["a horse with whose feet and mouth are white.", "that which has five colours."]}], "ಪಂಚರತ್ನ": [{"type": "noun", "defs": ["(pl.) the five precious gems (the five gems being differently reckoned by different authorities)."]}], "ಪಂಚರಸ": [{"type": "noun", "defs": ["(pl.) the five liquids - ghee (clarified butter), milk, honey, (edible) oil and spirituous liquor.", "(pl.) five kinds of flavours - bitter, sour, hot, sweet and brackishness."]}], "ಪಂಚರಸಿ": [{"type": "noun", "defs": ["(pl.) the five metals - gold, silver, iron, copper and zinc."]}], "ಪಂಚರಾಶಿ": [{"type": "noun", "defs": ["(arith.) a method of finding the sixth quantity using other five known quantities."]}], "ಪಂಚರಾಶಿಕ": [{"type": "noun", "defs": ["= ಪಂಚರಾಶಿ."]}], "ಪಂಚಲಿಂಗ": [{"type": "noun", "defs": ["(pl.) the five Lingas of Śiva, in Talakāḍu (Arkēśvara, Pātāḷēśvara, Maraḷēśvara, Mallikārjunēśvara, and Vaidyēśvara), in Karnāṭaka.", "(pl.) similar Lingas in Tamil Nāḍu -(Přthvīlinga,āpōlinga, Tējōlinga, Vāyulinga, and ākāśa linga) which represent the five elements."]}], "ಪಂಚಲೋಭಿ": [{"type": "noun", "defs": ["a very covetous, greedy person."]}], "ಪಂಚಲೋಹ": [{"type": "noun", "defs": ["(pl.) the five metals - copper, brass, zinc, lead and iron.", "an alloy of these metals."]}], "ಪಂಚವಟಿ": [{"type": "noun", "defs": ["an ornamental string made of hair, worn on the breast."]}, {"type": "noun", "defs": ["(pl.) the five trees peepul (bo tree), beal (Aegle marmelos), banyan (Ficus benghalensis), Indian oak (Barringtonia acutangula), and Asoka (Jonesia asoca)."]}], "ಪಂಚವಣ್ಣ": [{"type": "noun", "defs": ["= ಪಂಚವರ್ಣ - 1."]}], "ಪಂಚವರ್ಗ": [{"type": "noun", "defs": ["(gram.) (pl.) the five groups of five consonants each (kavarga, cavarga, ṭavarga, tavarga, and pavarga).", "(pl.) five types of spies of a nation."]}], "ಪಂಚವರ್ಣ": [{"type": "noun", "defs": ["(pl.) the five colours - white, black, red, yellow and green.", "a sacred five-syllabic hymn repeated with reverence, submitting oneself to Śiva."]}], "ಪಂಚವಲ್ಕಲ": [{"type": "noun", "defs": ["the bark of peepul (Ficus religiosa), cluster fig (Ficus racemosa), banyan (Ficus benghalensis), fig (Ficus virens), and Mysore fig (Ficus mysorensis)."]}], "ಪಂಚವಳ್ಳಿ": [{"type": "noun", "defs": ["a kind of climber."]}], "ಪಂಚವಾಯು": [{"type": "noun", "defs": ["the five vital airs that maintain the functions of the body."]}], "ಪಂಚವಾರ್ಷಿಕ": [{"type": "adjective", "defs": ["running (continuously) over a period of five years; that is effective during a specified five years; made or planned for five years period."]}], "ಪಂಚವಾರ್ಷಿಕಯೋಜನೆ": [{"type": "noun", "defs": ["the fiscal plan (of Government of India) designed for a period of five continuous years."]}], "ಪಂಚವಾಳ": [{"type": "noun", "defs": ["a kind of container having five small cups welded together, with a handle, used to keep the five auspicious things - saffron, turmeric powder, sandal paste, coloured grains of rice and vermilion dye."]}], "ಪಂಚವಿಂಶತಿ": [{"type": "adjective", "defs": ["amounting to twenty five in number; twenty-five."]}, {"type": "noun", "defs": ["the cardinal number twenty-five; 25."]}], "ಪಂಚವೃತ್ತಿ": [{"type": "noun", "defs": ["= ಪಂಚವಾಯು."]}], "ಪಂಚವೆ": [{"type": "noun", "defs": ["= ಪಂಚಮಿ2."]}], "ಪಂಚಶಾಖ": [{"type": "noun", "defs": ["the hand, that has five terminal points."]}], "ಪಂಚಶಾಖೆ": [{"type": "noun", "defs": ["= ಪಂಚಶಾಖ."]}], "ಪಂಚಶೀಲ": [{"type": "noun", "defs": ["(pl.) the five principles accepted between two nations - recognition of each other's sovereignty, refraining from attacking each other, non-interference in the internal matters of another, equality, and co-operation."]}], "ಪಂಚಶೂಲೆ": [{"type": "noun", "defs": ["a kind of disease."]}], "ಪಂಚಸಂಸ್ಕಾರ": [{"type": "noun", "defs": ["(pl.) five kinds of religious observances (of Viśiṣṭādvaitis)."]}], "ಪಂಚಸೂನ": [{"type": "noun", "defs": ["(pl.) the five domestic works - pounding, winnowing, grinding, firing the oven and filling water into containers (by which the householder indirectly commits sins of hurting living beings)."]}], "ಪಂಚಸೂನಾದೋಷ": [{"type": "noun", "defs": ["the sin contracted by carrying on ಪಂಚಸೂನ daily."]}], "ಪಂಚಳ": [{"type": "noun", "defs": ["(sometimes, in singular number, it refers to any of) the five artisans of a village - carpenters, goldsmiths, blacksmiths, masons and braziers (or, according to some, carpenters, weavers, barbers, washermen and cobblers)."]}], "ಪಂಚಾಂಗ": [{"type": "noun", "defs": ["that which is made of five components or which has five parts.", "the five things - solar days, lunar days, asterisms, yōgas and karaṇās, which the Indian almanac considers.", "the Indian almanac, based on these five things, that determines the beginning, length, and divisions of a year, month, day, etc. giving information daywise along with astronomical data, weather forecasts, etc., usu. published annually.", "(fig.) a speech that is mere wordy and verbose, often made to deceive others; a prolix statement.", "the five parts of plants, the bark, leaves, flowers, roots and fruit, used in preparing medicinal substances.", "the foundation or lower part of a building; the basement.", "ಪಂಚಾಂಗ ಕೇಳು pancāngakēḷu to enquire about the ruling astrological asterisms, their effects, auspicious moment for doing something, etc.; ಪಂಚಾಂಗದವನು pancāngadavanu = ಪಂಚಾಂಗಿ; ಪಂಚಾಂಗ ಹೇಳು pancānga hēḷu to study the the positions of the sun, moon, stars, etc. and foretell the future events."]}], "ಪಂಚಾಂಗಚೂರ್ಣ": [{"type": "noun", "defs": ["the powder of any of the five parts of plants, - the bark, leaves, flowers, roots and fruit, - used in preparing medicinal substances."]}], "ಪಂಚಾಂಗಪ್ರಣಾಮ": [{"type": "noun", "defs": ["a salutation made joining both the palms, bending at knees, bowing the head, uttering respectful words, and looking reverentially at."]}], "ಪಂಚಾಂಗರಾಯ": [{"type": "noun", "defs": ["five coloured decorative buntings."]}], "ಪಂಚಾಂಗಶುದ್ಧಿ": [{"type": "noun", "defs": ["astrological auspiciousness of the moment for beginning or doing something.", "cleanliness and appropriateness of the five parts of plants( = ಪಂಚಾಂಗ - 5)."]}], "ಪಂಚಾಂಗಶ್ರವಣ": [{"type": "noun", "defs": ["a listening to the predictions for the year at the beginning, as mentioned in an Indian almanac."]}], "ಪಂಚಾಂಗಿ": [{"type": "noun", "defs": ["a man who is believed to foretell the future based on the positions of the sun, moon, starts, etc."]}], "ಪಂಚಾಂಗುಲ": [{"type": "noun", "defs": ["the five fingers (of a hand).", "the castor-seed plant, Ricinus communis of Euphorbiaceae family."]}], "ಪಂಚಾಂಡಿ": [{"type": "noun", "defs": ["a round, wide-mouthed container with flat bottom."]}], "ಪಂಚಾಕ್ಷರ": [{"type": "noun", "defs": ["= ಪಂಚಾಕ್ಷರಿ."]}], "ಪಂಚಾಕ್ಷರಿ": [{"type": "noun", "defs": ["a sacred five-syllabic hymn repeated with reverence, submitting oneself to Śiva."]}], "ಪಂಚಾಗ್ನಿ": [{"type": "noun", "defs": ["(pl.) the five sacred fires.", "(pl.) the five mystic fires supposed to be present in the body.", "(pl.) five inflammatory passions.", "(pl.) fires set on four sides and the sun on top of a person undergoing self-mortification or self-penance.", "such a penance.", "(pl.) the five venerable persons - father, mother, teacher, the sacred fire and the Supreme Being.", "(Dvaita phil.) (pl.) the five objects to be venerated father, mother, the earth, cloud and the sky.", "(pl.) five kinds medicinal substances that stimulate the appetite."]}], "ಪಂಚಾಚಾರ್ಯ": [{"type": "noun", "defs": ["(vīr.) the five primordial spiritual personages."]}], "ಪಂಚಾಟಿ": [{"type": "noun", "defs": ["the decision of the juries of a village.", "the act or process of giving such a decision."]}], "ಪಂಚಾಣುವ್ರತ": [{"type": "noun", "defs": ["(pl.) the five observances that a householder has to observe - an abstaining from hurting living beings, truthfulness, abstaining from stealing, sexual abstinence, and abstaining from receiving anything from others."]}], "ಪಂಚಾನ": [{"type": "noun", "defs": ["= ಪಂಚಾಲ."]}], "ಪಂಚಾನನ": [{"type": "noun", "defs": ["(pl.) Śiva who has five faces - Sadyōjāta, Vāmadēva, Aghōra, Tatpuruṣa and Īśāna.", "one of several names of Śiva."]}, {"type": "noun", "defs": ["a lion which has a broad face.", "(fig.) an excellent man."]}], "ಪಂಚಾನನರಸ": [{"type": "noun", "defs": ["a medicinal substance made using five ingredients."]}], "ಪಂಚಾಭಿಷೇಕ": [{"type": "noun", "defs": ["a bathing of an idol of a deity with five things - milk, sugar, ghee (clarified butter), curds and honey."]}], "ಪಂಚಾಮೃತ": [{"type": "noun", "defs": ["(pl.) the five things - milk, sugar, ghee (clarified butter), curds and honey - used to bathe an idol with.", "a mixture of these things.", "(fig.) that which gives one utmost pleasure.", "(pl.) the five things derived from the cow - milk, curds, clarified butter, urine and dung (held as auspicious).", "ಪಾಲಿಗೆ ಬಂದದ್ದು ಪಂಚಾಮೃತ pālige bandaddu pancāmřta considering what one gets is satisfactory; a not being too ambitious or greedy."]}], "ಪಂಚಾಮ್ಲ": [{"type": "noun", "defs": ["(pl.) five types of acidic substances."]}], "ಪಂಚಾಯತ": [{"type": "noun", "defs": ["= ಪಂಚಾಯಿತಿ."]}], "ಪಂಚಾಯತದಾರ": [{"type": "noun", "defs": ["a member of the group of people who hear the evidence and inquire into the facts in a litigation in a village or town; a jury."]}], "ಪಂಚಾಯತನ": [{"type": "noun", "defs": ["(pl.) the five gods Śiva, Pārvati, Viṣṇu, the Sun, and Gaṇapati, worshipped daily by Smārta Brāhmaṇas."]}], "ಪಂಚಾಯತಿ": [{"type": "noun", "defs": ["= ಪಂಚಾಯಿತಿ."]}], "ಪಂಚಾಯತಿಕೆ": [{"type": "noun", "defs": ["= ಪಂಚಾಯಿತಿಕೆ."]}], "ಪಂಚಾಯಿತ": [{"type": "noun", "defs": ["= ಪಂಚಾಯತದಾರ."]}], "ಪಂಚಾಯಿತಿ": [{"type": "noun", "defs": ["a body of people governing the affairs of a village or group of villages.", "a dull, tiresome affair.", "a judgement or conclusion reached or given; a decision.", "a committee or council of trustees of a temple, etc.", "a meddling with another's affairs; undesired interference.", "a dispute; a quarrel.", "a perplexed condition solving of which is difficult.", "the condition or fact of being difficult.", "thoughtful consideration; attention paid or required to be paid.", "a committee of people who hear the evidence and inquire into the facts of a litigation and give decision in accordance with their findings; jury."]}], "ಪಂಚಾಯಿತಿಕೆ": [{"type": "noun", "defs": ["the act or process or an instance of hearing the evidence and inquire into the facts of a litigation and arriving at a conclusion."]}], "ಪಂಚಾಯ್ತ": [{"type": "noun", "defs": ["= ಪಂಚಾಯತದಾರ."]}], "ಪಂಚಾಯ್ತಿ": [{"type": "noun", "defs": ["= ಪಂಚಾಯಿತಿ."]}], "ಪಂಚಾಯ್ತಿಮನೆ": [{"type": "noun", "defs": ["the office of the body governing the affairs of a village or group of villages."]}], "ಪಂಚಾರ": [{"type": "noun", "defs": ["a young horse."]}], "ಪಂಚಾರತಿ": [{"type": "noun", "defs": ["a plate, designed to have five votive-lamp shaped depressions at one end and a handle at the other, used to wave light before a deity.", "a waving of light with this."]}], "ಪಂಚಾರಶೀಲ": [{"type": "noun", "defs": ["a man who indulges in excess sexual enjoyment; a voluptuous man."]}], "ಪಂಚಾರಿಸು": [{"type": "verb", "defs": ["(a horse) to attain the state of youth."]}], "ಪಂಚಾಲ": [{"type": "noun", "defs": ["(pl.) (sometimes, in singular number, it refers to any of) the five artisans of a village - carpenters, goldsmiths, blacksmiths, masons and braziers (or, according to some, carpenters, weavers, barbers, washermen and cobblers)."]}], "ಪಂಚಾಲಿಕೆ": [{"type": "noun", "defs": ["a puppet or doll made of stone, wood, lac, etc."]}], "ಪಂಚಾವರಣ": [{"type": "noun", "defs": ["(phil.) five kinds of coverings or impediments in the path of knowledge and realisation of the Supreme."]}], "ಪಂಚಾಹಿಕಜ್ವರ": [{"type": "noun", "defs": ["a fever that recurs every fifth day."]}], "ಪಂಚಾಳ": [{"type": "noun", "defs": ["= ಪಂಚಾಲ."]}], "ಪಂಚಾಳಿ": [{"type": "noun", "defs": ["a talkative woman."]}, {"type": "noun", "defs": ["a kind of (percussion ?) instrument."]}], "ಪಂಚಿ": [{"type": "noun", "defs": ["the score of five in the game of chance played with dice."]}, {"type": "noun", "defs": ["silly, stupid or useless talk."]}], "ಪಂಚಿಕರಣ": [{"type": "noun", "defs": ["= ಪಂಚೀಕರಣ2."]}], "ಪಂಚಿಕೆ": [{"type": "noun", "defs": ["= ಪಂಜಿಕೆ - 2."]}], "ಪಂಚೀಕರಣ": [{"type": "noun", "defs": ["a dividing into groups of five.", "the act or fact of manifesting or causing to manifest with a gross physical form using five elements."]}, {"type": "noun", "defs": ["a broadening or widening."]}], "ಪಂಚೀಕರಿಸು": [{"type": "verb", "defs": ["to cause to manifest using the five elements.", "to render five times."]}, {"type": "verb", "defs": ["to become larger; to increase in one's size; to enlarge oneself.", "to make larger, increase in size; to broaden."]}], "ಪಂಚೀಕೃತ": [{"type": "adjective", "defs": ["formed by five elements."]}, {"type": "noun", "defs": ["that which is formed using five elements."]}], "ಪಂಚೀಕೃತಿ": [{"type": "noun", "defs": ["= ಪಂಚೀಕರಣ1."]}], "ಪಂಚು": [{"type": "verb", "defs": ["to divide (a whole) into parts, groups, etc.", "(math.) to divide a quantity by another quantity.", "to distribute among.", "ಪಂಚಂಪಾಡು ಮಾಡು pancam pāḍu māḍu to divide and distribute; ಪಂಚುಪಱಿ pancu paṛi that which is divided into small pieces; ಪಂಚುಪಱಿ ಮಾಡು pancu paṛi māḍu to divide, cut into small pieces; ಪಂಚಂಪಾಡಾಗು pancam pāḍāgu to be broken into (small) pieces."]}, {"type": "noun", "defs": ["a thin, burnt piece, made of clay used for roofing; a tile.", "a piece of broken pottery; a potsherd."]}, {"type": "noun", "defs": ["a device or machine for making holes (as on a sheet of paper); a punch; a punching machine."]}], "ಪಂಚುಗೆ": [{"type": "noun", "defs": ["a dividing or being divided; separation.", "a sharing or apportioning; distribution.", "a part or portion so separated from the whole.", "the quality of being wise; power of judging rightly and following the soundest course of action, based on knowledge, experience, understanding, etc.; good judgement; sagacity; wisdom.", "the quality of being generous; willingness to share; generosity.", "that which is proper, fit.", "the quality of being proper, fitting or suitable; propriety; fitness.", "tax paid in the form of goods (not money)."]}], "ಪಂಚುಗೆಗೊಳ್": [{"type": "verb", "defs": ["to get a share or portion of.", "to get something divided between or among."]}], "ಪಂಚೆ": [{"type": "noun", "defs": ["an oblong piece of cloth, having boarders on all the sides, used by men to cover from waist to the ankles, and sometimes, to cover the upper portion; a dhōti."]}], "ಪಂಚೇಂದ್ರಿಯ": [{"type": "noun", "defs": ["(pl.) the five sense organs of the body - the eyes, ears, nose, tongue and skin.", "a living being having all these."]}], "ಪಂಚೇರು": [{"type": "noun", "defs": ["a measure of weight, equal to five seers (10.6 lb.)."]}], "ಪಂಚೇಷು": [{"type": "noun", "defs": ["(myth.) the five flowery arrows of Manmatha, the Love-God.", "Manmatha."]}], "ಪಂಚೊಡೆ": [{"type": "verb", "defs": ["to become broken up and scattered in different directions; to disperse oneself."]}], "ಪಂಚೋಟಿ": [{"type": "noun", "defs": ["the tall, evergreen tree Palaquium ellipticum ( = Dichopsis elliptica) of Sapotaceae family; Indian gutta percha."]}], "ಪಂಚೋಪಚಾರ": [{"type": "noun", "defs": ["(pl.) the five things offered to the God - sandal paste, flower, incense, light and food.", "(pl.) the five stages of worshipping the God - invocation, installation, feeling the presence of the God, worshipping with flowers, and conclusion."]}], "ಪಂಚೌದುಂಬರ": [{"type": "noun", "defs": ["the five ficus trees - peepul (Ficus religiosa), cluster fig (Ficus racemosa), banyan (Ficus benghalensis), fig (Ficus virens), and Mysore fig (Ficus mysorensis)."]}], "ಪಂಜ": [{"type": "adjective", "defs": ["amounting to five in number; five.", "being one fifth of."]}, {"type": "noun", "defs": ["the cardinal number five."]}, {"type": "noun", "defs": ["= ಪಂಜಾ."]}], "ಪಂಜಂಹಿಸ್ಸೆ": [{"type": "noun", "defs": ["one of the five equal parts; one fifth portion."]}], "ಪಂಜಮರೇಶಿಮೆ": [{"type": "noun", "defs": ["a kind of inferior silk."]}], "ಪಂಜರ": [{"type": "noun", "defs": ["a box or enclosed structure made of wires, bars, etc., for confining and displaying birds or animals; a cage.", "a veil used to cover a palanquin.", "the bones of a human or an animal considered as a whole, together forming the framework of the body; the skeleton."]}, {"type": "noun", "defs": ["= ಪಂಜಾ."]}], "ಪಂಜರಂಬಡೆ": [{"type": "verb", "defs": ["to make a cage or cage-like structure."]}], "ಪಂಜರವಳ್ಳಿ": [{"type": "noun", "defs": ["= ಪಂಜುರ್ಲಿ."]}], "ಪಂಜರಾಖೇಟ": [{"type": "noun", "defs": ["a basket for catching fish in a small stream or canal."]}], "ಪಂಜರಿಸು": [{"type": "verb", "defs": ["to cover from all or almost all sides; to encircle.", "to pervade throughout or spread (oneself) widely.", "to come together in a large number; to assemble; to crowd."]}], "ಪಂಜರುಳ್ಳಿ": [{"type": "noun", "defs": ["= ಪಂಜುರ್ಲಿ."]}], "ಪಂಜಾ": [{"type": "noun", "defs": ["a foot of a bird or any of various reptiles and mammals that has sharp, hooked and curved horny structure or nail; a claw.", "a metal hand, representing five holy personages, worshipped by Muslims during Muharram."]}], "ಪಂಜಿ": [{"type": "noun", "defs": ["= ಪಂಚೆ."]}, {"type": "noun", "defs": ["a ball or roll of cotton from which the thread is spun."]}], "ಪಂಜಿಕೆ": [{"type": "noun", "defs": ["= ಪಂಜಿ2.", "a continuous commentary or interpretation.", "a book containing tables or charts that show the details of the date, positions and movements of stars, sun, moon, etc. of each day, published usu. annually; an almanac.", "a book for recording each day's income and expenditure; a daybook.", "a book in which list of names, events, items, are recorded; a register."]}], "ಪಂಜು": [{"type": "noun", "defs": ["a long, thick piece of wood, wound on at one end with long cloth pieces, dipped in flammable oil or tallow, that burns when lit, used as a portable light, on religious occasions, etc.; a torch; a fire-brand."]}], "ಪಂಜುಬಳೆ": [{"type": "noun", "defs": ["a long strip of cloth, soaked in flammable oil or tallow, for winding round a long,, thick piece of wood, to be used as a portable light."]}], "ಪಂಜುರುಳಿ": [{"type": "noun", "defs": ["= ಪಂಜುರ್ಲಿ."]}], "ಪಂಜುರ್ಲಿ": [{"type": "noun", "defs": ["name of a daemon-god worshipped esp. in the coastal districts of Karnāṭaka."]}], "ಪಂಜುಸೇವೆ": [{"type": "noun", "defs": ["a religious service to a god performed by several people together, holding burning torches."]}], "ಪಂಜುಹಚ್ಚು": [{"type": "verb", "defs": ["to light a torch.", "(fig.) to cause distress, anguish, extreme pain, etc."]}], "ಪಂಜೆ": [{"type": "noun", "defs": ["= ಪಂಚೆ."]}, {"type": "noun", "defs": ["the tree Madhuca indica ( = Bassia latifolia) of Sapotaceae family; Indian butter tree; (?)."]}, {"type": "noun", "defs": ["a deeply distressed, miserable person."]}], "ಪಂಜೆತನ": [{"type": "noun", "defs": ["the quality, condition or fact of being distressed, miserable; misery; wretchedness."]}], "ಪಂಜೇವಾರ್": [{"type": "adjective", "defs": ["being distressed; living miserably."]}], "ಪಂಜ್ರೊಳ್ಳಿ": [{"type": "noun", "defs": ["= ಪಂಜುರ್ಲಿ."]}], "ಪಂಟಿ": [{"type": "noun", "defs": ["any of the chief meals of the day (either lunch or dinner)."]}], "ಪಂಟಿಮಾರಿಗ": [{"type": "noun", "defs": ["a man who inflicts pain, distress, etc.; a wicked fellow."]}], "ಪಂಟಿಸು": [{"type": "verb", "defs": ["to cover with or as with a veil.", "to attack; to make inroads.", "to enter into association with; to be associated with.", "to take part in a physical struggle or battle; to fight.", "to become spread throughout all parts of.", "to cause to fall; to knock down; to fell.", "to trip or miss one's step in walking, running, etc.; to stumble.", "to struggle for superiority; to enter into competition with someone; to vie; to compete.", "to hit with a hard and heavy blow; to smash.", "to blend together; to mix."]}], "ಪಂಟು": [{"type": "noun", "defs": ["boastful or useless talk; brag.", "the act, an instance of deceiving or being deceived; deception."]}], "ಪಂಟುನುಡಿ": [{"type": "noun", "defs": ["= ಪಂಟು - 1."]}], "ಪಂಟುಬಡಿ": [{"type": "verb", "defs": ["to talk boastfully about deeds. abilities, etc. of either one's own or those of someone close to one, etc.; to brag; to boast."]}], "ಪಂಡುಬಡೆ": [{"type": "verb", "defs": ["= ಪಂಟುಬಡಿ."]}], "ಪಂಡುಹಚ್ಚು": [{"type": "verb", "defs": ["= ಪಂಟುಬಡಿ."]}], "ಪಂಟುಹೊಡೆ": [{"type": "verb", "defs": ["= ಪಂಟುಬಡಿ."]}], "ಪಂಟೆ": [{"type": "noun", "defs": ["the woody extension growing from the trunk of a tree; a branch."]}], "ಪಂಠಿಸು": [{"type": "verb", "defs": ["= ಪಂಟಿಸು."]}], "ಪಂಡ": [{"type": "noun", "defs": ["a man lacking normal functions of the testes."]}, {"type": "noun", "defs": ["a priest who conducts rituals in a pilgrim centres (in North India)."]}], "ಪಂಡಕ": [{"type": "noun", "defs": ["= ಪಂಡ1."]}], "ಪಂಡಾಣೆ": [{"type": "noun", "defs": ["an undried, long, slender piece of wood of a plant, used as a stick."]}], "ಪಂಡಾಪೂರ್ವ": [{"type": "noun", "defs": ["that which is of no use; an unserviceable thing.", "a useless or ineffectual religious rite."]}], "ಪಂಡಿತ": [{"type": "noun", "defs": ["a learned or erudite person, esp. one who has profound knowledge of a particular subject; a scholar; a wise man.", "anāyurvēdic physician or a man who treats sick men with the knowledge of some native medicines.", "a man who has studied deeply a language, grammar, logics or philosophy in a traditional manner."]}], "ಪಂಡಿತಂಮನ್ಯ": [{"type": "noun", "defs": ["a false or pseudo scholar or intellect."]}], "ಪಂಡಿತತ್ವ": [{"type": "noun", "defs": ["the knowledge attained by a scholar; the systematised knowledge of a learned person, exhibiting accuracy, critical ability, and thoroughness; scholarship; erudition."]}], "ಪಂಡಿತಪುತ್ರ": [{"type": "noun", "defs": ["(fig.) a blockhead; a fool; a stupid fellow."]}], "ಪಂಡಿತಮರಣ": [{"type": "noun", "defs": ["a deliberate dying of a Jaina religious scholar by completely abstaining from food."]}], "ಪಂಡಿತವಕ್ಕಿ": [{"type": "noun", "defs": ["the bird that imitate human speech; a parrot."]}], "ಪಂಡಿತವರ": [{"type": "noun", "defs": ["an outstanding scholar."]}], "ಪಂಡಿತವರ್ಯ": [{"type": "noun", "defs": ["= ಪಂಡಿತವರ."]}], "ಪಂಡಿತಿಕೆ": [{"type": "noun", "defs": ["= ಪಂಡಿತತ್ವ."]}], "ಪಂಡಿತಿಕ್ಕೆ": [{"type": "noun", "defs": ["= ಪಂಡಿತತ್ವ."]}], "ಪಂಡಿತೆ": [{"type": "noun", "defs": ["an erudite, scholarly woman; a learned, wise woman."]}], "ಪಂತ": [{"type": "noun", "defs": ["a solemn promise or pledge dedicating oneself to an act, service or way of life; a vow; a pledge.", "utterly unyielding and quarrelsome in attitude; adamancy.", "a striving in competition or rivalry with another; a vying.", "any game of uncertainty played with a wager.", "(in gen.) any game played by two teams to establish supremacy of one over the other.", "a pledge of a forfeit risked on some uncertain outcome; wager; a bet.", "haughtiness; insolence; disdain; arrogance.", "an announcement, declaration or narration made in an open or ostentatious way."]}, {"type": "noun", "defs": ["a way beaten, formed or trodden by the feet of persons; a path.", "a right course of action procedure.", "position; rank; status; standing."]}, {"type": "noun", "defs": ["a learned man; a scholar.", "a teacher.", "a surname used in Mahārāṣṭra."]}], "ಪಂತಂಗಟ್ಟು": [{"type": "verb", "defs": ["= ಪಂತಕಟ್ಟು."]}], "ಪಂತಕಟ್ಟು": [{"type": "verb", "defs": ["to strive in competition or rivalry with another; to contend for superiority; to view.", "to call or dare to take part in a duel, contest, etc.; to challenge.", "to pledge or resolve solemnly to do, make, give, observe, etc.; to vow.", "to stake money or other valuables in a bet; to bet."]}], "ಪಂತಗಾರ": [{"type": "noun", "defs": ["an unduly adamant man.", "he who plays any game of chance staking his money, valuables, etc.", "an insolent, haughty or conceited man.", "a village servant.", "a man who has pledged himself or resolved solemnly to do, make, give, observe, etc.", "a man who challenges another or vies with another for supremacy."]}], "ಪಂತಗಾರ್ತಿ": [{"type": "noun", "defs": ["an unduly adamant woman.", "she who plays any game of chance staking her money, valuables, etc.", "an insolent, haughty or conceited woman.", "a woeman who has pledged herself or resolved solemnly to do, make, give, observe, etc.", "a woman who challenges or vies another person with another person for supremacy."]}], "ಪಂತಗಾಱ": [{"type": "noun", "defs": ["= ಪಂತಗಾರ."]}], "ಪಂತಡಿ": [{"type": "noun", "defs": ["a kind of dance representing the emotions of love dramatically."]}], "ಪಂತಪಾಡು": [{"type": "noun", "defs": ["= ಪಂತ1 - 3.", "an avowed declaration of one's solemn pledge to do, abstain from doing, to dedicate oneself to, etc."]}], "ಪಂತಮಣೆ": [{"type": "noun", "defs": ["a wooden board with two rows of seven hollows, used to play on with cowries or tamarind seeds."]}], "ಪಂತವೊಡ್ಡು": [{"type": "verb", "defs": ["= ಪಂತಕಟ್ಟು- 2 & 4"]}], "ಪಂತಹಾಕು": [{"type": "verb", "defs": ["= ಪಂತಕಟ್ಟು- 2, 3 & 4."]}], "ಪಂತಿ": [{"type": "noun", "defs": ["a number of people or things arranged so as to form a line; a row; a file.", "people sitting down in a row taking meals.", "a group, flock, herd, multitude or troop.", "the act of succeeding or coming after another in order or sequence; succession.", "any of a series of such horizontal lines in parallel, as of seats in a theatre or airplane, corn in a field, etc.", "a row of written or printed characters extending across or part way across a page; a line.", "a number of cattle tied one by the side of the other, that are made to go round and round a pole on the threshed crops (as paddy) to separate remaining grains."]}], "ಪಂತಿಕಾರ": [{"type": "noun", "defs": ["a man supervising serving of meals to persons sitting in a row.", "any of several men sitting in a row for meals."]}], "ಪಂತಿಕಾಱ": [{"type": "noun", "defs": ["= ಪಂತಿಕಾರ."]}], "ಪಂತಿಗಟ್ಟು": [{"type": "verb", "defs": ["(a large number of persons) to stand in a line; to form a queue.", "to come together in a large group."]}], "ಪಂತಿಗೊಡು": [{"type": "verb", "defs": ["to cause or allow another to sit along with others in a row for taking meals."]}], "ಪಂತಿಗೊಳ್": [{"type": "verb", "defs": ["= ಪಂತಿಗಟ್ಟು."]}], "ಪಂತಿಗೊಳಿಸು": [{"type": "verb", "defs": ["to make a large number of persons to stand in a line; to form a queue.", "to assemble a large number of persons to make a group."]}], "ಪಂತಿಯುಣಿಸು": [{"type": "noun", "defs": ["= ಪಂತಿಯೂಟ."]}], "ಪಂತಿಯೂಟ": [{"type": "noun", "defs": ["a sitting together and having meals together; the meal so taken by several persons together."]}], "ಪಂತಿವಿಡಿ": [{"type": "verb", "defs": ["= ಪಂತಿಗಟ್ಟು - 1."]}], "ಪಂತು": [{"type": "noun", "defs": ["(mus.) a mode."]}], "ಪಂತುವರಾಲಿ": [{"type": "noun", "defs": ["= ಪಂತುವರಾಳಿ."]}], "ಪಂತುವರಾಳಿ": [{"type": "noun", "defs": ["(mus.) in Karnāṭaka system, the fiftieth of the seventy two main modes."]}], "ಪಂತೈಸು": [{"type": "verb", "defs": ["= ಪಂತಿಗಟ್ಟು - 1."]}], "ಪಂತೋಜಿ": [{"type": "noun", "defs": ["a school teacher."]}], "ಪಂಥ": [{"type": "noun", "defs": ["= ಪಂತ1."]}, {"type": "noun", "defs": ["a way beaten, formed or trodden by the feet of persons; a path.", "a right course of action procedure.", "a group of people having a common religious ideals, philosophy, customs, etc."]}], "ಪಂಥಗಾರ": [{"type": "noun", "defs": ["= ಪಂತಗಾರ."]}], "ಪಂಥಗಾಱ": [{"type": "noun", "defs": ["= ಪಂತಗಾರ."]}], "ಪಂಥತೊಡು": [{"type": "verb", "defs": ["= ಪಂತಕಟ್ಟು - 2, 3."]}], "ಪಂಥಪಾಡು": [{"type": "noun", "defs": ["= ಪಂತ1 - 3."]}, {"type": "noun", "defs": ["= ಪಂಥ2 - 2."]}], "ಪಂಥವಾಡು": [{"type": "verb", "defs": ["= ಪಂತಕಟ್ಟು - 1 & 2."]}], "ಪಂಥಾನ": [{"type": "noun", "defs": ["= ಪಂಥ2 - 2."]}], "ಪಂಥಿ": [{"type": "noun", "defs": ["a man belonging to a particular religious sect;2.a man who follows a particular ideology (as in art, politics, etc.)."]}], "ಪಂಥೀಯ": [{"type": "noun", "defs": ["= ಪಂಥಿ."]}], "ಪಂದ": [{"type": "noun", "defs": ["= ಪಂತ1."]}], "ಪಂದರ್": [{"type": "noun", "defs": ["= ಪಂದರ."]}], "ಪಂದರ": [{"type": "noun", "defs": ["a temporary shed, usu. a roof raised on poles, for providing shelter for larger number of people or for religious purposes; a pandal."]}], "ಪಂದರಿಕ್ಕು": [{"type": "verb", "defs": ["to raise a pandal."]}], "ಪಂದರಿಸು": [{"type": "verb", "defs": ["to become a pandal or a pandal-like.", "to make a structure by intertwining long, slender wood pieces, bamboo splits, etc."]}]}