{"ಗುರುಋಣ": [{"type": "noun", "defs": ["the condition or fact of being indebted to one's teacher, preceptor or religious pontiff."]}], "ಗುರುಂಘಾತಕ": [{"type": "noun", "defs": ["= ಗುರಮಘಾತಕ2."]}], "ಗುರುಂಘಾತಕಿ": [{"type": "noun", "defs": ["= ಗುರಮಘಾತಕಿ."]}], "ಗುರುಕರಜಾತ": [{"type": "noun", "defs": ["a man in relation to his religious pontiff, who admitted him to the religious order, esp. as an ascetic."]}], "ಗುರುಕಾಣಿಕೆ": [{"type": "noun", "defs": ["a present, fees, anything in kind, etc. given to one's teacher (usu. on completion of one's education or training).", "anything contributed to one's religious head or his institution."]}], "ಗುರುಕಾಯಿಸು": [{"type": "verb", "defs": ["(a dog in rage) to make its characteristic sound.", "to look at in anger.", "(fig.) to shout or speak sharply in anger."]}], "ಗುರುಕಿಡು": [{"type": "verb", "defs": ["to breathe during sleep with a rough, hoarse noise due to vibration of the soft palate; to snore.", "to utter a loud, rumbling sound as from anger or speak in a reprimanding tone."]}], "ಗುರುಕು": [{"type": "verb", "defs": ["= ಗುರುಗುಟ್ಟು."]}, {"type": "noun", "defs": ["= ಗುರುಕೆ."]}], "ಗುರುಕುಚ": [{"type": "noun", "defs": ["the round, plump breast of a woman."]}], "ಗುರುಕುಚೆ": [{"type": "noun", "defs": ["a woman whohas round, plump breasts."]}], "ಗುರುಕುಲ": [{"type": "noun", "defs": ["the residential school run by a teacher in his house.", "one's teacheṛs house.", "one's eldeṛs house."]}], "ಗುರುಕುಲವಾಸ": [{"type": "noun", "defs": ["a staying in one's teacheṛs house while studying."]}], "ಗುರುಕುಲವಾಸಿ": [{"type": "noun", "defs": ["a pupil or disciple staying in his teacheṛs house while studying."]}], "ಗುರುಕೆ": [{"type": "noun", "defs": ["a making of harsh sounds in breathing, while asleep as caused by vibration of the soft palate usu. with the mouth open; the act or sound of snoring.", "the loud, deep sound made by an animal, etc. that roars; roaring."]}], "ಗುರುಕ್ರಮ": [{"type": "noun", "defs": ["the series of teachers in an institution in their chronological order.", "the tradition, traditional instructions handed down from generation to generation of teachers in an institution, social system, etc."]}], "ಗುರುಗ": [{"type": "noun", "defs": ["the plant Eclipta prostrata ( = E. alba) of Asteraceae family; weed-ham."]}], "ಗುರುಗಂಜಿ": [{"type": "noun", "defs": ["= ಗುರುಗುಂಜಿ."]}], "ಗುರುಗಂಜಿಗಣ್ಣ": [{"type": "noun", "defs": ["a petty god of folklore."]}], "ಗುರುಗಡೆ": [{"type": "noun", "defs": ["a kind of bird."]}], "ಗುರುಗಾತ್ರ": [{"type": "noun", "defs": ["a hefty body (of a person)."]}], "ಗುರುಗು": [{"type": "noun", "defs": ["the plant Mackenziaea integrifolia ( = Strobilanthas integrifolius, = S. perfoliates) of Acanthaceae family.", "the tree Bridelia retusa of Euphorbiaceae family.", "the plant Chrozophra rottlerii of Euphorbiaceae family."]}], "ಗುರುಗುಂಜಿ": [{"type": "noun", "defs": ["the climbing plant Abrus precatorius of Papilionaceae family; wild liquorice weather plant.", "its poisonous, red and black seed, used for beads, and formerly, as a weight; crab's eye.", "another plant of the same family Abrus typica (var. albiflora.", "its seed.", "the weight of a wild liquorice seed (crab's eye) approx. 0.15 gm.)."]}], "ಗುರುಗುಂಜು": [{"type": "noun", "defs": ["= ಗುರುಗುಂಜಿ."]}], "ಗುರುಗುಂಜೆ": [{"type": "noun", "defs": ["= ಗುರುಗುಂಜಿ."]}], "ಗುರುಗುಟ್ಟು": [{"type": "verb", "defs": ["(the throat) to make indistinct sound (while being cleared).", "(such a sound) to be made.", "(fig.) (one's time of death) to be very close.", "(fig.) to utter harsh words, from anger."]}], "ಗುರುಗುಮ್ಮ": [{"type": "noun", "defs": ["a wicked or mischievous man, who does not seem to be so; an impostor."]}], "ಗುರುಗುಮ್ಮನೆ": [{"type": "adverb", "defs": ["without doing anything; without action; idly; inactively."]}], "ಗುರುಗುರಿಸು": [{"type": "verb", "defs": ["to breathe during sleep with a rough, hoarse noise due to vibration of the soft palate; to snore.", "to utter a loud, rumbling sound as from anger or speak in a reprimanding tone.", "(the throat) to make indistinct sound (while being cleared).", "(such a sound) to be made."]}], "ಗುರುಗುಲು": [{"type": "noun", "defs": ["the plant Heliotropium indicum of Boraginaceae family."]}], "ಗುರುಗೇಹಿನಿ": [{"type": "noun", "defs": ["one's teacheṛs wife."]}], "ಗುರುಚರ": [{"type": "noun", "defs": ["one's teacheṛs feet, as an object of reverence."]}], "ಗುರುಚಿಹ್ನೆ": [{"type": "noun", "defs": ["(pros.) a sign (-) used to represent a long syllable."]}], "ಗುರುಜನ": [{"type": "noun", "defs": ["(pl.) one's elders, teachers and advisors (often used as a general term for elders)."]}], "ಗುರುತನ": [{"type": "noun", "defs": ["the state or quality of being important, superior or excellent; significance; consequence; importance; superiority.", "the state of being, the duties of a teacher; teachership."]}], "ಗುರುತಪ್ಪುಗ": [{"type": "noun", "defs": ["a man who defies his elders, teachers or advisors."]}], "ಗುರುತರ": [{"type": "adjective", "defs": ["much higher in some quality or degree; much above the ordinary or average.", "having or commanding respect or reverence."]}], "ಗುರುತಲ್ಪ": [{"type": "noun", "defs": ["(fig.) one's teacheṛs wife."]}], "ಗುರುತಲ್ಪಗ": [{"type": "noun", "defs": ["a man who has sexual relation with the wife of his teacher."]}], "ಗುರುತಲ್ಪಗಮನ": [{"type": "noun", "defs": ["the fact that a man having sexual relation with the wife of his teacher, considered as one of the five heinous sins."]}], "ಗುರುತಿಡು": [{"type": "verb", "defs": ["to explain or detail one's characteristics; to indicate the distinctive feature or features of.", "to mark with (a sign, symbol or indication)."]}], "ಗುರುತಿಸು": [{"type": "verb", "defs": ["to be aware of as something or someone known before or as the same as that known; to recognise.", "to recognise as being or show to be the very person or thing known, described or claimed; fix the identity of; to identify.", "to set down in writing; make a note of; to note.", "to acknowledge the existence, worth or genuineness of; to appreciate."]}], "ಗುರುತು": [{"type": "noun", "defs": ["a visible trace or impression on a surface; a mark - a) a line, dot or other distinctive feature produced by drawing, colouring, stamping, etc. b) a spot, stain, scratch, blemish, mar, bruise, dent, etc.", "a sign, symbol or indication - a) a printed or written sign or stroke; b) a brand, label, seal, tag, etc. put on an article to show the owner, maker, etc; c) a sign or indication of some quality, character, etc. d) a cross or other sign made on a document as a substitute for a signature by a person unable to write.", "knowledge (of something) got from personal experience or study of it; the state or relation of being acquainted (with someone); acquaintance.", "the state of being famous; renown; fame.", "a mark or symbol having an accepted; a signature.", "ಗುರುತಿನವನು gurutinavanu a known man; a man whom one knows (but not intimately); ಗುರುತು ಹಾಕು gurutu hāku to put or make a mark or marks on; 2. to identify or designate by or as by a mark or marks; to set down in writing; to make a note of."]}], "ಗುರುತುಗ": [{"type": "noun", "defs": ["a man having an identification that is particular or characteristic to him, his position, rank or quality, character, etc."]}], "ಗುರುತುಚೀಟಿ": [{"type": "noun", "defs": ["a card or metal plate given to a person by the government, school organisation, etc. to help establish his or her identify; an identity card."]}], "ಗುರುತುಪಟ್ಟಿ": [{"type": "noun", "defs": ["a band, strip, ring of cloth, paper or metal, worn displaying one's identification of one's membership, status, grade of a person or type of responsibility one has.", "a strip or band of wood or metal used as a reference for level, height, etc."]}], "ಗುರುತುಹಚ್ಚು": [{"type": "verb", "defs": ["to know by some detail, as of appearance; to identify; to recognise."]}], "ಗುರುತುಹತ್ತು": [{"type": "verb", "defs": ["(one's identification) to become known; to be recognised; to be identified."]}], "ಗುರುತುಹಲಗೆ": [{"type": "noun", "defs": ["a piece of metal, wood, etc. on which a name, identification, characteristic mark is inscribed."]}], "ಗುರುತುಹಿಡಿ": [{"type": "verb", "defs": ["= ಗುರುತುಹಚ್ಚು."]}], "ಗುರುತೆ": [{"type": "noun", "defs": ["the quality of being worthy of esteem or honour; respectability; dignity; worthiness.", "reputation based on brilliance of achievement, character, etc.; prestige; renown."]}], "ಗುರುತೆವೆಱು": [{"type": "verb", "defs": ["to become estimable; to earn respectability."]}], "ಗುರುತ್ವ": [{"type": "noun", "defs": ["= ಗುರುತೆ.", "the quality or fact of being relatively heavier.", "the position, status or duty of a teacher; the profession of a teacher; teachership.", "(pros.) the state or fact of being long (said of a syllable).", "(phys.) the force by which every mass or particle of matter, including photons, attracts and is attracted by every other mass or particle of matter; gravitation.", "(phys.) the tendency of these masses or particles to move toward each other.", "the effect of gravitation, esp. the falling of bodies to the earth."]}], "ಗುರುತ್ವಕೇಂದ್ರ": [{"type": "noun", "defs": ["that point in a body or system around which its mass or weight is evenly distributed or balanced and through which the force of gravity acts; the centre of gravity."]}], "ಗುರುತ್ವಮಧ್ಯ": [{"type": "noun", "defs": ["= ಗುರುತ್ವಕೇಂದ್ರ."]}], "ಗುರುತ್ವವಡೆ": [{"type": "verb", "defs": ["= ಗುರುತೆವೆಱು."]}], "ಗರುತ್ವವೇಗೋತ್ಕರ್ಷ": [{"type": "noun", "defs": ["the acceleration that a freely falling object gets due to the gravitational power (as of the earth); acceleration due to gravity."]}], "ಗುರುತ್ವಶಕ್ತಿ": [{"type": "noun", "defs": ["the force by which every mass or particle of matter, including photons, attracts and is attracted by every other mass or particle of matter; the gravitational force (as of the earth)."]}], "ಗುರುತ್ವಾಂಕ": [{"type": "noun", "defs": ["the constant that is equal to the product of two masses that are attracting each other and divided by the square of the distance between them, which is reckoned as the force of attraction between them; the constant of gravitation."]}], "ಗುರುತ್ವಾಕರ್ಷಣ": [{"type": "noun", "defs": ["(phys.) the fact of a mass or particle of matter, including photons, being attracted by every other mass or particle of matter; gravitation."]}], "ಗುರುತ್ವಾಕರ್ಷಣ ನಿಯಮ": [{"type": "noun", "defs": ["the natural law that governs the attraction of objects that are free in the space, by the earth; the law of gravitation."]}], "ಗುರುತ್ವಾಕರ್ಷಣ ಶಕ್ತಿ": [{"type": "noun", "defs": ["= ಗುರುತ್ವಶಕ್ತಿ."]}], "ಗುರುದಕ್ಷಿಣೆ": [{"type": "noun", "defs": ["a present, fees or anything in kind, etc. given to one's teacher (usu. on completion of one's education or training).", "anything contributed to one's religious head or his institution."]}], "ಗುರುದೆ": [{"type": "noun", "defs": ["a thick, cylindrical piece of wood with metal rings fixed on both ends, used as a weapon or for pounding; a pestle or bludgeon."]}], "ಗುರುದ್ರೋಹ": [{"type": "noun", "defs": ["the act of treating one's teacher with irreverence or contempt; to desecrate one's relation with or cheat, his or her teacher, parent, elder or venerable person (which is considered as one of the heinous sins)."]}], "ಗುರುದ್ರೋಹಿ": [{"type": "noun", "defs": ["a person who treats with irreverence or disregard or who violates or sullies the instructions order etc. of, one's teacher, parent, elder, etc."]}], "ಗುರುದ್ವಾರ": [{"type": "noun", "defs": ["a temple or place or worship of Sikh people."]}], "ಗುರುದ್ವೇಷ": [{"type": "noun", "defs": ["a hating of, treating with irreverence or having contemptuous rivalry with, one's teacher, parent, respectful person etc."]}], "ಗುರುಪಥ": [{"type": "noun", "defs": ["the path shown, revealed or enlightened by one's teacher."]}], "ಗುರುಪರಂಪರೆ": [{"type": "noun", "defs": ["the series of teachers in an institution in their chronological order."]}], "ಗುರುಪಾಡೆ": [{"type": "noun", "defs": ["the plant Glycosmis cohinchinensis of Rutaceae family."]}], "ಗುರುಪಾತಕ": [{"type": "noun", "defs": ["a (most) heinous sin.", "a man who has committed such a sin."]}], "ಗುರುಬಂಧು": [{"type": "noun", "defs": ["a person as related to another both of whom studied under the same teacher; a fellow disciple or student."]}], "ಗುರುಬಲ": [{"type": "noun", "defs": ["(astrol.) the favourable aspect of the planet Jupiter during a period, which is considered necessary for occasions as marriage, upanayana, etc."]}], "ಗುರುಬು": [{"type": "noun", "defs": ["a covering made of a blanket, gunny bag or reeds, for the head, neck and back, used as a protection against rain; a hood."]}], "ಗುರುಬ್ರುವ": [{"type": "noun", "defs": ["(masc.) a man who claims himself to be a teacher, an elder to, etc."]}], "ಗುರುಭಾರ": [{"type": "noun", "defs": ["a burden; a heavy load.", "anything that one has to bear or put up with as of work, duty, responsibility, loss, etc."]}], "ಗುರುಮಂತ್ರ": [{"type": "noun", "defs": ["the advice given by one's teacher.", "the political wisdom enunciated by Břhaspati, the preceptor of gods."]}], "ಗುರುಮಠ": [{"type": "noun", "defs": ["the house, place where a religious pontiff normally lives; a monastery.", "a place or institution for teaching and learning; a school."]}], "ಗುರುಮಣಿ": [{"type": "noun", "defs": ["the small tree Elaeocarpus amoenus of Elaeocarpaceae family."]}], "ಗುರುಮನೆ": [{"type": "noun", "defs": ["= ಗುರುಮಠ - 1."]}], "ಗುರುಮುಖ": [{"type": "noun", "defs": ["(masc.) one's teacher, from whom knowledge is got."]}], "ಗುರುಮುಖೇನ": [{"type": "adverb", "defs": ["through (one's) teacher."]}], "ಗುರುಯೋಷಿತೆ": [{"type": "noun", "defs": ["the wife of one's teacher.", "a woman worthy of respect or reverence by reason of her age and dignity, character or position; a respectable woman."]}], "ಗುರುರಾಯ": [{"type": "noun", "defs": ["a good teacher.", "an epithet of Madvācārya, the founder of the philosophy of dualism.", "a common term used to refer to Rāghavēndra Swāmi of Mantrālaya monastery, belonging to the same school of philosophy."]}], "ಗುರುಲಘುಗಣನ": [{"type": "noun", "defs": ["the act of distinguishing differences between big and small, important and unimportant, etc.; discrimination.", "(pros.) the act of identifying the longness and shortness of syllables in a verse."]}], "ಗುರುಲಾಘವ": [{"type": "noun", "defs": ["= ಗುರುಲಘುಗಣನ -1."]}], "ಗುರುಲಿಂಗ": [{"type": "noun", "defs": ["(vīr.) the phallus of Śiva, considered as one's teacher, guide."]}], "ಗುರುವಚನ": [{"type": "noun", "defs": ["the teachings, advice, instruction of one's teacher, preceptor or religious pontiff or elder (esp. parent)."]}], "ಗರುವರಿಯ": [{"type": "noun", "defs": ["= ಗುರುವರ್ಯ."]}], "ಗುರುವರ್ಯ": [{"type": "noun", "defs": ["(masc.) a respectable teacher, preceptor."]}], "ಗುರುವರ್ಯೆ": [{"type": "noun", "defs": ["(fem.) a respectable teacher, preceptor."]}], "ಗುರುವಲೆ": [{"type": "noun", "defs": ["the tree Glycosmis mauritiana of Rutaceae family (akin to ಗುರುಪಾಡೆ)."]}], "ಗುರುವಾಡೆ": [{"type": "noun", "defs": ["= ಗುರುಪಾಡೆ."]}], "ಗುರುವಾರ": [{"type": "noun", "defs": ["the fifth day of the week; Thursday."]}], "ಗುರುವಿಘಾತಕ": [{"type": "noun", "defs": ["a person who treats with irreverence or disregard or who violates or sullies the instruction order etc. of, one's teacher, parent, elder, etc."]}], "ಗುರುವಿಘಾತಿ": [{"type": "noun", "defs": ["= ಗುರುವಿಘಾತಕ."]}], "ಗುರುವಿಯೋಗ": [{"type": "noun", "defs": ["a being separated from one's teacher, preceptor, elder, parent, etc. (caused either by physical separation or death); an instance of this."]}], "ಗುರುಶೇಷ": [{"type": "noun", "defs": ["that which (as used cloth, food, etc.) is offered by a teacher, religious pontiff, with his blessings to his pupil."]}], "ಗುರುಸಾರ್ವಭೌಮ": [{"type": "noun", "defs": ["a common term used to refer to Rāghavēndra Swāmi of Mantrālaya Monastery, belonging to the school of dualistic philosophy."]}], "ಗುರುಸೇವೆ": [{"type": "noun", "defs": ["work, service done for one's teacher, elder, parent, etc."]}], "ಗುರುಳಿ": [{"type": "noun", "defs": ["= ಗುರುಳೆ."]}], "ಗುರುಳೆ": [{"type": "noun", "defs": ["a thin sphere of liquid enclosing air etc; a bubble.", "an inflamed, pus-filled swelling caused by infection or an abnormal protuberance on or in the body; a boil; a swelling.", "a hard outer covering, as of a mollusc, insect, etc.; a shell.", "a small, circular band of metal, usu. of silver, worn by a married woman on the second toe; a toe-ring.", "anything that is spherical; a ball or ball-like thing."]}], "ಗುರೂಪಧೆ": [{"type": "noun", "defs": ["(gram.) a word in which the syllable previous to the last one being long."]}], "ಗುರೂಪಾಂತ": [{"type": "noun", "defs": ["the fact of condition of being, sitting, living, closer to one's teacher."]}], "ಗುರೆಳ್ಳು": [{"type": "noun", "defs": ["the niger plant Guizotia abyssinica of Asteraceae family.", "its seed."]}], "ಗುರ್ಕಾರ": [{"type": "noun", "defs": ["(masc.) a skilled archer; a marksman.", "(masc.) an officer appointed by a king to head a department in the palace or a village, etc.; a headman."]}], "ಗುರ್ಗುಳ": [{"type": "noun", "defs": ["the tree Ailanthus malabarica of Simaroubaceae family.", "its resin, used as incense.", "(vīr.) a service of carrying this resin to a deity.", "the tree Agathis australis of Araucariaceae family.", "its resin.", "the tree Boswellia glabra of Burseraceae family; Indian olibanum.", "a gum resin obtained from this, used in perfumes and as incense; olibanum.", "the tree Commiphora mukul, ( = Balsamodendrum mukul) of Burseraceae family; bdellium tree.", "a myrrh-like gum resin of this tree.", "another tree of the same family Commiphora agallocha ( = Balsamodendrum roxburghii.", "its resin used as incense.", "the tree Dipterocarpous indicus ( = D. turbinatus) of Dipterocarpaceae family.", "the tree Moringa oleifera ( = M. pterygosperma, = Hyperanthera moringa) of Moringaceae family; the drum-stick tree.", "its slender, long fruit, used as vegetable."]}], "ಗುರ್ಚಿ": [{"type": "noun", "defs": ["a rain-god of folklore."]}, {"type": "noun", "defs": ["the tree Garcinia xanthochymus ( = G. pictoria, = G. tinctoria) of Guttiferae family; Mysore gamboge."]}], "ಗುರ್ಜರ": [{"type": "noun", "defs": ["a state in the western part of India, with Gandhinagar as its capital.", "a man of, from or primarily belonging to that state."]}], "ಗುರ್ಜರಿ": [{"type": "noun", "defs": ["a musical mode, in Karnāṭaka system, derived from the main mode Māyāmālavagauḷa."]}], "ಗುರ್ಜು": [{"type": "noun", "defs": ["the quality or state of being short, dwarf; dwarfishness.", "a man of short stature.", "a thick, short wooden pole used as a buttress for a roof from below.", "a small pole fixed vertically on the side beams of a cart, used as a support for the side walls."]}], "ಗುರ್ಜುಗೊಳ್": [{"type": "verb", "defs": ["to become smaller; to shrink or contract (oneself).", "to become flat or flatter.", "to sink, bend or curve from weight or pressure; to sag.", "(the speed) to be reduced; to become slow."]}], "ಗುರ್ದು": [{"type": "verb", "defs": ["to strike with the fist; to punch.", "to prod or poke with a stick."]}, {"type": "noun", "defs": ["a thrusting blow with the fist; a punch."]}], "ಗುರ್ಬು": [{"type": "noun", "defs": ["= ಗುರ್ವು."]}], "ಗುರ್ಮ": [{"type": "noun", "defs": ["something that seems to appear to the sight but has no physical existence; a spectre.", "an imaginary hobgoblin or terror used to frighten children into good conduct or that which is used to frighten but is actually not harmful; a bugbear; a scarecrow.", "any nocturnal bird of prey of the order Strigiformes, with large eyes and a hooked beak, including barn owls, tawny owls, etc.; an owl."]}], "ಗುರ್ರೆ": [{"type": "noun", "defs": ["the first day of any calendar month."]}], "ಗುರ್ವನುಗ್ರಹ": [{"type": "noun", "defs": ["a blessing or benediction of one's teacher, religious head, seer, etc."]}], "ಗುರ್ವಿ": [{"type": "noun", "defs": ["= ಗುರ್ವಿಣಿ."]}], "ಗುರ್ವಿಣಿ": [{"type": "noun", "defs": ["a woman having an offspring or offsprings developing in the uterus; a pregnant woman."]}], "ಗುರ್ವು": [{"type": "noun", "defs": ["the quality or state of causing fear, awe; dreadfulness.", "the sense caused by dreadfulness, amazement or awe; great fear; astonishment mingled with wonder.", "marked courage or bravery; valour; heroism.", "the quality by which one excels another; excelling merit, quality; greatness; excessiveness.", "excessiveness in terms of quantity or number; plentifulness.", "the quality of being worthy of esteem or honour; worthiness; dignity."]}], "ಗುರ್ವೆ": [{"type": "noun", "defs": ["the tree Ixora arborea (=I. parviflora) of Rubiaceae family; (?)."]}], "ಗುಲಂದಾಜ": [{"type": "noun", "defs": ["a soldier trained in the use of cannons, mounted heavy-guns, etc.; an artilleryman.", "the branch of an army specialised in the use of heavy mounted guns; the artillery."]}], "ಗುಲಕಂದ": [{"type": "noun", "defs": ["a kind of sweet and nutritious jam made of rose petals."]}], "ಗುಲಗಂಜಿ": [{"type": "noun", "defs": ["the climbing plant Abrus precatorius of Papilionaceae family; wild liquorice weather plant.", "its poisonous, red and black seed, used for beads, and formerly, as a weight; crab's eye.", "another plant of the same family Abrus typica (var. albiflora).", "its seed.", "the weight of a wild liquorice seed (crab's eye) (approx. 0.15 gm.)."]}], "ಗುಲಗಂಜಿದುಂಬಿ": [{"type": "noun", "defs": ["the beetle Epilachna that affects growth of plants."]}], "ಗುಲಗಂಜೆ": [{"type": "noun", "defs": ["= ಗುಲಗಂಜಿ."]}], "ಗುಲಗುಂಜಿ": [{"type": "noun", "defs": ["= ಗುಲಗಂಜಿ."]}], "ಗುಲಗುಂಜೆ": [{"type": "noun", "defs": ["= ಗುಲಗಂಜಿ."]}], "ಗುಲಬಾಕ್ಷಿ": [{"type": "noun", "defs": ["a kind of flowering plant."]}], "ಗುಲಾಡು": [{"type": "noun", "defs": ["= ಗುಲುಡು."]}], "ಗುಲಾಬಜಾಮ": [{"type": "noun", "defs": ["= ಗುಲಾಬಜಾಮೂನು."]}], "ಗುಲಾಬಜಾಮೂನು": [{"type": "noun", "defs": ["a kind of sweet dish, round in shape, and usu. preserved in sugar syrup."]}], "ಗುಲಾಬದಾಣಿ": [{"type": "noun", "defs": ["= ಗುಲಾಬದಾನಿ."]}], "ಗುಲಾಬದಾನಿ": [{"type": "noun", "defs": ["a container, usu. ornamented, with a porous lid on its snout, for sprinkling the preparation of water and attar of roses."]}], "ಗುಲಾಬಿ": [{"type": "adjective", "defs": ["of rose, pinkish or purplish red colour."]}, {"type": "noun", "defs": ["any of a genus (Rosa) of shrubs of the Rosaceae family, characteristically with prickly stems, alternate compound leaves.", "its five-parted, usu. fragrant flowers of red, pink, white, yellow, etc. having many stamens; rose.", "pinkish red or purplish red colour."]}], "ಗುಲಾಮ": [{"type": "noun", "defs": ["(masc.) a human being, as in feudal systems, owned as property by, and is absolutely subject to the will of, another; bondservant divested of all freedom and personal rights; a slave.", "(masc.) a person employed to perform services, esp. household duties, for another; a servant.", "(masc.) a person who is completely dominated by some influence, habit, person, etc.", "a man of ignoble quality or base mentality; a menial man.", "a playing card with a conventionalised picture of a male slave or a soldier on it; a jack."]}], "ಗುಲಾಮಗಿರಿ": [{"type": "noun", "defs": ["the condition of being a slave; absolute subjection to another person who owns and completely controls one; bondage; servitude; slavery.", "the condition of being a servant, worker engaged in hard, menial or tiresome work (esp. working against one's will)."]}], "ಗುಲಾಮಚಾಕರಿ": [{"type": "noun", "defs": ["the work done by, forced to do by a slave.", "a work, job that is hard, menial being done against one's will; such an occupation."]}], "ಗುಲಾಮಪದ್ಧತಿ": [{"type": "noun", "defs": ["the system of buying and selling slaves and keeping them as serfs under bondage; feudalism; serfdom."]}], "ಗುಲಾಮೀ": [{"type": "adjective", "defs": ["of or belonging to serfdom."]}], "ಗುಲಾಮೀಪದ್ಧತಿ": [{"type": "noun", "defs": ["= ಗುಲಾಮಪದ್ಧತಿ."]}], "ಗುಲಾರ": [{"type": "noun", "defs": ["the deciduous tree Ficus glomerta of Moraceae family."]}], "ಗುಲಾಲು": [{"type": "noun", "defs": ["a kind of red powder used to throw, sprinkle mutually on, on festive occasions."]}], "ಗುಲಿಕಲು": [{"type": "noun", "defs": ["a stone set up to mark the boundaries of fragmented agricultural land; a boundary-stone."]}], "ಗುಲಿಕೆ": [{"type": "noun", "defs": ["a small ball of glass, etc, used to play with; a marble.", "a ball or disc etc. of solid medicine for swallowing whole; a pill.", "a smooth, hard, usu. white or bluish-grey, abnormal nacreous growth of various shapes (usu. round ones) formed around a grain of sand, a parasite or other foreign body within the shell of some oysters and certain other bivalve molluscs, used as a gem; a pearl."]}], "ಗುಲಿಗಂಜಿ": [{"type": "noun", "defs": ["= ಗುಲಗಂಜಿ."]}], "ಗುಲಿಮಾವು": [{"type": "noun", "defs": ["the plant Cryptocarya wightiana of Lauraceae family; Brazilian nutmeg."]}], "ಗುಲುಂಛನ": [{"type": "noun", "defs": ["= ಗುಲುಚ್ಛ."]}], "ಗುಲುಗಂಜಿ": [{"type": "noun", "defs": ["= ಗುಲಗಂಜಿ."]}], "ಗುಲುಗು": [{"type": "noun", "defs": ["difficulty - a) the condition or fact of being difficult; b) something that is difficult, as a hard problem or an obstacle or objection."]}, {"type": "noun", "defs": ["a loud, continuous, indistinct sound (as the incessant chattering sound made by large number of children at the same time or the one made by the bells attached to the anklets)."]}], "ಗುಲುಗುಂಜಿ": [{"type": "noun", "defs": ["= ಗುಲಗಂಜಿ."]}], "ಗುಲುಚ್ಛ": [{"type": "noun", "defs": ["a cluster of things growing or fastened together (as flowers, grapes, etc.); a bunch."]}], "ಗುಲುಡು": [{"type": "noun", "defs": ["the tree Gmelina asiatica of Verbenaceae family."]}], "ಗುಲುಮ": [{"type": "noun", "defs": ["= ಗುಲ್ಮ - 1."]}], "ಗುಲ್ಕನ್ನು": [{"type": "noun", "defs": ["a kind of sweet and nutritious jam made of rose petals."]}], "ಗುಲ್ಡು": [{"type": "noun", "defs": ["a stupid person."]}], "ಗುಲ್ಫ": [{"type": "noun", "defs": ["the joint that connects the foot and the leg; the ankle."]}], "ಗುಲ್ಫದ್ವಯಸ": [{"type": "adjective", "defs": ["ankle-high deep."]}], "ಗುಲ್ಫಾಸ್ಥಿ": [{"type": "noun", "defs": ["the ankle-bone in humans; the astragalus."]}], "ಗುಲ್ಫಿ": [{"type": "noun", "defs": ["a kind of bird ( = small owl) supposed to give indication of what will happen in future."]}], "ಗುಲ್ಮ": [{"type": "noun", "defs": ["a cluster of shrubs, underbush or small trees; a thicket.", "a unit or subdivision of an army consisting of nine elephants, nine chariots, twenty-seven horses and forty- five foot soldiers.", "a large, vascular, lymphatic organ in the upper left part of the abdominal cavity of vertebrates, near the stomach, that has various functions in modifying the structure of the blood and forms part of the immune system; the spleen.", "a particular disease of the spleen.", "a kind of tropical tree."]}], "ಗುಲ್ಮಗಂಧಿ": [{"type": "noun", "defs": ["= ಗುಲ್ಮ -4."]}], "ಗುಲ್ಮಜ್ವರ": [{"type": "noun", "defs": ["= ಗುಲ್ಮ -4."]}], "ಗುಲ್ಮಮುಖ": [{"type": "noun", "defs": ["the captain of a unit or subdivision of an army consisting of nine elephants, nine chariots, twenty-seven horses and forty- five foot soldiers."]}], "ಗುಲ್ಮಲ": [{"type": "noun", "defs": ["= ಗುಲ್ಮಾಲ್."]}], "ಗುಲ್ಮವೃದ್ಧಿ": [{"type": "noun", "defs": ["a disease characterised by enlargement of the spleen."]}], "ಗುಲ್ಮಶೂಲೆ": [{"type": "noun", "defs": ["a disease of the spleen.", "pain caused by it."]}], "ಗುಲ್ಮಹರ್": [{"type": "noun", "defs": ["the evergreen tree Delonix regia ( = Poinciana regia) of Ceasalpiniaceae family; gold mohur."]}], "ಗುಲ್ಮಾರ್": [{"type": null, "defs": []}], "ಗುಲ್ಮಾಲ್": [{"type": "noun", "defs": ["the act of concealing deliberately (something) from another's or otheṛs knowledge.", "the act of cheating another by bungling up or creating a mess of something.", "the condition of disturbance; commotion."]}], "ಗುಲ್ಮಿ": [{"type": "noun", "defs": ["a person suffering from the disease of the spleen."]}], "ಗುಲ್ಮಿನಿ": [{"type": "noun", "defs": ["any of several creepers that spread.", "a woman suffering from the disease of the spleen."]}], "ಗುಲ್ಮೊಹರ್": [{"type": "noun", "defs": ["= ಗುಲ್ಮಹರ್."]}], "ಗುಲ್ಮೊಹೊರ್": [{"type": "noun", "defs": ["= ಗುಲ್ಮಹರ್."]}], "ಗುಲ್ಮೊಹೋರ್": [{"type": "noun", "defs": ["= ಗುಲ್ಮಹರ್."]}], "ಗುಲ್ಲ": [{"type": "noun", "defs": ["the small tree Mastixia arborea of Cornaceae family; oblong leaved cornel."]}], "ಗುಲ್ಲಕಂಚಿ": [{"type": "noun", "defs": ["the plant Crotalaria rubiginosa of Papilionaceae family, a kind of rattle wort."]}], "ಗುಲ್ಲನೆ": [{"type": "adverb", "defs": ["(moving, turning, causing to rotate etc.) with a whizzing or buzzing sound."]}], "ಗುಲ್ಲು": [{"type": "noun", "defs": ["noise of a crowd; din of voices; clamour; hub-bub.", "2) a wide spread (but, usu. baseless or unconfirmed) news; rumour.", "ಗುಲ್ಲು ಮಾಡು gullu māḍu = ಗುಲ್ಲುಹಬ್ಬಿಸು; ನಿತ್ಯ ಪಯಣ ಬುತ್ತಿಗೇಡು, ಬರೀ ಗುಲ್ಲು ನಿದ್ದೆಗೇಡು nitya payaṇa buttigēḍu. barī gullu niddegēḍu (prov.) a defaming by spreading baseless rumours results in sleepless nights, as aimless touring results in missing of one's regular food."]}], "ಗುಲ್ಲುಹಬ್ಬಿಸು": [{"type": "verb", "defs": ["to cause uproar, hub-hub.", "to spread widely baseless (esp. defaming) news."]}], "ಗುಲ್ಲೆಬ್ಬಿಸು": [{"type": "verb", "defs": ["= ಗುಲ್ಲುಹಬ್ಬಿಸು."]}], "ಗುಲ್ಲೇಳು": [{"type": "verb", "defs": ["(a rumour, gossip, hearsay) to be spread widely."]}], "ಗುವಾಕ": [{"type": "noun", "defs": ["the tree Areca catechu of Arecaceae family; the betel palm.", "its hard nut; betel nut."]}], "ಗುವಿ": [{"type": "noun", "defs": ["= ಗುಹೆ."]}], "ಗುಷ್ಟು": [{"type": "noun", "defs": ["sediment precipitated from a liquid; solid particles of a liquid forming a residue; dregs.", "(fig.) any refuse, dirt, sweepings, rubbish or worthless thing."]}], "ಗುಸ": [{"type": "noun", "defs": ["= ಗುಸು."]}, {"type": "noun", "defs": ["a sudden action, intentional or unintentional, resulting in a harmful impact; a stroke; a blow.", "a feeling of displeasure resulting from injury, mistreatment, opposition, etc., followed by a desire to fight back at or to blame or scold, in a sharp manner, the person who caused such a feeling; anger."]}], "ಗುಸು": [{"type": "noun", "defs": ["(usu. used in dupl. as ಗುಸುಗುಸು) a low muttering or whispering sound.", "a sound imitating it."]}], "ಗುಸುಗಾಟ": [{"type": "noun", "defs": ["the act of making low whispering sounds."]}], "ಗುಸುಗುಂಪಲು": [{"type": "noun", "defs": ["a talking amongst many people in a low and indistinct voice.", "a sound imitating it.", "the subdued sound of continuous talking.", "a blame, censure or accusation prevalent against a person or institution, but not spoken out by people.", "a doubt; an inclination to disbelieve."]}], "ಗುಸುಗುಂಪು": [{"type": "noun", "defs": ["= ಗುಸುಗುಂಪಲು."]}], "ಗುಸುಗುಟ್ಟು": [{"type": "verb", "defs": ["to talk quietly or furtively, as in gossiping; to whisper."]}], "ಗುಸುಗುಸು": [{"type": "noun", "defs": ["= ಗುಸು."]}], "ಗುಸುಗುಸುಗುಟ್ಟು": [{"type": "verb", "defs": ["= ಗುಸುಗುಟ್ಟು."]}], "ಗುಸುಟು": [{"type": "noun", "defs": ["the whispering sound.", "the act of making low whispering sounds; an instance of whispering.", "the relation with, reference to or interest in another's affairs or things."]}], "ಗುಸುನಗೆ": [{"type": "noun", "defs": ["a gentle facial expression showing pleasure, satisfaction, amusement, affection, friendliness by an upward curving the corners of the mouth, without opening the mouth; smile."]}], "ಗುಸುಮುಸಿ": [{"type": "noun", "defs": ["a wide spread (but, usu. baseless or unconfirmed) news; rumour."]}], "ಗುಹ": [{"type": "noun", "defs": ["Subrahmaṇya, the son of Śiva."]}], "ಗುಹಾಂಗಣ": [{"type": "noun", "defs": ["the space in front of a cave."]}], "ಗುಹಾಂತರ": [{"type": "noun", "defs": ["the inner space of a cave."]}], "ಗುಹಾಧ್ವನಿ": [{"type": "noun", "defs": ["the repetition of a sound by reflection of sound waves; echo.", "(fig.) any repetition or imitation of the words, style, ideas, etc. of another; something said or another's saying repeated, without originality of one's own."]}], "ಗುಹಾನಿಹಿತ": [{"type": "adjective", "defs": ["kept, deposited, hidden in a cave."]}, {"type": "noun", "defs": ["the Supreme Being that is immanent in all living and non-living beings.", "(fig.) that which is kept, as a secret, from otheṛs knowledge."]}], "ಗುಹಾಲಯ": [{"type": "noun", "defs": ["a relatively big caves, whether naturally formed or man-made, large enough to live in."]}], "ಗುಹಾಲಿಪಿ": [{"type": "noun", "defs": ["the letter or writings on the walls of a cave or caves."]}], "ಗುಹಾಲೇಖ": [{"type": "noun", "defs": ["the writing or writings on the walls of a cave or caves."]}], "ಗುಹಾಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["the scientific study and exploration of caves; speleology."]}], "ಗುಹಾಹಿತ": [{"type": "adjective", "defs": ["kept, deposited, hidden in a cave."]}, {"type": "noun", "defs": ["the Supreme Being.", "(fig.) that which is kept, as a secret, from otheṛs knowledge."]}], "ಗುಹಿಲಿಕ್ಕು": [{"type": "verb", "defs": ["to laugh with a hoarse sound (as in great merriment, contempt or scorn, etc.)."]}], "ಗುಹಿಲು": [{"type": "noun", "defs": ["the hoarse sound made in laughing.", "such a laugh."]}], "ಗುಹೆ": [{"type": "noun", "defs": ["a hollow place inside the earth, usu. an opening, as in a hillside, extending back horizontally; a cave.", "a place of refuge; a resort; a house.", "the plant Hemionites arifolia ( = H. cordifolia) of Polypodiaceae family."]}], "ಗುಹ್ನೆ": [{"type": "noun", "defs": ["the act of breaking a law; sin or crime; transgression; an offence; a misdeed."]}], "ಗುಹ್ನೇಗಾರ": [{"type": "noun", "defs": ["a man who has neglected his duty, committed an offence, hurt others, etc.; an offender.", "a man guilty of or legally convicted of, a crime; a criminal."]}], "ಗುಹ್ಯ": [{"type": "adjective", "defs": ["kept as a secret.", "fit to be maintained as a secret.", "beyond general knowledge or understanding; mysterious or esoteric."]}, {"type": "noun", "defs": ["that which is or must be, kept as a secret.", "a sin, crime etc. that must not be committed.", "an additional, supplementary or auxiliary thing or matter (as opp. to the main one).", "the sexual organ (of a human being).", "a narrow, long piece of cloth, used to cover the loins (as by ascetics or some peoples in warm climates, esp. aboriginals).", "a place fortified by mountains on all the sides and having a single entrance."]}], "ಗುಹ್ಯಕ": [{"type": "noun", "defs": ["Kubēra, the Regent who guards wealth.", "a class of deities, attendants of Kubēra."]}], "ಗುಹ್ಯಕೇಶ್ವರ": [{"type": "noun", "defs": ["= ಗುಹ್ಯಕ - 1."]}], "ಗುಹ್ಯರೋಗ": [{"type": "noun", "defs": ["any of the diseases, as syphilis, gonorrhoea, etc., transmitted only or chiefly by sexual intercourse with an infected individual; a venereal disease."]}], "ಗುಹ್ಯಲಂಪಟ": [{"type": "noun", "defs": ["a man excessively preoccupied with sexual pleasures; a lustful or lecherous man; a lecher."]}], "ಗುಹ್ಯಲಂಪಟತ್ವ": [{"type": "noun", "defs": ["the quality or the tendency of being excessively occupied with sexual pleasures."]}], "ಗುಹ್ಯಲಂಪಟೆ": [{"type": "noun", "defs": ["a woman excessively preoccupied with sexual pleasures; a lustful woman."]}], "ಗುಹ್ಯಾಂಗ": [{"type": "noun", "defs": ["the sexual organ (of a human being)."]}], "ಗುಹ್ಯಾತ್ಮ": [{"type": "noun", "defs": ["the Supreme Being that is immanent in all living and non-living beings."]}], "ಗುಳ್": [{"type": "noun", "defs": ["the sound of a sudden and loud laugh.", "a sound imitating it."]}], "ಗುಳ": [{"type": "noun", "defs": ["the plant Solanum indicum of Solanaceae family.", "its fruit.", "the plant Solanum ferox of the same family."]}, {"type": "noun", "defs": ["the part of a plough that cuts the soil; a plough-share.", "an iron bar used to burn a mark on the skin; a branding-rod."]}, {"type": "noun", "defs": ["a dark, crude sugar from the sap of sugarcane; jaggery.", "anything that is round or globular in shape, as a ball.", "an armour that covers the back and the sides of a horse or elephant.", "(dial.) the fleshy and juicy part of a fruit; pulp."]}], "ಗುಳಂಬ": [{"type": "noun", "defs": ["sliced mango, Indian goose berry (of Phyllanthus emblica), etc. kept in the sugar or jaggery syrup."]}], "ಗುಳಕ್": [{"type": "noun", "defs": ["the sound at the throat made in swallowing or gulping something hastily or greedily.", "a sound imitating it."]}], "ಗುಳಕವ್ವ": [{"type": "noun", "defs": ["an idol of Gauri, the wife of Śiva, made of earth."]}], "ಗುಳಗಿಚಣ್ಣ": [{"type": "noun", "defs": ["trousers reaching to or just below the knees and often tapered to fit closely; breeches."]}], "ಗುಳಗಿಚೊಣ್ಣ": [{"type": "noun", "defs": ["= ಗುಳಗಿಚಣ್ಣ."]}], "ಗುಳದಾಳಿ": [{"type": "noun", "defs": ["the small, round piece of gold stringed to the necklace of a married woman, as a symbol of her husband being alive."]}], "ಗುಳಪಪ್ಪಡಿ": [{"type": "noun", "defs": ["= ಗುಳಪಾವಟೆ."]}], "ಗುಳಪಾವಟೆ": [{"type": "noun", "defs": ["a kind of sweet dish, usu. round in shape, made of wheat flour, jaggery, etc."]}], "ಗುಳಪುಟ್ಟಿ": [{"type": "noun", "defs": ["a small basket, made of inter-woven bamboo strips."]}], "ಗುಳಲ": [{"type": "noun", "defs": ["= ಗುಳ1."]}], "ಗುಳವತ್ತಿ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಗುಳಾಪು": [{"type": "noun", "defs": ["a round glass container, esp. the ornamental ones; a globe; a bulb."]}], "ಗುಳಿ": [{"type": "noun", "defs": ["a hole or cavity in the ground; a pit; a depressed part or place; a hollow.", "a hollow place within something; a cavity."]}], "ಗುಳಿಕ": [{"type": "noun", "defs": ["(myth.) one of the eight chief serpents.", "(astrol.) one of the minor planets, a satellite of Saturn."]}], "ಗುಳಿಕಕಾಲ": [{"type": "noun", "defs": ["a time (of 90 minutes duration, every day) that is considered as inauspicious for beginning any work."]}], "ಗುಳಿಗ": [{"type": "noun", "defs": ["(dial.) name of a demon."]}], "ಗುಳಿಗಣ್ಣು": [{"type": "noun", "defs": ["a sunken eye."]}], "ಗುಳಿಗದ್ದೆ": [{"type": "noun", "defs": ["a (paddy) field that is lower in level than the fields surround it."]}], "ಗುಳಿಗೆ": [{"type": "noun", "defs": ["a small ball, tablet, capsule, etc. of medicine to be swallowed whole; a pill.", "anything that is round or globular.", "an archaic coin.", "a false statement; a lie."]}, {"type": "noun", "defs": ["the joint that connects the foot and the leg; the ankle."]}], "ಗುಳಿಗೆಗಟ್ಟು": [{"type": "verb", "defs": ["to form into a ball or ball-like object.", "(fig.) to take handful of food (for eating)."]}], "ಗುಳಿಗೆಯಿಕ್ಕು": [{"type": "verb", "defs": ["= ಗುಳಿಗೆಗಟ್ಟು;", "to administer poison (secretly)."]}], "ಗುಳಿಗೆಯಿಡು": [{"type": "verb", "defs": ["= ಗುಳಿಗೆಗಟ್ಟು."]}], "ಗುಳಿಗೆಯೆತ್ತು": [{"type": "verb", "defs": ["to take handful of food (for eating)."]}], "ಗುಳಿಬೀಳು": [{"type": "verb", "defs": ["(the surface of something) to become depressed; to become hollow; to sink; to sag; to become dented."]}], "ಗುಳಿಮಣೆ": [{"type": "noun", "defs": ["a wooden board with two rows of seven hollows used to play on with cowries or tamarind seeds."]}], "ಗುಳು": [{"type": "noun", "defs": ["= ಗುಳ2."]}, {"type": "noun", "defs": ["a tax or duty levied by a government to raise revenue for administration.", "a tax- payer.", "a man who has taken a piece of agricultural land from another on lease on the contract to pay the owner of the land a fixed amount of money or agricultural produce."]}], "ಗುಳುಂ": [{"type": "noun", "defs": ["the sound at the throat made in swallowing or gulping something hastily or greedily.", "a sound imitating it.", "the act or an instance of swindling another's or public money, property, etc.", "ಗುಳುಂ ಮಾಡು guḷum māḍu to swindle money or property of another under false pretences; to cheat; to defraud."]}], "ಗುಳುಂಗಾರ": [{"type": "noun", "defs": ["a man who swallows.", "(fig.) a man who swindles another's or public money, property, etc. or takes bribe."]}], "ಗುಳುಂಗಾರಿಕೆ": [{"type": "noun", "defs": ["(fig.) the habit, tendency or an instance of taking bribe."]}], "ಗುಳುಕ್": [{"type": "noun", "defs": ["the sound at the throat made in swallowing or gulping something hastily or greedily.", "a sound imitating it."]}], "ಗುಳುಕನೆ": [{"type": "adverb", "defs": ["= ಗುಳುಕ್ಕನೆ."]}], "ಗುಳುಕು": [{"type": "noun", "defs": ["= ಗುಳುಕ್."]}], "ಗುಳುಕ್ಕನೆ": [{"type": "adverb", "defs": ["(swallowing, gulping etc.) making a sound in the throat.", "immediately; suddenly; at once."]}], "ಗುಳುಗುಳನೆ": [{"type": "noun", "defs": ["with a deep, rumbling, bubbling or rippling sound.", "(used to modify the verb 'run')) quickly; swiftly."]}], "ಗುಳುಗುಳಿಸು": [{"type": "verb", "defs": ["to make a deep, rumbling sound; (flowing water) to make a bubbling or rippling sound."]}], "ಗುಳುಗುಳು": [{"type": "noun", "defs": ["the bubbling or rippling sound, as made by flowing water."]}], "ಗುಳುಗುಳುಗುಪ್ಪಂಡಿ": [{"type": "noun", "defs": ["a children's play."]}], "ಗುಳುಚ್ಛ": [{"type": "noun", "defs": ["a cluster of things growing or fastened together (as flowers, grapes, etc.); a bunch."]}], "ಗುಳುದಾಳಿ": [{"type": "noun", "defs": ["= ಗುಳದಾಳಿ."]}], "ಗುಳುಪು": [{"type": "noun", "defs": ["= ಗುಳಾಪು."]}], "ಗುಳುಮೆ": [{"type": "noun", "defs": ["(dial.) a natural pool or pond where water is stored or stagnated; a water tank."]}], "ಗುಳೂಚಿ": [{"type": "noun", "defs": ["the creeper Tinosporia cordifolia ( = Menispermum cordifolium, = Cocculus cordifolius) of Menispermaceae family; moon creeper.", "the plant Cissampelos pareira ( = C. convolvulaceae) of Menispermaceae family; false pareira root."]}], "ಗುಳೂಚೆ": [{"type": "noun", "defs": ["= ಗುಳೂಚಿ."]}], "ಗುಳೂರಿಗೆ": [{"type": "noun", "defs": ["a kind of unleavened, small sweet cake, made by frying in ghee or oil."]}], "ಗುಳೆ": [{"type": "noun", "defs": ["the act of leaving the region, town, village where one normally lives to settle in another, permanently or for a relatively longer period (esp. necessitated by famine, disaster, etc. or by threat or coercion); immigration.", "a collection of several persons, things, animals, etc. together at a place of time; a crowd, multitude."]}], "ಗುಳೆಕಟ್ಟು": [{"type": "verb", "defs": ["= ಗುಳೆಹೋಗು."]}], "ಗುಳೆಕಾರ": [{"type": "noun", "defs": ["a man who has left or leaving his original place of living to settle in another."]}], "ಗುಳೆಕಿತ್ತಿಸು": [{"type": "verb", "defs": ["= ಗುಳೆಯೆಬ್ಬಿಸು."]}], "ಗುಳೆಕೀಳು": [{"type": "verb", "defs": ["= ಗುಳೆಯೇಳು."]}], "ಗುಳೆಗಟ್ಟು": [{"type": "verb", "defs": ["= ಗುಳೆಹೋಗು.", "ಗುಳೆಗಟ್ಟಿಕೊಳ್ಳು guḷegaṭṭikoḷḷu = ಗುಳೆಹೋಗು."]}], "ಗುಳೆತೆಗೆ": [{"type": "verb", "defs": ["= ಗುಳೆಹೋಗು."]}], "ಗುಳೆಬೀಳು": [{"type": "verb", "defs": ["= ಗುಳೆಹೋಗು."]}], "ಗುಳೆಯ": [{"type": "noun", "defs": ["a hard outer covering, as of a mollusc, insect, etc.; a shell."]}], "ಗುಳೆಯೆಬ್ಬಿಸು": [{"type": "verb", "defs": ["to cause (another or others) to leave original place of living; to drive away to another place."]}], "ಗುಳೆಯೇಳು": [{"type": "verb", "defs": ["= ಗುಳೆಹೋಗು."]}], "ಗುಳೆಹೋಗು": [{"type": "verb", "defs": ["to immigrate, en masse , from the normal place of living, to settle in another, permanently or for a relatively longer period (esp. necessitated by famine, disaster, etc. or by threat or coercion)."]}], "ಗುಳೋಪು": [{"type": "noun", "defs": ["= ಗುಳಾಪು."]}], "ಗುಳ್ಕನೆ": [{"type": "adverb", "defs": ["= ಗುಳುಕ್ಕನೆ."]}], "ಗುಳ್ಟೋರಿ": [{"type": "noun", "defs": ["a hide-and-seek play of children."]}], "ಗುಳ್ಳ": [{"type": "noun", "defs": ["the plant Solanum indicum of Solanaceae family.", "its fruit.", "the plant Solanum ferox of the same family."]}], "ಗುಳ್ಳಕೆ": [{"type": "noun", "defs": ["a petty god of folklore."]}], "ಗುಳ್ಳಗಂಜಿ": [{"type": "noun", "defs": ["the climbing plant Abrus precatorius of Papilionaceae family; wild liquorice weather plant.", "its poisonous, red and black seed, used for beads, and formerly, as a weight; crab's eye.", "another plant of the same family Abrus typica (var. albiflora.", "its seed.", "the weight of a wild liquorice seed (crab's eye) (approx. 0.15 gm.)."]}], "ಗುಳ್ಳಪಟೆ": [{"type": "noun", "defs": ["= ಗುಳ್ಳಪಾವಟೆ."]}], "ಗುಳ್ಳಪಾವಟೆ": [{"type": "noun", "defs": ["a kind of sweet dish, usu. round in shape, made of wheat flour, jaggery, etc."]}], "ಗುಳ್ಳಬದನೆ": [{"type": "noun", "defs": ["= ಗುಳ್ಳ."]}], "ಗುಳ್ಳಿಗಣ್ಣ": [{"type": "noun", "defs": ["= ಗುಳ್ಳೆಗಣ್ಣ."]}], "ಗುಳ್ಳಿಗಣ್ಣು": [{"type": "noun", "defs": ["= ಗುಳ್ಳೆಗಣ್ಣು."]}], "ಗುಳ್ಳಿಱಿ": [{"type": "verb", "defs": ["to laugh with a harsh or grating sound (as in great merriment, in contempt or scorn, etc.)."]}], "ಗುಳ್ಳುಗಾವಿ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಗುಳ್ಳೆ": [{"type": "noun", "defs": ["a thin sphere of liquid enclosing air etc; a bubble.", "an inflamed, pus-filled swelling caused by infection or an abnormal protuberance on or in the body; a boil; a swelling.", "a hard outer covering, as of a mollusc, insect, etc.; a shell.", "a small, circular band of metal, usu. of silver, worn by a married woman on the second toe; a toe-ring.", "anything that is spherical; a ball or ball-like thing."]}, {"type": "noun", "defs": ["= ಗುಳ್ಳ."]}, {"type": "adjective", "defs": ["small in size, stature, importance, etc."]}], "ಗುಳ್ಳೆಕಂಕ": [{"type": "noun", "defs": ["= ಗುಳ್ಳೆನರಿ."]}], "ಗುಳ್ಳೆಗಣ್ಣ": [{"type": "noun", "defs": ["a man having an opaque protuberance an the eye-ball (or both the eye-balls)."]}], "ಗುಳ್ಳೆಗಣ್ಣು": [{"type": "noun", "defs": ["an eye with an opaque protuberance on the eye-ball."]}], "ಗುಳ್ಳೆಗೊಟ್ಟಿ": [{"type": "noun", "defs": ["a game played on wooden board with two rows of seven hallows each, using tamarind seeds or cowries."]}], "ಗುಳ್ಳೆನರಿ": [{"type": "noun", "defs": ["the Vulpes bengalensis, a wild canine with bushy tail and, commonly, grey fur, which is conventionally thought of as sly and crafty.", "a sly and crafty person."]}], "ಗುಳ್ಳೆಮುತ್ತು": [{"type": "noun", "defs": ["an artificial, hollow pearl."]}], "ಗುಳ್ಳೆರೋಗ": [{"type": "noun", "defs": ["a contagious disease caused by a bacterium (Yersinia pestis) transmitted by fleas from infected rats, and characterised by buboes, fever, prostration, and delirium; bubonic plague."]}], "ಗುಳ್ಳೆಶಂಖ": [{"type": "noun", "defs": ["a small conch."]}]}