{"ಮರ್ದುಮಿ": [{"type": "noun", "defs": ["= ಮರ್ದುಮೀ."]}], "ಮರ್ದುಮೀ": [{"type": "noun", "defs": ["any of the qualities generally regarded as those that a man should have, as virilty; strength, bravery, resoluteness, etc.; manliness."]}], "ಮರ್ಪ": [{"type": "noun", "defs": ["a big, cylindrical percussion instrument consisting of a hollow cylinder or hemisphere with a membrane stretched tightly over both the ends, played by beating with the hands, sticks, etc."]}], "ಮರ್ಬಿಗ": [{"type": "noun", "defs": ["he who moves only during night or also is capable of moving during night (without the aid of light); a demon."]}], "ಮರ್ಬು": [{"type": "noun", "defs": ["the condition of somewhat dark; lack of sufficient light; dimness.", "the condition of the sensibility being diminished or lessened greatly, as caused by loss of sleep or from the use of a narcotic, etc.; stupour.", "a kind of gambling.", "(fig.) a senseless, idiotic fellow; a stupid.", "the quality of being stupid, foolish; senselessness; stupidity; foolishness.", "the condition or quality of being ignorant; lack of knowledge; ignorance."]}], "ಮರ್ಬುವೆಳಗು": [{"type": "noun", "defs": ["dimness of light; lack of sufficient light."]}], "ಮರ್ಮ": [{"type": "noun", "defs": ["a son of one's son or daughter; a grandson."]}, {"type": "noun", "defs": ["any vital, sensitive or vulnerable spot or part of the body.", "any of the places or parts where two bones are joined, so that they can move; a joint.", "the mind or heart as the seat for inner feelings.", "something hidden or that requires to be kept concealed; a secret or mystery.", "the hidden meaning or interior motive.", "a man appointed to execute something in a secret or clandestine manner."]}], "ಮರ್ಮಕೆಣಕು": [{"type": "verb", "defs": ["to cause to suffer mentally (as by raking up delicate, embarrassing issues)."]}], "ಮರ್ಮಘಾತ": [{"type": "noun", "defs": ["a blow delivered on a vulnerable or vital part of the body.", "to hurt emotionally by raking unpleasant, embarrassing facts up."]}], "ಮರ್ಮಘಾತಕ": [{"type": "adjective", "defs": ["wounding the vitals; hitting at or on a vulnerbale part of the body."]}, {"type": "noun", "defs": ["= ಮರ್ಮಘಾತ.", "he who strikes on a vulnerable or vital part of another's body.", "a man who hurts another emotionally by raking unpleasant, embarrassing facts up."]}], "ಮರ್ಮಘಾತುಕ": [{"type": "noun", "defs": ["= ಮರ್ಮಘಾತಕ - 3 & 4."]}], "ಮರ್ಮಜ್ಞ": [{"type": "noun", "defs": ["one who has the capacity to understand the secret or mystery (behind something); an exceedingly clver man.", "he who knows the weak vulnerable points of another (esp. of an enemy)."]}], "ಮರ್ಮಭೇದ": [{"type": "noun", "defs": ["the act or process of understanding the secret or mystery (behind something)."]}], "ಮರ್ಮಭೇದಕ": [{"type": "adjective", "defs": ["understanding or capable of understanding the secret or mystery (behind something).", "hitting at the vital parts, vulnerable spots, etc.", "causing much grief or mental anguish."]}, {"type": "noun", "defs": ["a man or something that causes much grief or mental anguish.", "he who can understand the secret, mystery of something or vulnerability of another (esp. of a rival or enemy)."]}], "ಮರ್ಮಭೇದನ": [{"type": "noun", "defs": ["the act of understanding the secret, mystery of something or weakness, vulnerability of another, etc.", "the act of hitting at the vital parts, vulnerable spots, etc.", "a causing of much grief or mental anguish to another."]}], "ಮರ್ಮಭೇದಕಿ": [{"type": "noun", "defs": ["a woman or something that causes much grief or mental anguish.", "she who can understand the secret, mystery of something or vulnerability of another (esp. of a rival or enemy)."]}], "ಮರ್ಮಭೇದಿ": [{"type": "adjective", "defs": ["= ಮರ್ಮಭೇದಕ1."]}, {"type": "noun", "defs": ["= ಮರ್ಮಭೇದಕ2."]}], "ಮರ್ಮರ": [{"type": "noun", "defs": ["a sound produced by shaking leaves (as by a current of air) or by walking on dry leaves."]}], "ಮರ್ಮರಿಸು": [{"type": "verb", "defs": ["to make a sound by shaking leaves or by walking on dry leaves."]}], "ಮರ್ಮರೋಗ": [{"type": "noun", "defs": ["any infectious venereal disease."]}], "ಮಮಸ್ಥಳ": [{"type": "noun", "defs": ["= ಮರ್ಮ2 - 1 & 2."]}], "ಮರ್ಮಸ್ಪರ್ಶಿ": [{"type": "adjective", "defs": ["touching the vital or vulnerable parts; very cutting or stinging; highly sarcastic."]}], "ಮರ್ಮಳ್": [{"type": "noun", "defs": ["a daughter of one's son or daughter; a grand-daughter."]}], "ಮರ್ಮಾಹತ": [{"type": "noun", "defs": ["sharp pain inflicted by stinging or pungent remark, accusation, etc.", "a man inflicted so."]}], "ಮರ್ಮಿ": [{"type": "noun", "defs": ["a man who tends to conceal his thoughts, feelings, affairs, plants, etc. from others; a secretive man."]}], "ಮರ್ಮಿಗ": [{"type": "noun", "defs": ["a man who knows or who can understand another's plan, plot, etc."]}], "ಮರ್ಮೋದ್ಘಾಟನ": [{"type": "noun", "defs": ["a blow delivered on a vulnerable or vital part of the body.", "to hurt emotionally by raking unpleasant, embarrassing facts up.", "the act or process of understanding the secret or mystery (behind something)."]}], "ಮರ್ಮೋದ್ಘಾಟನೆ": [{"type": "noun", "defs": ["= ಮರ್ಮೋದ್ಘಾಟನ."]}], "ಮರ್ಯಾದಸ್ತ": [{"type": "adjective", "defs": ["conforming to approved social standards; respectable.", "not immodest; not obscene; chaste."]}, {"type": "noun", "defs": ["a man whose conduct conforms to approved social standards; a respectable man.", "a man who is not immodest."]}], "ಮರ್ಯಾದಸ್ತೆ": [{"type": "noun", "defs": ["a woman whose conduct conforms to approved social standards; a respectable woman.", "a woman who is not immodest."]}], "ಮರ್ಯಾದಸ್ಥ": [{"type": "adjective", "defs": ["= ಮರ್ಯಾದಸ್ತ."]}, {"type": "noun", "defs": ["= ಮರ್ಯಾದಸ್ತ."]}], "ಮರ್ಯಾದಸ್ಥೆ": [{"type": "noun", "defs": ["= ಮರ್ಯಾದಸ್ತೆ."]}], "ಮರ್ಯಾದಿತ": [{"type": "adjective", "defs": ["limited by; having definite boundary or boundaries."]}], "ಮರ್ಯಾದೆ": [{"type": "noun", "defs": ["the boundary or frontier of a state, nation, etc.", "a set date or duration of time as for payment, termination of tenancy, etc.", "the land along a waterbody, that limits water from flowing over in normal conditions; a shore; a bank.", "reverential regard; respect extended to.", "the respect that one deserves.", "a habitual practice; the usual way of acting in given circumstances; a custom.", "a way, manner in which something done or is to be done."]}], "ಮರ್ಯೋ": [{"type": "adverb", "defs": ["certainly; without doubt."]}], "ಮರ್ವು": [{"type": "verb", "defs": ["to make something dim or to make something look dim."]}, {"type": "noun", "defs": ["= ಮರ್ಬು."]}], "ಮರ್ಷ": [{"type": "noun", "defs": ["the act, quality, tendency or an instance of forbearing, toleratingor enduring; toleration; forbearance; endurance."]}], "ಮರ್ಷಿ": [{"type": "noun", "defs": ["a man who habitually endures, forbears or tolerates (something)."]}], "ಮಲ್": [{"type": "noun", "defs": ["a thin, soft muslin."]}], "ಮಲ": [{"type": "adjective", "defs": ["(used in composition only) combining form related through the remarriage of a parent."]}, {"type": "noun", "defs": ["the tree Flacourtia jongamans ( = F. cataphracta) of Flacourtiaceae family."]}, {"type": "noun", "defs": ["dirt; filth; dust; impurity.", "any of the bodily excretions as faeces, sweat, phlegm, etc.", "the red or orange coating that forms on the surface of iron when exposed to air and moisture; rust.", "an offence against god; any act regarded as such a transgression, esp. a willful or deliberate violation of some religious or moral principle; a sin.", "any flaw, defect or shortcoming; a blemish.", "that which is unfit for religious purpose.", "a hole or cavity in a diamond, considered as a defect.", "any of the three humours of the body, wind, bile or phlegm.", "that which corrupts the soul and keep in ignorance."]}], "ಮಲಅಣ್ಣ": [{"type": "noun", "defs": ["a boy or man as related to a younger person only one of whose parents is common."]}], "ಮಲಂಗಿಸು": [{"type": "verb", "defs": ["= ಮಲಗಿಸು."]}], "ಮಲಂಗು": [{"type": "verb", "defs": ["= ಮಲಗು1."]}, {"type": "noun", "defs": ["= ಮಲಗು2."]}], "ಮಲಂಗುಮೂಡೆ": [{"type": "noun", "defs": ["= ಮಲಗು2."]}], "ಮಲಕಟ್ಟು": [{"type": "noun", "defs": ["a condition in which the feces are dry and hardened and evacuation is difficult and infrequent; constipation."]}], "ಮಲಕಾಡುಹತ್ತಿ": [{"type": "noun", "defs": ["the plant Hibiscus canescens of Malvaceae family."]}], "ಮಲಕಿಸು": [{"type": "verb", "defs": ["to shake (something, continuously or repeatedly)."]}], "ಮಲಕು": [{"type": "verb", "defs": ["to move unsteadily.", "to be tempted (esp. to do wrong) easily; to become frail."]}, {"type": "noun", "defs": ["the fact of being interwoven or connected closely or intricately; a tangle.", "a knob in a thread, cord, rope, etc. formed by passing one free end through a loop and drawing it tight; a knot.", "an ornament made by interweaving some strips, splits, etc.", "a kind of head ornament.", "a kind of necklace.", "a string of decorative beads suspended by the ends to hang as a curve across the doorway.", "(dance.) a particular posture.", "a seizing and holding or being seized and held fast; secure grasp; firm hold.", "ಮಲಕಿನ ಕೋಲು malakina kōlu a particular variety of a folk-dance performed by a group of people, in which short sticks are stuck rythmically in harmony to the song sung, moving within themselves, as the threads in a woven fabric; a kind of morris-dance.", "ಮಲಕು ಬೀಳು malaku bīḷu to be connected closely or intricately with; to be well blended; ಮಲಕಿನ ತೆನೆ malakina tene the top portion of a fortification, projecting upwards, having interwoven structure."]}], "ಮಲಕುಗೊಳ್": [{"type": "verb", "defs": ["to become full of knots or interwoven intricately."]}], "ಮಲಕುಟ": [{"type": "noun", "defs": ["the opening at the lower end of the alimentary canal through which the solid refuse of digestion is excreted; the anux."]}], "ಮಲಕುಹ": [{"type": "noun", "defs": ["the tree Randia candolleana of Ruybiaceae family."]}], "ಮಲಗಟ್ಟು": [{"type": "noun", "defs": ["= ಮಲಕಟ್ಟು."]}], "ಮಲಗದೆ": [{"type": "noun", "defs": ["a kind of land."]}], "ಮಲಗಿಸು": [{"type": "verb", "defs": ["to cause to lie down (as on a bed, mat, sofa, etc.).", "to lean on another (for support).", "to destroy; to demolish; to spoil completely."]}], "ಮಲಗು": [{"type": "verb", "defs": ["to lean on (either while sitting or standing): 2) to lie oneself down (as on a bed, mat, sofa, etc.).", "to be in or to go to, the state of sleep.", "to have sexual intercourse; to copulate.", "to take (another person) into one's arms and press to the bosom, from love, affection or expressing one's joy.", "to become actionless, motionless or stationary.", "to be or continue to be ignorant; to lack or to continue to be lacking knowledge.", "to hang down unevenly or losely; to sag.", "to be in bed from sickness; to be sick.", "ಮಲಗುವ ಮನೆ malaguva mane a room where a person normally sleeps; a bed-room."]}, {"type": "noun", "defs": ["a long, round cushion or pillow to lean on, while sitting; a bolster."]}, {"type": "noun", "defs": ["a kind of fish; an eel."]}], "ಮಲಗುದಾಣ": [{"type": "noun", "defs": ["a place or room where one normally sleeps."]}], "ಮಲಗುಮೂಡೆ": [{"type": "noun", "defs": ["= ಮಲಗು2."]}], "ಮಲಗ್ರ್ರಸ್ತ": [{"type": "adjective", "defs": ["full of filth, dirt; grossly dirty."]}, {"type": "noun", "defs": ["a totally dirty man."]}], "ಮಲಗ್ರ್ರಸ್ತೆ": [{"type": "noun", "defs": ["a totally dirty woman."]}], "ಮಲತಂಗಿ": [{"type": "noun", "defs": ["a girl or woman as related to a person only one of whose parents is common."]}], "ಮಲತಂದೆ": [{"type": "noun", "defs": ["the husband of one's mother by a later marriage; a step-father."]}], "ಮಲತಮ್ಮ": [{"type": "noun", "defs": ["a boy or man as related to an elder person only one of whose parents is common."]}], "ಮಲತಾಯ್": [{"type": "noun", "defs": ["= ಮಲತಾಯಿ."]}], "ಮಲತಾಯಿ": [{"type": "noun", "defs": ["the wife of one's father by a later marriage; a step-mother; ಮಲತಾಯಿ ಧೋರಣೆ malatāyi dhōraṇe (fig.) a biased treatment meted out."]}], "ಮಲತ್ರಯ": [{"type": "noun", "defs": ["(pl.) the three excretions from the body, sweat, urine and faeces."]}], "ಮಲದಂದೆ": [{"type": "noun", "defs": ["a totally dirty person."]}], "ಮಲದಾಯ್": [{"type": "noun", "defs": ["= ಮಲತಾಯಿ."]}], "ಮಲದಾಯಿ": [{"type": "noun", "defs": ["= ಮಲತಾಯಿ."]}], "ಮಲದೇಹಿ": [{"type": "noun", "defs": ["= ಮಲಗ್ರ್ರಸ್ತ2."]}], "ಮಲಧರ": [{"type": "noun", "defs": ["= ಮಲಗ್ರ್ರಸ್ತ2."]}], "ಮಲಧಾರಿ": [{"type": "noun", "defs": ["= ಮಲಗ್ರ್ರಸ್ತ2."]}], "ಮಲನಾಗರು": [{"type": "noun", "defs": ["= ಮಲರೋಗ."]}], "ಮಲನೀರು": [{"type": "noun", "defs": ["a bathing (of a bride or bridegroom) in water mixed with turmeric powder."]}], "ಮಲಪು": [{"type": "noun", "defs": ["wet, soft earth or earthy matter, as on the ground after rain, at the bottom of a pond or along the banks of a river; mire; mud."]}], "ಮಲಬದ್ಧತೆ": [{"type": "noun", "defs": ["a condition in which the faeces are dry and hardened and evacuation is difficult and infrequent; constipation."]}], "ಮಲಬದ್ಧರೋಗ": [{"type": "noun", "defs": ["= ಮಲಬದ್ಧತೆ."]}], "ಮಲಬಾಧೆ": [{"type": "noun", "defs": ["the discomfort, pain caused by holding the faeces from being excreted.", "the act or an instance of passing the faeces."]}], "ಮಲಮಂಡಿ": [{"type": "noun", "defs": ["the plant Indigofera endecaphylla of Popilionaceae family."]}], "ಮಲಮಗ": [{"type": "noun", "defs": ["a boy or man who one's husband or wife had by another marriage; a step son."]}], "ಮಲಮಗಳು": [{"type": "noun", "defs": ["a girl or woman who one's husband or wife had by another marriage; a step daughter."]}], "ಮಲಮಲ": [{"type": "adverb", "defs": ["= ಮಲಮಲನೆ."]}, {"type": "noun", "defs": ["= ಮಲಮಲ್ಲು."]}], "ಮಲಮಲಂ": [{"type": "adverb", "defs": ["= ಮಲಮಲನೆ."]}], "ಮಲಮಲನೆ": [{"type": "adverb", "defs": ["(used to modify the verb ಮರುಗು(ಮಱುಗು) to grieve, in intrans. mode) excessively."]}], "ಮಲಮಲಿ": [{"type": "noun", "defs": ["= ಮಲಮಲ್ಲು."]}], "ಮಲಮಲ್ಲು": [{"type": "noun", "defs": ["a thin, soft muslin."]}], "ಮಲಮಱುಗು": [{"type": "verb", "defs": ["to grieve (oneself) excessively."]}], "ಮಲಮಾತಂಗಿ": [{"type": "noun", "defs": ["the plant Xanthophylium flavesceens of Polygalaceae family (?)."]}], "ಮಲಮಾಸ": [{"type": "noun", "defs": ["the thirteenth, intercalary, lunary month inserted in the Lunar calendar after every thirty lunar months which is religiously considered as inauspicious."]}], "ಮಲಮೈತ್ರ": [{"type": "noun", "defs": ["the creeper Ventilago maderaspatana of Rhamnaceae family."]}], "ಮಲಯ": [{"type": "noun", "defs": ["a mountain (in gen.).", "name of a range of mountains in South India, known for rich growth of sandalwood trees.", "the region surrounding this range."]}], "ಮಲಯಜ": [{"type": "noun", "defs": ["the tree Santalum album ( = Sirium myrtifolium) of Santalaceae family.", "its hard, light-coloured, close-grained, sweet-smelling wood.", "the paste made by powder of this wood."]}], "ಮಲಯಮಾರುತ": [{"type": "noun", "defs": ["the wind blowing from the Malaya range of mountains, carrying the sweet smell of sandalwood.", "(mus.) in Karnāṭaka system, a mode derived from the main mode Cakravāka."]}], "ಮಲಯರುಹ": [{"type": "noun", "defs": ["= ಮಲಯಜ."]}], "ಮಲಯಾಚಲ": [{"type": "noun", "defs": ["= ಮಲಯ - 2."]}], "ಮಲಯಾವರಿಕೆ": [{"type": "noun", "defs": ["the plant Sophora glauca of Papilionaceae family; Chinese pagoda tree.", "another plant Sophora interrupta of the same family.", "the plant Cassia sophera of Caesalpiniaceae family; senna sophera."]}], "ಮಲಯಾಳ": [{"type": "noun", "defs": ["the state of Kerala, in South India, having Tiruvananthapuram as its capital.", "the official language of this state, one of the four prominent Dravadian languages.", "a man who is a native of this state."]}], "ಮಲರ್": [{"type": "verb", "defs": ["to come or go back.", "to turn oneself (as to see again).", "3 to be attracted, fascinated, charmed by.", "to withdraw oneself in the face of opposition or from a dangerous or unpleasant 5ituation; to retreat.", "to be hanging loosely.", "to turn oneself on one's own axis or around a point; to revolve.", "(a liquid) to be heated to just below the boiling point where tiny bubbles are formed at below with a low, murmuring sound."]}, {"type": "verb", "defs": ["= ಮಲರು1."]}, {"type": "noun", "defs": ["= ಮಲರು2."]}, {"type": "noun", "defs": ["loose, gritty particles of worn or disintegrated rock, varying in size from about 0.1 mm to 2 mm in diameter, usu. deposited along the shores of bodies of water, in river beds or in deserts; sand."]}], "ಮಲರಗ": [{"type": "noun", "defs": ["the plant Gordonia obtusa of Ternstroemiaceae family."]}], "ಮಲರಹಿತ": [{"type": "adjective", "defs": ["not stained by dirt, dust, filth, etc.; unsoiled; clean.", "not stained by sin, moral blimish or dishonour; pure; upright."]}, {"type": "noun", "defs": ["a man not stained by sin, moral blimish, dishonour; a man of immaculate conduct.", "anything that clean, pure, blemishless."]}], "ಮಲರಿಸು": [{"type": "verb", "defs": ["to cause (a flower) to blow up, expand."]}], "ಮಲರು": [{"type": "verb", "defs": ["(a bud of a flower) to expand; to blow up.", "to be filled with high spirits, enthusiasm, optimism, etc.; to be elated."]}, {"type": "noun", "defs": ["a reproductiveof angiosperm plants having showy or colourful petals; a flower."]}], "ಮಲರೋಗ": [{"type": "noun", "defs": ["a recurrent disorder of the nervous system, characterised either by mild, episodic loss of attention or sleepiness or by severe convulsions with loss of consciousness, accompanied by convulsions, physical dysfunction, etc.; epilepsy.", "an astrological planet or demigod, that is believed to cause this disease."]}], "ಮಲರೋಗಿ": [{"type": "noun", "defs": ["a person suffering from epilepsy."]}], "ಮಲರ್ಚು": [{"type": "verb", "defs": ["to cause to go back.", "to give back (what was taken earlier).", "to turn an object as to face a different direction.", "to cause to travel in a circle or orbit; to revolve.", "to heat (a liquid) as to form tiny bubbles with a low, murmuring sound."]}], "ಮಲರ್ವಿಲ್ಲು": [{"type": "noun", "defs": ["(myth.) Manmatha, the Love-God, whose bow is made of flowers."]}], "ಮಲವ": [{"type": "noun", "defs": ["= ಮಲೆಪ."]}], "ಮಲವಿಸರ್ಜನೆ": [{"type": "noun", "defs": ["the act or process of excreting the faeces through the anus."]}], "ಮಲವೇಗ": [{"type": "noun", "defs": ["excessive frequency and looseness of bowel movements; diarrhoea."]}], "ಮಲವೇಱು": [{"type": "verb", "defs": ["to be stained by dirt, dust, filth, etc."]}], "ಮಲಶುದ್ಧಿ": [{"type": "noun", "defs": ["= ಮಲವಿಸರ್ಜನೆ."]}], "ಮಲಶೂಲೆ": [{"type": "noun", "defs": ["= ಮಲಬಾಧೆ - 1."]}], "ಮಲಶೋಧನೆ": [{"type": "noun", "defs": ["= ಮಲವಿಸರ್ಜನೆ.", "any laxative medicine; mild cathartic; a laxative."]}], "ಮಲಸಂಬಂಧ": [{"type": "noun", "defs": ["the relation of a man and a woman married to each other, at least for one of whom this is a remarrige."]}], "ಮಲಸೀಮೆ": [{"type": "noun", "defs": ["= ಮಲೆನಾಡು."]}], "ಮಲಸುತ್ತು": [{"type": "noun", "defs": ["a device for pulling corks out of bottles, usu. a spiral-shaped piece of steel with a point at one end and a handle at the other; a cork-screw."]}], "ಮಲಸುರಿ": [{"type": "noun", "defs": ["the large-sized, evergreen tree Mimusops elengi of Sapotaceae family."]}], "ಮಲಸೂತ್ರ": [{"type": "noun", "defs": ["= ಮಲಸುತ್ತು."]}], "ಮಲಹ": [{"type": "noun", "defs": ["= ಮಲೆಪ."]}], "ಮಲಹೆಗ್ಗೆ": [{"type": "noun", "defs": ["the tree Hopea wightiana ( = H. glabra) of Dipterocarpaceae family.", "another tree Hopea glabra of the same family."]}], "ಮಲಹರ": [{"type": "noun", "defs": ["Śiva, who delivers, liberates people from sin or sinfullife."]}], "ಮಲಹರಾದ್ರಿ": [{"type": "noun", "defs": ["Kailāsa, the abode of Śiva."]}], "ಮಲಹರಿ": [{"type": "noun", "defs": ["(mus.) in Karnāṭaka system, a mode derived from the main mode Māyāmāḷavagauḷa."]}, {"type": "noun", "defs": ["= ಮಲಾರ3."]}], "ಮಲಹಾರಿ": [{"type": "noun", "defs": ["= ಮಲಹರಿ1."]}], "ಮಲಹೊನ್ನೆ": [{"type": "noun", "defs": ["the tree Ougeinia oojeinensis ( = O. dalbergioides, = Dalbergia ougeinensis) of Papilionaceae family."]}], "ಮಲಾಪಹ": [{"type": "noun", "defs": ["he who delivers, liberates from sin or sinful life."]}], "ಮಲಾಭ್ರಕ": [{"type": "noun", "defs": ["a dark-brown or black mineral of the mica family, found in igneous and metamorphic rocks; biotite."]}], "ಮಲಾಮತ್": [{"type": "noun", "defs": ["= ಮಲಾಮತ್ತು."]}], "ಮಲಾಮತಿ": [{"type": "noun", "defs": ["= ಮಲಾಮತ್ತು."]}], "ಮಲಾಮತು": [{"type": "noun", "defs": ["= ಮಲಾಮತ್ತು."]}], "ಮಲಾಮತ್ತು": [{"type": "noun", "defs": ["something that may cause harm or injury; a peril.", "overbearing pride evidenced by a superior manner in conducting oneself; arrogance; haughtiness.", "the feeling aroused by something strange and surprising; wonder."]}], "ಮಲಾಮೆ": [{"type": "noun", "defs": ["the condition of a commodity being available at a very cheaper rate; cheapness.", "the trait of being imperious and overbearing; overbearingness; haughtiness."]}], "ಮಲಾರ": [{"type": "noun", "defs": ["a large number of bangles bunched together."]}, {"type": "noun", "defs": ["a band put around the belly of a horse for holding a saddle; a girth.", "a narrow strap of leather attached to each end of the bit in the mouth of a horse, and held by the rider or driver to control the animal; rein."]}, {"type": "noun", "defs": ["a kind of percussion instrument."]}], "ಮಲಿನ": [{"type": "adjective", "defs": ["dirty; soiled; filthy.", "defective; deficient in; imperfect.", "indistinct; hazy.", "dull; murky; gloomy."]}, {"type": "noun", "defs": ["dirt; dust; filth.", "an offence against, god, religion or custom; a sin.", "a piece of dirty cloth; soiled clothing.", "black colour."]}], "ಮಲಿನತೆ": [{"type": "noun", "defs": ["the quality, fact or state of being dirty;want of cleanliness; dirtiness.", "darkness; want of sufficient light.", "lack of something that is essential; deficiency (considered as a blemish)."]}], "ಮಲಿನತ್ವ": [{"type": "noun", "defs": ["= ಮಲಿನತೆ."]}], "ಮಲಿನದೃಷ್ಟಿ": [{"type": "noun", "defs": ["(dance.) a mode of looking in which, after taking a glance, the eyelids are half-shut, the eyelashes trembling and the corners of the eyes have become pale."]}], "ಮಲಿನಿ": [{"type": "noun", "defs": ["a menstruated woman; a woman in her periods."]}], "ಮಲಿಮ್ಲುಚ": [{"type": "noun", "defs": ["a thief.", "a brāhmaṇa, who does not perform the five daily sacrifices prescribed.", "a demon.", "a mosquito.", "the air in motion; wind.", "the thirteenth, intercalary, lunary month inserted in the Lunar calendar after every thirty lunar months which is religiously considered as inauspicious."]}], "ಮಲೀಮಸ": [{"type": "adjective", "defs": ["= ಮಲಿನ1.", "mean; petty; trivial.", "defective; faulty; imperfect."]}, {"type": "noun", "defs": ["dirt; filth; soil.", "a sullied, besmirched man."]}], "ಮಲುಕು": [{"type": "verb", "defs": ["to move unsteadily.", "to be tempted (esp. to do wrong) easily; to become frail."]}, {"type": "noun", "defs": ["the fact of being interwoven or connected closely or intricately; a tangle.", "a knob in a thread, cord, rope, etc. formed by passing one free end through a loop and drawing it tight; a knot.", "an ornament made by interweaving some strips, splits, etc.", "a kind of head ornament.", "a kind of necklace.", "a string of decorative beads suspended by the ends to hang as a curve across the doorway.", "(dance.) a particular posture.", "a seizing and holding or being seized and held fast; secure grasp; firm hold."]}], "ಮಲುಮಲ": [{"type": "adverb", "defs": ["= ಮಲುಮಲನೆ."]}], "ಮಲುಮಲನೆ": [{"type": "adverb", "defs": ["(used to modify the verb ಮರುಗು to grieve, in intrans. mode) excessively."]}], "ಮಲುವು": [{"type": "noun", "defs": ["the force of a flood."]}], "ಮಲೂಲತನ": [{"type": "noun", "defs": ["the quality of state of not having interest, spirit, zeal or enthusiasm; listlessness; lanquidness."]}], "ಮಲೂಲು": [{"type": "noun", "defs": ["lack of enthusiasm, spirit of zeal."]}], "ಮಲೆ": [{"type": "verb", "defs": ["to behave insolently, impudently; to be haughty.", "to resist defiantly."]}, {"type": "verb", "defs": ["to become muddy; to have the sediment stirred."]}, {"type": "noun", "defs": ["a hill or mountain.", "a forest on and around a mountain.", "a region consisting mainly of hills and mountains.", "an inhabitant of this region."]}], "ಮಲೆಕೋಡು": [{"type": "noun", "defs": ["the tapered crest or summit of a hill or mountain; a peak."]}], "ಮಲೆಗ": [{"type": "noun", "defs": ["a man who is an inhabitant of a mountainous region."]}], "ಮಲೆಗೇರು": [{"type": "noun", "defs": ["the tree Holigarna arnottiana of Anacardiaceae family."]}], "ಮಲೆಜೇನು": [{"type": "noun", "defs": ["a kind of honey-bee that is found in mountainous region."]}], "ಮಲೆತರ್": [{"type": "verb", "defs": ["to come resisting defiantly; to show insolence in one's behaviour."]}], "ಮಲೆದುರ್ಗ": [{"type": "noun", "defs": ["a fort on a mountain."]}], "ಮಲೆನಾಡಿಗ": [{"type": "noun", "defs": ["a man who is an inhabitant of a mountainous region.", "(fig.) a monkey."]}], "ಮಲೆನಾಡು": [{"type": "noun", "defs": ["a mountainous region."]}], "ಮಲೆನಾಡುಗ": [{"type": "noun", "defs": ["= ಮಲೆನಾಡಿಗ."]}], "ಮಲೆನೆಲ್ಲಿ": [{"type": "noun", "defs": ["the goose berry tree Phyllanthus maderaspatensis of Euphorbiaceae family.", "its berry."]}], "ಮಲೆಪ": [{"type": "noun", "defs": ["= ಮಲೆಯ."]}], "ಮಲೆಪು": [{"type": "noun", "defs": ["contemptuously rude or impertinent behavior or speech; insolence.", "the act or power of resisting, opposing; resistance."]}], "ಮಲೆಪೊಡವಿ": [{"type": "noun", "defs": ["= ಮಲೆನಾಡು."]}], "ಮಲೆಯ": [{"type": "noun", "defs": ["the chieftain of a mountainous region.", "a man belonging to Kerala state or whose mother-tongue is Malayāḷa."]}], "ಮಲೆಯಾವರಿಕೆ": [{"type": "noun", "defs": ["the plant Sophora glauca of Papilionaceae family; Chinese pagoda tree.", "another plant Sophora interrupta of the same family.", "the plant Cassia sophera of Caesalpiniaceae family; senna sophera."]}], "ಮಲೆಯಾಳ": [{"type": "noun", "defs": ["the state of Kerala, in South India, having Tiruvantapuram as its capital.", "the official language of this state, one of the four prominent Dravadian languages.", "a man who is a native of this state."]}], "ಮಲೆಯಾಳಿ": [{"type": "noun", "defs": ["= ಮಲೆಯಾಳ - 2 & 3."]}], "ಮಲೆಯಾಳು": [{"type": "noun", "defs": ["= ಮಲೆನಾಡಿಗ - 1."]}], "ಮಲೆಯಿಸು": [{"type": "verb", "defs": ["to cause to resist; to incite a person against anotehr or against a government organisation, etc."]}], "ಮಲೆಸಾಗದ": [{"type": "noun", "defs": ["the plant Walsura piscidia ( = W. ternata) of Meliaceae family."]}], "ಮಲೆಸೇನ": [{"type": "noun", "defs": ["a kind of hawk, that is found mostly in mountainous regions."]}], "ಮಲೆಸೌತೆ": [{"type": "noun", "defs": ["the plant Mucuna Pruritus ( = M. Puriens) of Papilionaceae family; (?)."]}], "ಮಲೆಹ": [{"type": "noun", "defs": ["the act or power of resisting, opposing; resistance."]}], "ಮಲೆಹಾಕಟು": [{"type": "noun", "defs": ["the tree Euphoria longana ( = Nephelium longana) of Sapindaceae family."]}], "ಮಲೆಹೆಗ್ಗೆ": [{"type": "noun", "defs": ["the tree Hopea wightiana ( = H. glabra) of Dipterocarpaceae family.", "another tree Hopea glabra of the same family."]}], "ಮಲೇರಿಯ": [{"type": "noun", "defs": ["an infectious disease, usu. intermittent or remittent, characterised by attacks of severe chills, fever, and sweating caused by a parasitic protozoan, which is transferred to the human bloodstream by a mosquito of the genus Anopheles and which occupies and destroys red blood cells."]}], "ಮಲ್ತೊ": [{"type": "noun", "defs": ["name of a Dravidian language that does not have script of its own."]}], "ಮಲ್ನೀರು": [{"type": "noun", "defs": ["a bathing (of a bride or bridegroom) in water mixed with turmeric powder."]}], "ಮಲ್ಪೂಫ": [{"type": "noun", "defs": ["a letter or its enclosure, sent through an envelope (through postal service)."]}], "ಮಲ್ಪೂಫಿ": [{"type": "noun", "defs": ["= ಮಲ್ಪೂಫ."]}], "ಮಲ್ಲ": [{"type": "adjective", "defs": ["having necessary power, skill; able; efficient."]}, {"type": "noun", "defs": ["a man who wrestles; a wrestler.", "a physically strong man.", "an able, efficient man."]}], "ಮಲ್ಲಂತಿಗೆ": [{"type": "noun", "defs": ["a band that a wrestler ties around his waist; a wrestler's belt."]}], "ಮಲ್ಲಕಂಭ": [{"type": "noun", "defs": ["a stout pillar for wrestlers to practise gymnastic feats.", "a strong post planted in the ground, for tying an elephant."]}], "ಮಲ್ಲಕಳ": [{"type": "noun", "defs": ["a stage in a stadium where wrestling takes place; an arena."]}], "ಮಲ್ಲಕಾಳಗ": [{"type": "noun", "defs": ["a sport in which two opponents struggle hand to hand attempting to throw or knock each other to the ground, without delivering blows."]}], "ಮಲ್ಲಖಂಡ": [{"type": "noun", "defs": ["a kind of medicinal substance (used in overcoming involuntary discharge of urine)."]}], "ಮಲ್ಲಗ": [{"type": "noun", "defs": ["name of a petty god."]}], "ಮಲ್ಲಗಂಟು": [{"type": "noun", "defs": ["= ಮಲ್ಲಂತಿಗೆ."]}], "ಮಲ್ಲಗಂಡಿಕೆ": [{"type": "noun", "defs": ["the prowess, ability of a wrestler."]}], "ಮಲ್ಲಗಂಬ": [{"type": "noun", "defs": ["= ಮಲ್ಲಕಂಭ."]}], "ಮಲ್ಲಗಂಭ": [{"type": "noun", "defs": ["= ಮಲ್ಲಕಂಭ."]}], "ಮಲ್ಲಗಚ್ಚೆ": [{"type": "noun", "defs": ["a particular mode of wearing a dhoti by a wrestler while wrestling."]}], "ಮಲ್ಲಗದ್ದೆ": [{"type": "noun", "defs": ["(now obs.) a variety of agricultural land."]}], "ಮಲ್ಲಗಳ": [{"type": "noun", "defs": ["= ಮಲ್ಲಕಳ."]}], "ಮಲ್ಲಗಾಸೆ": [{"type": "noun", "defs": ["= ಮಲ್ಲಗಚ್ಚೆ."]}], "ಮಲ್ಲಗಾಳಗ": [{"type": "noun", "defs": ["= ಮಲ್ಲಕಾಳಗ."]}], "ಮಲ್ಲಗಾಳೆಗ": [{"type": "noun", "defs": ["= ಮಲ್ಲಕಾಳಗ."]}], "ಮಲ್ಲಗಿಳಿ": [{"type": "noun", "defs": ["a parrot that is capable of imitating human voice well."]}], "ಮಲ್ಲಣಿ": [{"type": "noun", "defs": ["= ಮಲ್ಲಳಿ."]}], "ಮಲ್ಲಣಿಗೊಳ್": [{"type": "verb", "defs": ["= ಮಲ್ಲಳಿಗೊಳ್."]}], "ಮಲ್ಲಣಿಸು": [{"type": "verb", "defs": ["= ಮಲ್ಲಳಿಸು."]}], "ಮಲ್ಲತುಂಬಿ": [{"type": "noun", "defs": ["a composition, as of lime or gypsum, sand, water, etc., for applying on to walls, ceilings, etc.to give a smooth finishing; plaster."]}], "ಮಲ್ಲದಾಳ": [{"type": "noun", "defs": ["the sound made by a wrestler by striking his upper arm, thigh, etc. with his palm."]}], "ಮಲ್ಲಯುದ್ಧ": [{"type": "noun", "defs": ["= ಮಲ್ಲಕಾಳಗ."]}], "ಮಲ್ಲರಂಗ": [{"type": "noun", "defs": ["the central stage in a stadium where wrestling takes place."]}], "ಮಲ್ಲರಿ": [{"type": "noun", "defs": ["the tree Stereospermum personatum ( = S.chelonoides) of Bignoniaceae family."]}], "ಮಲ್ಲಲ್": [{"type": "noun", "defs": ["a shallow bowl as a porringer."]}], "ಮಲ್ಲಲಿ": [{"type": "noun", "defs": ["the tree Diospyros ebenum ( = D. assimilis) of Ebenaceae family; black satin wood."]}], "ಮಲ್ಲವಱೆ": [{"type": "noun", "defs": ["a kind of huge drum played by sticks."]}], "ಮಲ್ಲವಾತು": [{"type": "noun", "defs": ["a valourous speech made by wrestlers during wrestling."]}], "ಮಲ್ಲವಿದ್ಯೆ": [{"type": "noun", "defs": ["the art of wrestling."]}], "ಮಲ್ಲವೋರ್": [{"type": "verb", "defs": ["to engage in wrestling; to wrestle."]}], "ಮಲ್ಲವೋರ್ಕೆ": [{"type": "noun", "defs": ["the sport of wrestling."]}], "ಮಲ್ಲಶಾಲೆ": [{"type": "noun", "defs": ["a room or building for training wrestlers."]}], "ಮಲ್ಲಶ್ರಮ": [{"type": "noun", "defs": ["the struggle of a wrestler in wrestling.", "the practice and process of training in wrestling."]}], "ಮಲ್ಲಸಾಲೆ": [{"type": "noun", "defs": ["= ಮಲ್ಲಶಾಲೆ."]}], "ಮಲ್ಲಳಿ": [{"type": "noun", "defs": ["the act or an instance of wandering, roaming.", "any deviation from health, as sickness, mental depression, etc.", "fear; fright; terror.", "a large number of people, animals, things, etc. gathered at a place; a multitude.", "a honey-bee.", "a group dance, in which usu. female dancers go in circle around a male dancer.", "the state of disorder, confusion or bewilderment.", "an agitation, disturbance etc. in a society or in the mind or among members of a group, etc.", "the feeling aroused by something strange and surprising; wonder."]}], "ಮಲ್ಲಳಿಕಾಱ": [{"type": "noun", "defs": ["a man who roams, wanders (aimlessly around or about).", "a man who causes agitation, disturbance, etc.", "a man walking unsteadily."]}], "ಮಲ್ಲಳಿಗಾರ್ತಿ": [{"type": "noun", "defs": ["a woman who roams, wanders (aimlessly around or about)."]}], "ಮಲ್ಲಳಿಗಾಱ": [{"type": "noun", "defs": ["= ಮಲ್ಲಳಿಕಾಱ."]}], "ಮಲ್ಲಳಿಗೊಳ್": [{"type": "verb", "defs": ["to be alarmed, suddenly afraid, frightened, scared; to be terrified.", "to come in large number to form a group; to assemble.", "to go or move aside.", "to mentally agitated; to be very much disturbed."]}], "ಮಲ್ಲಳಿಸು": [{"type": "verb", "defs": ["to turn on the circumferance of a circle; to revolve around (something).", "(an animal that is surrounded by hunters) to try to escape."]}], "ಮಲ್ಲೞಿ": [{"type": "noun", "defs": ["= ಮಲ್ಲಳಿ."]}], "ಮಲ್ಲೞಿಗಾರ್ತಿ": [{"type": "noun", "defs": ["= ಮಲ್ಲಳಿಗಾರ್ತಿ."]}], "ಮಲ್ಲೞಿಗಾಱ": [{"type": "noun", "defs": ["= ಮಲ್ಲಳಿಕಾಱ."]}], "ಮಲ್ಲೞಿಗೊಳ್": [{"type": "verb", "defs": ["= ಮಲ್ಲಳಿಗೊಳ್."]}], "ಮಲ್ಲೞಿದಿರಿ": [{"type": "verb", "defs": ["to wander in group."]}], "ಮಲ್ಲಾಗರು": [{"type": "noun", "defs": ["= ಮಲ್ಲೋಗರ."]}], "ಮಲ್ಲಾಮಲ್ಲಿ": [{"type": "noun", "defs": ["the sport or fight of wrestlers.", "a vying for establishing one's supremacy over another or others.", "outward expression of one's deep grief; a weeping or wailing; lamentation."]}], "ಮಲ್ಲಾರ": [{"type": "noun", "defs": ["a large number of bangles bunched together."]}], "ಮಲ್ಲಾಳಿ": [{"type": "noun", "defs": ["the tree Diospyros melanoxylon ( = D. tupru) of Ebenaceae family."]}], "ಮಲ್ಲಿ": [{"type": "noun", "defs": ["a variety of jasmine plant.", "its flower.", "a kind of plant.", "a kind of earthen container.", "an idol of a woman holding a votive lamp."]}], "ಮಲ್ಲಿಕ": [{"type": "noun", "defs": ["= ಮಲ್ಲಿಕಾಕ್ಷ - 1 & 2."]}], "ಮಲ್ಲಿಕಾಕ್ಷ": [{"type": "noun", "defs": ["the small bird Zosterops palpebrosus of Zosteropidae family with green-yellow body, white ring round the eyes, black bill and legs.", "a species of crane, gull of white swan, with dark legs and light eyes.", "a horse having white spots on the eyes."]}], "ಮಲ್ಲಿಕಾಮಾಲೆ": [{"type": "noun", "defs": ["a garland of jasmine flowers.", "(pros.) a verse of four lines, each line having six groups of three syllables (-u-, uu-, u-u, u-u, -uu,-u- , totally 18 sylables and twenty six prosodic units)."]}], "ಮಲ್ಲಿಕಾರ್ಜುನ": [{"type": "noun", "defs": ["Śiva."]}], "ಮಲ್ಲಿಕಾವಸಂತ": [{"type": "noun", "defs": ["name of a musical mode in Karnāṭaka system."]}], "ಮಲ್ಲಿಕೆ": [{"type": "noun", "defs": ["= ಮಲ್ಲಿಗೆ.", "a columnar, wooden structure having a hollow at the top for keeping a votive lamp."]}], "ಮಲ್ಲಿಕ್ಕು": [{"type": "verb", "defs": ["to issue a challenge to anotehr for wrestling."]}], "ಮಲ್ಲಿಗೆ": [{"type": "noun", "defs": ["any of various tropical and subtropical plants (genus Jasminum) of the Oleaceae family.", "its fragrant flower of yellow, red or white, used in perfumes.", "a kind of earthenware.", "ಮಲ್ಲಿಗೆ ಹೂವಿನಿಂದ ಬಾಳೆನಾರು ಪಾವನವಾಯಿತು mallige hūvininda bāḷe nāru pāvanavāyitu (prov.) for the rose, the thorn is plucked."]}], "ಮಲ್ಲಿಗೆಗೋಲ": [{"type": "noun", "defs": ["Manmatha, whose arrows are made of jasmine flowers among others.", "a Jaina saint, the son of first Thirthankara named Adinatha, who fought against and defeated his ambitious brother but got disillusioned with the futility of the worldly life, stood meditating for a year and got enlightened."]}], "ಮಲ್ಲಿನಾಥ": [{"type": "noun", "defs": ["(jain.) name of a spiritual teacher."]}], "ಮಲ್ಲಿನಾಥಿ": [{"type": "noun", "defs": ["any of the commentaries on several Samskřta works, written by the scholar Mallinātha.", "(fig.) any gloss or commentary of a literary work."]}], "ಮಲ್ಲು": [{"type": "noun", "defs": ["a thin, soft muslin."]}], "ಮಲ್ಲುಕ": [{"type": "noun", "defs": ["a king of chief."]}], "ಮಲ್ಲುಕಪದವಿ": [{"type": "noun", "defs": ["the office, position, rank or dignity of a king; kingship."]}], "ಮಲ್ಲೆ": [{"type": "noun", "defs": ["the jasmine plant Jasminum auriculatum of Oleaceae family.", "its flower.", "the plant Lonicera leschenaultiana of Caprifoliaceae family.", "the plant Gardenia jasminoides ( = G. florida) of Rubiaceae family; cape jasmine."]}], "ಮಲ್ಲೆನೇರಳೆ": [{"type": "noun", "defs": ["the tree Syzygium jambos ( = Eugenia jambos) of Myrtaceae family.", "its plum."]}], "ಮಲ್ಲೋಗರ": [{"type": "noun", "defs": ["a recurrent disorder of the nervous system, characterised either by mild, episodic loss of attention or sleepiness or by severe convulsions with loss of consciousness, accompanied by convulsions, physical dysfunction, etc.; epilepsy.", "an astrological planet or demigod, that is believed to cause this disease."]}], "ಮವಕುಫ್": [{"type": "noun", "defs": ["a discharging or removing or being discharged or removed from office or service, etc.; dismissal; removal.", "the act closing an office, court, shop, etc. or fact of being closed."]}], "ಮವಲಂಗ": [{"type": "noun", "defs": ["the tree Crataeva roxburghii of Capparaceae family."]}], "ಮವಾಳ": [{"type": "noun", "defs": ["a political party that refrains from adopting aggressive, extremist measures or advocates taking softer approach in public administration; a liberal party."]}], "ಮವಾಳಿತನ": [{"type": "noun", "defs": ["softness, blandness in one's approach or behaviour."]}], "ಮವುಜೆ": [{"type": "noun", "defs": ["a village or small town."]}], "ಮವುರಿ": [{"type": "noun", "defs": ["the gourd-pipe of Indian jugglers and snake charmers."]}], "ಮಶ": [{"type": "noun", "defs": ["the tree Shorea talura ( = S. robusta, = Vatica robusta) of Dipterocarpaceae family."]}], "ಮಶಕ": [{"type": "noun", "defs": ["any of numerous dipterous insects of the family Culicidae, the females of which suck the blood of animals and humans, some species transmitting certain diseases, as malaria and yellow fever; a mossquito."]}], "ಮಶಕಾರಿ": [{"type": "noun", "defs": ["a spider, as an enemy of mosquitoes."]}, {"type": "noun", "defs": ["a very fine cloth mesh or a curtain made of this in the form of a curtain, for keeping out mosquitoes while sleeping; a mosquito curtain."]}], "ಮಶವಳ": [{"type": "noun", "defs": ["= ಮಶವಾಳ."]}], "ಮಶವಾಳ": [{"type": "noun", "defs": ["the middle-sized, deciduous tree Chloroxylon swietenia of Meliaceae family; satin wood.", "the tree Meliosma arnottiana of Sabiaceae tree."]}], "ಮಶಾಣ": [{"type": "noun", "defs": ["=ಮಸಣ."]}], "ಮಶಾಲು": [{"type": "noun", "defs": ["a long strip of cloth, soaked in flamable oil or tallow, for winding round a long, thick piece of wood, to be used as a portable light."]}], "ಮಶಿ": [{"type": "noun", "defs": ["= ಮಸಿ 6 & 7.", "the profession of a writer, clerk.", "a piece of charcoal."]}], "ಮಶಿಕಾಣಿಕೆ": [{"type": "noun", "defs": ["= ಮಸಿಕಾಣಿಕೆ."]}], "ಮಶೀತಿ": [{"type": "noun", "defs": ["= ಮಸೀದಿ."]}], "ಮಶೀದಿ": [{"type": "noun", "defs": ["= ಮಸೀದಿ."]}], "ಮಶ್ರು": [{"type": "noun", "defs": ["a silk and cotton cloth with waving stripes."]}], "ಮಷಾಲ್": [{"type": "noun", "defs": ["= ಮಶಾಲು."]}], "ಮಷಾಲಚಿ": [{"type": "noun", "defs": ["= ಮಷಾಲ್ಚಿ."]}], "ಮóಷಾಲು": [{"type": "noun", "defs": ["= ಮಶಾಲು."]}], "ಮಷಾಲ್ಚಿ": [{"type": "noun", "defs": ["a man who carries a torch; a torch-bearer."]}], "ಮಷಿ": [{"type": "noun", "defs": ["= ಮಸಿ."]}], "ಮಷಿವಿದ್ಯೆ": [{"type": "noun", "defs": ["the profession of a writer, clerk."]}], "ಮಷೀಚಿತ್ರ": [{"type": "noun", "defs": ["a figure drawn with charcoal."]}], "ಮಷ್ಕಿರಿ": [{"type": "noun", "defs": ["lively, joyous play or playfulness; amusement, sport, recreation, etc."]}], "ಮಷ್ಟು": [{"type": "noun", "defs": ["matter that settles to the bottom of a liquid; sediment."]}], "ಮಸ": [{"type": "noun", "defs": ["intense anger; wrath; ire."]}], "ಮಸಂಗು": [{"type": "verb", "defs": ["= ಮಸಗು."]}], "ಮಸಕ": [{"type": "noun", "defs": ["the property of a moreadequate quantity or supply; abundance; copiousness.", "force or speed; great energy or vehemence of activity.", "a deep prolonged loud noise; roar.", "extreme degree of anything; the quality of being intense.", "a lively interest or strong eagerness; enthusiasm; zeal.", "mentalof extreme emotional.", "intense anger; ire; wrath.", "the quality of being magnificent or splendid; brilliance.", "any substance that causes injury or illness or death of a living organism in a slow manner; a slow-poison."]}, {"type": "noun", "defs": ["= ಮಶಕ.", "any of various plant diseases, esp. of cereal grasses, characterised by the appearance of masses of black spores which usu. break up into a fine powder; smut disease."]}], "ಮಸಕಂಗುಂದಿಸು": [{"type": "verb", "defs": ["to cause to become blur, dull, not brilliant."]}], "ಮಸಕಂಗುಂದು": [{"type": "verb", "defs": ["(intensity, force, brightness, lustre, etc.) to become less."]}], "ಮಸಕಂಗೊಳ್": [{"type": "verb", "defs": ["to become intense or more intense.", "to be excited by enthusiasm, zeal, etc.", "to become violently anger; to be enraged."]}], "ಮಸಕಂಬೆಱು": [{"type": "verb", "defs": ["= ಮಸಕಂಗೊಳ್."]}], "ಮಸಕು": [{"type": "noun", "defs": ["= ಮಸಕ1."]}, {"type": "noun", "defs": ["lack of brightness, lustre; dullness."]}], "ಮಸಗ": [{"type": "noun", "defs": ["a man whose profession is to sharpen the weapons, as sword, arrows, etc.; a whetter."]}], "ಮಸಗಿಸು": [{"type": "verb", "defs": ["to put into a rage; make very angry; to enrage."]}], "ಮಸಗು": [{"type": "verb", "defs": ["to become intense or more intense; to be intensified.", "to spread (onself) or diffuse through; to pervade throughout or all over.", "to reveal its presence or make an appearance; to manifest; to appear.", "to become forceful; to gain more momentum.", "to be characterised by undue haste and lack of thought or deliberation.", "to become excited, enthusiastic or zealous.", "to be agitated very much.", "to be enraged; to be put into rage.", "to oppose vehemently.", "to be or become bright, splendid or lusterous."]}], "ಮಸಗೆ": [{"type": "noun", "defs": ["= ಮಸಕ2."]}], "ಮಸಜೀದ": [{"type": "noun", "defs": ["= ಮಸೀದಿ."]}], "ಮಸಜೀದಿ": [{"type": "noun", "defs": ["= ಮಸೀದಿ."]}], "ಮಸಣ": [{"type": "noun", "defs": ["a burial ground or a place where dead bodies are cremated; a graveyard, cemetery or crematory."]}], "ಮಸಣಕಬ್ಬೆ": [{"type": "noun", "defs": ["= ಮಸಣಿ."]}], "ಮಸಣಗಾಡು": [{"type": "noun", "defs": ["= ಮಸಣ."]}], "ಮಸಣಗಾಹಿ": [{"type": "noun", "defs": ["a watchman at a cemetery or crematory.", "Śiva."]}], "ಮಸಣಬಟ್ಟೆ": [{"type": "noun", "defs": ["= ಮಸಣ."]}], "ಮಸಣಬ್ಬೆ": [{"type": "noun", "defs": ["name of a petty goddess."]}], "ಮಸಣಯಾತ್ರೆ": [{"type": "noun", "defs": ["a taking of a dead body to a cemetery or crematory."]}], "ಮಸಣವಟ್ಟಿ": [{"type": "noun", "defs": ["= ಮಸಣ."]}], "ಮಸಣವಟ್ಟಿಗೆ": [{"type": "noun", "defs": ["= ಮಸಣ."]}], "ಮಸಣವಟ್ಟೆ": [{"type": "noun", "defs": ["= ಮಸಣ."]}], "ಮಸಣವಾಟಿ": [{"type": "noun", "defs": ["= ಮಸಣ."]}], "ಮಸಣವಾಡಗೆ": [{"type": "noun", "defs": ["the fees payable for burying or cremating a dead body."]}], "ಮಸಣಿ": [{"type": "noun", "defs": ["name of a petty goddess."]}], "ಮಸಣಿಕಬ್ಬೆ": [{"type": "noun", "defs": ["= ಮಸಣಿ."]}]}