{"ಗೋಮೇದಿಕ": [{"type": "noun", "defs": ["= ಗೋಮೇದಕ."]}], "ಗೋಮೇಧ": [{"type": "noun", "defs": ["a sacrifice at the end of which a cow would be sacrificed."]}], "ಗೋಮೇಧಿಕ": [{"type": "noun", "defs": ["= ಗೋಮೇದಕ."]}], "ಗೋಯೆ": [{"type": "noun", "defs": ["a person who guards, protects or takes care of another person, property, etc.; a protector, a guardian."]}], "ಗೋರ್": [{"type": "verb", "defs": ["to gather or scrape together with or as with a rake, spade or fingers.", "to catch fish with a net or basket.", "to take unlawfully from, esp. by force or threat of force; to rob; to plunder.", "to make a mark on the surface with a pointed instrument, nail, etc.", "to pour grain from above to blow the chaff by wind; to winnow.", "to level the ploughed or turned up soil or make beds in a garden.", "to inflict a wound or wounds (on or upon); to injure."]}], "ಗೋರ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಗೋರಂಟ": [{"type": "noun", "defs": ["= ಗೋರಂಟಿ1."]}], "ಗೋರಂಟಿ": [{"type": "noun", "defs": ["the plant Barleroa prionites of Acanthaceae family; thorny nail dye."]}, {"type": "noun", "defs": ["the plant Lawsonia inermis ( = L. alba) of Lythraceae family; a kind of henna plant, the leaves of which are used make a dye for decorating hands and feet.", "the dye made from this plant."]}], "ಗೋರಂಟೆ": [{"type": "noun", "defs": ["= ಗೋರಂಟಿ1."]}, {"type": "noun", "defs": ["= ಗೋರಂಟಿ2."]}], "ಗೋರಕ್ಷ": [{"type": "noun", "defs": ["one who tends and guards cows; a cowherd.", "the plant Dregea volubilis ( = Marsdenia volubilis) of Asclepiadaceae family; cotton milk plant."]}], "ಗೋರಕ್ಷಕ": [{"type": "noun", "defs": ["= ಗೋರಕ್ಷ - 1."]}], "ಗೋರಕ್ಷಣ": [{"type": "noun", "defs": ["the care and raising of domesticated cattle; animal husbandry."]}], "ಗೋರಕ್ಷದುಗ್ಧಿ": [{"type": "noun", "defs": ["= ಗೋರಕ್ಷ - 2."]}], "ಗೋರಕ್ಷಮೂಲಿ": [{"type": "noun", "defs": ["= ಗೋರಕ್ಷ - 2."]}], "ಗೋರಕ್ಷಿ": [{"type": "noun", "defs": ["= ಗೋರಕ್ಷ - 2."]}], "ಗೋರಕ್ಷೆ": [{"type": "noun", "defs": ["= ಗೋರಕ್ಷ - 2."]}], "ಗೋರಖಮುಂಡಿ": [{"type": "noun", "defs": ["the tree Saymida febrifuga of Meliaceae family; bastard cedar; Indian redwood."]}], "ಗೋರಜ": [{"type": "noun", "defs": ["dust raised by cattle on the road while coming home in the evening."]}], "ಗೋರಜಮುಹೂರ್ತ": [{"type": "noun", "defs": ["evening, the time when the cattle return home, considered to be very auspicious time."]}], "ಗೋರಟಿ": [{"type": "noun", "defs": ["= ಗೋರಂಟಿ1."]}], "ಗೋರಟೆ": [{"type": "noun", "defs": ["= ಗೋರಂಟಿ1."]}], "ಗೋರಥ": [{"type": "noun", "defs": ["a carriage drawn by an ox or oxen.", "Śiva, whose vehicle is Vřṣabha, the best of bulls."]}], "ಗೋರಸ": [{"type": "noun", "defs": ["cow's milk.", "the liquid left after churning butter from milk; buttermilk.", "the coagulated part of milk, from which cheese is made, formed when milk sours; curd."]}], "ಗೋರಾ": [{"type": "adjective", "defs": ["having the colour of pure snow or milk; white.", "having a light-coloured skin; of white complexion."]}], "ಗೋರಾಗುಮ್ಮಟ": [{"type": "noun", "defs": ["that which is of white complexion, and healthy, graceful form."]}], "ಗೋರಾಜ": [{"type": "noun", "defs": ["an excellent bull.", "Nandi, the mythological bull, the vehicle of Śiva.", "the moon.", "Indra, the lord of gods.", "(myth.) Varuṇa, the lord of water."]}], "ಗೋರಾಜಿ": [{"type": "noun", "defs": ["a number of cattle feeding, living or being driven together; a herd of cattle.", "the potherb Amaranthus polygamus (=A. hypochondriacus) of Amaranthaceae family."]}], "ಗೋರಾಡ್ಗಮನ": [{"type": "noun", "defs": ["= ಗೋರಥ."]}], "ಗೋರಿ": [{"type": "noun", "defs": ["the act of attracting or fact of being attracted, as by charm, fascination or allure.", "the act of hunting animals by enticing.", "a song or music used by hunters to attract animals, esp. deer.", "ಗೋರಿಯ ಮೃಗ gōriya mřga a wild animal enticed by a hunter."]}, {"type": "noun", "defs": ["a hole in the ground in which to bury a dead body; a grave.", "a mound, monument made on it.", "ಗೋರಿ ಮಾಡು gōri māḍu to put a dead body into the earth usu. in a ceremonial manner; to inter; to bury; 2. (fig.) to erase, remove, obliterate something; ತನ್ನ ಗೋರಿಯನ್ನು ತಾನೇ ತೋಡಿಕೊ tanna gōriyannu tānē tōḍiko (fig.) to cause one's own destruction; to spoil completely oneself."]}, {"type": "noun", "defs": ["a kind of animal."]}, {"type": "noun", "defs": ["a man of crooked or sadistic nature."]}], "ಗೋರಿಕ": [{"type": "noun", "defs": ["any of the birds Gracula religiosa, Acridotheres tristis, Eulabes religiosa, Tumenuchus pagodarum and Sturnopastor contra, a few of them are able to mimic the human voice, often kept as pet; myna."]}], "ಗೋರಿಕಲ್": [{"type": "noun", "defs": ["= ಗೋರಿಕಲ್ಲು1."]}], "ಗೋರಿಕಲ್ಲು": [{"type": "noun", "defs": ["a brilliant, hexagonally crystalline mineral, silicon dioxide, SiO2, (with principal constituent being ordinary sand), most often in a colourless, transparent form, but also sometimes in coloured varieties used as semiprecious stones; quartz.", "a piece of any stone with sharp edge or edges."]}, {"type": "noun", "defs": ["a stone slab planted at the place where a dead person is buried."]}], "ಗೋರಿಕಾಯಿ": [{"type": "noun", "defs": ["the bean of the annual leguminous plant Cyamopsis tetragonoloba of Papilionaceae family; guar-bean."]}], "ಗೋರಿಗಲ್": [{"type": "noun", "defs": ["= ಗೋರಿಕಲ್ಲು1."]}], "ಗೋರಿಗೊಳ್": [{"type": "verb", "defs": ["= ಗೋರಿಗೊಳು."]}], "ಗೋರಿಗೊಳಿಸು": [{"type": "verb", "defs": ["to attract by charm, temptation etc.; to fascinate; to entice; to lure.", "to lure an animal by singing a charming song (for catching or killing).", "to inflict pain, suffering."]}, {"type": "verb", "defs": ["to put (the body of a dead) in the ground and cover with earth; to bury."]}], "ಗೋರಿಗೊಳು": [{"type": "verb", "defs": ["to be lured or enticed by the song of a hunter (said of animals being hunted).", "to suffer pain; to be inflicted."]}], "ಗೋರಿಡು": [{"type": "verb", "defs": ["to gather by scraping together with or as with a rake, spade or fingers."]}], "ಗೋರಿಪಿಡಿ": [{"type": "noun", "defs": ["the plant Barleria longiflora of Acanthaceae family."]}], "ಗೋರಿಬಲೆ": [{"type": "noun", "defs": ["= ಗೋರಿವಲೆ."]}], "ಗೋರಿಬೇಂಟೆ": [{"type": "noun", "defs": ["= ಗೋರಿವೇಂಟೆ."]}], "ಗೋರಿಯಿಕ್ಕು": [{"type": "verb", "defs": ["= ಗೋರಿಗೊಳಿಸು2."]}], "ಗೋರಿಲ್ಲ": [{"type": "noun", "defs": ["the largest, vegetarian, intelligent but shy, and most powerful of the great apes (Gorilla gorilla), native to the jungles of equatorial Africa; gorilla."]}], "ಗೋರಿವಲೆ": [{"type": "noun", "defs": ["a kind of rectangular net for catching fish, by pulling both sides of it in shallow water."]}], "ಗೋರಿವೇಂಟೆ": [{"type": "noun", "defs": ["a catching or killing a wild animal by alluring or decoying it into a trap."]}], "ಗೋರಿಸು": [{"type": "verb", "defs": ["to level the ploughed or turned up soil or make beds in a garden."]}], "ಗೋರು": [{"type": "verb", "defs": ["to gather or scrape together with or as with a rake, spade or fingers.", "to catch fish with a net or basket.", "to take unlawfully from, esp. by force or threat of force; to rob; to plunder.", "to make a mark on the surface with a pointed instrument, nail, etc.", "to pour grain from above to blow the chaff by wind; to winnow.", "to level the ploughed or turned up soil or make beds in a garden.", "to inflict a wound or wounds (on or upon); to injure."]}, {"type": "noun", "defs": ["the act of drawing in or together, raking."]}], "ಗೋರುಕೋಲು": [{"type": "noun", "defs": ["a small rake or a device with small teeth (usu. bent toward one side) at one end used for gathering dust, rubbish or for turning the material being cooked."]}], "ಗೋರುಗರೀಬ": [{"type": "noun", "defs": ["a very poor man."]}], "ಗೋರುಗೊಳಿಸು": [{"type": "verb", "defs": ["to inflict pain, suffering; to cause to suffer."]}], "ಗೋರುತ": [{"type": "noun", "defs": ["the loud cry of a ox or cow.", "an approximate unit of measure of distance (two haridāris)."]}], "ಗೋರುಮಣೆ": [{"type": "noun", "defs": ["a wooden board used to level ploughed ground or to gather grain together.", "a piece of board used for removing the excess of jaggery from the top of a mould."]}], "ಗೋರುಳಿ": [{"type": "noun", "defs": ["a small hand tool with a sharp blade for engraving or making marks on the surface of wood, etc.; a small chisel."]}], "ಗೋರೆ": [{"type": "noun", "defs": ["a man of crooked or sadistic nature."]}, {"type": "noun", "defs": ["= ಗೋರುಮಣೆ - 1.", "the excess jaggery removed from the top of a mould.", "a kind of basket used to catch fish."]}], "ಗೋರೋಚ": [{"type": "noun", "defs": ["= ಗೋರೋಚನ."]}], "ಗೋರೋಚನ": [{"type": "noun", "defs": ["a bright yellow pigment prepared from the urine or bile of a cow or vomited by a cow in the form of scybala."]}], "ಗೋರೋಚಿಸೊಪ್ಪು": [{"type": "noun", "defs": ["the potherb Amaranthus polygamus (=A. hypochondriacus) of Amaranthaceae family; (?)."]}], "ಗೋರೋಜ": [{"type": "noun", "defs": ["= ಗೋರೋಚನ."]}], "ಗೋರೋಜನ": [{"type": "noun", "defs": ["= ಗೋರೋಚನ."]}], "ಗೋರ್ಕಲ್ಲು": [{"type": "noun", "defs": ["= ಗೋರಿಕಲ್ಲು1."]}], "ಗೋರ್ಕು": [{"type": "noun", "defs": ["the medium-sized evergreen tree Trema orientalis (=Celtis orientalis) of Ulmaceae family; charcoal tree."]}], "ಗೋರ್ಗಲ್ಲು": [{"type": "noun", "defs": ["= ಗೋರಿಕಲ್ಲು1."]}], "ಗೋರ್ಗಿ": [{"type": "noun", "defs": ["a kind of plant (Galega purpurea ?)."]}], "ಗೋರ್ಗುರಿಸು": [{"type": "verb", "defs": ["to utter a loud, rumbling sound, as in pain, anger, etc."]}], "ಗೋರ್ದ": [{"type": "noun", "defs": ["the mass of nerve tissue in the cranium of vertebrate animals, an enlarged extension of the spinal cord, being the main part of the nervous system, the centre of thought, and the organ that perceives sensory impulses and regulates motor impulses; the brain."]}], "ಗೋಲ": [{"type": "noun", "defs": ["the state of being spherical.", "any round body or figure having the surface equally distant from the centre at all points; a globe; a ball.", "a plane figure bounded by a single curved line, every point of which is equally distant from the point at the centre of the figure; a circle.", "the plant Xeromphis spinosa ( = Gardenia floribunda, = Randi dumetorum) of Rubiaceae family.", "an illegitimate son of a widow.", "(astrol.) the condition of six (according to some seven) planets being in the same house."]}], "ಗೋಲಂದಾಜ": [{"type": "noun", "defs": ["a soldier trained in the use of cannons, mounted heavy-guns, etc.; an artilleryman.", "the branch of an army specialised in the use of heavy mounted guns; the artillery."]}], "ಗೋಲಂದಾಜು": [{"type": "noun", "defs": ["= ಗೋಲಂದಾಜ."]}], "ಗೋಲಂದಾಜು ಇಲಾಖೆ": [{"type": "noun", "defs": ["military branch or unit that orders, stores, and supplies ordnance; ordnance."]}], "ಗೋಲಂದಾಸ": [{"type": "noun", "defs": ["= ಗೋಲಂದಾಜ."]}], "ಗೋಲಂದಿ": [{"type": "noun", "defs": ["a rodent resembling the rat."]}], "ಗೋಲಕ": [{"type": "noun", "defs": ["any round body or figure having the surface equally distant from the centre at all points; a globe; a ball.", "any of the openings (as of sensory organs such as the eye, ear, nose, etc.) 3) the round, pigmented membrane surrounding the pupil of the eye, having muscles that adjust the size of the pupil to regulate the amount of light entering the eye; the iris.", "an electric light bulb.", "a closed box or a round container with a slit at the top for inserting monetary coins, used as a money box.", "an illegitimate son of a widow.", "a small ball, tablet, capsule, etc. of medicine usu. to be swallowed whole; a pill.", "the churned curd."]}], "ಗೋಲಗುಮಟ": [{"type": "noun", "defs": ["a hemispherical roof or one formed by a series of rounded arches or vaults on a round or many-sided base; a large cupola; a dome.", "a rounded lump or protuberance."]}], "ಗೋಲಗುಮುಟ": [{"type": "noun", "defs": ["= ಗೋಲಗುಮಟ."]}], "ಗೋಲನ್": [{"type": "noun", "defs": ["the act of inducing or trying to induce to do something; a seeking to persuade by flattery, soothing words, an ingratiating manner, etc.; coaxing.", "ಗೋಲನ್ ಮಾಡು gōlan māḍu to influence or persuade (a person) by flattery, soothing words, coaxing, etc.; 2) (fig.) to make another act according to one's plan; to hypnotise."]}], "ಗೋಲರಸ": [{"type": "noun", "defs": ["a bitter, transparent, aromatic gum exuded from the bark of Commiphora plants; Myrrh."]}], "ಗೋಲಸರ": [{"type": "noun", "defs": ["the plant Mallotus philippensis ( = Rottlera tinctoria) of Euphorbiaceae family (?)."]}], "ಗೋಲಾಂಗೂಲ": [{"type": "noun", "defs": ["the tail of a cow.", "a kind of monkey having a tail like a cow."]}], "ಗೋಲಾಂಗೂಳ": [{"type": "noun", "defs": ["= ಗೋಲಾಂಗೂಲ."]}], "ಗೋಲಾಕಾರ": [{"type": "noun", "defs": ["the shape that is round or globular."]}], "ಗೋಲಾಟ": [{"type": "noun", "defs": ["(myst.) one of the many yogic spots or circles in the subtle body of human, by activating which by yogic techniques, one achieves some superhuman powers."]}], "ಗೋಲಾರ್ಧ": [{"type": "noun", "defs": ["half of a sphere, globe or celestial body, esp. - a) any of the halves into which the celestial sphere is divided by either the celestial equator or the ecliptic; b) any of the halves of the earth (either north or south); a hemisphere."]}], "ಗೋಲಿ": [{"type": "noun", "defs": ["anything that is in the shape of a ball.", "a little ball of stone, glass or clay, used in games.", "a small ball or cone-shaped missile of lead, metal alloy, etc., to be shot from a firearm; a bullet.", "ಗೋಲಿ ಆಟ gōli āṭa a children's game in which a marble is propelled by a finger at other marbles, usu. in an attempt to drive them out of a marked circle; 2. a work, undertaking that is, considered to be or neglected as a trivial or easy."]}, {"type": "noun", "defs": ["in football game, a player stationed at a goal to prevent the ball from entering it; a goal-keeper."]}, {"type": "noun", "defs": ["the plant Nyctanthes arbor-tristis of Oleaceae family.", "its flower."]}], "ಗೋಲಿತೇವು": [{"type": "noun", "defs": ["a children's game in which the loser propels the marble by the back of the palm with fingers folded."]}], "ಗೋಲಿಬಾರು": [{"type": "noun", "defs": ["= ಗೋಲೀಬಾರು."]}], "ಗೋಲೀಢ": [{"type": "noun", "defs": ["the plant Stereospermum suaveolens ( = Bignonia suaveolens) of Bignoniaceae family.", "its flower; trumpet flower."]}], "ಗೋಲೀಬಾರು": [{"type": "noun", "defs": ["the act or an instance of firing using a fire-arm, esp. by policemen; firing."]}], "ಗೋಲೀಯ": [{"type": "adjective", "defs": ["shaped like a sphere; globular; spherical."]}], "ಗೋಲು": [{"type": "noun", "defs": ["a position or space beside one; a side.", "the act or fact of the rein of a horse being pulled by the rider to control the animal."]}, {"type": "noun", "defs": ["(dial.) a kind of sari (a long, unsewn cloth worn by women) that is worn without tucking the one end behind at the waist , passing between the legs."]}, {"type": "noun", "defs": ["in football game, the space between two poles set at the opposite ends of a field through which or a net into which the ball must be passed to score; the goal.", "the score so made."]}], "ಗೋಲೋಕ": [{"type": "noun", "defs": ["(myth.) one of the several higher regions, a part of heaven."]}], "ಗೋಲೋಮಿ": [{"type": "noun", "defs": ["the plant Acorus calamus of Araceae family.", "its root; sweet flag-root.", "the grass Agrostis procera of Poaceae family.", "the plant Nardostachys jatamansi of Valerianaceae family, the root of which is used in making a fragrant ointment; spikenard; Indian nard."]}], "ಗೋಲೋಮಿಕೆ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಗೋವ": [{"type": "noun", "defs": ["a man who protects, tends cattle; a cowherd.", "a man who guards, protects, another.", "a man who rides a horse."]}], "ಗೋವಂದನಿ": [{"type": "noun", "defs": ["the tree Aglaia roxburghiana of Meliaceae family; tree of beauty."]}], "ಗೋವಗೆಡ್ಡೆ": [{"type": "noun", "defs": ["the plant Leonotis nepetaefolia of Labiatae (=Lamiaceae) family."]}], "ಗೋವತಿ": [{"type": "noun", "defs": ["a woman belonging to herdsmaṇs caste; a herdswoman."]}], "ಗೋವತ್ಸ": [{"type": "noun", "defs": ["a young cow."]}], "ಗೋವರ": [{"type": "noun", "defs": ["an excellent cow.", "good, pleasing speech."]}], "ಗೋವರ್ಧನ": [{"type": "noun", "defs": ["the care and welfare of domesticated cattle.", "Křṣṇa, as the one who is the care-taker of cattle.", "name of a mountain, mythologically known as the one held up by Křṣṇa to defy Indra the lord of gods.", "the annual leguminous plant Cyamopsis tetragonoloba of Papilionaceae family; guar.", "its bean used as food; guar bean."]}], "ಗೋವಲೆಗಟ್ಟಿಗೆ": [{"type": "noun", "defs": ["= ಗೋವಳಗಟ್ಟಿಗೆ."]}], "ಗೋವಳ": [{"type": "noun", "defs": ["a man who protects, tends cattle; a cowherd."]}], "ಗೋವಳಗಟ್ಟಿಗೆ": [{"type": "noun", "defs": ["the stick of a cowherd for controlling or threatening cows.", "a wooden or metal hook to impel or drive a horse or elephant."]}], "ಗೋವಳಗೞ್ತಲೆ": [{"type": "noun", "defs": ["pitch darkness."]}], "ಗೋವಳಗೋಲ್": [{"type": "noun", "defs": ["= ಗೋವಳಗಟ್ಟಿಗೆ."]}], "ಗೋವಳತಿ": [{"type": "noun", "defs": ["a woman belonging to herdsmaṇs caste; a herdswoman."]}], "ಗೋವಳಿಗ": [{"type": "noun", "defs": ["= ಗೋವಳ."]}], "ಗೋವಳಿಗಟ್ಟಿಗೆ": [{"type": "noun", "defs": ["= ಗೋವಳಗಟ್ಟಿಗೆ."]}], "ಗೋವಳಿಗತನ": [{"type": "noun", "defs": ["the work, profession of a cowherd.", "the quality or condition of being stupid; stupidity."]}], "ಗೋವಳಿಗೋಲ್": [{"type": "noun", "defs": ["= ಗೋವಳಗಟ್ಟಿಗೆ."]}], "ಗೋವಳಿತಿ": [{"type": "noun", "defs": ["= ಗೋವಳತಿ."]}], "ಗೋವಾಟಿ": [{"type": "noun", "defs": ["a building for cows; a cowshed."]}], "ಗೋವಾಳ": [{"type": "noun", "defs": ["= ಗೋವಳ."]}], "ಗೋವಾಳಿ": [{"type": "noun", "defs": ["a number of cattle feeding, living or being driven together; a herd of cattle."]}, {"type": "noun", "defs": ["= ಗೋವಳತಿ."]}], "ಗೋವಿ": [{"type": "noun", "defs": ["a device consisting of a narrow tube fitted at one end with a piston by means of which a liquid can be drawn in and then ejected in a stream, used to play with.", "a high-pitched wind instrument, with or without reed, consisting of a long, slender (usu. bamboo) tube, played by blowing across a hole near one end and fingering the holes along its length; a flute.", "a short pipe used to blow air on fire for kindling it.", "a very small, short pipe made of gold, stringed to a necklace.", "a kind of weapon consisting of a metal tube from which bullets or other missiles are propelled by explosive force; a gun."]}, {"type": "noun", "defs": ["= ಗೋವಳತಿ."]}], "ಗೋವಿಂದ": [{"type": "noun", "defs": ["a man who owns cattle.", "Křṣṇa, as a cowherd.", "(myth.) Břhaspati, the lord of speech.", "(pros.) a kind of metre with three syllables of which the first two are long and third one being short (--u).", "(fig.) the act of cheating or an instance of being cheated.", "ಬಂದದ್ದೆಲ್ಲಾ ಬರಲಿ, ಗೋವಿಂದನ ದಯವಿರಲಿ bandaddellā barali, gōvindana dayavirali a saying to embolden people to face the hardships and may the God help them; whom god will help, none can hinder."]}], "ಗೋವಿಂದಗತಿ": [{"type": "noun", "defs": ["the use of charms, spells, and rituals in seeking or pretending to cause or control events or govern certain natural or supernatural forces; magic."]}], "ಗೋವಿಂದಫಲ": [{"type": "noun", "defs": ["the fruit of the plant Capparis zeylanica of Capparaceae family; Ceylon caper.", "the plant itself."]}], "ಗೋವಿಂದಬಕ್ಷಿ": [{"type": "noun", "defs": ["an erstwhile monetary coin."]}], "ಗೋವಿಂದರಾಜಿ": [{"type": "noun", "defs": ["an erstwhile monetary coin."]}], "ಗೋವಿಂದವೀಳೈ": [{"type": "noun", "defs": ["a substance made of the betel pepper leaf with betel nut, lime and spices, in the shape of a pyramid, for chewing."]}], "ಗೋವಿಕೆ": [{"type": "noun", "defs": ["= ಗೋವಳಿಗತನ."]}], "ಗೋವು": [{"type": "noun", "defs": ["the mature female of domestic cattle of the genus Bos.", "ಗೋವಿನ ಜೋಳ gōvina jōḷa the cereal grass Zea mays of Poaceae family; maize; Indian corn; 2. the seeds of this; maize; Indian corn."]}], "ಗೋವುಂಡು": [{"type": "noun", "defs": ["the chief of a village.", "the duty, office or status of the chief of a village."]}], "ಗೋವುಧಿ": [{"type": "noun", "defs": ["= ಗೋವಾಳಿ1."]}], "ಗೋವುಳಿಗ": [{"type": "noun", "defs": ["= ಗೋವಳ."]}], "ಗೋವುಳಿಗತನ": [{"type": "noun", "defs": ["= ಗೋವಳಿಗತನ."]}], "ಗೋವೆ": [{"type": "noun", "defs": ["a small region on the west coast of India having an area of 1,350 sq. mi. (3,496 sq. km) and since 1962, it is formed as a Union Territory (with Daman & Diu and called Goa, Daman, and Diu), with a total area of 3,813 sq. km; ಗೋವೆಯ ಸಣ್ಣ gōveya saṇṇa a variety of fine rice."]}, {"type": "noun", "defs": ["the tropical tree Anacardium occidentale of Anacardiaceae family, valued for its kidney-shaped seeds; cashew."]}], "ಗೋವೆಬೀಜ": [{"type": "noun", "defs": ["the kidney-shaped nut of the tropical, evergreen tree Anacardium occidentale (family: Anacardiaceae); cashew nut."]}], "ಗೋವೈದ್ಯ": [{"type": "noun", "defs": ["the branch of medicine dealing with the prevention and treatment of diseases and injuries in cattle; veterinary science.", "a man who practices this branch of medicine or surgery."]}], "ಗೋಶಾಲೆ": [{"type": "noun", "defs": ["a building for cows; a cowshed."]}], "ಗೋಶಿ": [{"type": "noun", "defs": ["a single long cloth used to cover the privy parts, as by a male ascetic or, poormen in warm climates; a loin cloth."]}], "ಗೋಶೀರ್ಷ": [{"type": "noun", "defs": ["the head of a cow.", "a kind of sandal wood that is brass-coloured and very fragrant.", "the sandal paste."]}], "ಗೋಶ್ರೋತ್ರ": [{"type": "noun", "defs": ["snake, which is believed to use its eyes as ears also."]}], "ಗೋಶ್ವಾರೆ": [{"type": "noun", "defs": ["= ಗೋಷ್ವಾರೆ."]}], "ಗೋಷಾ": [{"type": "noun", "defs": ["a thin curtain used by women to cover their face (from strangers, that is in practice among Muslims and some Hindus); purdah."]}], "ಗೋಷಾಪದ್ಧತಿ": [{"type": "noun", "defs": ["the practice among Muslims and some Hindus of secluding or hiding women from strangers; purdah custom."]}], "ಗೋಷೆ": [{"type": "noun", "defs": ["= ಗೋಷಾ."]}], "ಗೋಷ್ಟಿ": [{"type": "noun", "defs": ["= ಗೋಷ್ಠಿ."]}], "ಗೋಷ್ಠ": [{"type": "noun", "defs": ["a building for cows; a cowshed.", "a number of cattle feeding, living or being driven together; a herd of cattle."]}], "ಗೋಷ್ಠಶ್ವ": [{"type": "noun", "defs": ["a dog lying in the fodder-bin in a cowshed.", "(fig.) a mean person who without enjoying the comfort of one's life, denies others such comfort or inflicts physical or psychological pain; a sadist."]}], "ಗೋಷ್ಠಾಗಾರ": [{"type": "noun", "defs": ["= ಗೋಷ್ಠ -1."]}], "ಗೋಷ್ಠಾಧ್ಯಕ್ಷ": [{"type": "noun", "defs": ["the chief of the herdsmeṇs community."]}], "ಗೋಷ್ಠಿ": [{"type": "noun", "defs": ["a group of persons gathered together, as for worship, instruction, discussion or entertainment.", "the state of being associated; companionship; fellowship; association.", "(dance.) a kind of dance-drama."]}], "ಗೋಷ್ಠಿಕೆ": [{"type": "noun", "defs": ["the act, fact of drinking spirituous liquors by several persons together.", "an assemblage for such a purpose."]}], "ಗೋಷ್ಠಿಗಾನ": [{"type": "noun", "defs": ["a singing by many people together in a musical show; a group-singing; chorus."]}], "ಗೋಷ್ಠಿಗೆಯ್": [{"type": "verb", "defs": ["to make merry, laugh and have fun with a number of persons joined together for the purpose."]}], "ಗೋಷ್ಠೀಕಲ್ಯಾಣ": [{"type": "noun", "defs": ["(mus.) a particular kind of time-keeping."]}], "ಗೋಷ್ಪದ": [{"type": "noun", "defs": ["the bottom part of a cow's leg.", "the place meant for the movement of cattle, esp. a pasture.", "the mark, impression of a cow's hoof in the soil.", "anything that is very small as a very narrow place, shallow depression in the ground, etc."]}], "ಗೋಷ್ಪದಜಲ": [{"type": "noun", "defs": ["that quantity of water which is sufficient to fill the depression made by the hoof of a cow in the soil; a very small quantity of water."]}], "ಗೋಷ್ಪಾದ": [{"type": "noun", "defs": ["= ಗೋಷ್ಪದ."]}], "ಗೋಷ್ವಾರ": [{"type": "noun", "defs": ["= ಗೋಷ್ವಾರೆ."]}], "ಗೋಷ್ವಾರೆ": [{"type": "noun", "defs": ["a brief statement or summary of accounts; an abstract.", "a general calculation of size, value, etc., esp. an approximate computation of the probable cost of a piece of work or a very general opinion or judgement formed based on superficial impression of something.", "a concise abridgment of a passage; a precis."]}], "ಗೋಸ": [{"type": "noun", "defs": ["sound esp. one of a loud proclamation, announcement, etc.", "an enclosed yard, building for cattle; a cow-pen."]}, {"type": "noun", "defs": ["a fragrant, bitter-tasting gum resin exuded from any of several plants, used in making incense, perfume, etc. gum myrrh."]}], "ಗೋಸಂಖ್ಯ": [{"type": "noun", "defs": ["a man who has the count of cows (one has or in a herd); a cowherd."]}], "ಗೋಸಂಪಿಗೆ": [{"type": "noun", "defs": ["the tree Plumeria rubra ( = p. acuminata, = P. acutifolia) of Apocynaceae family, with large and fragrant flowers; frangipani.", "its flower."]}], "ಗೋಸಂಭವ": [{"type": "noun", "defs": ["that which is produced from or by a cow."]}], "ಗೋಸಗೆ": [{"type": "noun", "defs": ["the early part of the day, when cattle are taken out for grazing; morning."]}], "ಗೋಸಣೆ": [{"type": "noun", "defs": ["a proclamation - a) a proclaiming or being proclaimed; b) something that is proclaimed or announced officially.", "the state of being widely known (in good sense); reputation; fame."]}], "ಗೋಸಣೆಗಳೆ": [{"type": "verb", "defs": ["= ಗೋಸಣೆಮಾಡು."]}], "ಗೋಸಣೆಗೊಳ್": [{"type": "verb", "defs": ["= ಗೋಸಣೆಗೊಳಿಸು."]}], "ಗೋಸಣೆಗೊಳಿಸು": [{"type": "verb", "defs": ["to cause to announce loudly, officially; to cause to publicise."]}], "ಗೋಸಣೆಮಾಡು": [{"type": "verb", "defs": ["to announce loudly, officially; to make widely known."]}], "ಗೋಸಣೆಯಿಡಿಸು": [{"type": "verb", "defs": ["= ಗೋಸಣೆಗೊಳಿಸು."]}], "ಗೋಸಣೆಯಿಡು": [{"type": "verb", "defs": ["= ಗೋಸಣೆಗೊಳಿಸು."]}], "ಗೋಸಣೆವೆಱು": [{"type": "verb", "defs": ["to gain popularity, fame; to become renowned."]}], "ಗೋಸನೆ": [{"type": "noun", "defs": ["= ಗೋಸಣೆ."]}], "ಗೋಸನೆಗಳೆ": [{"type": "verb", "defs": ["= ಗೋಸಣೆಮಾಡು."]}], "ಗೋಸನೆಗುಡುಕು": [{"type": "noun", "defs": ["food offered to a person calling him or her (from a distance)."]}], "ಗೋಸನೆಗೊಳು": [{"type": "verb", "defs": ["= ಗೋಸಣೆಗೊಳಿಸು."]}], "ಗೋಸನೆಯಿಡು": [{"type": "verb", "defs": ["= ಗೋಸಣೆಗೊಳಿಸು."]}], "ಗೋಸನೆವಿಡಿಸು": [{"type": "verb", "defs": ["= ಗೋಸಣೆಗೊಳಿಸು."]}], "ಗೋಸನೆವೋಗು": [{"type": "verb", "defs": ["to become famous; to be widely known."]}], "ಗೋಸಮಾಜ": [{"type": "noun", "defs": ["= ಗೋಸಮಿತಿ."]}], "ಗೋಸಮಿತಿ": [{"type": "noun", "defs": ["a number of cattle feeding, living or being driven together; a herd of cattle; farm animals collectively; livestock; cattle."]}], "ಗೋಸಮುದಾಯ": [{"type": "noun", "defs": ["= ಗೋಸಮಿತಿ."]}], "ಗೋಸಮೃದ್ಧಿ": [{"type": "noun", "defs": ["possession of cows considered as wealth."]}], "ಗೋಸರು": [{"type": "noun", "defs": ["(dial.) any of various classes (esp. Bryopsida) of very small, green bryophytes having stems with leaf-like structures and growing in velvety clusters on rocks, trees, moist ground, etc.; moss."]}], "ಗೋಸರ್ಗ": [{"type": "noun", "defs": ["the early part of the day, when cattle are taken out for grazing; morning."]}], "ಗೋಸಾಯಿ": [{"type": "noun", "defs": ["a man who has renunciated worldly life and lives on begging; a religious mendicant."]}], "ಗೋಸಾವಿ": [{"type": "noun", "defs": ["= ಗೋಸಾಯಿ."]}], "ಗೋಸಾಸ": [{"type": "noun", "defs": ["valour exhibited by a person in capturing cattle (of another country) or in a fight against the enemy army for getting released captured cattle of one's country."]}, {"type": "noun", "defs": ["a group of one thousand cows.", "a gift of one thousand cows."]}], "ಗೋಸಾಸಿ": [{"type": "noun", "defs": ["(a title) a man who exhibited extraordinary valour in a) capturing of cattle of another country or b) getting released cattle captured of one's country."]}], "ಗೋಸಾಸಿಗ": [{"type": "noun", "defs": ["= ಗೋಸಾಸಿ."]}], "ಗೋಸಿ": [{"type": "noun", "defs": ["= ಗೋಶಿ.", "ಆಸೆಗಾಱ ಹಾರುವಯ್ಯ ಗೋಸಿಯೊಳಗೆ ಮೂಗಳ ಕಟ್ಟಿದ āsegāṛa hāruvayya gōsiyoḷage mūgaḷa kaṭṭida a proverb meaning that on getting an opportunity, a greedy person grabs as much as he or she can."]}], "ಗೋಸಿಂಬೆ": [{"type": "noun", "defs": ["= ಗೋಸುಂಬೆ."]}], "ಗೋಸಿಗೆ": [{"type": "noun", "defs": ["a gift of food articles to a girl who is in her menses, for the first time."]}], "ಗೋಸಿದ್ಧಿ": [{"type": "noun", "defs": ["mastery over one's speech; accomplishment achieved in vivid, forceful, fluent, graceful and persuasive speech."]}], "ಗೋಸು": [{"type": "verb", "defs": ["to take (something) from another by force or fraud; to snatch away."]}], "ಗೋಸುಂಬೆ": [{"type": "noun", "defs": ["a kind of lizard, (Lacerta cristata/Chamaeles vulgaris) belonging to the Chamaeleontidae family, with an angular head, prehensile tail, eyes that move independently of each other, the ability to change skin colour rapidly, and a long, agile tongue for catching prey; a chameleon.", "(fig.) a person who changes his or her priorities, values of life, without regard to rightness or propriety, to gain advantage at any point of time."]}], "ಗೋಸುಗಲಿ": [{"type": "noun", "defs": ["one who boasts his own abilities, but actually not living up to his words."]}], "ಗೋಸುಬೆ": [{"type": "noun", "defs": ["= ಗೋಸುಂಬೆ."]}], "ಗೋಸ್ತ": [{"type": "noun", "defs": ["= ಗೋಸ್ಥಾನ."]}], "ಗೋಸ್ತನ": [{"type": "noun", "defs": ["a bag-like mammary organ in cows containing four more glands, each with a separate teat; udder.", "a bunch of flowers.", "a necklace of four strings."]}], "ಗೋಸ್ತನಿ": [{"type": "noun", "defs": ["a bunch of grapes.", "the grape vine.", "a wine made from grapes.", "a necklace of four strings."]}], "ಗೋಸ್ಥಾನ": [{"type": "noun", "defs": ["an enclosure, building for cattle; a cow-pen."]}], "ಗೋಸ್ಥಾನಕ": [{"type": "noun", "defs": ["= ಗೋಸ್ಥಾನ."]}], "ಗೋಸ್ವಾಮಿ": [{"type": "noun", "defs": ["the master or possessor of a cow or cows.", "a man who has subdued his worldly passions; a religious or yogic mendicant."]}], "ಗೋಹತಿ": [{"type": "noun", "defs": ["a killing of a cow, considered as a heinous crime.", "the sin contracted by that crime."]}], "ಗೋಹತ್ತು": [{"type": "noun", "defs": ["= ಗೋಹತಿ -1."]}], "ಗೋಹತ್ಯ": [{"type": "noun", "defs": ["= ಗೋಹತಿ."]}], "ಗೋಹನ": [{"type": "noun", "defs": ["the act of guarding, protecting, preserving, keeping, etc.; preservation; protection."]}], "ಗೋಹಳೆ": [{"type": "noun", "defs": ["cow's excrement; cow-dung; ಗೋಹಳೆಯೆಡೆ gōhaḷeyeḍe a place, usu. a pit, where cow-dung is collected."]}], "ಗೋಹುರ": [{"type": "noun", "defs": ["a gate in gen.", "the main gate of a town.", "a structure that is relatively high for its length and width and of conical or pyramidal type standing on the main gate of a town or temple or on the sanctum sanctorum of a temple or on a palace building."]}], "ಗೋಳ್": [{"type": "noun", "defs": ["the part of the body of an animal or human being that connects the head and the trunk; the neck."]}, {"type": "noun", "defs": ["= ಗೋಳು2."]}], "ಗೋಳ": [{"type": "noun", "defs": ["any of several domesticated or wild varieties of a large, strong species (Equus caballus) of perissodactylous mammal having a long, flowing tail; a horse."]}, {"type": "noun", "defs": ["the state of being spherical.", "any round body or figure having the surface equally distant from the centre at all points; a globe; a ball.", "a plane figure bounded by a single curved line, every point of which is equally distant from the point at the centre of the figure; a circle.", "the plant Xeromphis spinosa ( = Gardenia floribunda, = Randi dumetorum) of Rubiaceae family.", "an illegitimate son of a widow.", "(astrol.) the condition of six (according to some seven) planets being in the same house."]}], "ಗೋಳಕ": [{"type": "noun", "defs": ["any round body or figure having the surface equally distant from the centre at all points; a globe; a ball.", "any of the openings (as of sensory organs such as the eye, ear, nose, etc.) 3) the round, pigmented membrane surrounding the pupil of the eye, having muscles that adjust the size of the pupil to regulate the amount of light entering the eye; the iris.", "an electric light bulb.", "a closed box or a round container with a slit at the top for inserting monetary coins, used as a money box.", "an illegitimate son of a widow.", "a small ball, tablet, capsule, etc. of medicine usu. to be swallowed whole; a pill.", "the churned curd."]}], "ಗೋಳಕತ್ರಯ": [{"type": "noun", "defs": ["(Dvaita phil.) the three forms i.e. gross, subtle and absolute forms of the Lord that is to be meditated while worshipping."]}], "ಗೋಳಕಪಂಚಕ": [{"type": "noun", "defs": ["(Dvaita phil.) the three forms i.e. gross, ideal, subtle, subtler and absolute forms of the Lord that is to be meditated while worshipping."]}], "ಗೋಳಕಾಕಾರ": [{"type": "noun", "defs": ["the shape that is round or globular."]}], "ಗೋಳಕಾಯಿ": [{"type": "noun", "defs": ["a variety in mango fruits."]}], "ಗೋಳಗುಮುಟ": [{"type": "noun", "defs": ["a hemispherical roof or one formed by a series of rounded arches or vaults on a round or many-sided base; a large cupola; a dome.", "a rounded lump or protuberance."]}], "ಗೋಳಗುಮ್ಮಟ": [{"type": "noun", "defs": ["= ಗೋಳಗುಮುಟ."]}], "ಗೋಳಜಾತ": [{"type": "noun", "defs": ["(astrol.) a man who is born in ಗೋಳಯೋಗ (see below)."]}], "ಗೋಳಯೋಗ": [{"type": "noun", "defs": ["(astrol.) the condition of six (according to some seven) planets being in the same house, considered to be very inauspicious to the world."]}], "ಗೋಳಸಂಪಿಗೆ": [{"type": "noun", "defs": ["(dial.) a variety in campaka tree the flowers of which are round in shape.", "its flower."]}], "ಗೋಳಸಿ": [{"type": "noun", "defs": ["the tree Ficus drupaceae (var. pubescens) ( = F. mysorensis) of Moraceae family; demon fig tree.", "its fig."]}], "ಗೋಳಾಂಗೂಳ": [{"type": "noun", "defs": ["the tail of a cow.", "a kind of monkey having a tail like a cow."]}], "ಗೋಳಾಕಾರ": [{"type": "noun", "defs": ["the shape that is round or globular."]}], "ಗೋಳಾಗೋಳಿ": [{"type": "noun", "defs": ["the state of being disorder, deranged, confused."]}], "ಗೋಳಾಟ": [{"type": "noun", "defs": ["outward expression of grief; esp., a weeping or wailing; lamentation."]}], "ಗೋಳಾಡಿಸು": [{"type": "verb", "defs": ["to cause to lament; to cause sorrow, misery or suffering to."]}], "ಗೋಳಾಡು": [{"type": "verb", "defs": ["to feel deep sorrow or express it as by weeping or wailing; to wail; to lament.", "to beg humbly; to beseech."]}], "ಗೋಳಾಯಿಲ": [{"type": "noun", "defs": ["a man who rides a horse (usu. a professional); a horse-rider."]}], "ಗೋಳಾರ್ಧ": [{"type": "noun", "defs": ["half of a sphere, globe or celestial body; esp. a) any of the halves into which the celestial sphere is divided by either the celestial equator or the ecliptic; b) any of the halves of the earth (either north or south hemisphere); a hemisphere."]}], "ಗೋಳಿ": [{"type": "noun", "defs": ["the fig tree Ficus tinctoria ( = F. gibbosa) of Moraceae family.", "the potherb Portulaca quadrifida of Portulaceae family."]}, {"type": "noun", "defs": ["the tree Mimusops elengi of Sapotaceae family.", "its flower."]}, {"type": "noun", "defs": ["ಗೋಳಿಕುಟುಮನಬಳ್ಳಿ."]}], "ಗೋಳಿಕುಟುಮನಬಳ್ಳಿ": [{"type": "noun", "defs": ["the plant Gloriosa superba of Liliaceae family."]}], "ಗೋಳಿಗೆ": [{"type": "noun", "defs": ["a female horse; a mare."]}], "ಗೋಳಿಡಿಸು": [{"type": "verb", "defs": ["to inflict pain; to cause another wail; to distress."]}], "ಗೋಳಿಡು": [{"type": "verb", "defs": ["to make a plaintive, sad, crying sound; to express grief or pain by long, loud cries; to wail; to lament.", "to make a loud, rumbling noise; to roar."]}], "ಗೋಳಿಪಲ್ಯ": [{"type": "noun", "defs": ["= ಗೋಳಿಸೊಪ್ಪು."]}], "ಗೋಳಿಪಲ್ಲೆ": [{"type": "noun", "defs": ["= ಗೋಳಿಸೊಪ್ಪು."]}], "ಗೋಳಿಸು": [{"type": "verb", "defs": ["= ಗೋಳಿಡಿಸು."]}, {"type": "verb", "defs": ["to mix thoroughly; to stir well."]}], "ಗೋಳಿಸುಂಡೆ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಗೋಳಿಸೊಪ್ಪು": [{"type": "noun", "defs": ["the potherb Portulaca quadrifida of Portulaceae family."]}], "ಗೋಳೀಬಾರು": [{"type": "noun", "defs": ["the shooting of firearms, etc. esp. by policemen; firing."]}], "ಗೋಳು": [{"type": "verb", "defs": ["to poke or jab with a stick, finger etc."]}, {"type": "noun", "defs": ["a long, pitiful cry of grief and pain; wail; lamentation.", "the state of being distressed; pain, suffering, discomfort, etc.; distress; misery; agony."]}, {"type": "noun", "defs": ["a position or space beside one; a side.", "the act or fact of the rein of a horse being pulled by the rider to control the animal."]}, {"type": "noun", "defs": ["the part of the body of an animal or human being that connects the head and the trunk; the neck."]}], "ಗೋಳುಂಡೆ": [{"type": "noun", "defs": ["excessive grief."]}], "ಗೋಳುಂಡೆಗುಟ್ಟು": [{"type": "verb", "defs": ["= ಗೋಳುಂಡೆಗೊಳ್."]}], "ಗೋಳುಂಡೆಗೊಳ್": [{"type": "verb", "defs": ["to feel, express one's excessive grief; to lament vehemently."]}], "ಗೋಳುಂಡೆಗೊಳಿಸು": [{"type": "verb", "defs": ["to inflect excessive pain, grief to."]}], "ಗೋಳುಕರೆ": [{"type": "noun", "defs": ["a wailing cry, as of grief, pain or despair.", "any similar mournful sound.", "a piteous begging for mercy, aid, etc.", "the condition of making such a cry."]}], "ಗೋಳುಗರೆ": [{"type": "verb", "defs": ["to utter a prolonged, inarticulate, mournful cry, as in grief or suffering; to wail.", "to beg piteously, as for aid or mercy; to beseech; to entreat; to implore."]}], "ಗೋಳುಗುಟ್ಟಿಸು": [{"type": "verb", "defs": ["= ಗೋಳುಹೊಯ್."]}], "ಗೋಳುಗುಟ್ಟು": [{"type": "verb", "defs": ["to lament excessively; to wail."]}], "ಗೋಳುವೆ": [{"type": "noun", "defs": ["= ಗೋಳಿಸೊಪ್ಪು."]}], "ಗೋಳುಹುಯ್": [{"type": "verb", "defs": ["= ಗೋಳುಹೊಯ್."]}], "ಗೋಳುಹೊಯ್": [{"type": "verb", "defs": ["to irritate excessively; to cause to wail by inflicting trouble, pain, etc."]}], "ಗೋಳೆ": [{"type": "noun", "defs": ["hollow space as within a bamboo; the upper part of the bamboos."]}], "ಗೋಳೆತ್ತು": [{"type": "verb", "defs": ["to feel deep sorrow or express it as by weeping or wailing; to wail; to lament."]}], "ಗೋಳ್ಗರೆ": [{"type": "verb", "defs": ["= ಗೋಳುಗರೆ."]}, {"type": "noun", "defs": ["= ಗೋಳುಕರೆ."]}], "ಗೋಳ್ಗರೆತ": [{"type": "noun", "defs": ["= ಗೋಳುಕರೆ."]}], "ಗೋಳ್ಗುಟ್ಟಿಸು": [{"type": "verb", "defs": ["= ಗೋಳುಹೊಯ್."]}], "ಗೋಳ್ಗುಟ್ಟು": [{"type": "verb", "defs": ["= ಗೋಳುಗುಟ್ಟು."]}], "ಗೋಳ್ಗುಡಿಸು": [{"type": "verb", "defs": ["= ಗೋಳುಹೊಯ್."]}], "ಗೋಳ್ನುಡಿ": [{"type": "verb", "defs": ["= ಗೋಳೆತ್ತು."]}], "ಗೋಳ್ಮುರಿ": [{"type": "noun", "defs": ["the act of twisting another's neck.", "the act of inflicting; infliction; suffering inflicted on another."]}], "ಗೋಳ್ಮುರಿಗೊಳ್": [{"type": "verb", "defs": ["to twist another's neck.", "to inflict pain; to trouble, annoy, harm."]}], "ಗೋೞ್": [{"type": "noun", "defs": ["the wailing sound.", "a sound imitating it."]}, {"type": "noun", "defs": ["= ಗೋಳು4."]}, {"type": "noun", "defs": ["= ಗೋಳು2."]}], "ಗೋೞ": [{"type": "noun", "defs": ["= ಗೋಳ."]}], "ಗೋೞಯಿಲ": [{"type": "noun", "defs": ["= ಗೋಳಾಯಿಲ."]}], "ಗೋೞಾಡು": [{"type": "verb", "defs": ["= ಗೋಳಾಡು."]}], "ಗೋೞಾಯಿಲ": [{"type": "noun", "defs": ["= ಗೋಳಾಯಿಲ."]}], "ಗೋೞಾಯ್ಲ": [{"type": "noun", "defs": ["= ಗೋಳಾಯಿಲ."]}], "ಗೋೞಿಗೆ": [{"type": "noun", "defs": ["= ಗೋಳಿಗೆ."]}], "ಗೋೞಿಡಿಸು": [{"type": "verb", "defs": ["= ಗೋಳಿಡಿಸು."]}], "ಗೋೞಿಡು": [{"type": "verb", "defs": ["= ಗೋಳಿಡು."]}], "ಗೋೞುಂಡೆ": [{"type": "noun", "defs": ["= ಗೋಳುಂಡೆ."]}], "ಗೋೞುಂಡೆಗೊಳ್": [{"type": "verb", "defs": ["= ಗೋಳುಂಡೆಗೊಳ್."]}], "ಗೋೞುಂಡೆಗೊಳಿಸು": [{"type": "verb", "defs": ["= ಗೋಳುಂಡೆಗೊಳಿಸು."]}], "ಗೋೞೆಯಿಲ": [{"type": "noun", "defs": ["= ಗೋಳಾಯಿಲ."]}], "ಗೋೞ್ಗಱೆ": [{"type": "verb", "defs": ["= ಗೋಳುಗರೆ."]}, {"type": "noun", "defs": ["= ಗೋಳುಕರೆ."]}], "ಗೋೞ್ಗೆಡೆ": [{"type": "verb", "defs": ["(a condition, situation) to be characterised by mourning; to be depressing or melancholy."]}], "ಗೋೞ್ಮುರಿ": [{"type": "noun", "defs": ["= ಗೋಳ್ಮುರಿ."]}], "ಗೋೞ್ಮುರಿಗೊಳ್": [{"type": "verb", "defs": ["= ಗೋಳ್ಮುರಿಗೊಳ್."]}], "ಗೌಂಜು": [{"type": "noun", "defs": ["= ಗೌಜಲು."]}], "ಗೌಂಟಿಕೆ": [{"type": "noun", "defs": ["= ಗೌಂಟಿಗೆ."]}], "ಗೌಂಟಿಗೆ": [{"type": "noun", "defs": ["a talisman tied to a woman whois pregnant with the first child."]}], "ಗೌಂಡ": [{"type": "noun", "defs": ["= ಗೌಡ1."]}], "ಗೌಂಡಿ": [{"type": "noun", "defs": ["= ಗೌಡಿ1."]}, {"type": "noun", "defs": ["a person whose work is building with stone, brick, concrete, etc.; a mason."]}], "ಗೌಂಡು": [{"type": "noun", "defs": ["= ಗೌಡ1."]}], "ಗೌಂಡುಂಬಳಿ": [{"type": "noun", "defs": ["= ಗೌಡುಂಬಳಿ."]}], "ಗೌಜಲ್": [{"type": "noun", "defs": ["the medium to large sized deciduous tree Careya arborea of Myrtaceae family.", "the common black plum tree Syzygium cumuni ( = Eugenia jambolana) of Myrtaceae family.", "its dark blue or black plum."]}], "ಗೌಜಲ": [{"type": "noun", "defs": ["= ಗೌಜಲು1."]}], "ಗೌಜಲು": [{"type": "noun", "defs": ["the bird francolin partridge."]}, {"type": "noun", "defs": ["= ಗೌಜಲ್."]}], "ಗೌಜಿ": [{"type": "noun", "defs": ["= ಗೌಜು1."]}], "ಗೌಜು": [{"type": "noun", "defs": ["busy and noisy activity caused by enthusiasm, excitement, etc.; bustle.", "loud or confused shouting; din of voices; clamour; any loud, discordant or disagreeable sound or sounds; noise.", "the act of associating; a being or working together."]}, {"type": "noun", "defs": ["= ಗೌಜಲು1."]}], "ಗೌಟಿಕೆ": [{"type": "noun", "defs": ["= ಗೌಂಟಿಗೆ."]}], "ಗೌಟಿಕೆಗಟ್ಟು": [{"type": "verb", "defs": ["to tie a talisman to a woman whois pregnant with the first child, to ward off evil spirits.", "(a pregnant woman) to wear such a talisman."]}], "ಗೌಡ": [{"type": "noun", "defs": ["the chief of a village.", "a caste the main occupation of the members of which is agriculture and farming.", "a member of that caste."]}, {"type": "noun", "defs": ["name of a region including the present Bengal and northern part of Orissa in Eastern India.", "(rhet.) a literary style that is fraught with long and intertwined words, showy and artificially rhetoric sentences."]}], "ಗೌಡಪಟ್ಟು": [{"type": "noun", "defs": ["a caste the main occupation of the members of which is agriculture and farming."]}], "ಗೌಡಬಂಗಾಲ": [{"type": "noun", "defs": ["name of a region almost corresponding to the present Bengal in Eastern India.", "a secret, usu. evil, project or scheme; conspiracy; a plot.", "a magician or cheat."]}], "ಗೌಡಬಂಗಾಲಿ": [{"type": "adjective", "defs": ["of the nature of cheating; tending to deceive; planning to act secretly to commit a crime."]}, {"type": "noun", "defs": ["the art or performing skill of producing baffling effects or illusions by sleight of hand, concealed apparatus, etc. magic."]}], "ಗೌಡಬಂಗಾಳ": [{"type": "noun", "defs": ["= ಗೌಡಬಂಗಾಲ."]}], "ಗೌಡಮಾರ್ಗ": [{"type": "noun", "defs": ["= ಗೌಡ2 - 2."]}], "ಗೌಡರೀತಿ": [{"type": "noun", "defs": ["= ಗೌಡ2 - 2."]}], "ಗೌಡಿ": [{"type": "noun", "defs": ["the wife of the chief of a village.", "a female servant."]}, {"type": "noun", "defs": ["= ಗೌಡ2 - 2.", "the spirituous liquor made from the thick syrup produced during the refining of sugar."]}], "ಗೌಡಿಕೆ": [{"type": "noun", "defs": ["the office, status, duty etc. of the chief of a village."]}], "ಗೌಡಿತಿ": [{"type": "noun", "defs": ["= ಗೌಡಿ1."]}], "ಗೌಡೀರೀತಿ": [{"type": "noun", "defs": ["= ಗೌಡ2 - 2."]}], "ಗೌಡು": [{"type": "noun", "defs": ["= ಗೌಡ1."]}]}