{"ತುರ್ಪು": [{"type": "noun", "defs": ["= ತುರುಪು2."]}], "ತುರ್ಪುಹೂಡು": [{"type": "verb", "defs": ["to take with a trump.", "(fig.) to excel; surpass; outdo."]}], "ತುರ್ಯ": [{"type": "adjective", "defs": ["forming a 4th part.", "(phil.) being in the fourth state (said of the soul).", "(astrol.) being in the fourth house (from one's birth house)."]}], "ತುರ್ಯಗೆ": [{"type": "noun", "defs": ["(phil.) one of the seven stages that are achievable only through knowledge and which are essential means in gaining the final liberation of the soul."]}], "ತುರ್ಯಕ್ರ್ಷ": [{"type": "noun", "defs": ["(astrol.) the fourth house from one's birth house."]}], "ತುರ್ಯಾತೀತ": [{"type": "adjective", "defs": ["freed from all worldly bindings, feelings and obligations (while being alive)."]}, {"type": "noun", "defs": ["a man who, while being alive, has freed himself from all worldly bindings, feelings and obligations."]}], "ತುರ್ಯಾರೂಢ": [{"type": "adjective", "defs": ["= ತುರ್ಯಾತೀತ1."]}, {"type": "noun", "defs": ["= ತುರ್ಯಾತೀತ2."]}], "ತುರ್ಯಾಶ್ರಮ": [{"type": "noun", "defs": ["the fourth of the four orders of a Hindu in ancient society, in which, after fulfilling worldly obligations, one would become an ascetic and lead self-denying and religious life."]}], "ತುಲ": [{"type": "noun", "defs": ["= ತುಲೆ - 1.", "the state or quality of being alike; similarity; resemblance."]}], "ತುಲನ": [{"type": "noun", "defs": ["= ತುಲನೆ."]}], "ತುಲನಾತ್ಮಕ": [{"type": "adjective", "defs": ["of or pertaining to comparison.", "proceeding by, founded on or using, involving comparison as a method of study.", "estimated by comparison; not positive or absolute; relative."]}], "ತುಲನೆ": [{"type": "noun", "defs": ["the act of weighing by means of a scale or balance.", "the act of comparing or examining the similarities and differences of two or more things; comparison.", "heaviness as a quality of things (measurable by weighing).", "the act or raising aloft; a hoisting."]}], "ತುಲಸಿ": [{"type": "noun", "defs": ["any of a genus (Ocimum) of fragrant plants of the mint family, esp. a white-flowered garden herb (Ocimum sanctum which is religiously regarded as a goddess)."]}], "ತುಲಸಿಕಟ್ಟೆ": [{"type": "noun", "defs": ["a square-type structure with a basin at the top for planting ತುಲಸಿ (Ocimum sanctum) kept for purpose of worshipping."]}], "ತುಲಸಿಮಾಲೆ": [{"type": "noun", "defs": ["a garland of petals of Tulasi plant (Ocimum sanctum)."]}], "ತುಲಸೀದ್ವಾದಶಿ": [{"type": "noun", "defs": ["the twelfth day in the first fortnight of Kārtīka month (the eighth month in the lunar calendar).", "the ತುಲಸಿ festival observed on that day."]}], "ತುಲಸೀಮಣಿ": [{"type": "noun", "defs": ["a bead made of ತುಲಸಿ wood (a string of these beads is worn around the neck by religious people)."]}], "ತುಲಸೀವೃಂದಾವನ": [{"type": "noun", "defs": ["= ತುಲಸಿಕಟ್ಟೆ."]}], "ತುಲಾಕೋಟಿ": [{"type": "noun", "defs": ["either of the ends of the beam or crossbar of a weighing balance.", "an ornamental circlet worn around the ankle; an anklet.", "(math.) a hundred millions (10,00,00,000)."]}], "ತುಲಾದಂಡ": [{"type": "noun", "defs": ["the beam or crossbar of a weighing balance.", "a weighing balance."]}], "ತುಲಾಪುರುಷ": [{"type": "noun", "defs": ["gold, jewels or other valuables equal to a man's weight (given as a gift).", "a man who has given such a gift.", "a religious vow of giving such a gift."]}], "ತುಲಾಭಾರ": [{"type": "noun", "defs": ["gold, jewels or other valuables, grains or other articles as sugar, jaggery, etc. equal to a man's weight (given as a gift).", "a series of movement from back to forth (as a suspended object, pendulum, etc.)."]}], "ತುಲಾಮಾಸ": [{"type": "noun", "defs": ["the seventh month in a solar calendar (corresponding to the period from mid October to mid November)."]}], "ತುಲಾಯನ": [{"type": "noun", "defs": ["= ತುಲಾಸಂಕ್ರಮಣ."]}], "ತುಲಾಸಂಕ್ರಮಣ": [{"type": "noun", "defs": ["the day the sun enters the ತುಲಾಮಾಸ, that is in the mid October."]}], "ತುಲಾಸೂತ್ರ": [{"type": "noun", "defs": ["the string suspending a balance."]}], "ತುಲಿತ": [{"type": "adjective", "defs": ["likened; compared."]}, {"type": "noun", "defs": ["heaviness as a quality of things (measurable by weighing)."]}], "ತುಲು": [{"type": "noun", "defs": ["= ತುಳು."]}], "ತುಲೆ": [{"type": "noun", "defs": ["an instrument for weighing, esp. one that opposes equal weights, as in two matched shallow pans hanging from either end of a lever supported exactly in the middle; scales; a balance.", "the weight determined by weighing.", "a measure of gold or silver equal to one hundred palas.", "the act of weighing.", "the state, fact or quality of resembling; similarity of appearance, quality, etc.; likeness; resemblance.", "the beam or cross bar of a balance.", "a measure of weight equal to the weight of a rupee coin.", "a kind of utensil.", "a long, thick piece of wood used as a horizontal support for the roof of a building; a beam.", "a kind of trial used to find out the fact in ancient times.", "(astrol.) the seventh sign of the zodiac, which the sun enters in the middle of October.", "gold, jewels or other valuables equal to a man's weight (given as a gift)."]}], "ತುಲ್ಯ": [{"type": "adjective", "defs": ["having almost or exactly the same qualities, characteristics, etc.; similar; like; equal."]}], "ತುಲ್ಯತೆ": [{"type": "noun", "defs": ["the state or an instance of being equal or resembling almost exactly."]}], "ತುಲಾಪಾನ": [{"type": "noun", "defs": ["an act or instance of several persons drinking alcoholic liquors together; a tippling; compotation."]}], "ತುಲ್ಯಯೋಗಿತಾಲಂಕಾರ": [{"type": "noun", "defs": ["(rhet.) a figure of speech in which, equal qualities of unequal objects are combined."]}], "ತುಲ್ಲು": [{"type": "noun", "defs": ["the external genital organs of the female, including the labia majora, labia minora, clitoris, and the entrance to the vagina; the pudendum muliebre; the vulva."]}], "ತುವರ": [{"type": "noun", "defs": ["the astringent taste.", "a man in whom beard is not grown on the cheeks and chin; a beardless man."]}], "ತುವರಮಣ್ಣು": [{"type": "noun", "defs": ["a kind of fragrant earth."]}], "ತುವರಹ": [{"type": "noun", "defs": ["the evergreen tree Gynocardia odourata of Flacourtiaceae family, the oil extracted from the seedsof which is used in curing various skin diseases.", "another tree of the same family Hydnocarpus laurifolia; Tamane oil tree."]}], "ತುವರಿ": [{"type": "noun", "defs": ["= ತುವರಮಣ್ಣು.", "2.the pea plant Cajanus indicus with yellow flowers, widely grown in tropical land for its edible seed; the pigeon pea plant.", "its seed.", "a double sulphate of a monovalent metal or radical (as sodium, potassium or ammonium) with a trivalent metal (as aluminium, iron or chromium) and used as an astringent, as an emetic, and in the manufacture of baking powders, dyes, and paper; alum."]}], "ತುವರಿಕೆ": [{"type": "noun", "defs": ["= ತುವರಿ."]}], "ತುಶಿತ": [{"type": "noun", "defs": ["a class of gods.", "the region of these gods."]}], "ತುಷ": [{"type": "noun", "defs": ["the dry outer covering of rice; chaff; husk.", "the large deciduous tree Terminalia belerica (= T. bellirica, = T. bellerica) of Combretaceae family.", "that with which something is covered; a veil, screen, lid etc."]}], "ತುಷಗಳೆ": [{"type": "verb", "defs": ["to remove the husk or husks from; to husk; to hull."]}], "ತುಷಪರ್ಣ": [{"type": "noun", "defs": ["the leaf-like cover that envelops a planṭs new growth as a shoot, bud, etc. in initial stage."]}], "ತುಷಪರ್ಣಿ": [{"type": "noun", "defs": ["the fig tree Ficus benjamina (= F. retusa) of Moraceae family; willow fig tree; (?)."]}], "ತುಷಮಷ": [{"type": "adjective", "defs": ["without worth or merit; useless, valueless, etc.; worthless."]}], "ತುಷಾಗ್ನಿ": [{"type": "noun", "defs": ["a fire of chaff or of the husk of corn; chaff-fire.", "a kind of self-punishment of burning oneself in a chaff-fire, undertaken by a person in repentance.", "(myth.) one of the hells."]}], "ತುಷಾನಲ": [{"type": "noun", "defs": ["= ತುಷಾಗ್ನಿ."]}], "ತುಷಾರ": [{"type": "adjective", "defs": ["of a temperature much lower than that of the human body; cold; chilly; frigid."]}, {"type": "noun", "defs": ["the icy crystals that form directly on a freezing surface as moist air contacts it; frost; rime; hoarfrost.", "a dewdrop (usu. formed usu. during the night on lawns, etc.).", "the glassy, brittle, crystalline form of water made solid by cold; frozen water; ice.", "a whitish, translucent, crystalline, pleasant-odoured terpene ketone, C10H16O, obtained from the camphor tree, used chiefly in the manufacture of celluloid and in medicine as a counter-irritant for infections and in the treatment of pain and itching."]}], "ತುಷಿತ": [{"type": "noun", "defs": ["a class of celestial beings."]}], "ತುಷೋದಕ": [{"type": "noun", "defs": ["water in which rice is washed before being cooked."]}], "ತುಷ್ಟ": [{"type": "adjective", "defs": ["satisfied; contented; gratified."]}, {"type": "noun", "defs": ["a satisfied, contented, gratified man."]}], "ತುಷ್ಟಿ": [{"type": "noun", "defs": ["the state of being satisfied or contented; satisfaction; contentment; pleasure.", "(phil.) any of the nine kinds of contentment derived by leading an austere life.", "(myth.) name of one of the sixteenth part of the moon (as seen increasing by a day between new-moon day and full-moon day)."]}], "ತುಷ್ಟಿಕರ": [{"type": "adjective", "defs": ["causing satisfaction; satisfactory; pleasing; gratifying; bringing contentment."]}, {"type": "noun", "defs": ["the act of satisfying; gratification; satisfaction."]}], "ತುಷ್ಟಿಗೊಳಿಸು": [{"type": "verb", "defs": ["to fulfil the needs, expectations, desires, etc. of; to satisfy; to gratify."]}], "ತುಷ್ಟಿಬಡಿಸು": [{"type": "verb", "defs": ["= ತುಷ್ಟಿಗೊಳಿಸು."]}], "ತುಷ್ಟಿಬಡು": [{"type": "verb", "defs": ["to get satisfaction; to be gratified."]}], "ತುಷ್ಟಿವಡಿಸು": [{"type": "verb", "defs": ["= ತುಷ್ಟಿಗೊಳಿಸು."]}], "ತುಷ್ಟಿವಡು": [{"type": "verb", "defs": ["= ತುಷ್ಟಿಬಡು."]}], "ತುಷ್ಟಿವಡೆ": [{"type": "verb", "defs": ["= ತುಷ್ಟಿಗೊಳಿಸು.", "to get satisfaction; to be gratified."]}], "ತುಷ್ಟಿಸು": [{"type": "verb", "defs": ["= ತುಷ್ಟಿಬಡು."]}], "ತುಸ": [{"type": "noun", "defs": ["= ತುಷ - 1."]}, {"type": "noun", "defs": ["= ತುಸ್ತ - 1."]}, {"type": "adjective", "defs": ["little - a) small in size; not big; b) small in amount, number or degree; not much; c) short in duration or distance; brief; not long; d) small in importance or power; e) small in force, intensity, etc.; f) trivial; trifling."]}, {"type": "noun", "defs": ["a small, little quantity, number, degree or extent."]}, {"type": "adverb", "defs": ["= ತುಸಂ."]}], "ತುಸಂ": [{"type": "adverb", "defs": ["= ತುಸ3."]}], "ತುಸಪುಸ": [{"type": "noun", "defs": ["(an onomatopoeic formation) a term indicating disgust, confusion, etc."]}], "ತುಸು": [{"type": "adjective", "defs": ["= ತುಸ3."]}, {"type": "noun", "defs": ["= ತುಸ4."]}, {"type": "adverb", "defs": ["in a small degree; to a slight extent; only slightly; not much.", "(used in negative sense) (not) in the least."]}], "ತುಸ್ತ": [{"type": "noun", "defs": ["roasted meat.", "the burnt exterior of roasted meat.", "the husk or shell of a fruit."]}], "ತುಹಿನ": [{"type": "adjective", "defs": ["of a temperature much lower than that of the human body; cold; chilly; frigid."]}, {"type": "noun", "defs": ["particles of water vapour which when frozen in the upper air fall to earth as soft, white, crystalline flakes; snow.", "a mass or accumulation of fallen snow.", "the light of the moon.", "the tree Cinnamomum camphora of Lauraceae family; the camphor tree."]}], "ತುಹಿನತೆ": [{"type": "noun", "defs": ["absence of heat; lack of warmth; coldness; chilliness.", "a low temperature; esp., one below freezing.", "the sensation produced by a loss or absence of heat.", "a volatile, crystalline ketone, C10H16O, with a strong characteristic odour, derived from the wood of the camphor tree, used to protect fabrics from moths, in manufacturing cellulose plastics, and in medicine as an irritant and stimulant; camphor."]}], "ತುಹಿನರ್ತು": [{"type": "noun", "defs": ["the coldest season of the year usu. corresponding to the period from middle of November to middle of January."]}], "ತುಳ": [{"type": "noun", "defs": ["an instrument for weighing, esp. one that opposes equal weights, as in two matched shallow pans hanging from either end of a lever supported exactly in the middle; scales; a balance.", "the state or quality of being alike; similarity; resemblance."]}], "ತುಳಕಲು": [{"type": "noun", "defs": ["that which is walked on, pressed or crushed with the feat trodden; a trampled thing.", "that which has lost freshness or is withered, faded, etc.", "the act or an instance of treading; a trampling."]}], "ತುಳಸಿ": [{"type": "noun", "defs": ["any of a genus (Ocimum) of fragrant plants of the mint family, esp. a white-flowered garden herb, Ocimum sanctum, which is religiously regarded as a goddess."]}], "ತುಳಸಿಕಟ್ಟೆ": [{"type": "noun", "defs": ["a square-type structure with a basin at the top for planting ತುಳಸಿ (Ocimum sanctum) which usu. kept for purpose of worshipping."]}], "ತುಳಸಿಮಾಲೆ": [{"type": "noun", "defs": ["= ತುಳಸೀಮಾಲೆ."]}], "ತುಳಸೀಮಣಿ": [{"type": "noun", "defs": ["a bead made of ತುಳಸಿ wood (a string of these beads is worn around the neck by religious people)."]}], "ತುಳಸೀಮಾಲೆ": [{"type": "noun", "defs": ["a garland of petals of Tulasi plant (Ocimum sanctum)."]}], "ತುಳಾಡಿ": [{"type": "noun", "defs": ["a particular feat in wrestling."]}], "ತುಳಾಧರ": [{"type": "noun", "defs": ["a man who holds a balance; a merchant."]}], "ತುಳಾಪುರುಷ": [{"type": "noun", "defs": ["gold, jewels or other valuables equal to a man's weight (given as a gift).", "a man who has such a gift.", "a religious vow of giving such a gift."]}], "ತುಳಿ": [{"type": "verb", "defs": ["to press or beat with the feet so as to crush or injure; to tread; to trample.", "to oppress, subdue or destroy, by or as if by stepping on.", "to annoy; to harm; to molest.", "to press hard or closely; to exert pressure on, esp. from two or more sides to compress; to squeeze.", "to walk on, in, along, over etc."]}, {"type": "noun", "defs": ["= ತುಳಿತ."]}, {"type": "noun", "defs": ["soft, fluffy feathers, as the outer covering on young birds or an inner layer of feathers on adult birds; down."]}], "ತುಳಿತ": [{"type": "noun", "defs": ["the act or an instance of pressing or beating with the feet to or as to crush; a trampling."]}], "ತುಳಿಯಿಸು": [{"type": "verb", "defs": ["= ತುಳಿಸು."]}], "ತುಳಿಲ್": [{"type": "noun", "defs": ["= ತುಳಿಲು1."]}, {"type": "noun", "defs": ["= ತುಳಿಲು2."]}], "ತುಳಿಲಾಳ್": [{"type": "noun", "defs": ["= ತುಳಿಲಾಳು1."]}, {"type": "noun", "defs": ["= ತುಳಿಲಾಳು2."]}], "ತುಳಿಲಾಳು": [{"type": "noun", "defs": ["a man who is bound to work in feudal servitude or the like and who is completely dominated by his master; a servant; a serf."]}, {"type": "noun", "defs": ["a man of great strength and courage; a brave man; a hero."]}], "ತುಳಿಲು": [{"type": "noun", "defs": ["the act of laying one's body facing downward at the feet or in front of someone or something as a mark of respect or submission.", "the condition of being a slave, serf; subjection to a master; slavery; servitude."]}, {"type": "noun", "defs": ["boldness or determination in facing great danger; heroic courage; bravery."]}], "ತುಳಿಲುಗೆಯ್": [{"type": "verb", "defs": ["to prostrate throwing one's body at the feet of or in front of another as a mark of reverence or submission."]}], "ತುಳಿಲುಗೆಯಿ": [{"type": "verb", "defs": ["= ತುಳಿಲುಗೆಯ್."]}], "ತುಳಿಲ್ಗೆಯ್": [{"type": "verb", "defs": ["= ತುಳಿಲುಗೆಯ್."]}], "ತುಳಿಲ್ಗೈ": [{"type": "verb", "defs": ["= ತುಳಿಲುಗೆಯ್."]}], "ತುಳಿಲ್ಗೊಳ್": [{"type": "verb", "defs": ["= ತುಳಿಲ್ಗೊಳು."]}], "ತುಳಿಲ್ಗೊಳು": [{"type": "verb", "defs": ["= ತುಳಿಲುಗೆಯ್.", "to accept reverence or to be revered."]}], "ತುಳಿಸು": [{"type": "verb", "defs": ["to cause to walk on, press or beat (something) with the feet.", "to mix (different things) together; to blend.", "to injure beyond repair or renewal; to demolish; to ruin; to destroy."]}], "ತುಳು": [{"type": "noun", "defs": ["the region consisting of coastal districts of Western Karnāṭaka.", "a Dravidian language spoken chiefly in the western Districts of Karnāṭaka in southern India.", "a man belonging to this region or whose mother-tongue is Tuḷu."]}], "ತುಳುಂಕಾಡು": [{"type": "verb", "defs": ["= ತುಳುಕಾಡು."]}], "ತುಳುಂಕು": [{"type": "verb", "defs": ["= ತುಳುಕು1."]}, {"type": "noun", "defs": ["= ತುಳುಕು2."]}], "ತುಳುಂಕುಗುಟ್ಟು": [{"type": "verb", "defs": ["to spill over the brim (of a container) or overflow over the brink."]}], "ತುಳುಂಕುದುಂಬು": [{"type": "verb", "defs": ["to fill (a container) with something as to make it overflow, spill out, etc."]}], "ತುಳುಕಾಡು": [{"type": "verb", "defs": ["to spill over the brim (of a container) or overflow over the brink (as of a river, tank, etc.).", "to be highly disturbed physically or emotionally.", "to scatter (water) in drops; to sprinkle (over).", "to go down under the surface of water and rise repeatedly (enjoying bathing a river)."]}], "ತುಳುಕಿಸು": [{"type": "verb", "defs": ["to cause to spill (over or out).", "to express or show (smile, joy, etc. by a facial expression)."]}], "ತುಳುಕು": [{"type": "verb", "defs": ["to run or spill over the brim (said of a liquid in a container, water in a water tank, reservoir, etc.).", "to become greatly agitated, disturbed.", "to disturb, agitate greatly.", "to scatter (a liquid, powder, etc.) in drops or particles.", "to throw out; to emit.", "to project, hurl (a weapon) on.", "to set (an arrow) on the bow.", "to come forth; to come into existence; to occur."]}, {"type": "noun", "defs": ["the act of discharging, emitting or sending out something (from within)."]}], "ತುಳುಗತ್ತಿ": [{"type": "noun", "defs": ["a kitchen utensil with a sharp blade, usu. fixed vertically to a wooden or iron board, to cut vegetables."]}], "ತುಳುನಾಡು": [{"type": "noun", "defs": ["= ತುಳು - 1."]}], "ತುಳುವ": [{"type": "noun", "defs": ["= ತುಳು."]}, {"type": "noun", "defs": ["that which has become soft or softer (as a ripened fruit).", "a variety of jack tree.", "its soft fruit."]}], "ತುಳುವಕತ್ತಿ": [{"type": "noun", "defs": ["= ತುಳುಗತ್ತಿ."]}], "ತುಳುವಗಾಯಿ": [{"type": "noun", "defs": ["a kind of dish made of ribbed gourd ( the fruit of Luffa acutangula)."]}], "ತುಳುವಬದನೆಕಾಯಿ": [{"type": "noun", "defs": ["a kind of dish made of brinjal (the fruit of Solanum melongena)."]}], "ತುಳ್ಕಾಡು": [{"type": "verb", "defs": ["= ತುಳುಕಾಡು."]}], "ತುಳ್ಕು": [{"type": "verb", "defs": ["= ತುಳುಕು1."]}], "ತುಳ್ಳಾಡು": [{"type": "verb", "defs": ["to roll oneself on the floor repeatedly.", "to jump up repeatedly (in joy, sport, etc.)."]}], "ತುಳ್ಳು": [{"type": "verb", "defs": ["to roll oneself on the floor.", "to jump up."]}], "ತುಱಿ": [{"type": "noun", "defs": ["the sensation of itching on the skin.", "any of various skin disorders accompanied by severe irritation of the skin, as scabies.", "an itching desire for sexual gratification."]}], "ತುಱಿಕೆ": [{"type": "noun", "defs": ["= ತುಱಿ.", "the plant Girardinia leschenaultiana of Utricaceae family."]}], "ತುಱಿಗ": [{"type": "noun", "defs": ["a man affected with scabies or any other itch-disease."]}], "ತುಱಿಚ": [{"type": "noun", "defs": ["= ತುಱುಚೆ."]}], "ತುಱಿಚೆ": [{"type": "noun", "defs": ["= ತುಱುಚೆ."]}], "ತುಱಿಪ": [{"type": "noun", "defs": ["an itching desire for sexual gratification."]}], "ತುಱಿಪಗಾರ್ತಿ": [{"type": "noun", "defs": ["a woman excessively interested in, desirous of, indulging in, sexual enjoyment."]}], "ತುಱಿಪಗಾಱ": [{"type": "noun", "defs": ["a man excessively interested in, desirous of, indulging in, sexual enjoyment."]}], "ತುಱಿಸು": [{"type": "verb", "defs": ["to scratch the itching part of the body.", "to penetrate into or run through (something), with or as with a sharp, pointed object or instrument."]}], "ತುಱಿಹಿಡಿ": [{"type": "verb", "defs": ["(any itching disease as scabies) to infect (a person)."]}], "ತುಱು": [{"type": "noun", "defs": ["farm animals collectively, as domesticated cows, bulls, etc.; cattle.", "a herd of cattle; ತುಱ್ವನಿಕ್ಕಿಸು tuṛuvanikkisu to fight for getting back the livestock stolen by thieves or a hostile army."]}], "ತುಱುಂಕು": [{"type": "verb", "defs": ["= ತುಱುಕು."]}], "ತುಱುಂಗಲ್": [{"type": "noun", "defs": ["= ತುಱುಗಲು."]}], "ತುಱುಂಗು": [{"type": "verb", "defs": ["= ತುಱುಕು."]}], "ತುಱುಂಬು": [{"type": "verb", "defs": ["= ತುಱುಬು1."]}, {"type": "noun", "defs": ["= ತುಱುಬು2."]}], "ತುಱುಕಾರ್ತಿ": [{"type": "noun", "defs": ["= ತುಱುಗಾರ್ತಿ."]}], "ತುಱುಕಾಱ": [{"type": "noun", "defs": ["= ತುಱುಗಾಱ."]}], "ತುಱುಕು": [{"type": "verb", "defs": ["to fill (a space) with more quantity than the normal capacity (of something) by squeezing, pressing, etc.; to pack full or too full; to cram; to stuff.", "to push, keep something (in a drawer, purse, etc.) in a jumbled manner.", "(contemp.) to stuff with food; to eat or cause to eat in a haphazard manner.", "to come together in large numbers; to crowd; to throng; to swarm.", "to abound in; to be plentiful; to exist in large numbers.", "to collect a large number of things together.", "to confront antagonistically.", "to cover, envelop completely or densely.", "to spread (oneself) extensively over a wide area.", "to set a small piece or pieces (of something) decoratively into a surface; to inlay.", "to catch, incur or contract (a sin, disease, etc.)."]}], "ತುಱುಗಲ್": [{"type": "noun", "defs": ["= ತುಱುಗಲು."]}], "ತುಱುಗಲು": [{"type": "noun", "defs": ["a large number of persons, things, animals, etc. gathered together at a place; a crowd."]}], "ತುಱುಗಾ": [{"type": "verb", "defs": ["= ತುಱುಗಾಯ್."]}], "ತುಱುಗಾಡು": [{"type": "noun", "defs": ["a piece of grass-land meant exclusively for grazing cattle."]}], "ತುಱುಗಾಯ್": [{"type": "verb", "defs": ["to take care of, watch over a herd of cattle; to tend cattle."]}], "ತುಱುಗಾಯಿ": [{"type": "noun", "defs": ["= ತುಱುಗಾಱ."]}], "ತುಱುಗಾರ್ತಿ": [{"type": "noun", "defs": ["she who grazes, tends cattle or who belongs to the cowherd caste."]}], "ತುಱುಗಾಹಿ": [{"type": "noun", "defs": ["= ತುಱುಗಾಱ."]}], "ತುಱುಗಾಱ": [{"type": "noun", "defs": ["he who grazes, tends cattle; a cowherd."]}], "ತುಱುಗು": [{"type": "verb", "defs": ["= ತುಱುಕು."]}, {"type": "noun", "defs": ["= ತುಱುಗಲು."]}], "ತುಱುಗೋಳ್": [{"type": "noun", "defs": ["a driving away of another's livestock, esp. cattle, using force.", "a fight waged for getting back such livestock."]}], "ತುಱುಚ": [{"type": "noun", "defs": ["= ತುಱುಚೆ."]}, {"type": "noun", "defs": ["a man affected with scabies or any other itch-disease."]}], "ತುಱುಚಿ": [{"type": "noun", "defs": ["= ತುಱುಚೆ."]}], "ತುಱುಚೆ": [{"type": "noun", "defs": ["any of various skin disorders accompanied by severe irritation of the skin, as scabies.", "the perennial weed Tragia hispida of Euphorbiaceae family with stinging hairs; nettle.", "another plant of the same family, Tragia involucrata; climbing nettle."]}], "ತುಱುಜೆ": [{"type": "noun", "defs": ["= ತುಱುಚೆ."]}], "ತುಱುನೆಲೆ": [{"type": "noun", "defs": ["= ತುಱುಹಟ್ಟಿ - 1."]}], "ತುಱುಪಟ್ಟಿ": [{"type": "noun", "defs": ["= ತುಱುಹಟ್ಟಿ."]}], "ತುಱುಬು": [{"type": "verb", "defs": ["to wear (flowers) on one's head; to set (flowers) in one's tress.", "to do so on another head or in another's tress; to cause to wear (flowers).", "to come or be together in large numbers at a relatively smaller room or space; to crowd.", "to tie the hairs of the head into a knot."]}, {"type": "noun", "defs": ["a knot of the hair of vÀhe head.", "a large number of persons gathered at a place; a crowd; a multitude."]}], "ತುಱುಮಂದೆ": [{"type": "noun", "defs": ["= ತುಱುಹಟ್ಟಿ - 1.", "a herd of cattle."]}], "ತುಱುಮಿಂಡಿ": [{"type": "noun", "defs": ["a girl who has recently attained menstrual stage.", "a menstruous girl or woman."]}], "ತುಱುವಟ್ಟಿ": [{"type": "noun", "defs": ["= ತುಱುಹಟ್ಟಿ."]}], "ತುಱುವಳ": [{"type": "noun", "defs": ["a man whose occupation is tending and herding of cows; a cowherd.", "a man belonging to the caste members of which are mainly engaged in tending of cows."]}], "ತುಱುವಳ್ತಿ": [{"type": "noun", "defs": ["a woman whose occupation is tending and herding of cows; a cowherd-woman.", "a woman belonging to the caste of cow-herds."]}], "ತುಱುವಳ್ಳಿ": [{"type": "noun", "defs": ["= ತುಱುಹಟ್ಟಿ - 2."]}], "ತುಱುವಾಳ": [{"type": "noun", "defs": ["= ತುಱುವಳ."]}], "ತುಱುವಿಂಡು": [{"type": "noun", "defs": ["a herd of cattle."]}], "ತುಱುವೆ": [{"type": "noun", "defs": ["the plant Azanza lampas (= Thespesia lampas, = Hibiscus lampas) of Malvaceae family.", "the plant Abutilon indicum of Malvaceae family; the country mallow.", "a kind of bird ."]}], "ತುಱುಹಟ್ಟಿ": [{"type": "noun", "defs": ["a building or shed for cattle; a cowshed.", "a village inhabited mainly by cowherds.", "(fig.) (collectively) people living in countryside (as distinguished those in cities and towns)."]}], "ತುೞಿ": [{"type": "verb", "defs": ["to press or beat with the feet so as to crush or injure; to tread; to trample.", "to oppress, subdue or destroy, by or as if by stepping on.", "to annoy; to harm; to molest.", "to press hard or closely; to exert pressure on, esp. from two or more sides; to compress; to squeeze.", "to walk on, in, along, over etc."]}, {"type": "noun", "defs": ["the act or an instance of pressing or beating with the feet to or as to crush; a trampling."]}], "ತುೞಿಕಲ್": [{"type": "noun", "defs": ["ತುೞಿಕಲ."]}], "ತುೞಿಕಲ": [{"type": "noun", "defs": ["that which is walked on, pressed or crushed with the feat trodden; a trampled thing.", "that which has lost freshness or is withered, faded, etc.", "the act or an instance of treading; a trampling."]}], "ತುೞಿಯಿಸು": [{"type": "verb", "defs": ["ತುೞಿಸು."]}], "ತುೞಿಲ್": [{"type": "noun", "defs": ["the act of laying one's body facing downward at the feet or in front of someone or something as a mark of respect or submission.", "the condition of being a slave, serf; subjection to a master; slavery; servitude."]}, {"type": "noun", "defs": ["boldness or determination in facing great danger; heroic courage; bravery."]}], "ತುೞಿಲ": [{"type": "noun", "defs": ["= ತುೞಿಲಾಳ್1."]}, {"type": "noun", "defs": ["= ತುೞಿಲಾಳ್2."]}], "ತುೞಿಲಾಳ್": [{"type": "noun", "defs": ["a man who is bound to work in feudal servitude or the like and who is completely dominated by his master; a servant; a serf."]}, {"type": "noun", "defs": ["a man of great strength and courage; a brave man; a hero."]}], "ತುೞಿಲಾಳ್ತನ": [{"type": "noun", "defs": ["= ತುೞಿಲ್2."]}], "ತುೞಿಲ್ಗೆಯ್": [{"type": "verb", "defs": ["to prostrate throwing one's body at the feet of or in front of another as a mark of reverence or submission."]}], "ತುೞಿಲ್ಗೊಳು": [{"type": "verb", "defs": ["= ತುೞಿಲ್ಗೆಯ್.", "to accept reverence or to be revered."]}], "ತುೞಿಲ್ಸಲ್": [{"type": "verb", "defs": ["to become a servant, slave."]}, {"type": "verb", "defs": ["to become widely known for one's valour."]}], "ತುೞಿವು": [{"type": "noun", "defs": ["= ತುೞಿ2."]}], "ತುೞಿಸು": [{"type": "verb", "defs": ["to cause to walk on, press or beat (something) with the feet.", "to mix (different things) together; to blend.", "to injure beyond repair or renewal; to demolish; to ruin; to destroy."]}], "ತುೞಿಹ": [{"type": "noun", "defs": ["= ತುೞಿ2.", "the act of squeezing (a fruit etc.) as to extract juice."]}], "ತುೞುವ": [{"type": "noun", "defs": ["the region consisting of coastal districts of Western Karnāṭaka.", "a Dravidian language spoken chiefly in the western Districts of Karnāṭaka in southern India.", "a man belonging to this region or whose mother-tongue is Tuḷu."]}], "ತುೞ್ದಿಲ್": [{"type": "noun", "defs": ["a kind of tree (Albizzia amara of Mimosae family ?)."]}], "ತೂ": [{"type": "noun", "defs": ["the sound made while spitting saliva.", "a sound imitating it expressing one's disgust, anger, scorn or contempt, etc.", "ತೂ ಅನ್ನು tū annu to regard with scorn; to treat contemptuously; to condemn; ತೂ ಛೀ ಅನ್ನು tū chī annu = ತೂ ಅನ್ನು; ತೂ ಮಾಡು tū māḍu (children's term) to throw out what is being chewed; to spit."]}], "ತೂಂಕಂಗೊಳ್": [{"type": "verb", "defs": ["to fall into a faint; to faint away."]}], "ತೂಂಕಡ": [{"type": "noun", "defs": ["= ತೂಕಡು."]}], "ತೂಂಕಡಂಗಾಣ್": [{"type": "verb", "defs": ["= ತೂಕಡಿಸು."]}], "ತೂಂಕಡಿಕೆ": [{"type": "noun", "defs": ["= ತೂಕಡಿಕೆ."]}], "ತೂಂಕಡಿಕೆಗಣ್": [{"type": "noun", "defs": ["the sleepy or half asleep eyes."]}], "ತೂಂಕಡಿಸು": [{"type": "verb", "defs": ["= ತೂಕಡಿಸು."]}], "ತೂಂಕಡು": [{"type": "noun", "defs": ["= ತೂಕಡು."]}], "ತೂಂಕಡುಗೆಡು": [{"type": "verb", "defs": ["to come out of drowsiness or sleep."]}], "ತೂಂಕು": [{"type": "verb", "defs": ["= ತೂಗು1."]}, {"type": "noun", "defs": ["= ತೂಗು2."]}], "ತೂಂತಿಡು": [{"type": "verb", "defs": ["to fill (something) by force with more than it can easily hold; to cram.", "to flow or spread beyond the limits."]}, {"type": "verb", "defs": ["to make a hole by or as by drilling; to bore a hole."]}], "ತೂಂತಿಱಿ": [{"type": "verb", "defs": ["to push out a liquid in drops continuously and forcefully.", "to blow air in puffs from the mouth."]}], "ತೂಂತು": [{"type": "verb", "defs": ["to fill (a space) beyond normal capacity by pressing or squeezing; to cram."]}, {"type": "noun", "defs": ["a hollow place in a solid body or mass; a narrow excavation made in the ground; a cavity; a hole."]}, {"type": "noun", "defs": ["the act of emitting or discharging forcefully (a liquid in continuous drops).", "the act or an instance of blowing air in puffs from the mouth."]}], "ತೂಂತುಗೊಱೆ": [{"type": "verb", "defs": ["to make a hole by or as by drilling; to bore a hole."]}], "ತೂಂತುವೋಗು": [{"type": "verb", "defs": ["to become hollowed; to be bored as to have a hole."]}], "ತೂಂಬು": [{"type": "noun", "defs": ["a hollow or hollowed-out place; cavity; a hole.", "a long tube for conveying water, gas, oil, etc.; a pipe.", "an artificial channel or passage for water, having a gate or valve to regulate the flow; a sluice.", "a unit of land measure (?).", "the centre part of a wheel, etc.; the part fastened to the axle or turning on it; the hub.", "the part (as a hole) of a tool which the handle passes through and which holds it.", "the tube of an ear-ornament."]}], "ತೂಂಬುರ್ಚು": [{"type": "verb", "defs": ["to open the gate or valve of a sluice to let the water out from a reservoir, tank, etc."]}], "ತೂಕ": [{"type": "noun", "defs": ["the amount or quantity of heaviness or mass; amount a thing weighs; weight.", "(phys.) the force that gravitation exerts upon a body, equal to the mass of the body times the local acceleration of gravity; weight.", "the act of weighing a thing (usu. using a balance).", "any of the units of heaviness or mass; weight.", "a particular unit of weight of earlier times.", "that much quantity or weight (as water) a person can carry in both the hands.", "mental balance or emotional stability.", "an equal or common status, ability, eminence, etc.", "solemnity or sedateness of manner or character; earnestness; gravity.", "(obs.) a kind of tax.", "the act of moving back to forth or from side to side; oscillation.", "ತೂಕ ತಪ್ಪು tūka tappu to lose one's mental balance or to go wrong in judgement (as from arrogance, emotional imbalance, etc.); ತೂಕದ ಗುಂಡು tūkada guṇḍu a heavy metal ball, with a pointed projection at the bottom, hung with the help of a thread, used by masons to check the perpendicularity of structures being built; ತೂಕದ ಮನುಷ್ಯ tūkada manuṣya a man of balanced mind having solemn, sedate character; he whose words carry respect; ತೂಕದ ಮಾತು tūkada mātu an opinion of a person having balanced mind and sedate character; ತೂಕ ಮಾಡು tūka māḍu to find the mass or weight of a thing (using a balance); 2. to judge the quality or worth of; to appraise; 3. (fig.) to sleep lightly; to doze; to drowse; ಒಂದು ತೂಕ ಏರು ondu tūka ēru to assume (sometimes, undue) importance; ಒಂದು ತೂಕ ಹೆಚ್ಚು ondu tūka heccu (comparatively) excelling another in quality, importance, etc."]}], "ತೂಕಗುಂದು": [{"type": "verb", "defs": ["to lose one's calmness, composedness or sedateness in giving one's judgement or opinion; to become mentally imbalanced."]}], "ತೂಕಡಿಕೆ": [{"type": "noun", "defs": ["the state of being half-asleep or sleepy; drowsiness."]}], "ತೂಕಡಿಸು": [{"type": "verb", "defs": ["to be sleepy or half-asleep; to drowse.", "to be in the state of sleep; to sleep; to slumber.", "(fig.) to become slow in being implemented, carried out, etc.; to have or show no progress."]}], "ತೂಕಡು": [{"type": "noun", "defs": ["= ತೂಕಡಿಕೆ.", "sleep - a) a natural, regularly recurring condition of rest for the body and mind, during which the eyes are usu. closed and there is little or no conscious thought or voluntary movement, but there is intermittent dreaming; b) a spell of sleeping."]}], "ತೂಕರಿಸು": [{"type": "verb", "defs": ["to blow air in puffs gently over another's head (usu. chanting a hymn or hymns to drive away the supposed evil effects of a bad look).", "to regard with contempt; to treat contemptuously; to look down."]}], "ತೂಕು": [{"type": "verb", "defs": ["= ತೂಗು1."]}, {"type": "noun", "defs": ["= ತೂಗು2."]}], "ತೂಗಡಿಕೆ": [{"type": "noun", "defs": ["= ತೂಕಡಿಕೆ."]}], "ತೂಗಾಟ": [{"type": "noun", "defs": ["a series of regular or irregular movement from back to forth or from side to side.", "the condition of the mind that is not conducive for judging and taking a decision; inability to take firm decision."]}], "ತೂಗಾಡಿಸು": [{"type": "verb", "defs": ["to cause to oscillate or swing.", "to cause to bend (as by pressing or applying pressure)."]}], "ತೂಗಾಡು": [{"type": "verb", "defs": ["to hang loosely; to walk or move unsteadily; to waddle.", "to cause to move unsteadily.", "to sleep lightly; to drowse; to doze.", "to be unable to take a decision; to be indecisive.", "(fig.) to make merry; to be lively and cheerful."]}], "ತೂಗಿಸು": [{"type": "verb", "defs": ["to cause to weigh (something).", "to cause to nod the head in appreciation or acceptance.", "to hang something from above, as to allow the free end to oscillate.", "to move or sway a cradle back and forth or from side to side (usu. in a gentle manner).", "to manage or bring about by contriving; to succeed in accomplish.", "ತೂಗಿಸಿಕೊಂಡು ಹೋಗು tūgisi koṇḍu hōgu to bring about or succeed in accomplishing, despite difficulty or hardship."]}], "ತೂಗು": [{"type": "verb", "defs": ["to determine the weight of an object using a balance; to weigh.", "to cause to move from back to forth or from side to side.", "to be hanging loosely with a swaying action.", "to walk with short steps or move, swaying or rocking from side to side; to waddle.", "to counterbalance; to counterpoise; to counter weigh.", "to consider (another) as equal or at par.", "to let or cause (something) to, hang loosely.", "to move or sway (a cradle, swing, etc.) to and fro or from side to side, esp. gently and soothingly.", "to move oneself to and from or from side to side as in a cradle or swing.", "to pull (something) with a jerking force.", "to throw or shoot at.", "to compare two things as to ascertain the identity, likeness or differences between them.", "to examine; to test; to evaluate; to appraise.", "to be possible.", "to be reached; to come into another's reach.", "to equal or to be at par.", "to cause to float on the surface of a liquid."]}, {"type": "noun", "defs": ["the act or an instance of oscillating.", "fluctuation; instability; variation.", "heaviness as a quality of things; weight."]}, {"type": "adjective", "defs": ["swinging or moving regularly back and forth or from side to side; oscillating."]}], "ತೂಗುಕುದುರೆ": [{"type": "noun", "defs": ["a wooden toy-horse with a semi-circular convex bottom that rocks back and forth."]}], "ತೂಗುಕೋಲು": [{"type": "noun", "defs": ["an erstwhile balance with a single pan on the tapered end of the beam hung or held with string moveable, used to weigh esp. butter."]}], "ತೂಗುಗುಂಡು": [{"type": "noun", "defs": ["a swinging lever, weighted at the lower end, for regulating the speed of a clock mechanism; a pendulum.", "a heavy metal ball, with a pointed projection at the bottom, hung with the help of a thread, used by masons to check the perpendicularity of structures being built."]}], "ತೂಗುತೊಟ್ಟಿಲು": [{"type": "noun", "defs": ["a cradle hung from above."]}], "ತೂಗುತೊಲೆ": [{"type": "noun", "defs": ["a heavy beam that could be swung and thrown on the rival army, used in warfare.", "a long piece of wood hung horizontally."]}], "ತೂಗುದೀಪ": [{"type": "noun", "defs": ["a lamp, esp. a votive lamp, hung from a fixed point above, that can move freely move back and forth or from side to side."]}], "ತೂಗುದೊಲೆ": [{"type": "noun", "defs": ["= ತೂಗುತೊಲೆ."]}], "ತೂಗುನೀರು": [{"type": "noun", "defs": ["the quantity of water in two containers that can be carried with both the hands at a time (as usu. done by gardeners)."]}], "ತೂಗುಬಿಡು": [{"type": "verb", "defs": ["to fasten or attach (a thing) so that it is supported only from above or at a point near its own top; to suspend."]}], "ತೂಗುಮಂಚ": [{"type": "noun", "defs": ["a piece of furniture consisting of a wooden plank, with a bed spread on, with facility at all the four corners to tie rope or chain and be hung from above, so that it can oscillate freely back and forth."]}], "ತೂಗುಮಣಿ": [{"type": "noun", "defs": ["an ornament with a hanging pearl, bead, etc., as one suspended from an earring; a pendant."]}], "ತೂಗುಮಣೆ": [{"type": "noun", "defs": ["a seat suspended from above by means of a loop of rope or between ropes or rods, on which one may sit and swing to and fro for recreation or relaxation; a swing."]}], "ತೂಗುಮರ": [{"type": "noun", "defs": ["= ತೂಗುತೊಲೆ.", "a wooden frame, consisting of a crossbeam on two uprights, on which condemned persons are executed by hanging; gallows."]}], "ತೂಗುಯ್ಯಲೆ": [{"type": "noun", "defs": ["= ತೂಗುಮಣೆ."]}], "ತೂಗುಯ್ಯಾಲೆ": [{"type": "noun", "defs": ["= ತೂಗುಮಣೆ."]}], "ತೂಗುವಣೆ": [{"type": "noun", "defs": ["= ತೂಗುಮಣೆ."]}], "ತೂಗುವರ": [{"type": "noun", "defs": ["= ತೂಗುಮರ."]}], "ತೂಗುವೊಡಲು": [{"type": "noun", "defs": ["the body of a person who is infirm or weak physically, as from old age."]}], "ತೂಗುಸೇತುವೆ": [{"type": "noun", "defs": ["a bridge suspended from chains or cables which are anchored at either end and supported by towers at regular intervals and having no support from below at all; a suspension bridge."]}], "ತೂಗುಹಲಗೆ": [{"type": "noun", "defs": ["a piece of wooden or metal plank on which name with or without address is written and hung (outside a building)."]}], "ತೂಗೋಲೆ": [{"type": "noun", "defs": ["an earring with a hanging object."]}], "ತೂಟಿಸು": [{"type": "verb", "defs": ["to destroy; to demolish; to ruin."]}], "ತೂಟೆದಾರ": [{"type": "noun", "defs": ["a kind of mock fight performed during procession of a temple deity, holding or throwing burning torches made of palm leaves."]}], "ತೂಣ": [{"type": "noun", "defs": ["the state of the mind influenced by higher degree of joy, delight, happiness, etc., usu. beyond the control of one's will.", "the state of being possessed by supposed supernatural powers; a particular kind of crazy state of the mind.", "a desire that cannot be suppressible.", "intense enthusiasm; ardent endeavour; zeal."]}, {"type": "noun", "defs": ["a strong piece of timber set upright in to the ground."]}, {"type": "noun", "defs": ["= ತೂಣೀರ."]}, {"type": "noun", "defs": ["Yama, the God of Death who awards punishment to dead commensurable with their sinful actions."]}], "ತೂಣಗೊಳ್ಳು": [{"type": "verb", "defs": ["to have one's feelings or passions aroused; to become excited."]}], "ತೂಣಮನ": [{"type": "noun", "defs": ["the determined, firm mind."]}], "ತೂಣಿ": [{"type": "noun", "defs": ["= ತೂಣೀರ."]}], "ತೂಣೀರ": [{"type": "noun", "defs": ["a case for holding or carrying arrows; a quiver."]}], "ತೂತ": [{"type": "noun", "defs": ["empty; worthless; valueless; hollow."]}, {"type": "noun", "defs": ["a worthless man."]}], "ತೂತಪ್ಪಚ್ಚಿ": [{"type": "noun", "defs": ["any kind of cake that has a hole at the centre.", "the external genital organs of the female; vulva."]}], "ತೂತಿಡು": [{"type": "verb", "defs": ["to fill (something) by force with more than it can easily hold; to cram.", "to flow or spread beyond the limits."]}], "ತೂತು": [{"type": "noun", "defs": ["a hollow place in a solid body or mass; a narrow excavation made in the ground; a cavity; a hole."]}, {"type": "noun", "defs": ["a kind of fish ."]}], "ತೂತುಕೈ": [{"type": "noun", "defs": ["a person who spends all his earnings without foresight.", "the disposition or habit of such a person."]}], "ತೂತುಕೊರೆ": [{"type": "verb", "defs": ["to make a hole by or as by drilling; to bore a hole."]}], "ತೂತುಬಾಯ್": [{"type": "noun", "defs": ["= ತೂತುಬಾಯಿ."]}], "ತೂತುಬಾಯಿ": [{"type": "noun", "defs": ["the inability of a person to keep secrets.", "such a person."]}], "ತೂತುವೋಗು": [{"type": "verb", "defs": ["to become hollowed; to be bored as to have a hole."]}], "ತೂತೇಳು": [{"type": "verb", "defs": ["(a hole) to be bored."]}], "ತೂತ್ಕಾರ": [{"type": "noun", "defs": ["a peculiar sound made while blowing wind-instrument (by giving stress on the air blown)."]}], "ತೂದ": [{"type": "noun", "defs": ["the tree Thespesia populnea (= Hibiscus populnea) of Malvaceae family; umbrella tree.", "the tree Areca catechu of Arecaceae family; areca nut tree."]}], "ತೂನ್": [{"type": "verb", "defs": ["= ತೂನು."]}], "ತೂನ": [{"type": "noun", "defs": ["= ತೂಣ2."]}], "ತೂನಗೆಣಸು": [{"type": "noun", "defs": ["the yam plant Dioscorea alata of Dioscoreaceae family.", "its yam; white yam; great yam."]}], "ತೂನಿಹುಳ": [{"type": "noun", "defs": ["a kind of insect ."]}], "ತೂನು": [{"type": "verb", "defs": ["to pull with a jerking force.", "to extract or draw out money, valuables, property, etc. usu. using force."]}], "ತೂಪರ": [{"type": "noun", "defs": ["= ತೂಪುರ."]}], "ತೂಪರು": [{"type": "noun", "defs": ["a fine rain; drizzle."]}], "ತೂಪರೆ": [{"type": "noun", "defs": ["= ತೂಪರು."]}, {"type": "noun", "defs": ["= ತೂಪುರ."]}], "ತೂಪಿಡು": [{"type": "verb", "defs": ["= ತೂಪಿರಿ - 1 & 2."]}], "ತೂಪಿರಿ": [{"type": "verb", "defs": ["to blow air in puffs from the mouth.", "to blow air in puffs gently over another's head (usu. chanting a hymn or hymns to drive away the supposed evil effects of bad look).", "to throw as to scatter around.", "to come out; to be discharged or emitted.", "to spit the saliva out from the mouth.", "to lessen or alleviate one's anger.", "(fig.) to make a sound (a blow-pipe)."]}], "ತೂಪಿಱಿ": [{"type": "verb", "defs": ["= ತೂಪಿರಿ."]}], "ತೂಪು": [{"type": "noun", "defs": ["= ತೂಬು."]}], "ತೂಪುರ": [{"type": "noun", "defs": ["the tree Diospyros peregrina (= D. embryopteris, = D. glutenifera) of Ebenaceae family; Indian persimmon.", "another tree of the same family Diospyros melanoxylon (= D. tupru)."]}], "ತೂಪ್ರ": [{"type": "noun", "defs": ["= ತೂಪುರ."]}], "ತೂಫಾನು": [{"type": "noun", "defs": ["a violent storm with high winds; tornado; hurricane.", "(fig.) a violent outburst; tumult."]}], "ತೂಬರ": [{"type": "noun", "defs": ["= ತೂಪುರ."]}, {"type": "noun", "defs": ["a man in whom beard is not grown on the cheeks and chin; a beardless man.", "any man or boy lacking normal function of the testes, as through castration or disease; an eunuch.", "a brute without horns."]}], "ತೂಬರಕ": [{"type": "noun", "defs": ["= ತೂಬರ2 - 2."]}], "ತೂಬರೆ": [{"type": "noun", "defs": ["= ತೂಪುರ."]}], "ತೂಬು": [{"type": "noun", "defs": ["a hollow or hollowed-out place; cavity; a hole.", "a long tube for conveying water, gas, oil, etc.; a pipe.", "an artificial channel or passage for water, having a gate or valve to regulate the flow; a sluice.", "a unit of land measure (?).", "the centre part of a wheel, etc.; the part fastened to the axle or turning on it; the hub.", "the part (as a hole) of a tool which the handle passes through and which holds it.", "the tube of an ear-ornament."]}], "ತೂಯ್": [{"type": "verb", "defs": ["to draw or haul toward oneself or itself, in a particular direction or into a particular position; to draw or tug at with force.", "to tend to react easily, readily and favourably or sympathetically to."]}], "ತೂರಣಿಗೆ": [{"type": "noun", "defs": ["a device for winnowing grain."]}], "ತೂರಲ್": [{"type": "noun", "defs": ["a being spread over a wide area.", "the front or top end of anything."]}], "ತೂರಲು": [{"type": "noun", "defs": ["a fine rain; drizzle."]}], "ತೂರಾಡು": [{"type": "verb", "defs": ["to move unsteadily from side to side, as in walking or while standing; to wobble or totter.", "to release or discharge from within."]}], "ತೂರಾಯ": [{"type": "noun", "defs": ["= ತೂರಾಯಿ."]}], "ತೂರಾಯಿ": [{"type": "noun", "defs": ["an ornament made of feathers or of a feathery tuft of hair, worn on a turban, crown, hat, helmet, etc.; a plume.", "a kind of poetical conversation, in the form of a song, sung by a group of persons hailing the excellence of men over women (as a sport) [the counterpart of this, hailing the excellence of women, is ಕಲ್ಕಿ].", "a group of persons singing this song.", "a bunch of cut flowers, arranged as to have convex top.", "any of the flowers, vegetable, etc. that has a tuft-like head or projection.", "a comb, crest or feathered tuft on certain birds."]}], "ತೂರಿಸು": [{"type": "verb", "defs": ["to cause to blow the chaff from (grain) by wind.", "to push with force.", "to throw or discharge with force."]}, {"type": "verb", "defs": ["to put or fit (something) into something else; to introduce; to insert."]}], "ತೂರು": [{"type": "verb", "defs": ["to free (grain) from the lighter particles of chaff, dirt, etc., esp. by throwing it into the air and allowing the wind or a forced current of air to blow away impurities; to winnow.", "to throw (something) as to scatter around.", "to pay no attention to; to treat without due respect; to disregard.", "to drive (a group of persons, animals, etc.) out in different directions.", "to come out with a sudden rush or with force.", "to avoid (an evil) happening or occurring; to prevent.", "to move back and forth or from side to side frequently.", "to discharge; to emit.", "to push forward or away.", "to run away (from a place).", "to blow up or move with or as with an explosive; to explode; to blast.", "to spend (money) wastefully or extravagantly.", "(dial.) to pass stools in loose form and frequently.", "ತೂರಿ ಬಿಡು tūri biḍu to give up (ideals); to flout or transgress (regulations, etc.)."]}, {"type": "verb", "defs": ["to enter or be inserted, into (something); to be in between (esp. in a narrow space).", "to pass through; ತೂರಿಕೊಳ್ಳು tūrikoḷḷu to get into; to pass into (a narrow space); ತೂರಿ ಬರು tūri baru to come passing through; ಒಬ್ಬ ಚಾಪೆ ಕೆಳಗೆ ತೂರಿದರೆ, ಇನ್ನೊಬ್ಬ ರಂಗೋಲೆಯ ಕೆಳಗೆ ತೂರಿದ obba cāpe keḷage tūridare, innobba rangōleya keḷage tūrida (prov.) if one proved to be intelligent, another excelled him in smartness."]}], "ತೂರುಗಂಡಿ": [{"type": "noun", "defs": ["a narrow passage (as in a fence, fort) for a person to pass through."]}], "ತೂರುಗಾಳಿ": [{"type": "noun", "defs": ["a violent storm with high winds; hurricane."]}], "ತೂರ್ಣ": [{"type": "adjective", "defs": ["brisk; speedy; quick."]}, {"type": "noun", "defs": ["quickness; swiftness; smartness.", "a very active, smart man."]}], "ತೂರ್ಯ": [{"type": "noun", "defs": ["the one following the third or three others in a series; the fourth.", "(astrol.) the fourth house from the birth-house in one's horoscope.", "the Supreme Spirit.", "the fourth state of the soul in which it becomes one with the Supreme Spirit."]}, {"type": "noun", "defs": ["a kind of wind instrument.", "any musical instrument in general."]}], "ತೂರ್ಯಸ್ಥಿತಿ": [{"type": "noun", "defs": ["= ತೂರ್ಯ1 - 4."]}], "ತೂಲ": [{"type": "noun", "defs": ["a soft, white, downy substance consisting of the hairs or fibres attached to the seeds of plants belonging to the genus Gossypium, of Malvaceae family, used in making fabrics, thread, etc.; cotton.", "the soft under plumage of birds as distinct from the contour feathers; down.", "the tree Thespesia populnea (= Hibiscus populnea) of Malvaceae family; umbrella tree."]}], "ತೂಲಕ": [{"type": "noun", "defs": ["= ತೂಲ - 1."]}], "ತೂಲತಲ್ಪ": [{"type": "noun", "defs": ["a bed made by filling with cotton or downs of birds."]}], "ತೂಲತಳ್ಪ": [{"type": "noun", "defs": ["= ತೂಲತಲ್ಪ."]}], "ತೂಲಿ": [{"type": "noun", "defs": ["= ತೂಲ - 1."]}, {"type": "noun", "defs": ["= ತೂಲತಲ್ಪ."]}], "ತೂಲಿಕಾತಲ್ಪ": [{"type": "noun", "defs": ["= ತೂಲತಲ್ಪ."]}], "ತೂಲಿಕೆ": [{"type": "noun", "defs": ["an implement consisting of bristles, hair or the like, set in or attached to a handle, used for painting; a painteṛs brush.", "a stick attached with a brush at one end, used by weavers.", "a container made of a substance that can resist great heat, for melting, fusing metals, as gold, silver etc.; a crucible.", "a rod used by goldsmiths for turning the fire up.", "a piece of cord or tape or a thin bundle of threads, in an oil lamp that absorbs fuel by capillary attraction and, when lighted burns with a small, steady flame; a wick.", "a bed made by filling with cotton or downs of birds.", "cotton or downs used for this purpose."]}], "ತೂವರ": [{"type": "noun", "defs": ["= ತೂಬರ2."]}], "ತೂಷ್ಣಿ": [{"type": "noun", "defs": ["a refraining from speech; the state of being or fact of keeping silent; silence.", "(dial.) an abridging of a passage, statement ; a being so abridged; abridgement; an epitome."]}], "ತೂಷ್ಣಿಭಾವ": [{"type": "noun", "defs": ["= ತೂಷ್ಣಿ - 1."]}], "ತೂಷ್ಣೀಂಭಾವ": [{"type": "noun", "defs": ["= ತೂಷ್ಣಿ - 1."]}], "ತೂಷ್ಣೀಂಭೂತ": [{"type": "adjective", "defs": ["keeping silence; refraining from speech; silent."]}], "ತೂಷ್ಣೀಂಶೀಲ": [{"type": "noun", "defs": ["= ತೂಷ್ಣೀಕ."]}], "ತೂಷ್ಣೀಕ": [{"type": "noun", "defs": ["he who does not talk much or who prefers to be silent.", "(Jain.) a class of deities."]}], "ತೂಷ್ಣೀಕರಿಸು": [{"type": "verb", "defs": ["to make another become silent; to cause to refrain from speaking.", "to keep quiet; to refrain from speaking."]}], "ತೂಷ್ಣೀಭಾವ": [{"type": "noun", "defs": ["= ತೂಷ್ಣಿ 1."]}], "ತೂಳ್": [{"type": "verb", "defs": ["= ತೂಳು1."]}], "ತೂಳ": [{"type": "noun", "defs": ["the state of the mind influenced by higher degree of joy, delight, happiness, etc., usu. beyond the control of one's will.", "the state of being possessed by supposed supernatural powers; a particular kind of crazy state of the mind.", "a desire that cannot be suppressed.", "intense enthusiasm; ardent endeavour; zeal."]}, {"type": "noun", "defs": ["the quality or fact of being stout, thick; stoutness; thickness; fat."]}, {"type": "noun", "defs": ["= ತೂಲ."]}], "ತೂಳಕ": [{"type": "noun", "defs": ["= ತೂಲ - 1."]}], "ತೂಳಗ": [{"type": "noun", "defs": ["= ತೂಳ1 - 1 & 2.", "a pretense of having a virtuous character, moral or religious beliefs or principles, etc., that one does not really possess; hypocrisy.", "a man who is spurred or moved by a strong feeling, madness, etc."]}], "ತೂಳತಲ್ಪ": [{"type": "noun", "defs": ["= ತೂಲತಲ್ಪ."]}], "ತೂಳವೇಳಿಸು": [{"type": "verb", "defs": ["to cause to be deeply interested, involved or absorbed in."]}], "ತೂಳವೇಳು": [{"type": "verb", "defs": ["to be absorbed in; to be wholly occupied in."]}], "ತೂಳಿಕೆ": [{"type": "noun", "defs": ["a blow; a stroke."]}, {"type": "noun", "defs": ["= ತೂಲಿಕೆ."]}], "ತೂಳಿಗ": [{"type": "noun", "defs": ["= ತೂಳಗ."]}]}