{"ಬ್ರಹ್ಮಮಾರ್ಗ": [{"type": "noun", "defs": ["the path for attaining the Supreme Knowledge (as per the philosopy of upanishads)."]}], "ಬ್ರಹ್ಮಮೀಮಾಂಸೆ": [{"type": "noun", "defs": ["Brahma sūtra, investigation into Brahma or the spiritual doctrine o the veda."]}], "ಬ್ರಹ್ಮಯಜ್ಞ": [{"type": "noun", "defs": ["recitation of portions of the veda and sacred books.", "a teaching of vedas."]}], "ಬ್ರಹ್ಮಯೋಗ": [{"type": "noun", "defs": ["employment of devotion; cultivation of spiritual knowledge.", "(astrol.) one of the twenty seven conjugation of astrological planets."]}], "ಬ್ರಹ್ಮರಂಧ್ರ": [{"type": "noun", "defs": ["a suture or aperture in the crown of the head, through which the soul is said to escape on death.", "the crown of the head."]}], "ಬ್ರಹ್ಮರಾಕ್ಷಸ": [{"type": "noun", "defs": ["the ghost of a brāhmaṇa, who lived a greedy and lewd life."]}], "ಬ್ರಹ್ಮರ್ಷಿ": [{"type": "noun", "defs": ["a sage possessing sacred knowledge (as taught by the upanishads), knowing and realising the Supreme Spirit."]}], "ಬ್ರಹ್ಮರ್ಷಿತ್ವ": [{"type": "noun", "defs": ["the state of a sage who possesses sacred knowledge (as taught by the upanishads) or has realised the Supreme Spirit; the fact of being so."]}], "ಬ್ರಹ್ಮಲಿಖಿತ": [{"type": "noun", "defs": ["a pre-determined course of events or something inevitable to which a person or thing is destined; destiny; fate."]}], "ಬ್ರಹ್ಮಲಿಪಿ": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮಲಿಖಿತ.", "(fig.) a bad, undecipherable hand-writing; cocography."]}], "ಬ್ರಹ್ಮಲೋಕ": [{"type": "noun", "defs": ["the world or heaven of Brahma; the supposed residence of pious spirits.", "(jain.) one of the sixteen heavens."]}], "ಬ್ರಹ್ಮವಂತ": [{"type": "noun", "defs": ["a man possessing sacred knowledge.", "a man well-versed in vedas."]}], "ಬ್ರಹ್ಮವರ್ಚಸ": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮತೇಜಸ್ಸು."]}], "ಬ್ರಹ್ಮವರ್ಚಸ್ಸು": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮತೇಜಸ್ಸು."]}], "ಬ್ರಹ್ಮವರ್ಷ": [{"type": "noun", "defs": ["the mythological year or a year of Brahma (equal to 4,32,00,00,000 human years)."]}], "ಬ್ರಹ್ಮವಾದಿ": [{"type": "noun", "defs": ["(masc.) one who asserts that all things are to be identified with Brahma."]}], "ಬ್ರಹ್ಮವಾದಿನಿ": [{"type": "noun", "defs": ["(fem.) one who asserts that all things are to be identified with Brahma."]}], "ಬ್ರಹ್ಮವಿತ್ತು": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮಜ್ಞ - 1."]}], "ಬ್ರಹ್ಮವಿದ": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮಜ್ಞ - 1."]}], "ಬ್ರಹ್ಮವಿದ್ಯೆ": [{"type": "noun", "defs": ["knowledge of Brahma; knowledge of 'the one self-existent Being'; the sacred and supreme knowledge.", "(fig. often sarc.) any branch of knowledge that is very difficult to understand; that which is unintelligible."]}], "ಬ್ರಹ್ಮವೀಣೆ": [{"type": "noun", "defs": ["a particular stringed instrument."]}], "ಬ್ರಹ್ಮವೃಕ್ಷ": [{"type": "noun", "defs": ["the tree Areca catechu of Arecaceae family; betel nut tree.", "the mulberry tree (Morus alba or Morus indica) of Moraceae tree.", "the tree Ficus religiosa of Moraceae family; the peepul tree.", "the tree Butea frondosa of Papilionaceae famiy; the flame of the forest."]}], "ಬ್ರಹ್ಮವೇತ್ತ": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮಜ್ಞ - 1."]}], "ಬ್ರಹ್ಮವೈವರ್ತ": [{"type": "noun", "defs": ["one of the most modern of the 18 Purāṇas, consisting prayers and invocations addressed to Křṣṇa)."]}], "ಬ್ರಹ್ಮವೈವರ್ತಕ": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮವೈವರ್ತ."]}], "ಬ್ರಹ್ಮವ್ರತ": [{"type": "noun", "defs": ["a vow of chastity."]}], "ಬ್ರಹ್ಮಶಿರ": [{"type": "noun", "defs": ["a particular mystical weapon."]}], "ಬ್ರಹ್ಮಶೌಚ": [{"type": "noun", "defs": ["(fig.) an instance of evacuation of bowels that takes unduly longer time."]}], "ಬ್ರಹ್ಮಸಂಕಲ್ಪ": [{"type": "noun", "defs": ["the seemingly inevitable, predetermined succession of events, supposed to have been ordained by Brahma."]}], "ಬ್ರಹ್ಮಸಭೆ": [{"type": "noun", "defs": ["the court of Brahma.", "a multitude of brāhmaṇas.", "a gathering of those who asserts that all things are to be identified with Brahma."]}], "ಬ್ರಹ್ಮಸಮಾಜ": [{"type": "noun", "defs": ["a Hindu movement advocating a monotheistic religion based on the Upanishads, and social and educational reforms according to Western principles; Brahma Samāja."]}], "ಬ್ರಹ್ಮಸಾಕ್ಷಾತ್ಕಾರ": [{"type": "noun", "defs": ["perfect identification or intimate union with Brahma."]}], "ಬ್ರಹ್ಮಸಾಯುಜ್ಯ": [{"type": "noun", "defs": ["intimate union with or identification with Brahma."]}], "ಬ್ರಹ್ಮಸಾವರ್ಣಿ": [{"type": "noun", "defs": ["name of the tenth manu, the progenitors of human race."]}], "ಬ್ರಹ್ಮಸೂತ್ರ": [{"type": "noun", "defs": ["the sacred thread worn by brāhmaṇas over their left shoulder and under the right arm; a sacrificial thread.", "the aphorisms of the Vedanta philosophy ascribed to the sage Vyāsa."]}], "ಬ್ರಹ್ಮಸೃಷ್ಟಿ": [{"type": "noun", "defs": ["that which is created by Brahma (as opp. to Viśvāmitra sřṣṭi)."]}], "ಬ್ರಹ್ಮಸ್ಥಾನ": [{"type": "noun", "defs": ["Brahma's place.", "(arch.) the point in adytum (the innermost or central room in a temple) where the idol of the main deity is installed."]}], "ಬ್ರಹ್ಮಸ್ವ": [{"type": "noun", "defs": ["the property belonging to a brāhmaṇa."]}], "ಬ್ರಹ್ಮಸ್ವರೂಪ": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮಸಾಯುಜ್ಯ."]}], "ಬ್ರಹ್ಮಹತಿ": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮಹತ್ಯೆ."]}], "ಬ್ರಹ್ಮಹತ್ಯ": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮಹತ್ಯೆ."]}], "ಬ್ರಹ್ಮಹತ್ಯೆ": [{"type": "noun", "defs": ["a killing of a brāhmaṇa, considered as one of the five most heinous sins.", "the consequence of that sin."]}], "ಬ್ರಹ್ಮಹರಣ": [{"type": "noun", "defs": ["a taking away of the belongings of a brāhmaṇa, in an illegal or unethical manner."]}], "ಬ್ರಹ್ಮಾಂಜಲಿ": [{"type": "noun", "defs": ["joining the hollowed hands while repeating the Veda."]}], "ಬ್ರಹ್ಮಾಂಡ": [{"type": "adjective", "defs": ["very much exceeding the usual size, number or degree; of great size; huge; vast; immense; enormous."]}, {"type": "noun", "defs": ["the totality of all the things that exist; creation; the cosmos.", "name of one of the eighteen main Purāṇas, revealed by Brahma.", "(Dvaita phil.) one of the twenty elements."]}], "ಬ್ರಹ್ಮಾಂಡಪುರಾಣ": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮಾಂಡ2 - 2."]}], "ಬ್ರಹ್ಮಾಂಭ": [{"type": "noun", "defs": ["the urine of a cow."]}], "ಬ್ರಹ್ಮಾಣಿ": [{"type": "noun", "defs": ["Sarasvati, the wife of Brahma and the Goddess of speech."]}], "ಬ್ರಹ್ಮಾತಿ": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮಹತ್ಯೆ."]}], "ಬ್ರಹ್ಮಾದಾಯ": [{"type": "noun", "defs": ["a piece of land given to a brāhmaṇa as a free gift."]}], "ಬ್ರಹ್ಮಾದೇಯ": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮಾದಾಯ."]}], "ಬ್ರಹ್ಮಾನಂದ": [{"type": "noun", "defs": ["the rapture of absorption into the one self-existent Spirit.", "the state of being in deep sleep; complete unconsciousness.", "(fig.) a feeling of overpowering joy; great delight; ecstasy; rapture."]}], "ಬ್ರಹ್ಮಾನುಸಂಧಾನ": [{"type": "noun", "defs": ["the uninterrupted contemplation on the principle of the Supreme Spirit or Supreme self-knowledge."]}], "ಬ್ರಹ್ಮಾಮ್ಲಿಕ": [{"type": "noun", "defs": ["the tree Adannsonia digitata of Bombacaceae famly; sour gourd tree.", "its fruit."]}], "ಬ್ರಹ್ಮಾಯು": [{"type": "noun", "defs": ["the term of the office of Brahma.", "(fig.) an abnormally long span of life."]}], "ಬ್ರಹ್ಮಾರ್ಪಣ": [{"type": "noun", "defs": ["imparting knowledge of the Supreme Being.", "dedication of one's deed to God.", "an absolute submission of oneself to the Supreme Being.", "an oblation offered to Brahma.", "a particular kind of hymns.", "a kind of funeral rites, in which the ritual food is not offered to the manes."]}], "ಬ್ರಹ್ಮಾªÀರ್ತ": [{"type": "noun", "defs": ["the old name for the region between the rivers Sarasvati and Dřṣadvatī, in the northern part of India."]}], "ಬ್ರಹ್ಮಾಸನ": [{"type": "noun", "defs": ["a particular posture suited for meditation."]}], "ಬ್ರಹ್ಮಾಸ್ತ್ರ": [{"type": "noun", "defs": ["a mythical, infalliable weapon, of which Brahma is the presiding deity.", "(fig.) an infalliable means or stratagem."]}], "ಬ್ರಹ್ಮಿ": [{"type": "noun", "defs": ["the potherb Alternanthera echinata of Amaranthaceae family.", "a kind of fish."]}, {"type": "adjective", "defs": ["of, relating to Brahma."]}, {"type": "noun", "defs": ["Viṣṇu.", "a person who asserts that all things are to be identified with Brahma."]}], "ಬ್ರಹ್ಮೇತಿ": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮಹತ್ಯೆ.", "a false, persistent belief maintained in spite of evidence to the contrary; delusion.", "(fig.) a person who is persistently and irritantly after another."]}], "ಬ್ರಹ್ಮೇತಿಕಾಱ": [{"type": "noun", "defs": ["he who has killed a brāhmaṇa, and hence committed one of the five most heinous sins.", "a man who instigates, causes another to kill a brāhmaṇa."]}], "ಬ್ರಹ್ಮೈಕ್ಯ": [{"type": "noun", "defs": ["intimate union with or identification with Brahma."]}], "ಬ್ರಹ್ಮೈಕ್ಯತೆ": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮೈಕ್ಯ."]}], "ಬ್ರಹ್ಮೋತ್ತರ": [{"type": "noun", "defs": ["(jain.) one of the sixteen heavens."]}], "ಬ್ರಹ್ಮೋತ್ಸವ": [{"type": "noun", "defs": ["an important, most magnificient celebration in a ceertain temples as Mēlukōṭe in Karnāṭaka, Tirupati in Āndhra Pradēsa etc."]}], "ಬ್ರಹ್ಮೋಪದೇಶ": [{"type": "noun", "defs": ["a teaching of the Supreme knowledge (to another).", "a religious function, held just before sending a brāhmaṇa student to the residence of the teacher for learning, in which he is initiated with the hymn of light (the Gāyatri hymn) by his father and invested with the sacred thread; (now that religious function only)."]}], "ಬ್ರಾಂದಿ": [{"type": "noun", "defs": ["an alcoholic liquor distilled from wine; brandy."]}], "ಬ್ರಾತ": [{"type": "noun", "defs": ["a large number of persons or things, esp. when gathered together or considered as a unit; a multitude."]}], "ಬ್ರಾಹ್ಮ": [{"type": "adjective", "defs": ["of, relating to Brahma.", "holy; sacred; divine.", "relating to sacred knowledge; prescribed by the vedas; spiritual.", "relating or belonging to the brāhmaṇa community.", "relating to or prescribed by brāhmaṇas, the holy scriptures.", "(said of weapons) having Brahma as the presiding deity.", "relating to or originated from the heaven of Brahma."]}, {"type": "noun", "defs": ["a member of the highest or priestly, class among the Hindus; a brāhmaṇa.", "Nārada, the celestial sage and son of Brahma.", "the root of the thumb.", "name of a purāṇa.", "a form of a marriage in which the bride is bestowed on the bridegroom without requiring anything from him.", "(astrol.) an auspicious moment or duration of the day, just before the sunrise.", "(dance.) one of the movements on the ground, with one foot kept in the normal position, the other foot is brought up to the knee of the former, bent back and raised."]}], "ಬ್ರಾಹ್ಮಣ": [{"type": "adjective", "defs": ["relating to or given by a brāhmaṇa.", "befitting or becoming of a brāhmaṇa or brāhmaṇa community."]}, {"type": "noun", "defs": ["he who has a divine knowledge; a brāhmaṇa.", "a man belonging to the brāhmaṇa caste.", "that caste or class.", "a division of the Vedas, (as distinct from their hymns and upanishads)."]}], "ಬ್ರಾಹ್ಮಣಗೇರಿ": [{"type": "noun", "defs": ["a street in a town where brāhmaṇas live."]}], "ಬ್ರಾಹ್ಮಣತ್ವ": [{"type": "noun", "defs": ["the rank of a brāhmaṇa; the condition of being a brāhmaṇa."]}], "ಬ್ರಾಹ್ಮಣಬ್ರುವ": [{"type": "noun", "defs": ["an unworthy brāhmaṇa; a brāhmaṇa, who violates the brāhmaṇa dharma."]}], "ಬ್ರಾಹ್ಮಣಯಷ್ಟಿಕೆ": [{"type": "noun", "defs": ["the plant Clerodendrumindicum( = Siphonanthus indica) of Verbenaceae family."]}], "ಬ್ರಾಹ್ಮಣವಾಡ": [{"type": "noun", "defs": ["= ಬ್ರಾಹ್ಮಣಗೇರಿ."]}], "ಬ್ರಾಹ್ಮಣಾರ್ಥ": [{"type": "noun", "defs": ["the ritual of a annual death ceremony.", "an offering of food to brāhmaṇas before offering to others."]}], "ಬ್ರಾಹ್ಮಣಿ": [{"type": "noun", "defs": ["a woman belonging to brāhmaṇa classe.", "the wife of a brāhmaṇa.", "Sarasvati, the wife of Brahma.", "the intellectual faculty.", "the plant Clerodendrum indicum ( = Siphonanthus indica) of Verbenaceae family.", "a yellowish metal that is essentially an alloy of copper and zinc; brass.", "a kind of lizard with a red tail.", "a kind of wasp."]}], "ಬ್ರಾಹ್ಮಣಿಕೆ": [{"type": "noun", "defs": ["= ಬ್ರಾಹ್ಮಣತ್ವ."]}], "ಬ್ರಾಹ್ಮಣಿತಿ": [{"type": "noun", "defs": ["= ಬ್ರಾಹ್ಮಣಿ - 1 & 2."]}], "ಬ್ರಾಹ್ಮಣೇತರ": [{"type": "adjective", "defs": ["belonging to a class other than brāhmaṇa class; non-brāhmaṇa."]}, {"type": "noun", "defs": ["a person belonging to a class other than brāhmaṇa class; a non-brāhmaṇa."]}], "ಬ್ರಾಹ್ಮಣ್ಯ": [{"type": "noun", "defs": ["= ಬ್ರಾಹ್ಮಣತ್ವ.", "a multitude of brāhmaṇas.", "the planet saturn."]}], "ಬ್ರಹ್ಮಧರ್ಮ": [{"type": "noun", "defs": ["the Hinduism of the Vedas, brāhmaṇas, and Upanishads."]}], "ಬ್ರಾಹ್ಮಮುಹೂರ್ತ": [{"type": "noun", "defs": ["= ಬ್ರಾಹ್ಮೀಮುಹೂರ್ತ."]}], "ಬ್ರಾಹ್ಮಿ": [{"type": "noun", "defs": ["1.Ādi Parāśakti, the primordial energy of Brahma personified as a woman.", "Sarasvati, the Goddess of speech.", "the power or ability to speak; speech.", "a woman who has married to a man without requiring anything from him.", "the wife of a brāhmaṇa.", "the herb Altenanthera echinata of Amaranthaceae family.", "the plant Asclepias acida of Asclepiadaceae family.", "the first of the seven divine mothers of all created beings.", "the plant Centella asiatica ( = Hydrocotyle asiatica of Apiaceae family.", "the wine Sarcostemma acidum ( = S. brevistigma) of Asclepiadaceae family.", "a kind of brass.", "name of a river.", "a script that was probably adapted from the Aramaic alphabet about the 7th century B.C., and from which most of the later Indian scripts developed."]}], "ಬ್ರಾಹ್ಮೀಮುಹೂರ್ತ": [{"type": "noun", "defs": ["(astrol.) an auspicious moment or duration of the day, just before the sunrise."]}], "ಬ್ರಾಹ್ಮೀಲಿಪಿ": [{"type": "noun", "defs": ["= ಬ್ರಾಹ್ಮಿ–13."]}], "ಬ್ರಾಹ್ಮೀsಸ್ಥಿತಿ": [{"type": "noun", "defs": ["the state of being absorbed in the one self-existent Spirit.", "(fig.) the state of being utterly confused or greatly perplexed."]}], "ಬ್ರಾಹ್ಮ್ಯ": [{"type": "adjective", "defs": ["of or relating to Brahma.", "holy; sacred; divine.", "relating to sacred knowledge; prescribed by the vedas; spiritual.", "relating or belonging to the brāhmaṇa community."]}, {"type": "noun", "defs": ["= ಬ್ರಾಹ್ಮಣತ್ವ."]}], "ಬ್ರಿಹವಾರ": [{"type": "noun", "defs": ["the fifth day of the week; Thursday."]}], "ಬ್ರುಂಹಿತಾತ್ಮ": [{"type": "noun", "defs": ["the Supreme Soul."]}], "ಬ್ರುಸಿ": [{"type": "noun", "defs": ["a seat for sages, monks to sit on."]}], "ಬ್ರೆಡ್ಡು": [{"type": "noun", "defs": ["a food baked from a leavened, kneaded dough made with flour or meal, water, yeast, etc.; brad."]}], "ಬ್ರೆಹವಾರ": [{"type": "noun", "defs": ["= ಬ್ರಿಹವಾರ."]}], "ಬ್ರೇಕು": [{"type": "noun", "defs": ["any device for slowing or stopping the motion of a vehicle or machine; a brake."]}], "ಬ್ರೇಲು": [{"type": "noun", "defs": ["a system of printing and writing for the blind, in which characters are formed by patterns of raised dots which are felt with the fingers; Braille."]}], "ಬ್ರೋಚು": [{"type": "noun", "defs": ["an ornamental pin with a clasp, worn by women, usu. at the neck; a broach."]}], "ಬ್ಲೇಡು": [{"type": "noun", "defs": ["the cutting part of a tool, instrument or weapon; blade.", "a very thin metal plate having sharp-edges on both the sides for shaving off or cutting hair; a blade."]}], "ಬ್ಲೌಜು": [{"type": "noun", "defs": ["= ಬ್ಲೌಸು."]}], "ಬ್ಲೌಸು": [{"type": "noun", "defs": ["an upper, outer garment, either or not sleeved, worn by women; a blouse."]}], "ಭ": [{"type": "noun", "defs": ["(gen. pronounced with the vowel 'ಅ') the thirty eighth letter of Kannaḍa alphabet and the twenty fourth consonant.", "any of the self-luminous celestial body; a star.", "the planet Venus.", "brightness; radiance; brilliance; lustre.", "a perception that represents what is perceived in a way different from the way it is in reality; illusion or an instance of this.", "the state of being similar; likeness; resemblance; similarity.", "(math.) a symbol for the number four.", "(math.) a symbol for the number twenty seven.", "(pros.) a group consisting of one long syllablic instant followed by two short ones (-uu); dactylus."]}], "ಭಂಗ": [{"type": "noun", "defs": ["a breaking, shattering, splitting or being broken, shattered, split, etc.", "a dividing or being divided; separation.", "that which is broken, shattered or split.", "a part or portion separated from a whole; a piece.", "a part or portion that belongs or is allotted to an individual; a share.", "a breach, rift; a break.", "the state or fact of being spoiled.", "the fact of being defeated.", "the state or fact of being humiliated; loss of one's pride, prestige, status, etc.", "anything that distresses; affliction; distress.", "a ripple, undulation or wave.", "lack of something necessary for completeness or imperfection or weakness; deficiency; shortcoming; a flaw; a fault; a defect.", "the condition of being disappointed; disappointment.", "a place or point where something is bent; a bend; a curve; a turn.", "the act of bending or being bent.", "the act or manner of flying or moving through space; a flight.", "the act or process of moving; movement.", "the condition of being crooked (as a hook).", "a fold of a cloth.", "the act of cheating or being cheated; deception.", "(dance) (archit.) a bending of the body (at one or more points) while standing.", "a violating or being violated; as - a) infringement or breach, as of a law, rule, right, etc.; b) sexual assault; rape; c) desecration of something sacred, as a temple; d) interruption; disturbance."]}], "ಭಂಗಂಬಡು": [{"type": "verb", "defs": ["= ಭಂಗಪಡು."]}], "ಭಂಗಂಬಡೆ": [{"type": "verb", "defs": ["= ಭಂಗಪಡು."]}], "ಭಂಗಂಬೆಱು": [{"type": "verb", "defs": ["= ಭಂಗಪಡು."]}], "ಭಂಗಗಾಱ": [{"type": "noun", "defs": ["a man who broke his promise or has deceived; he who is not trustworthy."]}], "ಭಂಗಗೊಳು": [{"type": "verb", "defs": ["= ಭಂಗಪಡು."]}], "ಭಂಗಚಿಕಿತ್ಸೆ": [{"type": "noun", "defs": ["something done to make up one's loss of respect, dignity."]}], "ಭಂಗತಾಳ": [{"type": "noun", "defs": ["(mus.) a particular rhythm in keeping time."]}], "ಭಂಗಪಡಿಸು": [{"type": "verb", "defs": ["to overpower or defeat another.", "to break (a law, rule, promise, etc.); to violate.", "to wilfully show disrespect; to treat disdainfully."]}], "ಭಂಗಪಡು": [{"type": "verb", "defs": ["to get one's pride, dignity hurt; to lose one's prestige, rank, position, etc.", "to suffer; to undergo distress, agony; to be distressed.", "to be defeated, overcome; to be overpowered.", "to be moved, displaced; to lose one's stability."]}], "ಭಂಗಬಡಿಸು": [{"type": "verb", "defs": ["= ಭಂಗಪಡಿಸು."]}], "ಭಂಗಬಡು": [{"type": "verb", "defs": ["= ಭಂಗಪಡು."]}], "ಭಂಗವಡಿಸು": [{"type": "verb", "defs": ["= ಭಂಗಪಡಿಸು."]}], "ಭಂಗವಡು": [{"type": "verb", "defs": ["= ಭಂಗಪಡು."]}], "ಭಂಗವಡೆ": [{"type": "verb", "defs": ["= ಭಂಗಪಡು."]}], "ಭಂಗವ್ಯಾಕುಳಿತ": [{"type": "noun", "defs": ["the condition of being mentally perturbed, agitated or disturbed.", "the condition of a waterbody that is agitated by disturbance caused from within or by the wind."]}], "ಭಂಗಶ್ಲೇಷ": [{"type": "noun", "defs": ["(rhet.) the usage of a compound of two or more words, the splitting them differently gives different meanings."]}], "ಭಂಗಾರ": [{"type": "noun", "defs": ["the precious yellow metallic element, highly malleable and ductile, and not subject to oxidation or corrosion (symbol: Au); gold.", "a jar or vase made of gold.", "any golden ornament.", "a term of endearment used in calling children.", "(fig.) an excellent person; a person held in great esteem; a gem.", "any of a group of minerals (complex silicates) that crystallise in tin, somewhat flexible, translucent or coloured, resistant to head and electricity; mica.", "a round ornamental container made of gold; a globe; a bulb.", "a most superior thing."]}], "ಭಂಗಾಱ": [{"type": "noun", "defs": ["= ಭಂಗಾರ."]}], "ಭಂಗಿ": [{"type": "noun", "defs": ["the tall, annual shrub Cannabis sativa of Cannabinaceae family; hemp.", "any substance, such as marijuana, hashish, etc., made from the leaves and flowers of this plant.", "a person addicted to narcotic or hallucinogen substances as marijuana, hashish, etc."]}, {"type": "noun", "defs": ["the act of breaking, splitting or being broken, shattered.", "a breach; a rift; cleft.", "a bend; a turn.", "the condition or quality of not being permanent or lasting for a longer time; transitoriness; momentariness.", "a crooked, circumambulatory road.", "an undulation created on the surface of a water-body by internal or external agitation; a wave.", "the act or practice of deceiving; deception.", "a reason or motive for doing or refraining from doing something.", "a way or method in which something is done or happens or must be done; a manner.", "the way a person is standing; the physical attitude of a person.", "the manner in which something is expressed or displayed.", "the act of dallying; flirting, toying or trifling; dalliance.", "a style that is particular to a person or assumed by a person deliberately to impress others."]}, {"type": "noun", "defs": ["a person who sweeps public roads and places; a sweeper."]}], "ಭಂಗಿಗ": [{"type": "noun", "defs": ["= ಭಂಗಿ1 - 3."]}], "ಭಂಗಿತ": [{"type": "adjective", "defs": ["broken; split; shattered.", "treated disrespectfuly or disdainfuly; humiliated.", "defeated; prevailed over; vanquished."]}, {"type": "noun", "defs": ["a man who is treated disrespectfuly or disdainfuly; a humiliated man.", "he who is defeated, prevailed over; a vanquished man."]}], "ಭಂಗಿತೆ": [{"type": "noun", "defs": ["a woman who is treated disrespectfuly or disdainfuly; a humiliated woman.", "she who is defeated, prevailed over; a vanquished woman."]}], "ಭಂಗಿಪಟ್ಟಿ": [{"type": "noun", "defs": ["a tax levied (by a local body) for paying salary to sweepers."]}], "ಭಂಗಿಮುಕ್ಕ": [{"type": "noun", "defs": ["= ಭಂಗಿ1 - 3."]}], "ಭಂಗಿವಡೆ": [{"type": "verb", "defs": ["to become charmful or very attractive."]}], "ಭಂಗಿವೆಱು": [{"type": "verb", "defs": ["= ಭಂಗಿವಡೆ."]}], "ಭಂಗಿಸು": [{"type": "verb", "defs": ["to force to come apart; to split or crack into pieces by force; to break.", "to destroy; to ruin; to bring to naught; to demolish.", "to conquer; to defeat in any conflict.", "to keep from happening; to ward off; to prevent; to avert.", "to treat or speak to with scorn, insolence or great disrespect; to insult; to humiliate.", "to annoy, interfere with or meddle with so as to trouble or harm; to molest."]}], "ಭಂಗುರ": [{"type": "adjective", "defs": ["easily broken, damaged or destroyed; breakable; fragile.", "lasting for only a moment; passing; transitory; momentary.", "bent; crooked; curved.", "tied; knotted; fastened with a rope, string, etc.", "cheating; of the nature of cheating or having the tendency to cheat."]}, {"type": "noun", "defs": ["lack of stability; unsteadiness.", "the quality or fact of being transitory; momentarines.", "the act or an instance of breaking, demolishing; destruction.", "the place where the path of a river takes a turn.", "the quality or fact of being crooked; crookedness."]}, {"type": "noun", "defs": ["the plant Aconitum heterophyllum of Ranunculaceae family."]}], "ಭಂಗುರಕೇಶಿ": [{"type": "noun", "defs": ["a woman having curly hair."]}], "ಭಂಗುರವೇಣಿ": [{"type": "noun", "defs": ["curly hair.", "= ಭಂಗುರಕೇಶಿ."]}], "ಭಂಗ್ಯ": [{"type": "noun", "defs": ["soil that is very much suited for growing hemp (Cannabis sativa).", "a field where hemp is grown."]}], "ಭಂಜಕ": [{"type": "noun", "defs": ["that which is breakable.", "the act of breaking or splitting.", "that which breaks or destroys (something).", "a man who destroys, demolishes (something)."]}], "ಭಂಜಕಿ": [{"type": "noun", "defs": ["a woman who destroys, demolishes (something)."]}], "ಭಂಜಣಿಗೆ": [{"type": "noun", "defs": ["the slow pace of a horse, in walking."]}], "ಭಂಜನ": [{"type": "adjective", "defs": ["tending to break or destroy.", "averting; preventing.", "annoying; troubling."]}, {"type": "noun", "defs": ["the act or an instance of destroying.", "the condition of being destroyed; destruction; ruin.", "the act of annoying, troubling.", "he who destroyes; a destroyer.", "the act or an instance of defeating."]}], "ಭಂಜನಿ": [{"type": "noun", "defs": ["(jain.) a mystic art of defeating others."]}], "ಭಂಜನೆ": [{"type": "noun", "defs": ["ಭಂಜನ2 - 1, 2 & 5."]}, {"type": "noun", "defs": ["a detailed explanation."]}], "ಭಂಜವಣೆ": [{"type": "noun", "defs": ["the fact of being bent, as a curve.", "an insolent or contemptuous remark, deliberately made to insult another; an insult; an affront."]}], "ಭಂಜಳಿ": [{"type": "noun", "defs": ["= ಭಂಜಣಿಗೆ."]}], "ಭಂಜಿ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಭಂಜಿಕೆ": [{"type": "noun", "defs": ["a solid image (as carved in stone or of metal, plaster of paris, etc.)."]}], "ಭಂಜಿತ": [{"type": "adjective", "defs": ["treated disrespectfuly or disdainfuly; humiliated.", "defeated; prevailed over; vanquished.", "broken; shattered."]}, {"type": "noun", "defs": ["a man who is treated disrespectfuly or disdainfuly; a humiliated man.", "he who is defeated, prevailed over; a vanquished man.", "that which is broken, split into pieces."]}], "ಭಂಜಿಸು": [{"type": "verb", "defs": ["= ಭಂಗಿಸು - 1, 2, 3 & 5.", "to cause to undergo pain, loss or suffering or to subject to death as a penalty for a crime or wrong doing; to punish.", "to sever; to separate; to divide."]}], "ಭಂಟ": [{"type": "noun", "defs": ["a boldly-courageous, brave man.", "a person who serves in an army; a person engaged in military service; a soldier.", "a person employed by another to perform personal and menial duties; a servant.", "a subcaste in the coastal Karnāṭaka, the members of which are engaged mainly in agriculture."]}], "ಭಂಟಾಕಿ": [{"type": "noun", "defs": ["the plant Solanum melongena of Solanaceae family; brinjal plant.", "its fruit."]}], "ಭಂಡ": [{"type": "noun", "defs": ["a man whose occupation it is to cut, dress the hair and to shave or trim the beard of customers; a barber."]}, {"type": "adjective", "defs": ["lacking a sense of shame; shameless; impudent."]}, {"type": "noun", "defs": ["anything bought and sold; any article of commerce; a commodity; merchandise.", "wealth (money or property) invested in a business by a person, corporation, etc.; capital.", "the object, end or purpose for which something is used; use.", "a performer who entertains by jokes, tricks, etc. in a play or film; a jester; a clown.", "lack of the sense of shame; shamelessness; impudence.", "a shameless, impudent man.", "he who argues illogically or without any sense.", "a wicked, merciless cut-throat."]}], "ಭಂಡಗೇಡು": [{"type": "noun", "defs": ["the quality of being shameless; shamelessness; impudence."]}], "ಭಂಡಣ": [{"type": "noun", "defs": ["a hostile encounter or engagement between opposing military forces; battle."]}], "ಭಂಡಣಾಜಿರ": [{"type": "noun", "defs": ["the site of a battle; a battlefield."]}], "ಭಂಡತನ": [{"type": "noun", "defs": ["the quality of being shameless, impudent; shamelessness; effrontery; impudence."]}], "ಭಂಡನ": [{"type": "noun", "defs": ["= ಭಂಡಣ.", "a protective covering worn to prevent from being hurt by weapons; an armour.", "the quality of being wicked or naughty; wickedness; naughtiness."]}], "ಭಂಡಬಾಳು": [{"type": "noun", "defs": ["a wretched, miserable life."]}], "ಭಂಡವಲ": [{"type": "noun", "defs": ["= ಭಂಡವಾಳ."]}], "ಭಂಡವಲು": [{"type": "noun", "defs": ["= ಭಂಡವಾಳ."]}], "ಭಂಡವಾಳ": [{"type": "noun", "defs": ["any form of wealth employed or capable of being employed in the production of more wealth; capital.", "assets remaining after deduction of liabilities; the net worth of a business; capital.", "monetary or material worth, as in commerce or trade; value.", "relative worth, merit, value or importance.", "the collective wealth of a country or its means of producing wealth; resources."]}], "ಭಂಡವಾಳಗಾರ": [{"type": "noun", "defs": ["a man who has invested capital in a business enterprise; an investor; a capitalist."]}], "ಭಂಡವಾಳಶಾಹಿ": [{"type": "noun", "defs": ["= ಭಂಡವಾಳಗಾರ.", "capitalists as a group or class (as distinguished from labour).", "the control, influence that this class exercises on economy of a nation.", "a person who advocates capitalism in the economy of a nation and supports investors and capitalists."]}], "ಭಂಡವಾಳಿಗ": [{"type": "noun", "defs": ["= ಭಂಡವಾಳಗಾರ."]}], "ಭಂಡವಾಳು": [{"type": "noun", "defs": ["= ಭಂಡವಾಳ."]}], "ಭಂಡವಾಳುಗಾರ": [{"type": "noun", "defs": ["= ಭಂಡವಾಳಗಾರ."]}], "ಭಂಡವಿಕ್ರಯ": [{"type": "noun", "defs": ["buying and selling; trade."]}], "ಭಂಡವಿದ್ಯೆ": [{"type": "noun", "defs": ["the quality or the manners adopted by, an impudent, shameless person."]}], "ಭಂಡಸಾಲೆ": [{"type": "noun", "defs": ["a room where things are stored; a store-room."]}], "ಭಂಡಾಟ": [{"type": "noun", "defs": ["the quality or state of being impudent; unashamed boldness; effrontery; insolence.", "a false claim, show; insincere or dishonest behaviour for cheating others; pretentiousness.", "a state of mental or physical distress; trouble."]}], "ಭಂಡಾರ": [{"type": "noun", "defs": ["a place where the funds of the government, of a corporation or the like are deposited, kept, and disbursed; a treasury.", "a steel or iron box or repository for money, jewels, papers, etc.; a safe; a locker.", "turmeric powder, saffron powder, etc. used in worshipping deities as Khaṇḍōbā, Yellamma, etc. given to devotees, which is regarded as prasada (having the grace of the deity).", "the yellow, principal substance of an egg, as distinguished from the white substance, albumen; yolk."]}], "ಭಂಡಾರಕ": [{"type": "noun", "defs": ["= ಭಂಡಾರಿ1."]}], "ಭಂಡಾರಗರಣತನ": [{"type": "noun", "defs": ["the office of the chief officer of a trasury."]}], "ಭಂಡಾರಸದನ": [{"type": "noun", "defs": ["= ಭಂಡಾರ - 1."]}], "ಭಂಡಾರಾಲಯ": [{"type": "noun", "defs": ["= ಭಂಡಾರ - 1."]}], "ಭಂಡಾರಿ": [{"type": "noun", "defs": ["the chief officer of a government treasury."]}, {"type": "noun", "defs": ["a temple servant of certain class.", "a man who makes and repairs boats."]}], "ಭಂಡಾರಿಗ": [{"type": "noun", "defs": ["= ಭಂಡಾರಿ1."]}], "ಭಂಡಾರಿಸು": [{"type": "verb", "defs": ["to put (a weapon as a sword) into a sheath of scabbard; to sheathe."]}], "ಭಂಡಿ": [{"type": "noun", "defs": ["a vehicle, usu. having two wheels, drawn by animals, used for carrying goods.", "a light, two-wheeled vehicle for one or two persons, drawn by a horse or horses; a chariot.", "a vehicle in general.", "a wheel."]}, {"type": "noun", "defs": ["a shameless, impudent girl or woman."]}], "ಭಂಡಿಕಾರ": [{"type": "noun", "defs": ["a man who drives a cart or chariot.", "the supervisor of a temple car."]}], "ಭಂಡಿಕಾಱ": [{"type": "noun", "defs": ["= ಭಂಡಿಕಾರ."]}], "ಭಂಡಿತೆ": [{"type": "noun", "defs": ["an ignoble, contemptible woman."]}], "ಭಂಡಿದೆರೆ": [{"type": "noun", "defs": ["(arch.) a tax levied on carts and other carriages."]}], "ಭಂಡಿಲ": [{"type": "noun", "defs": ["good luck; success; prosperity.", "a man who carries a message or goes on an errand; a messenger.", "a man who models, carves or otherwise fashions figures or forms of clay, stone, metal, wood, etc.", "the tree Acacia sirissa of Mimosae family."]}], "ಭಂಡಿಸು": [{"type": "verb", "defs": ["to wilfully treat another in a disdainful, scornful manner.", "to put to shame.", "to blame or scold in a sharp way; to rebuke."]}], "ಭಂಡೀರ": [{"type": "noun", "defs": ["the tree Ficus benghalensis ( = F.indica) of Moraceae family; a banyan tree.", "the plant Rubia cordifolia ( = R.munjista) of Rubiaceae family, with petals fused to form a funnel-shaped corolla; Indian madder."]}], "ಭಂಡೀರಿ": [{"type": "noun", "defs": ["= ಭಂಡೀರ - 2."]}], "ಭಂಡೀಲ": [{"type": "noun", "defs": ["= ಭಂಡಿಲ - 4."]}], "ಭಂಡು": [{"type": "adjective", "defs": ["not proper and fitting; unseemly; morally offensive; obscene; indecent."]}, {"type": "noun", "defs": ["the state of being inulsted or derided; insult; derision.", "a deed, work or job by doing of which one becomes petty, contemptible.", "a false claim, show; insincere or dishonest behaviour for cheating others; pretentiousness.", "ಭಂಡಾಗು bhaṇdāgu to become shameless; to behave indecently or impudently; ಭಂಡುಮಾಡು bhaṇḍu māḍu to laugh at in contempt or scorn; to ridicule; to deride."]}], "ಭಂಡುಗೆಯ್": [{"type": "verb", "defs": ["to speak derisively; to mock; to jeer; to scoff."]}], "ಭಂಡೆ": [{"type": "noun", "defs": ["a large, detached rock."]}, {"type": "noun", "defs": ["= ಭಂಡಿ2."]}], "ಭಂದಾಕಿ": [{"type": "noun", "defs": ["= ಭಂಟಾಕಿ."]}], "ಭಂಭಾ": [{"type": "noun", "defs": ["a drum consisting of a hollow hemisphere of brass or copper over which is stretched a skin, the tension of which can be modified by hand screws or by inserting small wedges to vary the pitch; a kettle-drum."]}], "ಭಕಾರ": [{"type": "noun", "defs": ["the letter 'ಭ'.", "its sound."]}], "ಭಕ್ಕರಿ": [{"type": "noun", "defs": ["a thin, flat or bowl-shaped cake of batter fried in a frying pan; a pancake."]}], "ಭಕ್ತ": [{"type": "adjective", "defs": ["distributed in shares; given out a port or portions of; apportioned.", "divided into parts; partitioned.", "showing reverence or devotion; characterised by devotion.", "occupied wholly with; absorbed in; engrossed in."]}, {"type": "noun", "defs": ["a man strongly devoted to (as a god, religion, etc.).", "a man enthusiastic about a particular person, sport, pastime, etc.; a fan.", "boiled rice (that is fit for eating).", "(vīr.) a man pious and highly devoted to Śiva."]}], "ಭಕ್ತಕುಟುಂಬಕ": [{"type": "noun", "defs": ["= ಭಕ್ತಕುಟುಂಬಿ."]}], "ಭಕ್ತಕುಟುಂಬಿ": [{"type": "noun", "defs": ["(said of a god) he who treats his devotees as his family members."]}], "ಭಕ್ತತೆ": [{"type": "noun", "defs": ["personal devotion to a particular deity."]}], "ಭಕ್ತಪರಾಧೀನ": [{"type": "noun", "defs": ["(said of a god) he who is at the behest of his devotees."]}], "ಭಕ್ತಪರಾಧೀನೆ": [{"type": "noun", "defs": ["(said of a goddess) she who is at the behest of her devotees."]}], "ಭಕ್ತವತ್ಸಲ": [{"type": "noun", "defs": ["(said of a god) he who treats his devotees very affectionately."]}], "ಭಕ್ತವತ್ಸಲತೆ": [{"type": "noun", "defs": ["= ಭಕ್ತವಾತ್ಸಲ್ಯ."]}], "ಭಕ್ತವತ್ಸಲೆ": [{"type": "noun", "defs": ["(said of a goddess) she who treats her devotees very affectionately."]}], "ಭಕ್ತವತ್ಸಳ": [{"type": "noun", "defs": ["= ಭಕ್ತವತ್ಸಲ."]}], "ಭಕ್ತವತ್ಸಳೆ": [{"type": "noun", "defs": ["= ಭಕ್ತವತ್ಸಲೆ."]}], "ಭಕ್ತವಾತ್ಸಲ್ಯ": [{"type": "noun", "defs": ["affection or love one has for his or her devotees."]}], "ಭಕ್ತವ್ಯಸನ": [{"type": "noun", "defs": ["the concern one has for his or her devotees."]}], "ಭಕ್ತವ್ಯಸನಿ": [{"type": "noun", "defs": ["he who has a deep concern for his devotees."]}], "ಭಕ್ತಸ್ಥಲ": [{"type": "noun", "defs": ["(vīr.) one of the six stages of devotion where the4 devotee is pious and highly devoted to Śiva."]}], "ಭಕ್ತಿ": [{"type": "noun", "defs": ["a dividing into parts, shares; partition; division.", "a part or portion so divided.", "selfless and reverential devotion to, attachment with, extreme fondness for a god, master, ruler, nation, parents, teacher, elders, etc.", "service - a) work done for a master or feudal lord; b) work done or duty performed for another or others; c) the serving of a god; d) a taking care of the sick, injured or aged, etc.", "(rhet.) a way of putting forth the meaning using an alternative word, without altering the sense."]}], "ಭಕ್ತಿಕ": [{"type": "adjective", "defs": ["characterised by, of or relating to, devotion."]}], "ಭಕ್ತಿಗೀತ": [{"type": "noun", "defs": ["= ಭಕ್ತಿಗೀತೆ."]}], "ಭಕ್ತಿಗೀತೆ": [{"type": "noun", "defs": ["a devotional song."]}], "ಭಕ್ತಿಪಂಥ": [{"type": "noun", "defs": ["a cult which advocates that the devotion to God is the only means to the final emancipation."]}], "ಭಕ್ತಿಪಥ": [{"type": "noun", "defs": ["the path of devotion followed as the only means to the final emancipation."]}], "ಭಕ್ತಿಪೂರ್ವಕ": [{"type": "adjective", "defs": ["with devotion."]}], "ಭಕ್ತಿಭಾವ": [{"type": "noun", "defs": ["the sentiment of pure devotion to God."]}], "ಭಕ್ತಿಮಾರ್ಗ": [{"type": "noun", "defs": ["= ಭಕ್ತಿಪಥ."]}], "ಭಕ್ತಿಯೋಗ": [{"type": "noun", "defs": ["devoted attachment or loving devotion to God."]}], "ಭಕ್ತಿಯೋಗಿ": [{"type": "noun", "defs": ["a man who has devoted attachment or loving devotion to God."]}], "ಭಕ್ತಿರಸ": [{"type": "noun", "defs": ["= ಭಕ್ತಿಭಾವ."]}], "ಭಕ್ತಿಸ್ಥಲ": [{"type": "noun", "defs": ["= ಭಕ್ತಸ್ಥಲ."]}], "ಭಕ್ತಿಹೀನ": [{"type": "adjective", "defs": ["not having selfless and reverential devotion, attachment etc.; destitute of devotion."]}, {"type": "noun", "defs": ["a man destitute of devotion."]}], "ಭಕ್ತಿಹೀನತೆ": [{"type": "noun", "defs": ["lack of selfless and reverential devotion, fondness, etc."]}], "ಭಕ್ತಿಹೀನೆ": [{"type": "noun", "defs": ["a woman destitute of devotion."]}], "ಭಕ್ತೆ": [{"type": "noun", "defs": ["a woman strongly devoted to (a god, religion, etc.).", "a woman enthusiastic about a specified sport, pastime or performer; a fan.", "(vīr.) a woman pious and highly devoted to Śiva."]}], "ಭಕ್ಷ": [{"type": "noun", "defs": ["anything that is fit to be eaten (as food); an eatable or food."]}], "ಭಕ್ಷಕ": [{"type": "adjective", "defs": ["eating.", "eating up (hungrily, greedily or voraciously).", "consuming or destroying with devastating force."]}, {"type": "noun", "defs": ["a man who eats.", "he who eats up (hungrily, greedily or voraciously).", "that which consumes or destroys with devastating force."]}], "ಭಕ್ಷಕಾರಿ": [{"type": "noun", "defs": ["= ಭಕ್ಷಕ2 - 2 & 3."]}], "ಭಕ್ಷಕಿ": [{"type": "noun", "defs": ["a woman who eats.", "she who eats up (hungrily, greedily or voraciously)."]}], "ಭಕ್ಷಣ": [{"type": "noun", "defs": ["= ಭಕ್ಷಣೆ - 1 & 2."]}], "ಭಕ್ಷಣೆ": [{"type": "noun", "defs": ["the act of eating.", "that which is eaten; food.", "a dish, eaten in small quantities, to enhance the taste of the main food."]}], "ಭಕ್ಷಿ": [{"type": "noun", "defs": ["the chief of a department in a palace."]}], "ಭಕ್ಷಿತ": [{"type": "adjective", "defs": ["eaten; consumed.", "eaten up hungrily, greedily or voraciously.", "consumed or destroyed with devastating force."]}, {"type": "noun", "defs": ["that which is eaten; food."]}], "ಭಕ್ಷಿಸು": [{"type": "verb", "defs": ["to put (food) in the mouth, chew and swallow; to eat.", "to eat or eat up hungrily, greedily or voraciously.", "to consume or destroy with devastating force."]}], "ಭಕ್ಷೀಸ್": [{"type": "noun", "defs": ["= ಭಕ್ಷೀಸು."]}], "ಭಕ್ಷೀಸು": [{"type": "noun", "defs": ["(wrong form of ಬಕ್ಷೀಸು) a small present of money given directly to someone for performing a service or menial task; a tip."]}], "ಭಕ್ಷ್ಯ": [{"type": "adjective", "defs": ["fit to be eaten; edible; eatable."]}, {"type": "noun", "defs": ["that which is fit to be eaten; an edible thing; an eatable.", "a special sweet dish made for a particular occasion."]}], "ಭಕ್ಷ್ಯಕಾರ": [{"type": "noun", "defs": ["a cook who makes special sweet dishes."]}], "ಭಗ": [{"type": "noun", "defs": ["the sun.", "name of one of the twelveādityas, a class of gods.", "the gaining of wealth, fame, rank, etc.; success.", "the external genitals of a woman; vulva.", "the effects of one's deeds in the past lives, affecting during the present life.", "good luck; fortune.", "the state of having much money or property; affluence; wealth.", "prosperous condition; prosperty.", "the quality of being worthy of esteem or honour; worthiness; dignity.", "the state or quality of being superior, eminent; superiority; eminence; excellence.", "the state or quality of being strong; force; power; vigoir.", "an earnest attempt or effort; an endeavour.", "brightness: brilliancy; splendor; effulgence; refulgence.", "tender, warm feeling; affection; love.", "freedom from evil, sin or currupting elements; purity; unsulliedness.", "knowledge.", "moral uprightness; righteousness; virtuousness.", "the quality or sate of being not influenced by personal interest, selfish motives, sensual enjoyments, worldly possessions, etc.", "a man who has subdued his passions; a sage.", "the final emancipation of the soul from the cycle of births and deaths; Beautitude.", "the act of meditating; deep, continued thought esp. on a religious object; meditation.", "the time that is to come and what will happen; the future.", "a god; a deity."]}], "ಭಗಂದರ": [{"type": "noun", "defs": ["a disease characterised by jagged or lacerate vulva."]}], "ಭಗಣ": [{"type": "noun", "defs": ["a cluster of stars.", "a group consisting of one long syllablic instant followed by two short ones (-uu); dactylus."]}], "ಭಗದಾಳ": [{"type": "noun", "defs": ["= ಭಗಂದರ."]}], "ಭಗಧ್ವಜ": [{"type": "noun", "defs": ["= ಭಗಾಂಕುರ."]}], "ಭಗಭಗನೆ": [{"type": "adjective", "defs": ["throwing out strong burning flames; bursting with flames; blazingly."]}], "ಭಗರ": [{"type": "noun", "defs": ["the grass Coix barbata of Poaceae family.", "its edible grain."]}], "ಭಗರಿ": [{"type": "noun", "defs": ["the black bumble-bee.", "the act of turning about (vertically on one's central axis), swinging or brandishing.", "(in sword or mace fight) a jumping up and turning in the air, to avoid being hit by one's opponent's blow.", "a toy, inversely conical, with a point on which it is made to spin with the help a string or cord; a top.", "a ring-like ornament for the ears.", "the side-lock on either side of the face, between the ears and the cheeks.", "a walking of a horse in a circular manner.", "the tree Ziziphus mauritiana ( = Z. jujuba) of Rhamnaceae family.", "its fruit.", "the medium sized evergreen tree Thespesia populnea of Malvaceae family; Indian tulip.", "(fig.) the male gonad or reproductive gland, either of two oval glands located in the scrotum; testis."]}], "ಭಗರೋಮ": [{"type": "noun", "defs": ["the hair at the lower part of the abdomen surrounding the external genitals; pubes."]}], "ಭಗವ": [{"type": "noun", "defs": ["a Vaiśṇava monk."]}], "ಭಗವಂತ": [{"type": "noun", "defs": ["the Supreme Being.", "Viṣṇu.", "Śiva.", "Jina, the jaina spiritual teacher.", "Gautama Buddha, the founder of Buddhism.", "a respectful term used in addressing a reverential man.", "a monk or religious mendicant."]}], "ಭಗವತಿ": [{"type": "noun", "defs": ["Pārvati, the Goddess of energy and consort of Śiva.", "any of the Hindu goddesses.", "a term used in respectfully addressing a reverential woman."]}], "ಭಗವತ್ಪಾದ": [{"type": "noun", "defs": ["a most respectful term used in addressing great teachers of philosophy."]}], "ಭಗವತ್ಪಾದಿ": [{"type": "noun", "defs": ["the celestial river Gangā supposed to have taken birth from the foot of Viṣṇu."]}], "ಭಗವದಿಚ್ಛೆ": [{"type": "noun", "defs": ["the will of God."]}], "ಭಗವದ್ಗೀತೆ": [{"type": "noun", "defs": ["a portion of the Mahābhařata, having the form of a philosophical dialogue between the hero Arjuna and Křṣṇa , which forms one of the three important philosophical works of Indian philosophy, dealing with the path of action (without focusing on its rewards), the path of knowledge and the path of devotion."]}], "ಭಗವನ್": [{"type": "noun", "defs": ["= ಭಗವಾನ್."]}], "ಭಗವಾ": [{"type": "adjective", "defs": ["of reddish brown colour."]}], "ಭಗವಾನ್": [{"type": "noun", "defs": ["a rspectful term used in addressing a deity or reverential man.", "Gautama Buddha, the founder of Buddhism."]}], "ಭಗಾಂಕುರ": [{"type": "noun", "defs": ["a small, sensitive, erectile organ at the upper end of the vulva; the clitoris."]}], "ಭಗಿನಿ": [{"type": "noun", "defs": ["a woman or girl as she is related to the other children of her parents; a sister."]}], "ಭಗಿನಿಜ": [{"type": "noun", "defs": ["the son of one's sister; a nephew."]}], "ಭಗಿನೀಪತಿ": [{"type": "noun", "defs": ["the husband of one's sister; a brother-in-law."]}], "ಭಗೀರಥ": [{"type": "noun", "defs": ["a mythological king, who by his austerities pleased Śiva and got the celestial Gangā released and brought to earth, which is supposed to the present Gangā river; ಭಗೀರಥ ಪ್ರಯತ್ನ bhagīrata prayatna undetered, rigorous effort that leads to success despite severe odds."]}], "ಭಗ್ಗನೆ": [{"type": "adverb", "defs": ["without lapse of time; immediately; suddenly."]}], "ಭಗ್ನ": [{"type": "adjective", "defs": ["split or cracked into pieces; splintered, fractured, burst, etc.; broken.", "overpowered or defeated in a combat, competition, etc.; vanquished.", "demolished; destroyed; ruined; dilapidated.", "discouraged or kept from doing or pursuing something by failure, deception, fear, diffidence, etc."]}, {"type": "noun", "defs": ["that which is broken, split, divided."]}], "ಭಗ್ನಪಾಠ": [{"type": "noun", "defs": ["the fact of a part of an old manuscript being lost (as by eaten by insects, breakage of palmyra leaves, etc.)."]}], "ಭಗ್ನಮನ": [{"type": "noun", "defs": ["the condition of being depressed or discouraged by the failure of one's hopes or expectations; a being frustrated."]}], "ಭಗ್ನಮನೋರಥ": [{"type": "noun", "defs": ["a man who is depressed or discouraged by the failure of his hopes or expectations; a frustrated man."]}], "ಭಗ್ನಮನೋರಥೆ": [{"type": "noun", "defs": ["a woman who is depressed or discouraged by the failure of her hopes or expectations; a frustrated woman."]}], "ಭಗ್ನಾಂಗ": [{"type": "noun", "defs": ["a broken or mutilated limb.", "a man who is lame or otherwise disabled in a way that prevents normal motion of the limbs or body."]}], "ಭಗ್ನಾವಶೇಷ": [{"type": "noun", "defs": ["the remains of a building, city, etc., that has been destroyed or that is in disrepair or a state of decay.", "(fig.) any such remnants."]}], "ಭಗ್ನಿಸು": [{"type": "verb", "defs": ["to split into pieces using force; to break.", "to cause to become partially ruined; to dilapidate."]}], "ಭಚಕ್ರ": [{"type": "noun", "defs": ["an imaginary belt in the heavens extending for about eight degrees on either side of the apparent path of the sun and including the paths of the moon and the principal planets, which is divided into twelve equal parts or signs, each named for a different constellation; the zodiac."]}], "ಭಜಕ": [{"type": "noun", "defs": ["a man who is greatly devoted to something."]}], "ಭಜನ": [{"type": "noun", "defs": ["= ಭಜನೆ -1, 2, 3, 4 & 6.", "the act or fact of getting, obtaining.", "(math.) the process of finding how many times a number is contained in another number; division."]}], "ಭಜನೆ": [{"type": "noun", "defs": ["an apportioning of a whole into parts or shares; apportionment.", "devotional service (as to a god, religious teachers, etc.).", "selfless and reverential devotion, attachment, extreme fondness etc. for a god, master, ruler, nation, parents, teacher, elders, etc.; devotion.", "service; courteous treatment.", "a singing of devotional songs.", "a devotional song.", "something that covers or protects; protection or a place affording protection, as from the elements or danger."]}], "ಭಜನೆಗೆಡಿಸು": [{"type": "verb", "defs": ["to cause to become shelterless, protectionless or homeless."]}], "ಭಜನೆವಂತ": [{"type": "noun", "defs": ["a man who regularly engages himself in singing devotional songs."]}], "ಭಜಿ": [{"type": "noun", "defs": ["a kind of dish made of crushed, roasted brinjals and mixed with curds."]}], "ಭಜಿಕೆ": [{"type": "noun", "defs": ["the tree Brucea sumatrana of Simaroubaceae family; (?)."]}], "ಭಜಿಯಿಸು": [{"type": "verb", "defs": ["= ಭಜಿಸು."]}], "ಭಜಿಸು": [{"type": "verb", "defs": ["to render religious reverence and homage to; to attend services of divine worship.", "to find protection, shelter or refuge.", "to think deeply and continuously; to reflect; to meditate.", "to laud the glory of; to praise; to extol."]}], "ಭಜ್ಜಿಸು": [{"type": "verb", "defs": ["to cook in a pan over direct heat, usu. without using oil, ghee, etc.; to fry.", "to eliminate completely; to erase."]}], "ಭಟ": [{"type": "noun", "defs": ["a man employed in royal courts to herald the titles of a king.", "a man who praises another insincerely, with an intention to get an advantage.", "a learned man; a scholar.", "a man whose profession is worshipping a god in a temple or conducting religious rites.", "a person whose profession is cooking; a cook."]}, {"type": "noun", "defs": ["a boldly-courageous, brave man.", "a person who serves in an army; a person engaged in military service; a soldier.", "a man belonging to hunters caste."]}], "ಭಟಕ": [{"type": "noun", "defs": ["a man employed by another, esp. to perform domestic duties; a servant."]}], "ಭಟಗುತಿಗೆ": [{"type": "noun", "defs": ["a stock of food and other supplies made to soldiers; military provisions."]}], "ಭಟಮಾನ್ಯ": [{"type": "noun", "defs": ["a tax-free land given as a gift to a learned person."]}], "ಭಟರಾಜು": [{"type": "noun", "defs": ["= ಭಟ1 - 1."]}], "ಭಟರಿ": [{"type": "noun", "defs": ["= ಭಟಾರಿ."]}], "ಭಟಾಂಗ": [{"type": "noun", "defs": ["a praising or being praised; commendation or glorification; praise."]}], "ಭಟಾರ": [{"type": "noun", "defs": ["a man worthy of respect or reverence by reason of scholarship, noble character and dignity.", "a monk or religious tacher.", "a master, ruler; a king."]}], "ಭಟಾರಕ": [{"type": "noun", "defs": ["= ಭಟಾರ - 2."]}], "ಭಟಾರಿ": [{"type": "noun", "defs": ["name of a folk goddess."]}], "ಭಟಿತ್ರ": [{"type": "noun", "defs": ["a piece of meat seasoned, implanted to a thin, pointed rod, and roasted over a fire."]}], "ಭಟ್ಟ": [{"type": "noun", "defs": ["a learned man; a doctor.", "a brāhmaṇa who scrupulously and punctiliously follows the religion as prescribed.", "a man emplolyed in royal courts to herald the titles of a king.", "a messenger; an errand.", "a priest in a temple.", "a professional cook.", "a surname used by some brāhmaṇa families.", "Kumārila Bhaṭṭa, a celebrated teacher of the Mīmāmsa philosopy and opponent of the Buddhism.", "a man as related to a woman whom he is married to; a husband."]}], "ಭಟ್ಟಂಗಿ": [{"type": "noun", "defs": ["= ಭಟ1 - 1.", "a man who praises another insincerely for some gain."]}], "ಭಟ್ಟಂಗಿತನ": [{"type": "noun", "defs": ["the office, duty of an heralder in a royal court.", "the mentality of a person who praises another insincerely for some gain."]}], "ಭಟ್ಟಗುತ್ತಿಕೆ": [{"type": "noun", "defs": ["= ಭಟಗುತಿಗೆ."]}], "ಭಟ್ಟಗೆಯಿ": [{"type": "noun", "defs": ["= ಭಟಮಾನ್ಯ."]}], "ಭಟ್ಟದರ್ಶನ": [{"type": "noun", "defs": ["the Mīmamsa philosophy as propounded by Kumarila Bhaṭṭa, a great exponent of this philosophy."]}], "ಭಟ್ಟಮಂಡಪ": [{"type": "noun", "defs": ["a place where scholars meet for discussion and argument."]}], "ಭಟ್ಟಮತ": [{"type": "noun", "defs": ["= ಭಟ್ಟದರ್ಶನ."]}], "ಭಟ್ಟಮಾನ್ಯ": [{"type": "noun", "defs": ["= ಭಟಮಾನ್ಯ."]}]}