{"ಊಱುಗೋಲು": [{"type": "noun", "defs": ["a strong stick carried while walking, esp. as a support.", "(fig) anything to lean on for support; a person who or thing that supports."]}], "ಊೞಿಗ": [{"type": "noun", "defs": ["= ಊಳಿಗ."]}], "ಋ": [{"type": "noun", "defs": ["the seventh letter and the seventh vowel of Kannaḍa alphabet."]}], "ಋಕಾರ": [{"type": "noun", "defs": ["the letter 'ಋ'."]}], "ಋಕಾರಾಂತ": [{"type": "adjective", "defs": ["ending with the letter or the sound of 'ಋ'."]}, {"type": "noun", "defs": ["the fact or an instance of a word ending with the letter or the sound of 'ಋ'."]}], "ಋಕ್ಕು": [{"type": "noun", "defs": ["a hymn in the Vēdas, in gen.", "a verse or a hymn of the Řgvēda."]}], "ಋಕ್ಛಂದಸ್ಸು": [{"type": "noun", "defs": ["the prosody of the Řgvēda."]}], "ಋಕ್ಥ": [{"type": "noun", "defs": ["wealth - a) much money or property; great amount of worldly possessions; riches b) the state of having much money or property; affluence.", "any paper note or coin issued by a government or a bank authorised by the government, generally accepted as a exchange and measure of value; money."]}], "ಋಕ್ಷ": [{"type": "noun", "defs": ["any of large, heavy, omnivorous carnivores of Ursidae family, that walk flat on the soles of their feet and have shaggy fur and a very short tail; a bear.", "any of the luminous celestial objects seen as points of light in the sky; esp., any self-luminous, celestial body having continuous nuclear reactions which send heat, light, etc. in all directions; a star.", "the tree Bignonia indica of Bigononiaceae family.", "a kind of deer.", "one of the seven mythological mountains."]}], "ಋಕ್ಷಗಂಧಿಕೆ": [{"type": "noun", "defs": ["the creeper Batatus paniculata."]}], "ಋಕ್ಷಗಂಧೆ": [{"type": "noun", "defs": ["the plant Argyreia argentea ( = Convolvulus argenteus) of Convolvulaceae family."]}], "ಋಕ್ಷನಾಯಕ": [{"type": "noun", "defs": ["Jāmbavanta, the king of bears (a character, known for wisdom, in the epic Rāmāyaṇa) 2) the moon, as the lord of asterisms."]}], "ಋಕ್ಷಪತಿ": [{"type": "noun", "defs": ["= ಋಕ್ಷನಾಯಕ."]}], "ಋಕ್ಷಪತಿಜೂಟ": [{"type": "noun", "defs": ["Śiva, adorning the moon in the knot of his hairs."]}], "ಋಕ್ಷಭಲ್ಲ": [{"type": "noun", "defs": ["= ಋಕ್ಷ - 1."]}], "ಋಕ್ಷಾಕೀರ್ಣ": [{"type": "adjective", "defs": ["consisting of a large number of a) stars; b) bears; c) deers; d) Bignonia indica trees."]}], "ಋಕ್ಷೇಶ": [{"type": "noun", "defs": ["= ಋಕ್ಷನಾಯಕ."]}], "ಋಗ್ವೇದ": [{"type": "noun", "defs": ["the oldest of the four Vēdas, and the most ancient sacred book of the Hindus, consisting of hymns."]}], "ಋಗ್ವೇದಿ": [{"type": "adjective", "defs": ["of or relating to the Řgvēda."]}, {"type": "noun", "defs": ["he who follows the Řgvēda."]}], "ಋಙ್ನಿಕಾಯ": [{"type": "noun", "defs": ["a collection of th hymns of the Řgvēda."]}], "ಋಚ": [{"type": "noun", "defs": ["a verse or a hymn of the Řgvēda."]}], "ಋಚೀಷ": [{"type": "noun", "defs": ["= ಋಜೀಷ."]}], "ಋಚೆ": [{"type": "noun", "defs": ["= ಋಚ."]}], "ಋಜೀಷ": [{"type": "noun", "defs": ["a frying pan or a cooking vessel.", "a hell."]}], "ಋಜು": [{"type": "adjective", "defs": ["1) not crooked, bent, bowed, wavy or curly; b) erect; upright.", "following strictly the principles; not swerving from moral, ethical values; following a direct system or course of reasoning; honest; sincere.", "simple; undiluted; pure."]}, {"type": "noun", "defs": ["a simple, honest, sincere man.", "a straight view free from prejudice or bias; a fair, impartial looking at or reviewing; a just, objective analysis."]}], "ಋಜುತೆ": [{"type": "noun", "defs": ["absolute honesty, fairness; unbiasedness; sincerity in one's thinking and action; rectitude; correctitude; uprightness."]}], "ಋಜುತೆವರು": [{"type": "verb", "defs": ["to become straight.", "to become free from crookedness, biasedness or prejudice; to become honest, sincere and frank."]}], "ಋಜುತ್ವ": [{"type": "noun", "defs": ["= ಋಜುತೆ."]}], "ಋಜುದೃಷ್ಟಿ": [{"type": "noun", "defs": ["a straight view free from prejudice or bias; a fair, impartial looking at or reviewing; a just, objective analysis."]}], "ಋಜುದೇವತೆ": [{"type": "noun", "defs": ["a class of souls fit for final emancipation."]}], "ಋಜುಮತಿ": [{"type": "noun", "defs": ["= ಋಜುತೆ.", "a person of rectitude."]}], "ಋಜುಮಾರ್ಗ": [{"type": "noun", "defs": ["= ಋಜುತೆ."]}], "ಋಜುರೇಖೆ": [{"type": "noun", "defs": ["a straight line."]}], "ಋಜುರೋಹಿತ": [{"type": "noun", "defs": ["the name of the red bow of Indra.", "an arc or ring containing the colours of the spectrum in consecutive bands, formed in the sky by the refraction, reflection, and dispersion of light in rain or fog; a rainbow."]}], "ಋಜುಲಂಬಿ": [{"type": "adjective", "defs": ["being straight and hung."]}], "ಋಜುವೃತ್ತಿ": [{"type": "noun", "defs": ["= ಋಜುತೆ."]}], "ಋಜೂಕರಣ": [{"type": "noun", "defs": ["the act, process or fact of making something straight, free from crookedness."]}], "ಋಜ್ವಾಗತ": [{"type": "adjective", "defs": ["that has come frankly or by following a straight path."]}, {"type": "noun", "defs": ["a straight path.", "a straight view, review, analysis that is impartial, free from prejudice or bias."]}], "ಋಣ": [{"type": "noun", "defs": ["something owed by one person to another or others; a debt; a loan.", "a defensive wall around a city, palace, etc.; a fort.", "water.", "obligation; indebtedness;-a) the condition or fact of being indebted to another for a favour or service received; b) a favour or service.", "(math.) the minus sign (-).", "ಋಣತೀರಿಸು řṇa tīrisu to discharge one's debt; to repay the loan availed; 2. to fulfil what one morally or socially owes to another or others; ಋಣಹರಿಸು řṇa harisu to free a person from his/her debt or obligation; ಋಣಹೊರಿಸು řṇa horisu to make another fall in debt or under obligation; 2. to cause another to owe gratitude as for a favour received; ಋಣಹೊರು řṇahoru to become a debtor 2. to be under the obligation of another; to be indebted."]}], "ಋಣಂಗುಡು": [{"type": "verb", "defs": ["to give money or something to another on the condition of being returned with or without interest; to lend.", "to help or favour another as to hold him under one's obligation."]}], "ಋಣಗಾರ": [{"type": "noun", "defs": ["a man owing something to another or others; a debtor.", "a man under moral or social obligation to another or others; an indebted or grateful man."]}], "ಋಣಗೂಳು": [{"type": "noun", "defs": ["food, (or fig. a favour) given gratis."]}], "ಋಣಚಿಹ್ನೆ": [{"type": "noun", "defs": ["(math.) the minus sign (-)."]}], "ಋಣತ್ರಯ": [{"type": "noun", "defs": ["(pl.) the three general indebtedness that all persons owe to a) the god, b) one's ancestors, and c) the teachers."]}], "ಋಣಧ್ರುವ": [{"type": "noun", "defs": ["the negative terminal of an electrolytic cell at which positively charged ions are discharged into the exterior electric circuit; a cathode."]}], "ಋಣನಿಧಾನ": [{"type": "noun", "defs": ["a deposit of money, valuables etc. that one is destined to get."]}], "ಋಣನಿಬದ್ಧ": [{"type": "noun", "defs": ["= ಋಣಗಾರ."]}], "ಋಣಪತ್ರ": [{"type": "noun", "defs": ["a voucher issued as a security by a company for money borrowed on the company's property, with a promise to pay a fixed rate of interest; a debenture."]}], "ಋಣಪಾತಕ": [{"type": "noun", "defs": ["a man who has failed to repay the loan he owes to another.", "an ungrateful man; an ingrate."]}], "ಋಣಬಾಧೆ": [{"type": "noun", "defs": ["the condition of being morally or legally bound to discharge one's debts, obligations, etc."]}], "ಋಣಭಯ": [{"type": "noun", "defs": ["the (moral) fear of the consequences of not discharging one's debt or obligations."]}], "ಋಣಭಾರ": [{"type": "noun", "defs": ["the quantum of a loan one owes to another or others.", "the oppressiveness of gratitude one owes to another or others; the consequent worrisomeness; encumbrance."]}], "ಋಣಮುಕ್ತ": [{"type": "adjective", "defs": ["free, discharged from a debt or an obligation."]}, {"type": "noun", "defs": ["he whohas liquidated his debts.", "he who is discharged from moral or social obligations."]}], "ಋಣಮುಕ್ತಿ": [{"type": "noun", "defs": ["the condition or state of being free from any debt or obligation."]}], "ಋಣಮುಕ್ತೆ": [{"type": "noun", "defs": ["she who liquidated her debts; she who is discharged from moral or social obligations."]}], "ಋಣವಿದ್ಯುತ್ತು": [{"type": "noun", "defs": ["the kind of electricity that predominates as in a body of resin after it has been rubbed with wool and has accumulated an excess of electrons; negative electricity."]}], "ಋಣವಿಮೋಚಕ": [{"type": "noun", "defs": ["he who clears, liquidates or discharges another from the burden of a loan or obligation."]}], "ಋಣವಿಮೋಚಕಿ": [{"type": "noun", "defs": ["she who clears, liquidates or discharges another from the burden of a loan or obligation."]}], "ಋಣವಿಮೋಚನೆ": [{"type": "noun", "defs": ["= ಋಣಮುಕ್ತಿ."]}], "ಋಣವ್ಯಾಪಾರ": [{"type": "noun", "defs": ["a transaction, as a sale, made not accompanied by immediate payment for it; a credit transaction."]}], "ಋಣಸಂಖ್ಯೆ": [{"type": "noun", "defs": ["the number or quantity to be subtracted from another; a subtrahend."]}], "ಋಣಸಂಬಂಧ": [{"type": "noun", "defs": ["= ಋಣಾನುಬಂಧ."]}], "ಋಣಸೂತಕ": [{"type": "noun", "defs": ["the sin consequent to one's failure to discharge his or her loan, obligation, etc."]}], "ಋಣಸ್ಥ": [{"type": "noun", "defs": ["a man to whom a debt is owed; esp. to whom money or goods are due; a creditor.", "a man who owes a debt; a debtor."]}], "ಋಣಸ್ಥೆ": [{"type": "noun", "defs": ["a woman to whom a debt is owed; esp. to whom money or goods are due; a creditor.", "a woman who owes a debt; a debtor."]}], "ಋಣಹರಿ": [{"type": "verb", "defs": ["(one's debt, obligation) to be discharged."]}], "ಋಣಾತ್ಮಕ": [{"type": "adjective", "defs": ["negative-a) lacking positive quality or character; b) containing, expressing or implying a denial or refusal; tending to say “no”; c) (math.) designating a quantity less than zero; d) (math.) that is to be subtracted; preceded by a minus sign; e) of, generating or charged with negative electricity."]}], "ಋಣಾದಾನ": [{"type": "noun", "defs": ["recovery of a debt."]}], "ಋಣಾನುಬಂಧ": [{"type": "noun", "defs": ["the relation, obligation etc. connected with or consequent to a debt.", "the relation between persons or results of one's deeds as pleasure, pain, agony, etc. contracted from one's previous birth."]}], "ಋಣಿ": [{"type": "noun", "defs": ["a person owing something to another or others; a debtor.", "a person under moral or social obligation to another or others; an indebted or grateful person."]}], "ಋಣಿಕೆ": [{"type": "noun", "defs": ["(accounting) an entry on the left-hand side of an account, showing an increase in assets, a decrease in liabilities, etc.; a debit entry."]}], "ಋಣಿಕೆಟಿಪ್ಪಣಿ": [{"type": "noun", "defs": ["a written document for having debited another's account; a debit note."]}], "ಋತ": [{"type": "noun", "defs": ["truth - a) that which is true; statement, etc. that accords with fact or reality; b) an established or verified fact, principle, law, etc.", "the sacred or divine rule; the cosmic, moral and spiritual order.", "righteousness - a) the condition or fact of acting in just, upright manner; virtuousness; b) the quality of being morally right, fair and just.", "a venerable man.", "livelihood by picking or gleaning grains in a field.", "a bright, intelligent, good-looking man.", "the sun.", "water.", "the moon.", "a swan, known for its graceful gait.", "an ascetic.", "darkness; want of light."]}], "ಋತಂಭರ": [{"type": "noun", "defs": ["the upholder of truth, righteousness; the Supreme God."]}], "ಋತಂಭರೆ": [{"type": "noun", "defs": ["the absolute consciousness free from limitations."]}], "ಋತಚಿತ್ತು": [{"type": "noun", "defs": ["the genuine, absolute knowledge."]}], "ಋತಜುಷ್ಟ": [{"type": "adjective", "defs": ["conforming or according to the established or verified fact, principle or law."]}], "ಋತದರ್ಶಿ": [{"type": "noun", "defs": ["a person that has realised the absolute nature of the Truth."]}], "ಋತಮಾರ್ಗ": [{"type": "noun", "defs": ["a path of righteousness; a virtuous way of doing, realising, etc."]}], "ಋತವಚನ": [{"type": "noun", "defs": ["a saying that has been popularly accepted as a truth."]}], "ಋತವಾಕ್ಯ": [{"type": "noun", "defs": ["= ಋತವಚನ."]}], "ಋತಶಕ್ತಿ": [{"type": "noun", "defs": ["the potential force, inherent power of the divine system or Absolute Truth."]}], "ಋತಿ": [{"type": "noun", "defs": ["the act of going, departing or moving away.", "a way, path to pass on.", "a blame, accusation or condemnation for the supposed wrong act or failure to perform in a right manner.", "a change to a better state; a progress; prosperity."]}], "ಋತೀಯೆ": [{"type": "noun", "defs": ["a censure; a blaming; reproach."]}], "ಋತು": [{"type": "noun", "defs": ["any of the six divisions of the year, each extending to a period of two months, characterised by or distinguished from each other by differences in temperature, precipitation, length of the day, etc.", "the periodic flow of blood and sloughed-off tissue from the uterus, discharged through the genital tract, normally about every four weeks in a woman who is not pregnant, from menarche to menopause; menses.", "a symbol for the number six.", "a time or season that is proper or favourable, in gen.", "a favourable time for conception.", "light; lustre; splendour."]}], "ಋತುಕಾಲ": [{"type": "noun", "defs": ["any of the six seasons, of two months each, of the year.", "the period during which menstruation occurs."]}], "ಋತುಕಾಲನಿಯಮ": [{"type": "noun", "defs": ["a rule governing the period or suggesting the proper time, for sexual intercourse."]}], "ಋತುಗೊಳ್": [{"type": "verb", "defs": ["(a woman) to have the periodic flow of blood and sloughed off tissue from the uterus."]}], "ಋತುಚಕ್ರ": [{"type": "noun", "defs": ["the cycle of menses in a woman, which normally happens once in every four-weeks."]}], "ಋತುದಾನ": [{"type": "noun", "defs": ["an instance of sexual intercourse with one's wife after she had the periodic flow of blood and slough off tissue from the uterus (supposed to be the proper time for conception)."]}], "ಋತುಧರ್ಮ": [{"type": "noun", "defs": ["all such rules having to do with the nature's activity and phenomena including the sphere of humans."]}], "ಋತುಧರ್ಮಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["the study of natural phenomena that recur periodically, as migration or blossoming, and of their relation to climate and changes in season; phenology."]}], "ಋತುಪ್ರತಾನ": [{"type": "noun", "defs": ["a combination of two or more seasons of the year."]}], "ಋತುಭೇದ": [{"type": "noun", "defs": ["the distinctive features of a season of the year."]}], "ಋತುಮತಿ": [{"type": "noun", "defs": ["a woman in her menses."]}], "ಋತುಯಾಪನ": [{"type": "noun", "defs": ["a spending or passing of a season of the year."]}], "ಋತುವಡೆ": [{"type": "verb", "defs": ["= ಋತುಗೊಳ್."]}], "ಋತುವಾಗು": [{"type": "verb", "defs": ["(a girl) to reach the first menstrual period, the stage when secondary sex characteristic develop and sexual reproduction first becomes possible."]}], "ಋತುವೃತ್ತಿ": [{"type": "noun", "defs": ["= ಋತುಚಕ್ರ."]}], "ಋತುಶಾಂತಿ": [{"type": "noun", "defs": ["a ceremony performed to a married girl at the time of her first menstrual period."]}], "ಋತುಸಮಯ": [{"type": "noun", "defs": ["= ಋತುಕಾಲ."]}], "ಋತುಸಾರ್ವಭೌಮ": [{"type": "noun", "defs": ["the personified spring season, considered as the king of all seasons."]}], "ಋತುಸ್ನಾತೆ": [{"type": "noun", "defs": ["a woman who has taken bath on the fourth day from the day menstruation occurred."]}], "ಋತುಸ್ನಾನ": [{"type": "noun", "defs": ["the bath taken by a woman on the fourth day from the day menstruation occurred."]}], "ಋತುಸ್ರಾವ": [{"type": "noun", "defs": ["menstrual discharge; menstruation; catamenia."]}], "ಋತ್ವ": [{"type": "noun", "defs": ["the letter'ಋ'."]}], "ಋತ್ವಿಕ್ಕು": [{"type": "noun", "defs": ["= (correctly) ಋತ್ವಿಜ."]}], "ಋತ್ವಿಜ": [{"type": "noun", "defs": ["a priest who officiates at a sacrifice."]}], "ಋದಂತ": [{"type": "noun", "defs": ["a word ending with the letter or with the sound of 'ಋ'."]}], "ಋದ್ಧ": [{"type": "adjective", "defs": ["prospered; flourished; thrived; succeeded; grown; increased."]}, {"type": "noun", "defs": ["heaped, piled or stored grain.", "a rich man."]}], "ಋದ್ಧಸತ್ವ": [{"type": "noun", "defs": ["a vigorous, potential man; a man having superior qualities."]}], "ಋದ್ಧಿ": [{"type": "noun", "defs": ["great plenty; abundance.", "a state characterised by abundant wealth.", "the fact of advancing toward perfection or to a higher or better state; progress.", "an achieving of something; accomplishment; esp. a getting supernatural powers.", "the plant Helicteres isora of Sterculiaceae family;", "a kind of medicinal substance made from it."]}], "ಋದ್ಧಿಪ್ರಾಪ್ತ": [{"type": "noun", "defs": ["he who has achieved, accomplished with, the desired aim or some supernatural powers."]}], "ಋದ್ಧಿಪ್ರಾಪ್ತಿ": [{"type": "noun", "defs": ["an achieving of the desired aim or supernatural power."]}], "ಋದ್ಧಿಮಂತ": [{"type": "noun", "defs": ["a rich man.", "a man skilled in the art of magic or possessing supernatural power."]}], "ಋದ್ಧಿಸಂಪನ್ನ": [{"type": "noun", "defs": ["a wealthy man."]}], "ಋಭು": [{"type": "noun", "defs": ["a deity; a divinity.", "a class of the attendants of gods."]}], "ಋವರ್ಣ": [{"type": "noun", "defs": ["either of the letters 'ಋ' or 'ೠ'."]}], "ಋಶ್ಯ": [{"type": "noun", "defs": ["an antelope with white spots on the body or white feet."]}], "ಋಶ್ಯಕೇತು": [{"type": "noun", "defs": ["(myth.) Aniruddha, who has the sign of an antelope in his banner."]}], "ಋಶ್ಯಶೃಂಗ": [{"type": "noun", "defs": ["the horn of a deer.", "a mythological seer."]}], "ಋಷಭ": [{"type": "noun", "defs": ["an adult, domesticated bull (Bos taurus).", "he who or that which is superior in his or its class; the best or most excellent man or thing.", "the first of the twenty four Jaina spiritual teachers.", "the second of the seven gross notes in the ascending scale of Indian music corresponding to the 'D' in the scale C major.", "the plant Carpopogon pruriens.", "the tail of a crocodile.", "the tail of a wild-boar."]}], "ಋಷಭಕ": [{"type": "noun", "defs": ["a kind of medicinal plant."]}, {"type": "noun", "defs": ["a medicinal plant ."]}], "ಋಷಭಪ್ರಿಯ": [{"type": "noun", "defs": ["(mus.) sixty second of the seventy two main modes in Karnāṭaka system."]}], "ಋಷಭವಾಹಿನಿ": [{"type": "noun", "defs": ["(mus.) a mode, in Karnāṭaka system, having six notes in ascending order and seven in descending and derived fromthe main mode Raghupriya."]}], "ಋಷಿ": [{"type": "noun", "defs": ["an inspired poet, sage or a singer of sacred hymns; a seer of the Vedic hymns.", "a sanctified sage, saint or ascetic.", "the most conspicuous of the northern constellations, situated between Lynx and Draco, and contains more than 50 visible stars, seven of which form the Big Dipper; Great Bear; Ursa major.", "a symbol for the number seven.", "ಋಷಿಗೆ ನೆಲವಿಲ್ಲ, ನದಿಗೆ ನೆಲೆಯಿಲ್ಲ řṣige nelavilla, nadige neleyilla (prov.) true human virtue must not be restricted to a small geographical territory."]}], "ಋಷಿ ಋಣ": [{"type": "noun", "defs": ["one of the three general indebtedness that all persons owe, i.e. to one's the teachers or sanctified sages."]}], "ಋಷಿಕಲ್ಪ": [{"type": "noun", "defs": ["one who is considered as or equal to a sanctified sage."]}], "ಋಷಿಕೆ": [{"type": "noun", "defs": ["a female seer of the Vedic hymns."]}], "ಋಷಿತ್ವ": [{"type": "noun", "defs": ["the status, rank or the fact of being, a saint; sainthood."]}], "ಋಷಿಧುರ್ಯ": [{"type": "noun", "defs": ["the best or most excellent among sanctified saints or sages; an epithet of Śiva."]}], "ಋಷಿನಿವೇದಕ": [{"type": "noun", "defs": ["one who heralds the coming of sages (into a hermitage, royal court, etc.)."]}], "ಋಷಿಪಂಚಮಿ": [{"type": "noun", "defs": ["a ceremony observed by women (who have crossed the stage of bearing children) on the fifth day of Bhādrapada the sixth month in Hindu Calendar."]}], "ಋಷಿಪುತ್ರಿ": [{"type": "noun", "defs": ["the plant Artemisia pallens of Asteraceae family with silvery-grey, aromatic leaves."]}], "ಋಷಿಪ್ರಿಯ": [{"type": "noun", "defs": ["(mus.) a mode, in Karnāṭaka system, derived from Kīravāṇi, six notes both in ascending and descending orders."]}], "ಋಷಿರೂಪಕ": [{"type": "noun", "defs": ["the external form of a sage."]}], "ಋಷಿವಧು": [{"type": "noun", "defs": ["the wife of a sage."]}], "ಋಷಿವಾಣಿ": [{"type": "noun", "defs": ["the revelation of a seer."]}], "ಋಷಿವಾಸ": [{"type": "noun", "defs": ["a kind of flute, a wind-instrument."]}], "ಋಷಿಶಕ್ತಿ": [{"type": "noun", "defs": ["the super-natural power of a sage."]}], "ಋಷ್ಟಿ": [{"type": "noun", "defs": ["a hand-held, long weapon with sharp-edged blade on one or both sides, and sharp point; a sword; a scimitar."]}], "ಋಷ್ಯ": [{"type": "noun", "defs": ["= ಋಶ್ಯ."]}], "ಋಷ್ಯಕೇತು": [{"type": "noun", "defs": ["= ಋಶ್ಯಕೇತು."]}], "ಋಷ್ಯಕೇತುಪ್ರಿಯ": [{"type": "noun", "defs": ["(mus.) a mode, in Karnāṭaka system, derived from the main mode Sarasāngi, and has six notes both in ascending and descending orders."]}], "ಋಷ್ಯಪ್ರೋಕ್ತೆ": [{"type": "noun", "defs": ["the plant Mucuna prurita ( = M. puriens) of Papilionaceae family.", "the plant Asparagus racemosus of Liliaceae family."]}], "ಋಷ್ಯಶೃಂಗ": [{"type": "noun", "defs": ["= ಋಶ್ಯಶೃಂಗ."]}], "ಎ": [{"type": "noun", "defs": ["the ninth letter and the ninth vowel of the Kannaḍa alphabet."]}], "ಎಂಕಲು": [{"type": "noun", "defs": ["a limb of a tree or shrub springing from the trunk or stem or from a bough; a branch."]}], "ಎಂಗ": [{"type": "noun", "defs": ["a stupid man."]}], "ಎಂಗಿ": [{"type": "noun", "defs": ["= ಎಂಗ."]}, {"type": "noun", "defs": ["a person who cheats habitually; a cheat; a swindler; a deceiver.", "the act of cheating; fraudulence."]}], "ಎಂಗಿಬೀಳು": [{"type": "verb", "defs": ["to be cheated or deceived."]}], "ಎಂಗಿನಾಣ್ಯ": [{"type": "noun", "defs": ["a fake coin; a counterfeit currency."]}], "ಎಂಚಲ್": [{"type": "noun", "defs": ["= ಎಂಜಲು."]}], "ಎಂಚೆಯ": [{"type": "noun", "defs": ["a kind of ornament for the ear."]}], "ಎಂಜಲ್": [{"type": "noun", "defs": ["= ಎಂಜಲು."]}], "ಎಂಜಲ": [{"type": "noun", "defs": ["= ಎಂಜಲು."]}], "ಎಂಜಲಗುಳು(ೞ್)": [{"type": "noun", "defs": ["a grain of rice left on the plate in which one has taken meals."]}], "ಎಂಜಲಿಗ": [{"type": "noun", "defs": ["a man who eats the left-overs in the plate in which another has taken meals.", "a religiously defiled man."]}], "ಎಂಜಲಿಸು": [{"type": "verb", "defs": ["to lick, eat a part of a thing touching it to the mouth, teeth or tongue.", "to defile a thing by doing so.", "to utter (a word or words)."]}], "ಎಂಜಲು": [{"type": "noun", "defs": ["the left-over in a dining plate; anything that has come into contact with the mouth, tongue or teeth or the hands of the person while taking food (considered defiled).", "the saliva spit out.", "anything that has been consumed, enjoyed, by another.", "(fig.) money or favour received for having shown some favour illegally or wrongly; bribe;", "ಎಂಜಲಕುಳಿ eñjalakuḷi a hallow or depression in the ground to spit the saliva, to dump the left-overs in a dining plate or leaves on which food is taken; ಎಂಜಲಕುೞಿ eñjalakułi = ಎಂಜಲಕುಳಿ; ಎಂಜಲಮಾತು eñjalamātu speech, sayings, words repeated by one, spoken by another earlier; ಎಂಜಲಿಗೆ ಹೇಸದವಳು ತಂಗಳು ಬಿಟ್ಟಾಳೆಯೇ? eñjalige hēsadavaḷu taŋgaḷu biṭṭāḷeyē? (prov.) an agreement with wretchedness never abhors servility; ಎಂಜಲು ಕೈಯಿಂದ ಕಾಗೆ ಹೊಡೆಯದಿರು eñjalu kaiyinda kāge hoḍeyadiru (prov.) to be very mean and miserly; not allow water slip through one's grasp; ಎಂಜಲಿಗೆ ಕೈಯೊಡ್ಡು eñjalige kaiyoḍḍu (derog.) to plead for money, to serve another abjectly for money at the cost of one's self-respect; to behave obsequiously; to cringe; ಎಂಜಲಿಗೆ ಬಾಯಿಬಿಡು eñjalige bāyibiḍu (derog.) to behave humbly or abjectly for some benefit or favour from another; ಎಂಜಲು ತಿನ್ನು eñjalau tinnu = ಎಂಜಲಿಗೆ ಕೈಯೊಡ್ಡು; ಎಂಜಲು ನೆಕ್ಕು eñjalau nekku = ಎಂಜಲಿಗೆ ಕೈಯೊಡ್ಡು."]}], "ಎಂಜಲುಗೂಳು": [{"type": "noun", "defs": ["food defiled by coming in contact with the mouth, teeth, dined plate or the hands of another eater; the left-over in another's dining plate."]}], "ಎಂಜಲುಗೋಮ": [{"type": "noun", "defs": ["(correctly, ಎಂಜಲುಗೋಮಯ) the act of washing using cow dung the place where the dining plate or platter was laid."]}], "ಎಂಜಲುದುಡ್ಡು": [{"type": "noun", "defs": ["(dial.) the money got the previous day.", "money received as a bribe."]}], "ಎಂಜಲುಬಂಡಿದೇವರು": [{"type": "noun", "defs": ["a god worshipped by a sect among farming community.", "a ceremony observed by a sect among farming community, on the day of piercing the ear-lobe of one's second or subsequent child."]}], "ಎಂಜಲುರುಳು": [{"type": "noun", "defs": ["a religious vow of rolling oneself on the dined leaves (esp. in a temple or religious place) and the act of doing so."]}], "ಎಂಜಲುವಾತು": [{"type": "noun", "defs": ["= ಎಂಜಲಮಾತು."]}], "ಎಂಜಲುಹಾಳೆ": [{"type": "noun", "defs": ["= ಎಂಜಲೆಲೆ."]}], "ಎಂಜಲೆಲೆ": [{"type": "noun", "defs": ["a leaf or platter on which one has dined."]}], "ಎಂಜಲೆವುೞು": [{"type": "noun", "defs": ["= ಎಂಜಲಗುಳು."]}], "ಎಂಜಲೋದನ": [{"type": "noun", "defs": ["=(gram. a heterogenous compound) ಎಂಜಲುಗೂಳು."]}], "ಎಂಜಲ್ಗೂೞ್": [{"type": "noun", "defs": ["= ಎಂಜಲುಗೂಳು."]}], "ಎಂಜಲ್ವಾತು": [{"type": "noun", "defs": ["= ಎಂಜಲಮಾತು."]}], "ಎಂಜನಿಯರಿಕೆ": [{"type": "noun", "defs": ["the work, profession of an engineer."]}], "ಎಂಜನಿಯರು": [{"type": "noun", "defs": ["a person skilled or occupied in some branch of engineering; an engineer."]}], "ಎಂಟಡಿ": [{"type": "noun", "defs": ["a mythological animal with eight feet, believed to overpower a lion."]}], "ಎಂಟಡಿಗ": [{"type": "noun", "defs": ["= ಎಂಟಡಿ."]}], "ಎಂಟಡಿವರಿಜ": [{"type": "noun", "defs": ["Vīrabhadra, a formidable god with terrible aspects, created by Śiva, in his wrath, to destroy the sacrifice of Dakṣa."]}], "ಎಂಟು": [{"type": "adjective", "defs": ["totalling one more than seven; eight.", "ಎಂಟುವರ್ಷಕ್ಕೆ ನನ್ನ ಮಗ ದಂಟು ಅಂದ eṇṭu varṣakke nanna maga daṇṭu anda (prov.) (said of a dull witted child) he had passed his teens by the time he could know A is the first letter of the alphabet."]}, {"type": "noun", "defs": ["the cardinal number between seven and nine; 8."]}], "ಎಂಟುಗೆಯ್": [{"type": "verb", "defs": ["to divide into eight parts."]}], "ಎಂಟುಹಿಟ್ಟು": [{"type": "noun", "defs": ["(obs.) eight artisanships or trades of earning one's livelihood.", "the chief of each of such artisan group."]}], "ಎಂಟೆಡೆ": [{"type": "noun", "defs": ["the eight places where the pearls are supposed to be born (the temples of an elephant, the hood of a serpent, the tusk of a boar, bamboo, a mountain, a marine shark [cartilaginous fish], an oyster, and a conch of a marine mollusc)."]}], "ಎಂಟೆದೆ": [{"type": "noun", "defs": ["(fig.) extraordinary courage."]}], "ಎಂಟೆಯ": [{"type": "noun", "defs": ["a circlet, usu. of precious metal, worn on the finger; a ring."]}], "ಎಂಟೆರಡವತೆ": [{"type": "noun", "defs": ["(pl.) the ten different stages of the sufferings while being separated from one's lover."]}], "ಎಂಟೆರಡು": [{"type": "noun", "defs": ["number equal to the total of eight and two; ten."]}], "ಎಂಟೆರ್ದೆ": [{"type": "noun", "defs": ["= ಎಂಟೆದೆ."]}], "ಎಂಟೊಡಲ": [{"type": "noun", "defs": ["Śiva, who manifests himself in eight different forms."]}], "ಎಂಡೆ": [{"type": "noun", "defs": ["the excrement of a cow; cow-dung.", "a lump of earth, clay, loam etc.; clod."]}], "ಎಂತ": [{"type": "pronoun", "defs": ["(used as an interrogative pron.) (dial.) which thing, event, circumstance etc."]}, {"type": "adverb", "defs": ["how? in what respect?."]}, {"type": "adjective", "defs": ["what?; which?."]}], "ಎಂತಪ್ಪ": [{"type": "adjective", "defs": ["= ಎಂತಹ."]}], "ಎಂತಹ": [{"type": "adjective", "defs": ["of what time; of which manner."]}, {"type": "noun", "defs": ["a man of which type; a man of such and such a type.", "ಎಂತೆಂತಹವರಿಗೆಲ್ಲ ಅಂತರಾಟವಾಗಿರಬೇಕಾದರೆ ಕಾಲಿಲ್ಲದವರಿಗೆ ಕೈಲಾಸವೇ? ententahavarigella antarāṭavāgira bēkādare kālilladavarige Kailāsavē? (prov.) when stalwarts have failed, will a novice do?'."]}], "ಎಂತಹಂ": [{"type": "noun", "defs": ["= ಎಂತಹ2."]}], "ಎಂತಾನುಂ": [{"type": "adverb", "defs": ["in whatever way; by whatever means."]}], "ಎಂತು": [{"type": "adverb", "defs": ["in what manner or way; by what means; how.", "for what reason or purpose; why."]}], "ಎಂತಕ್ಕೆ": [{"type": "adverb", "defs": ["in whatever way; by whatever means."]}], "ಎಂತುಂ": [{"type": "adverb", "defs": ["in whatever way; by whatever means.", "no matter how; however; nevertheless."]}], "ಎಂತುಟು": [{"type": "adjective", "defs": ["how much."]}, {"type": "adverb", "defs": ["in whatever way; by whatever means."]}], "ಎಂಥ": [{"type": "adjective", "defs": ["= ಎಂತಹ."]}], "ಎಂದಡೆ": [{"type": "conjunction", "defs": ["= ಎಂದರೆ."]}], "ಎಂದರೆ": [{"type": "conjunction", "defs": ["that means; by that it means.", "if said so."]}], "ಎಂದಿಗ": [{"type": "noun", "defs": ["a variety of fish."]}], "ಎಂದು": [{"type": "adverb", "defs": ["when - a) at what time; when; on what day; b) on what occasion."]}, {"type": "pronoun", "defs": ["the day on which; the time when."]}, {"type": "adverb", "defs": ["which (particular) day; when.", "ಎಂದಾದರೂ endādarū whenever; any day; ಎಂದಿಗೂ endigū = ಎಂದೂ; ಎಂದಿಗೆ endige by when; by what time or day; ಎಂದೂ endū ever - a) at all times; always; b) at any time; 2. (as a first word of a composition with a negative verb, used for emphasising that verb as in ಎಂದೂ ಇಲ್ಲ, ಎಂದೂ ಕಾಣುವುದಿಲ್ಲ etc. ಎಂದೂ ಓದದ ಮಾಣಿ ಅಮವಾಸ್ಯೆಯ ದಿನ ಓದಲಿಕ್ಕೆ ಕುಳಿತ endū ōdada māṇi amāvasyeya dina ōdalikke kuḷita (prov.) an indolent man started his venture on an inauspicious day."]}, {"type": "conjunction", "defs": ["(in narration of a dialogue) so; like this."]}], "ಎಂದುಂ": [{"type": "adverb", "defs": ["= ಎಂದೂ (see under ಎಂದು3)."]}], "ಎಂದೊಡೆ": [{"type": "conjunction", "defs": ["= ಎಂದರೆ."]}], "ಎಂಪರಲಾಡಿಸು": [{"type": "verb", "defs": ["to search, examine, thoroughly."]}], "ಎಂಪರಾಡಿಸು": [{"type": "verb", "defs": ["= (correctly) ಎಂಪಲಾಡಿಸು."]}], "ಎಂಪಲಾಡಿಸು": [{"type": "verb", "defs": ["to give trouble to; to annoy; to molest."]}], "ಎಂಪಲಿ": [{"type": "noun", "defs": ["the plant Tephrosia purpurea of Papilionaceae family."]}], "ಎಂಪಾಲಾಡಿಸು": [{"type": "verb", "defs": ["= ಎಂಪಲಾಡಿಸು."]}], "ಎಂಬ": [{"type": "conjunction", "defs": ["so called; by name."]}], "ಎಂಬತ್ತು": [{"type": "adjective", "defs": ["eight times ten; eighty."]}, {"type": "noun", "defs": ["the cardinal number eighty; 80."]}], "ಎಂಬಲ": [{"type": "noun", "defs": ["sour butter-milk."]}], "ಎಂಬುಕೆಯ್": [{"type": "verb", "defs": ["to do, carryout what is told."]}], "ಎಂಬುವಿಕೆ": [{"type": "noun", "defs": ["the act of speaking."]}], "ಎಂಭತ್ತು": [{"type": "adjective", "defs": ["= (correctly) ಎಂಬತ್ತು¹."]}, {"type": "noun", "defs": ["= (correctly) ಎಂಬತ್ತು²."]}], "ಎಕಡು": [{"type": "noun", "defs": ["a condition characterised by repeated, sudden, involuntary contractions of the diaphragm when it begins to allow air into the lungs only to have the glottis suddenly close, producing an abrupt sound; hiccup."]}], "ಎಕತ್ಯಾರು": [{"type": "noun", "defs": ["authority; control."]}], "ಎಕನಾತಿ": [{"type": "noun", "defs": ["a minor folk deity."]}], "ಎಕರ": [{"type": "noun", "defs": ["a man of object nature or conduct."]}], "ಎಕರಾರು": [{"type": "noun", "defs": ["the act of confessing; acknowledgement; esp. a) an admission of guilt, b) a general acknowledgment of sin, wrongs committed."]}], "ಎಕರು": [{"type": "noun", "defs": ["= ಎಕರೆ."]}], "ಎಕರೆ": [{"type": "noun", "defs": ["a unit of land measure equal to 160 square rods or 43,560 square feet (0.405 hectare); an acre."]}], "ಎಕಲುಗದ್ದೆ": [{"type": "noun", "defs": ["an irrigated field having fine clay mixed with sand."]}], "ಎಕಲ್ಲೆ": [{"type": "noun", "defs": ["= ಎಕಲ್ಲೇಮನುಷ್ಯ.", "the quality or state of the mind having only one aim or purpose at a time; single-mindedness."]}], "ಎಕಲ್ಲೇಮನುಷ್ಯ": [{"type": "noun", "defs": ["a man having only one aim or purpose; a single-minded man."]}], "ಎಕಳೆ": [{"type": "noun", "defs": ["a stupid woman."]}], "ಎಕಾರ": [{"type": "noun", "defs": ["the letter 'ಎ'."]}], "ಎಕಾರವಿಧಿ": [{"type": "noun", "defs": ["the rule governing the usage of the letter 'ಎ'."]}], "ಎಕಾರಾಂತ": [{"type": "adjective", "defs": ["ending with the letter 'ಎ'."]}, {"type": "noun", "defs": ["the fact or an instance of a word ending with the letter 'ಎ'."]}], "ಎಕೈ": [{"type": "noun", "defs": ["a linear measure equal to seven cubits (the length of the arm from the end of the middle finger to the elbow)."]}], "ಎಕೈಯಿ": [{"type": "noun", "defs": ["= ಎಕೈ."]}], "ಎಕ್ಕ": [{"type": "noun", "defs": ["the plant Calotropis gigantea ( = C. procera) of Asclepiadaceae family; the sun-plant.", "ಎಕ್ಕಹುಟ್ಟಿಸು ekkahuṭṭisu to destroy completely; ಎಕ್ಕಹುಟ್ಟು ekkahuṭṭu to be destroyed completely; to become bankrupt."]}, {"type": "noun", "defs": ["the number expressing unity or designating a single unit; the lowest cardinal number; one; 1.", "the number in the first digit position from right in a multi-digit number; the number in the position just to the left of the decimal point.", "a cart drawn by a single ox or horse.", "the number or a mark indicating it, on a dice.", "a playing card marked with one spot; ace."]}], "ಎಕ್ಕಂ": [{"type": "noun", "defs": ["a single-stringed musical instrument."]}], "ಎಕ್ಕಂಜಿ": [{"type": "noun", "defs": ["a kind of stringed musical instrument."]}], "ಎಕ್ಕಂಡೆ": [{"type": "noun", "defs": ["a physically well-built person."]}], "ಎಕ್ಕಚರ": [{"type": "noun", "defs": ["he who walks or travels alone."]}], "ಎಕ್ಕಛಾಯ": [{"type": "noun", "defs": ["a single colour (not mixed).", "a variety in the corundum or sapphire."]}], "ಎಕ್ಕಟ": [{"type": "noun", "defs": ["a man being alone."]}], "ಎಕ್ಕಟಗಲಿ": [{"type": "noun", "defs": ["he who relies on only himself or his own abilities in fighting; a self-reliant hero."]}], "ಎಕ್ಕಟಾಗೆ": [{"type": "noun", "defs": ["(dial.) one of the several portions of a whole."]}], "ಎಕ್ಕಟಿ": [{"type": "adjective", "defs": ["being alone; by oneself; alone; solitary."]}, {"type": "noun", "defs": ["he who is alone or by himself.", "the state of being alone; loneliness."]}, {"type": "adverb", "defs": ["in secret; without others' notice."]}], "ಎಕ್ಕಟಿಕರೆ": [{"type": "verb", "defs": ["= ಎಕ್ಕಟಿಗರೆ."]}], "ಎಕ್ಕಟಿಗ": [{"type": "noun", "defs": ["a man who keeps close and secret watch on another or others without being noticed.", "a man being alone.", "a trust-worthy man with whom one can confide or share secretes."]}], "ಎಕ್ಕಟಿಗರೆ": [{"type": "verb", "defs": ["to bring, take or invite to a lonely or secret place; to call aside."]}], "ಎಕ್ಕಟಿಗಾಳೆಗ": [{"type": "noun", "defs": ["a one-to-one fight (not involving not more than one person on each side)."]}], "ಎಕ್ಕಟಿಗೈ": [{"type": "verb", "defs": ["to talk to another secretly."]}], "ಎಕ್ಕಟೆ": [{"type": "noun", "defs": ["= ಎಕ್ಕಟಿ1."]}], "ಎಕ್ಕಡ": [{"type": "noun", "defs": ["a light footwear slipped on the foot, without a belt to tie on the back side of the foot."]}], "ಎಕ್ಕಡಿ": [{"type": "noun", "defs": ["a game played with dice."]}], "ಎಕ್ಕಡಿಗ": [{"type": "noun", "defs": ["= ಎಕ್ಕಟಿಗ."]}], "ಎಕ್ಕಡು": [{"type": "noun", "defs": ["= ಎಕಡು."]}], "ಎಕ್ಕತಕ್ಕು": [{"type": "noun", "defs": ["(one's) ability or capacity that matches with that of another."]}], "ಎಕ್ಕತಳ": [{"type": "noun", "defs": ["a place agreed to meet at by two or more persons."]}], "ಎಕ್ಕತಳಂಗೊಳ್": [{"type": "verb", "defs": ["to consider (more than one thing, person, etc.) alike or equal."]}], "ಎಕ್ಕತಾಣ": [{"type": "noun", "defs": ["= ಎಕ್ಕದಾಣ."]}], "ಎಕ್ಕತಾಳ": [{"type": "noun", "defs": ["an agreeable combination of sounds; harmony.", "one of the seven kinds of 'time-keeping' in music."]}], "ಎಕ್ಕತಾಳಿ": [{"type": "noun", "defs": ["a holding up to scorn or contempt; mocking; ridicule; mockery."]}], "ಎಕ್ಕತುಳ": [{"type": "noun", "defs": ["(one's) strength, ability or capacity that matches with that of another.", "great bravery; valour; boldness.", "a fight or wrestling between only two persons (not involving any one else on either side).", "acting or done rashly or with sudden energy."]}], "ಎಕ್ಕತುಳದಾಳ್": [{"type": "noun", "defs": ["a man admired for his courage and bravery."]}], "ಎಕ್ಕತುಳಂ": [{"type": "adverb", "defs": ["in great quantity or vehemence; vehemently; excessively."]}], "ಎಕ್ಕತೂಳ": [{"type": "noun", "defs": ["= ಎಕ್ಕತುಳ."]}], "ಎಕ್ಕದಾಣ": [{"type": "noun", "defs": ["a place of resort or protection; a shelter."]}], "ಎಕ್ಕದಾಳೆ": [{"type": "noun", "defs": ["the tree Bombax malabaricum ( = B. ceiba) of Bombacaceae family; red silk cotton tree."]}], "ಎಕ್ಕನಾತಿ": [{"type": "noun", "defs": ["a minor folk deity."]}], "ಎಕ್ಕನಾದಿ": [{"type": "noun", "defs": ["= ಎಕ್ಕನಾತಿ."]}], "ಎಕ್ಕಬಾಗೆ": [{"type": "noun", "defs": ["one of the several portions of a whole."]}], "ಎಕ್ಕಮದ್ದಳೆ": [{"type": "noun", "defs": ["a percussion instrument which is beaten only on one side (instead of two sides usu.) to make sound."]}], "ಎಕ್ಕರ": [{"type": "noun", "defs": ["a contemptible, ignoble man; a mean fellow."]}], "ಎಕ್ಕರಿಸು": [{"type": "verb", "defs": ["to make another the object of scornful laughter; to deride; to ridicule."]}], "ಎಕ್ಕಲ": [{"type": "noun", "defs": ["a man who is lonely.", "a male elephant.", "a wild boar (Sus scrofa).", "name of a hell.", "the most excellent man in a class of men."]}], "ಎಕ್ಕಲಕುಂಡ": [{"type": "noun", "defs": ["(myth.) a pit with huge fire in the hell."]}], "ಎಕ್ಕಲಗದ್ದೆ": [{"type": "noun", "defs": ["= ಎಕ್ಕಲುಗದ್ದೆ."]}], "ಎಕ್ಕಲಗಾಣ": [{"type": "noun", "defs": ["a singer, singing without being accompanied by another singer or instruments; a solo singer."]}], "ಎಕ್ಕಲದೇವಿ": [{"type": "noun", "defs": ["(myth.) Rēṇuke, the mother of Paruśurāma, worshipped as the cosmic energy."]}], "ಎಕ್ಕಲನರಕ": [{"type": "noun", "defs": ["(myth.) a hell where the most severe punishment is awarded to the sinners."]}], "ಎಕ್ಕಲಬಂಟ": [{"type": "noun", "defs": ["he who relies on only himself or his own abilities in fighting; a self-reliant hero."]}], "ಎಕ್ಕಲರಾಯ": [{"type": "noun", "defs": ["a king who can fight in battles relying only on his own strength; a valorous king."]}], "ಎಕ್ಕಲವಂದಿ": [{"type": "noun", "defs": ["a wild boar (Sus scrofa) that moves alone in the forest (supposed to be very furious)."]}], "ಎಕ್ಕಲವಿರಿ": [{"type": "noun", "defs": ["= ಎಕ್ಕಲದೇವಿ."]}], "ಎಕ್ಕಲು": [{"type": "noun", "defs": ["fine clay mixed with sand."]}], "ಎಕ್ಕಲುಗದ್ದೆ": [{"type": "noun", "defs": ["an irrigated field having fine clay mixed with sand."]}], "ಎಕ್ಕವಡ": [{"type": "noun", "defs": ["a light footwear slipped on the foot, without a belt to tie on the back side of the foot."]}, {"type": "noun", "defs": ["a long piece of cloth used for catching birds."]}], "ಎಕ್ಕವತ್ತ": [{"type": "noun", "defs": ["the herb Centella asiatica ( = Hydroctyle asiatica) of Apiaceae ( = Umbelliferae) family; Indian penny wort."]}], "ಎಕ್ಕವತ್ತಿ": [{"type": "noun", "defs": ["= ಎಕ್ಕವತ್ತ."]}], "ಎಕ್ಕವತ್ತಿಗೆ": [{"type": "noun", "defs": ["a variety in betel vine."]}], "ಎಕ್ಕವದ್ದಳೆ": [{"type": "noun", "defs": ["= ಎಕ್ಕಮದ್ದಳೆ."]}], "ಎಕ್ಕವಳಿ": [{"type": "noun", "defs": ["= ಎಕ್ಕಸರ1."]}], "ಎಕ್ಕವಿಂಡು": [{"type": "noun", "defs": ["a multitude of students."]}], "ಎಕ್ಕಸ": [{"type": "noun", "defs": ["quickness; rapidity; swiftness.", "undue pride; exaggerated self-esteem; conceit."]}], "ಎಕ್ಕಸಕ್ಕ": [{"type": "noun", "defs": ["a speech, talk that is incoherent or senseless.", "a man who talks senselessly.", "(dial.) excessiveness; abundance.", "confused state of the mind or the situation causing it."]}], "ಎಕ್ಕಸಕ್ಕಂಗೆಡೆ": [{"type": "verb", "defs": ["to talk senselessly or incoherently."]}], "ಎಕ್ಕಸಕ್ಕತನ": [{"type": "noun", "defs": ["the quality of talking incoherently or senselessly; perverseness.", "lack of order; disorderliness; confused state of affairs."]}], "ಎಕ್ಕಸಕ್ಕೆ": [{"type": "noun", "defs": ["a woman who talks senselessly or incoherently."]}], "ಎಕ್ಕಸರ": [{"type": "noun", "defs": ["(correctly ಏಕಾವಳಿ) a necklace of a single string."]}, {"type": "noun", "defs": ["a single arrow."]}, {"type": "noun", "defs": ["a single voice.", "something uttered by many persons, but together that seems to be a single voice."]}, {"type": "noun", "defs": ["continuity of anything (as happening of incidents, performing without a break etc.)."]}], "ಎಕ್ಕಸರ5": [{"type": "noun", "defs": ["a moving or travelling alone."]}], "ಎಕ್ಕಸಿಕ್ಕ": [{"type": "noun", "defs": ["= ಎಕ್ಕಸಕ್ಕ."]}], "ಎಕ್ಕಸಿಕ್ಕಬಾಜಿಗ": [{"type": "noun", "defs": ["a man who talks senselessly or incoherently."]}], "ಎಕ್ಕಸಿರ್ಕ": [{"type": "noun", "defs": ["= ಎಕ್ಕಸಕ್ಕ."]}], "ಎಕ್ಕಸೆಕ್ಕ": [{"type": "noun", "defs": ["= ಎಕ್ಕಸಕ್ಕ."]}], "ಎಕ್ಕಸೊಕ್ಕಿ": [{"type": "noun", "defs": ["= ಎಕ್ಕಸಕ್ಕೆ."]}]}