{"ಭೂ": [{"type": "noun", "defs": ["the earth.", "the first of the seven worlds.", "(phil.) the earth as one of the five basic elements, representing grossness of the physical objects including the bodies of living beings.", "(pros.) a meter consisting of three long syllablic instants (---); molassus."]}], "ಭೂಂಕೃತಿ": [{"type": "noun", "defs": ["the hissing sound of a snake."]}], "ಭೂಆಕೃತಿವಿಜ್ಞಾನ": [{"type": "noun", "defs": ["the science dealing with the nature and origin of the earth's topographic features including those under the sea; geomorphology."]}], "ಭೂಔಷ್ಣಿಕ": [{"type": "adjective", "defs": ["pertaining to the heat of the earth's interior; geothermic."]}], "ಭೂಕಂದಾಯ": [{"type": "noun", "defs": ["a tax levied on land (as agricultural, building sites, etc.)."]}], "ಭೂಕಂಪ": [{"type": "noun", "defs": ["a shaking or trembling of the crust of the earth, caused by underground volcanic forces or by breaking and shifting of rock beneath the surface; earth-quake.", "(fig.) a sudden explosion or outburst of one's wrath."]}], "ಭೂಕಂಪನ": [{"type": "noun", "defs": ["= ಭೂಕಂಪ."]}], "ಭೂಕಡವ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಭೂಕಾಂತ": [{"type": "noun", "defs": ["the ruler of a state; a king."]}], "ಭೂಖಂಡ": [{"type": "noun", "defs": ["any of the six or seven great divisions of land on the globe (as Asia, Africa, Australia, Europe, North and South America, Europe, and sometimes, Antarctica); a continent."]}], "ಭೂಖರ್ಜೂರ": [{"type": "noun", "defs": ["a species of palm."]}], "ಭೂಗತ": [{"type": "adjective", "defs": ["being or existing, occurring, working, placed, used, etc. beneath the surface of the earth; underground.", "secret; hidden; undercover."]}, {"type": "noun", "defs": ["that which is or is existing, occurring, working, placed, used, etc. beneath the surface of the earth; underground.", "the condition of being completely demolished, raised to the ground."]}], "ಭೂಗರ್ಭ": [{"type": "noun", "defs": ["the interior of the earth."]}], "ಭೂಗರ್ಭಜಲ": [{"type": "noun", "defs": ["water seeped into, available under the surface of the earth; underground water."]}], "ಭೂಗರ್ಭಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["the science that deals with the dynamics and physical history and nature of the earth, formation and composition of the rocks, and the physical, chemical, and biological changes that the earth has undergone or is undergoing; geology."]}], "ಭೂಗರ್ಭಶಾಸ್ತ್ರಜ್ಞ": [{"type": "noun", "defs": ["(masc.) a specialist in geology; a geologist."]}], "ಭೂಗರ್ಭಶಾಸ್ತ್ರಜ್ಞೆ": [{"type": "noun", "defs": ["(fem.) a specialist in geology; a geologist."]}], "ಭೂಗುಗ್ಗಳ": [{"type": "noun", "defs": ["a kind of balsam tree (?)."]}], "ಭೂಗುಗ್ಗುಳು": [{"type": "noun", "defs": ["= ಭೂಗುಗ್ಗಳ."]}], "ಭೂಗುಣ": [{"type": "noun", "defs": ["the physical features of a nation or part of the nation.", "quality of the soil (particularly with reference to its use in agriculture."]}], "ಭೂಗೃಹ": [{"type": "noun", "defs": ["a room or group of rooms below the ground level and usu. under a building; cellar floor of a building."]}], "ಭೂಗೋಚರ": [{"type": "noun", "defs": ["the inhabitant of the earth, chiefly the human beings."]}], "ಭೂಗೋಲ": [{"type": "noun", "defs": ["= ಭೂಗೋಳ."]}], "ಭೂಗೋಳ": [{"type": "noun", "defs": ["= ಭೂಗೋಳಶಾಸ್ತ್ರ.", "the earth of geoid shape."]}], "ಭೂಗೋಳಕಲ್ಪ": [{"type": "noun", "defs": ["the earth viewed as a hypothetical ellipsoid with the surface represented as a mean sea level; the geoid."]}], "ಭೂಗೋಳಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["the descriptive science dealing with the surface of the earth, its division into continents and countries, and the climate, plants, animals, natural resources, inhabitants, and industries of the various divisions; geography."]}], "ಭೂಗೋಳಶಾಸ್ತ್ರಜ್ಞ": [{"type": "noun", "defs": ["a man who has studied and well versed in geography; a man who has specialised in geographical research, delineation and study; a geographer."]}], "ಭೂಗೋಳಶಾಸ್ತ್ರಜ್ಞೆ": [{"type": "noun", "defs": ["a woman who has studied and well versed in geography; a woman who has specialised in geographical research, delineation and study; a geographer."]}], "ಭೂಚಕ್ರ": [{"type": "noun", "defs": ["the entire earth."]}], "ಭೂಚಕ್ರಬಳ್ಳಿ": [{"type": "noun", "defs": ["the vine Convolvulus arvensis of Convolvulaceae family."]}], "ಭೂಚಕ್ರಿ": [{"type": "noun", "defs": ["an emperor who rules the entire or most part of the, earth."]}], "ಭೂಚರ": [{"type": "noun", "defs": ["the act of living, moving on land.", "an animal living on land (rather than in water, in the air, in trees, etc.).", "(in part.) a human being or human being collectively."]}], "ಭೂಚರತ್ವ": [{"type": "noun", "defs": ["the fact of living, moving on land.", "a mystical power that helps to move freely anywhere on land."]}], "ಭೂಚೆಕ್ಕೆಗೆಡ್ಡೆ": [{"type": "noun", "defs": ["the plant Ipomoea digitata of Convolvulaceae family.", "its starchy tuberous root."]}], "ಭೂಚ್ಛಾಯ": [{"type": "noun", "defs": ["darkness; lack of light.", "the shadow of the earth.", "Rāhu, the mythological serpent demon and one of the nine astrological planets."]}], "ಭೂಚ್ಛಾಯೆ": [{"type": "noun", "defs": ["= ಭೂಚ್ಛಾಯ - 1 & 2."]}], "ಭೂಚ್ಛೇದಕ": [{"type": "noun", "defs": ["a man who cuts or digs the land surface (for making roads)."]}], "ಭೂಜ": [{"type": "noun", "defs": ["the tree Butea bojapatra of Papilionaceae family, the smooth bark of which can easily be peeled off in thin sheets; a birch tree."]}, {"type": "noun", "defs": ["anything that is born in or from the earth (as a plant); (gen.) a tree."]}], "ಭೂಜಂತು": [{"type": "noun", "defs": ["a kind of snail or snail-shell(?) ."]}], "ಭೂಜಟೆ": [{"type": "noun", "defs": ["a kind of plant ."]}], "ಭೂಜಾಂಗವೃತ್ತಿ": [{"type": "noun", "defs": ["the attitude of not being prepared for facing a danger beforehand."]}], "ಭೂಜಾತ": [{"type": "noun", "defs": ["= ಭೂಜ2."]}], "ಭೂಜಾತೆ": [{"type": "noun", "defs": ["Sīte, the daughter of the earth and the heroine in the epic Rāmāyaṇa."]}], "ಭೂಜಾನಿ": [{"type": "noun", "defs": ["the ruler of the land; a king."]}], "ಭೂತ": [{"type": "adjective", "defs": ["gone; past.", "actually happened; true; real.", "proper; appropriate.", "consisted of; mixed, associated with.", "similar; equal; like."]}, {"type": "noun", "defs": ["something that actually exists or existed; reality; truth; fact.", "that which took place, happened or was.", "a thing that has been got, obtained or received.", "Śiva.", "a class of attendants of Śiva.", "any of or collectively all, the living beings.", "the disembodied soul of a dead person, supposed to be wandering and haunt human being; a ghost.", "(esp.) such a soul of a person who died in fire.", "the phenomenal world.", "a class of demi-gods.", "that which is gone, slipped or past.", "any of the nine astrological planets.", "an elderly and respectable man.", "(phil.) any of the five basic elements which constitute all the physical matter in the phenomenal world.", "(adj.) the quality or fact of being of extraordinary or unusual size.", "(math.) a symbol for the number five.", "(gram.) the past tense.", "ಭೂತ ಮೆಟ್ಟುಕೊಳ್ಳು bhūta meṭṭikoḷḷu = ಭೂತ ಹಿಡಿ; ಭೂತ ಹಿಡಿ bhūta hiḍi (an evil spirit) to possess a person."]}], "ಭೂತಕರುಳು": [{"type": "noun", "defs": ["a small-sized tree or shrub Helieteres isora of Sterculiaceae family, with fibrous bark."]}], "ಭೂತಕಾಲ": [{"type": "noun", "defs": ["the time, period of time that is past or spent.", "(gram.) the past tense."]}], "ಭೂತಕಾಲಕ್ರಿಯೆ": [{"type": "noun", "defs": ["the verb with terminations suitable for past tense."]}], "ಭೂತಕೇಶ": [{"type": "noun", "defs": ["the plant Nardostachys jatamansi, of Valerianaceae family, that yields a fragrant ointment used in ancient times; spikenard."]}], "ಭೂತಕೇಶಿ": [{"type": "noun", "defs": ["the tree Elaeodendron glaucum of Celestraceae family."]}], "ಭೂತಕೋಲ": [{"type": "noun", "defs": ["(dial.) worshipping or propitiation of a daemon or a heathen god.", "(dial.) a ceremony and a dance connected with this worship."]}], "ಭೂತಗಣ": [{"type": "noun", "defs": ["a multitude of daemons or ghosts.", "a class of demigods who attend Śiva."]}], "ಭೂತಗಣೇಶ": [{"type": "noun", "defs": ["= ಭೂತನಾಥ.", "(pros.) the sign for a long syllable (-)."]}], "ಭೂತಗನ್ನಡಿ": [{"type": "noun", "defs": ["a concave mirror that magnifies the images of objects.", "(loosely) a lens that makes an object look much bigger than actually it is, when seen through it; a magnifying glass."]}], "ಭೂತಗಾಜು": [{"type": "noun", "defs": ["a lens that makes an object look much bigger than actual it is, when seen through it; a magnifying glass."]}], "ಭೂತಚತುಷ್ಟಯ": [{"type": "noun", "defs": ["(phil.) collectively the four basic elements the earth, water, fire and air believed to constitute all physical matter."]}], "ಭೂತಚಿಕಿತ್ಸೆ": [{"type": "noun", "defs": ["the act or process of driving an evil spirit out or away by incantations and other rituals; exorcism."]}], "ಭೂತಚೇಷ್ಟೆ": [{"type": "noun", "defs": ["the annoyance esp. frequent one, caused by an evil spirit."]}], "ಭೂತದಯ": [{"type": "noun", "defs": ["= ಭೂತದಯೆ."]}], "ಭೂತದಯೆ": [{"type": "noun", "defs": ["compassion towards all the living beings."]}], "ಭೂತದೇಹಿ": [{"type": "noun", "defs": ["any living being having a physical body made of the five basic elements."]}], "ಭೂತಧಾತ್ರಿ": [{"type": "noun", "defs": ["the earth."]}], "ಭೂತನಾಥ": [{"type": "noun", "defs": ["the lord of a class of demigods or all living beings; Śiva."]}], "ಭೂತನ್ಯೂನ": [{"type": "noun", "defs": ["(gram.) a participle used to express an action completed before the main action in a sentence; a past participle."]}], "ಭೂತಪಂಚಕ": [{"type": "noun", "defs": ["(phil.) collectively the five basic elements the earth, water, fire, air and space (ether) believed to constitute all physical matter."]}], "ಭೂತಪತಿ": [{"type": "noun", "defs": ["= ಭೂತನಾಥ."]}], "ಭೂತಪದಿ": [{"type": "noun", "defs": ["an archaic monetary coin (equal to one rupee)."]}], "ಭೂತಪುಣ್ಯ": [{"type": "noun", "defs": ["the accumalated merits of one's past deeds, esp. the ones committed in the previous births.", "a man having such an accumulation."]}], "ಭೂತಪೂಜೆ": [{"type": "noun", "defs": ["(dial.) worshipping or propitiation of a daemon or demi-god.", "worshipping or propitiation of the basic elements of nature."]}], "ಭೂತಬಲಿ": [{"type": "noun", "defs": ["an offering made to propitiate a demon or demigod."]}], "ಭೂತಭಾಗ್ಯ": [{"type": "noun", "defs": ["= ಭೂತಪುಣ್ಯ."]}], "ಭೂತಯಜ್ಞ": [{"type": "noun", "defs": ["an offering made to all the living beings, one of the five sacrifices that a householder has to observe daily."]}], "ಭೂತರೂಪ": [{"type": "noun", "defs": ["the form of a verb with appropriate terminations to depict the action in past tense."]}], "ಭೂತಲ": [{"type": "noun", "defs": ["= ಭೂತಳ."]}], "ಭೂತಲೀಲೆ": [{"type": "noun", "defs": ["the wanton play or action of an evil spirit, as annoying, haunting the people.", "a senseless, unprovoked, unjustifiable or deliberately malicious action."]}], "ಭೂತವತಿ": [{"type": "noun", "defs": ["(gram.) past tense."]}], "ಭೂತವಾದಿ": [{"type": "noun", "defs": ["(phil.) a person who advocates that the soul is nothing but the conbination of the earth, water, fire and air."]}], "ಭೂತವಾಸ": [{"type": "noun", "defs": ["= ಭೂತಾವಾಸ - 4."]}], "ಭೂತವೇಶಿ": [{"type": "noun", "defs": ["= ಭೂತವೇಷಿ."]}], "ಭೂತವೇಷಿ": [{"type": "noun", "defs": ["the tree Vitex negundo of Verbenaceae family.", "its white flower."]}], "ಭೂತಶಂಕೆ": [{"type": "noun", "defs": ["an irrational, excessive fear supposed to have been or imagined to have been caused by an evil spirit."]}], "ಭೂತಶುದ್ಧಿ": [{"type": "noun", "defs": ["a ritual performed to remove evil spirits before any auspicious action as worship."]}], "ಭೂತಸಂತುಷ್ಟಿ": [{"type": "noun", "defs": ["the state of evil spirits, demi-gods, etc. being satisfied (with the propiation)."]}], "ಭೂತಸಂಹಾರಿ": [{"type": "noun", "defs": ["= ಭೂತಾಂಕುಶ."]}], "ಭೂತಸಿದ್ಧಿ": [{"type": "noun", "defs": ["a kind of yogic accomplishment with which one is supposed to have the five basic elements at one's command."]}], "ಭೂತಸ್ಥಾನ": [{"type": "noun", "defs": ["a place where a demi-god or demi-gods are propriated."]}], "ಭೂತಹಿತ": [{"type": "noun", "defs": ["welfare of all the living beings, in general."]}], "ಭೂತಳ": [{"type": "noun", "defs": ["the surface of the earth.", "the earth.", "collectively, all the people."]}], "ಭೂತಾಂಕುಶ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಭೂತಾಂಜನ": [{"type": "noun", "defs": ["collirium applied to the palm of the right hand which would enable the person to see the invisible spirits."]}], "ಭೂತಾಕಾರ": [{"type": "noun", "defs": ["a huge, gigantic form or size."]}], "ಭೂತಾಗ್ರಣಿ": [{"type": "noun", "defs": ["Śiva.", "(pros.) a metre having four letters the first two of which are long, the rest being short ones."]}], "ಭೂತಾತ್ಮ": [{"type": "noun", "defs": ["that which is made of the five basic elements (the earth, fire, air, water and space).", "the Supreme Being who is present in all living beings.", "Śiva.", "Viṣṇu.", "the individual soul."]}], "ಭೂತಾಪಕಾರಿ": [{"type": "noun", "defs": ["he who tortures, troubles the living beings."]}], "ಭೂತಾಮರ": [{"type": "noun", "defs": ["(jain.) a class of demi-gods."]}], "ಭೂತಾಯಿ": [{"type": "noun", "defs": ["the earth, personified and regarded as mother; the earth-mother.", "the large-sized, evergreen tree Hydnocarpus laurifolia ( = H. wightiana) of Flacourtiaceae family, the seeds of which yield oil, which is used in treating skin diseases and also for lamps."]}], "ಭೂತಾರಾಧನೆ": [{"type": "noun", "defs": ["= ಭೂತಪೂಜೆ."]}], "ಭೂತಾಲಿ": [{"type": "noun", "defs": ["the large-sized tree Elaeocarpus tuberculatus of Elaecocarpaceae family."]}], "ಭೂತಾವಾಸ": [{"type": "noun", "defs": ["the body, as the abode of the soul.", "Śiva.", "Viṣṇu.", "the tree Terminalia bellirica ( = T. bellerica) of Combretaceae family; the belleric myrobalan tree."]}], "ಭೂತಾಳ": [{"type": "noun", "defs": ["= ಭೂತಾಳೆ."]}], "ಭೂತಾಳಕ್ರಿಯೆ": [{"type": "noun", "defs": ["(mus.) a musical mode."]}], "ಭೂತಾಳಭೈರವಿ": [{"type": "noun", "defs": ["the plant Croton oblongifolius of Euphorbiaceae family; oblong leaved croton."]}], "ಭೂತಾಳಿ": [{"type": "noun", "defs": ["the plant Curculigo orchioides of Zingiberaceae family."]}], "ಭೂತಾಳೆ": [{"type": "noun", "defs": ["the hedge-plant Agave americana of Agavaceae family, the thick, with fibre-yielding, pointed leaves; hill aloe; demon aloe.", "the medium-sized, deciduous tree Sterculia urens of Sterculiaceae family which yields good quality gum and fibre.", "the tree Grewia oppositifolia of Tiliaceae family."]}], "ಭೂತಿ": [{"type": "noun", "defs": ["the state or fact of being; existence.", "an act or instance of being born; birth.", "a successful, flourishing or thriving condition; prosperity.", "a great quantity or store of money, valuable possessions, property or other riches; wealth.", "favorable opinion or judgement; respect or regard; esteem.", "the powdery residue of matter that remains after burning; ash.", "a decorative stripe or stripes painted on an elephant.", "any of the super human accomplishment got by austerities or yogic practices.", "roasted meat.", "Śiva.", "Viṣṇu."]}], "ಭೂತಿಕ": [{"type": "noun", "defs": ["a man who entreats or who has the control over evil spirits, goblins, etc.; a sorcerer; a conjurer.", "a performer skilled in sleight of hand, illusions, etc.; a magician."]}, {"type": "noun", "defs": ["the grass Cymbopogon schoenanthus ( = Andropogon schoenanthus) of Poaceae family; lemon grass.", "the tree Swerita chirita ( = Gentiana chiryata) of Gentianaceae family.", "the tree Santalum album ( = Sirium myrtifolium) of Santalaceae family; sandal tree.", "its sweet smelling wood; sandal wood.", "a volatile, crystalline ketone, with a strong characteristic odour, derived from the wood of the camphor tree or synthetically from pinene; camphor."]}], "ಭೂತಿಪಟ್ಟ": [{"type": "noun", "defs": ["a marking with ashes (using three fingers) on various parts of the body, as per religious prescription."]}], "ಭೂತೃಣ": [{"type": "noun", "defs": ["= ಭೂತಿಕ2 - 1."]}], "ಭೂತೇಶ": [{"type": "noun", "defs": ["= ಭೂತನಾಥ."]}], "ಭೂತೈಲಿ": [{"type": "noun", "defs": ["the tree Sterculia foetida of Sterculiaceae family; dung tree; hill coconut."]}], "ಭೂತೊಳಸಿ": [{"type": "noun", "defs": ["a variety of basil plant."]}], "ಭೂತೋಚ್ಚಾಟನೆ": [{"type": "noun", "defs": ["the act or process of driving an evil spirit out or away by incantations and other rituals; exorcism; an instance of this."]}], "ಭೂದಾನ": [{"type": "noun", "defs": ["a giving of an extent of land as a gift."]}], "ಭೂದಾರ": [{"type": "noun", "defs": ["a hog, that roots up the earth.", "Viṣṇu, as in his incarnation as a boar."]}], "ಭೂದಿವಿಜ": [{"type": "noun", "defs": ["= ಭೂದೇವ."]}], "ಭೂದುರ್ಗ": [{"type": "noun", "defs": ["a fortified place amidst a thick forest."]}], "ಭೂದೇವ": [{"type": "noun", "defs": ["a brāhmaṇa, considered as a divinity on the earth."]}], "ಭೂಧರ": [{"type": "noun", "defs": ["a mountain.", "Viṣṇu, who bore the earth on his tusk in his third incarnation as a boar.", "Křṣṇa.", "Śiva.", "(math.) a symbol for the number seven.", "a kind of instrument used by physicians."]}], "ಭೂಧರಯಂತ್ರ": [{"type": "noun", "defs": ["= ಭೂಧರ - 6."]}], "ಭೂಧವ": [{"type": "noun", "defs": ["the ruler of the land; a king."]}], "ಭೂಧ್ರ": [{"type": "noun", "defs": ["a mountain."]}], "ಭೂನಾಗ": [{"type": "noun", "defs": ["any one of numerous annelid worms that burrow in soil and feed on soil nutrients and decaying organic matter; an earthworm.", "a kind of tree.", "a kind of snail or shail-shell (?)."]}], "ಭೂನಾಗಸತ್ವ": [{"type": "noun", "defs": ["a kind of substance (made of either earth-worms or a kind of snail, snail-shell) used as an antidote."]}], "ಭೂನಾಥ": [{"type": "noun", "defs": ["the ruler of the land; a king."]}], "ಭೂನಿಂಬ": [{"type": "noun", "defs": ["= ಭೂನಿಂಬೆ."]}], "ಭೂನಿಂಬೆ": [{"type": "noun", "defs": ["the plant Andrographis paniculata ( = Justicia paniculata) of Acanthaceae family.", "the tree Swerita chirita ( = Gentiana chiryata) of Gentianaceae family."]}], "ಭೂನೆಲ್ಲಿ": [{"type": "noun", "defs": ["the small tree Phylllanthus maderaspatensis of Euphorbiaceae family.", "its berry.", "another tree of the same family Phyllanthus niruri."]}], "ಭೂಪ": [{"type": "noun", "defs": ["= ಭೂನಾಥ.", "an unmanageable, uncontrollably self-willed man.", "(math.) a symbol for the number sixteen."]}], "ಭೂಪಟ": [{"type": "noun", "defs": ["a drawing or other representation, on a flat surface, of all or part of the earth's surface ordinarily showing countries, bodies of water, cities, mountains, etc.; a map."]}], "ಭೂಪತಿ": [{"type": "noun", "defs": ["= ಭೂಪ - 1 & 2.", "a particular bulbuous plant existing in the Himalaya region."]}], "ಭೂಪತಿಮಾತ್ರೆ": [{"type": "noun", "defs": ["a medicinal tablet made of ಭೂಪತಿ, a plant that grows in Himalayan region."]}], "ಭೂಪಥ": [{"type": "noun", "defs": ["the path on which the earth rotates round the sun."]}], "ಭೂಪದಿ": [{"type": "noun", "defs": ["= ಭೂಪರುಸಂಜೆಮಲ್ಲಿಗೆ."]}], "ಭೂಪರುಸಂಜೆಮಲ್ಲಿಗೆ": [{"type": "noun", "defs": ["the jasmine plant Jasminum heyneanum ( = J. sambac, = Nayctanthes sambac) of Oleaceae family.", "its flower."]}], "ಭೂಪಾಲ": [{"type": "noun", "defs": ["= ಭೂನಾಥ.", "(mus.) in Karnāṭaka system, a mode derived from the the main mode Hanumatōḍi."]}], "ಭೂಪಾಲಿ": [{"type": "noun", "defs": ["name of a musical mode in Hindūstāni system."]}], "ಭೂಪಾಳ": [{"type": "noun", "defs": ["= ಭೂಪಾಲ."]}], "ಭೂಪಾಳಿ": [{"type": "noun", "defs": ["= ಭೂಪಾಲಿ."]}], "ಭೂಪುಟ": [{"type": "noun", "defs": ["a keeping under the surface of the earth, a kind of processing medicinal substance."]}], "ಭೂಪ್ರದಕ್ಷಿಣ": [{"type": "noun", "defs": ["= ಭೂಪ್ರದಕ್ಷಿಣೆ."]}], "ಭೂಪ್ರದಕ್ಷಿಣೆ": [{"type": "noun", "defs": ["a going round the earth.", "a wandering widely from place to place."]}], "ಭೂಬಲ": [{"type": "noun", "defs": ["a large organised body of soldiers for waging war on land; an army.", "(astrol.) the favour or grace of astrological planet or planets by which one gets land-property."]}], "ಭೂಭರ": [{"type": "noun", "defs": ["the agony, suffering, distress, etc. caused by wicked men in extreme degree at any point of time (considered figuratively as a burden to the earth).", "the responsibility of a king or ruler."]}], "ಭೂಭಾಗ": [{"type": "noun", "defs": ["the solid part of the earth's surface not covered by water; land.", "a specific part of the earth's surface."]}], "ಭೂಭಾರ": [{"type": "noun", "defs": ["= ಭೂಭರ."]}], "ಭೂಭಾರಕ": [{"type": "noun", "defs": ["a wicked, evil man considered as a burden to the earth."]}], "ಭೂಭಾರಕತನ": [{"type": "noun", "defs": ["the quality of a wicked, evil man."]}], "ಭೂಭುಜ": [{"type": "noun", "defs": ["a king; a ruler."]}], "ಭೂಭೃತ್ತು": [{"type": "noun", "defs": ["a mountain.", "a king; a ruler.", "Viṣṇu.", "(math.) a symbol for the number seven."]}], "ಭೂಭ್ರªÀುಣ": [{"type": "noun", "defs": ["the movement of an orbiting celestial object (as the moon or an artificial satellite) completely around the earth; revolution around the earth.", "a wandering widely from place to place.", "the spinning motion of the earth around its own axis; the rotation of the earth."]}], "ಭೂಮ": [{"type": "adjective", "defs": ["very much exceeding the usual size, number or degree; of great size; immense."]}, {"type": "noun", "defs": ["the quality or fact of exceeding very much the normal size, number or degree.", "a special dinner for the bride and bridegroom with their parents arranged in the same row.", "food (in gen.); meals.", "the Universal Soul; the Supreme Being.", "the earth.", "ಭೂಮದ ಪದ bhūmada pada a series of songs sung by the friends of the bride and of the bridegroom, each making fun of the other, as a sport; ಭೂಮದ ಹಾಡು bhūmada hāḍu = ಭೂಮದ ಪದ; ಭೂಮದೂಟ bhūmadūṭa = ಭೂಮ2 - 2."]}], "ಭೂಮಂಡಲ": [{"type": "noun", "defs": ["the entire earth.", "an extent of land."]}], "ಭೂಮಂಡಳ": [{"type": "noun", "defs": ["= ಭೂಮಂಡಲ."]}], "ಭೂಮತೆ": [{"type": "noun", "defs": ["the quality or fact of exceeding very much in size, number or degree."]}], "ಭೂಮಧ್ಯಪ್ರದೇಶ": [{"type": "noun", "defs": ["a country, region, etc. that is entirely surrounded by land; a land-lock region, country."]}], "ಭೂಮಧ್ಯರೇಖೆ": [{"type": "noun", "defs": ["an imaginary circle around the earth, equally distant at all points from both the North and South Poles and which divides the earth's surface into the Northern and Southern Hemispheres; the equator."]}], "ಭೂಮಧ್ಯರೇಷೆ": [{"type": "noun", "defs": ["= ಭೂಮಧ್ಯರೇಖೆ."]}], "ಭೂಮಾನ": [{"type": "noun", "defs": ["the total mass or weight of the earth.", "the central area of a stadum, in which wrestlers vie; an wrestling arena."]}], "ಭೂಮಾನುಭೂತಿ": [{"type": "noun", "defs": ["the act of experience something supreme; the effect of this; the ultimate experience."]}], "ಭೂಮಾಲೀಕ": [{"type": "noun", "defs": ["a man who an extent of land; a land-owner."]}], "ಭೂಮಿ": [{"type": "noun", "defs": ["the planet that we live on; the earth.", "the solid part of the earth's surface not covered by water; land.", "a piece of cleared land, set off or enclosed, for raising crops; a field.", "(pros.) a metre consisting of three long syllabic instants (---); molassus."]}], "ಭೂಮಿಕಂಪ": [{"type": "noun", "defs": ["a shaking or trembling of the crust of the earth, caused by underground volcanic forces or by breaking and shifting of rock beneath the surface; earth-quake."]}], "ಭೂಮಿಕೆ": [{"type": "noun", "defs": ["the surface of the earth, esp. the solid surface; ground.", "any particular piece of land; esp., one set aside for a specified purpose.", "any particular area of reference, discussion, work, etc.; topic; subject.", "an upper floor in a multi-storeyed building; upstairs.", "a flight of steps; stairway; stairs.", "a short introductory statement to a book; foreword.", "a mental or emotional position adopted with respect to something; stance.", "the surface of a rock, prepared for inscribing.", "a part or character, that an actor plays in a performance; a role.", "(phil.) any of the seven stages one has to go through in the path of salvation of the soul."]}], "ಭೂಮಿಗೃಹ": [{"type": "noun", "defs": ["a house constructed under the ground."]}], "ಭೂಮಿಗೋಚರ": [{"type": "noun", "defs": ["the human race; mankind."]}], "ಭೂಮಿಚಕ್ರಗೆಡ್ಡೆ": [{"type": "noun", "defs": ["the vine Ipomoea digitata of Convolvulaceae family.", "its yam."]}], "ಭೂಮಿಚ್ಛಿದ್ರ": [{"type": "noun", "defs": ["the land that is not fit for raising crops; an extent of non-agricultural land."]}], "ಭೂಮಿಚ್ಛಿದ್ರನ್ಯಾಯ": [{"type": "noun", "defs": ["the procedure that a king has to follow in distributing non-agricultural land."]}], "ಭೂಮಿಜ": [{"type": "noun", "defs": ["any plant (as a herb, creeper, shrub, tree etc.).", "(myth.) Mangala, the deity of the astrological planet, Mars, considered as the son of the earth-mother.", "name of a demon, Naraka, slain by Křṣṇa.", "a man.", "a variety or class of horse."]}], "ಭೂಮಿಜಂಬುಕೆ": [{"type": "noun", "defs": ["the tree Syzygium hemisphaericum ( = Eugenia heisphaerica) of Myrtaceae family.", "its fruit; hemispheric rose apple."]}], "ಭೂಮಿತಿ": [{"type": "noun", "defs": ["the branch of mathematics that deals with the deduction of the properties, measurement, and relationships of points, lines, angles, and figures in space from their defining conditions by means of certain assumed properties of space; geometry."]}], "ಭೂಮಿದುಂದುಭಿ": [{"type": "noun", "defs": ["a kind of large percussion instrument."]}], "ಭೂಮಿರುಹ": [{"type": "noun", "defs": ["= ಭೂರುಹ."]}], "ಭೂಮಿವಿಲಗ್ಪ್ನ": [{"type": "noun", "defs": ["(dance.) a placing of the sole of the foot normally on the ground."]}], "ಭೂಮಿಸ್ಪøಶ": [{"type": "noun", "defs": ["a man.", "a man of merchant caste.", "a blind man.", "a man crippled in the foot or leg so as to limp or walk with difficulty; a lame man."]}], "ಭೂಮಿಹುಣ್ಣಿಮೆ": [{"type": "noun", "defs": ["the full moonday in Bhādrapada, the sixth month in the Hindu lunar calendar."]}], "ಭೂಮೀಜ": [{"type": "noun", "defs": ["= ಭೂಮಿಜ - 1."]}], "ಭೂಮೀಧ್ರ": [{"type": "noun", "defs": ["a mountain."]}], "ಭೂಯಿಷ್ಠ": [{"type": "adjective", "defs": ["most numerous; abundant."]}, {"type": "noun", "defs": ["the condition of being numerous; numerousness; abundance.", "(collectively) relatives; kinsfolk."]}], "ಭೂಯುಗ": [{"type": "noun", "defs": ["any of the five main divisions of geologic time."]}], "ಭೂಯೋನುಗ್ರಹನ್ಯಾಯ": [{"type": "noun", "defs": ["the attitude of looking positive aspects of a thing more favourably rather than giving importance to the negative ones."]}], "ಭೂಯೋಪಾಧ್ಯ": [{"type": "noun", "defs": ["a man who is an expert in many branches of knowledge."]}], "ಭೂಯೋವಿದ್ಯ": [{"type": "noun", "defs": ["= ಭೂಯೋಪಾಧ್ಯ."]}], "ಭೂರಾಜನೀತಿ": [{"type": "noun", "defs": ["the study or the application of the influence of political and economic geography on the politics, national power, foreign policy, etc., of a state; geo-politics.", "the combination of geographic and political factors influencing or delineating a country or region; geo-politics.", "a national policy based on the interrelation of politics and geography; geo-politics."]}], "ಭೂರಿ": [{"type": "adjective", "defs": ["much; many.", "numerouns; abundant.", "strong; mighty.", "wide; broad."]}, {"type": "noun", "defs": ["plentifulness; abundance.", "Viṣṇu.", "Brahma.", "Śiva.", "Indra, the lord of gods.", "gold.", "a generous gift of money given to a large number of persons.", "a piece of wood used as fuel.", "willful neglect; contempt.", "a large number of people, animal gathered together; a group; a multitude."]}], "ಭೂರಿಗುಡು": [{"type": "verb", "defs": ["to distribute among a large number of persons."]}], "ಭೂರಿಫೇನ": [{"type": "noun", "defs": ["the plant Mimosa abstergens of Mimosaceae family."]}], "ಭೂರಿಮಾಯ": [{"type": "noun", "defs": ["a wild dog Canis aureus of Canideae family, often hunt prey in packs, generally known for its trickery."]}], "ಭೂರುಂಡಿ": [{"type": "noun", "defs": ["the plant Heliotropium indicum of Boraginaceae family."]}], "ಭೂರುಗ": [{"type": "noun", "defs": ["a kind of brass instrument like a small trumpet; a bugle."]}], "ಭೂರುಹ": [{"type": "noun", "defs": ["any plant (as a herb, creeper, shrub, tree etc.)."]}], "ಭೂರ್ಗ": [{"type": "noun", "defs": ["= ಭೂರುಗ."]}], "ಭೂರ್ಜ": [{"type": "noun", "defs": ["the tree Butea bojapatra of Papilionaceae family, the smooth bark of which can easily be peeled off in thin sheets; a birch tree."]}], "ಭೂರ್ಜತ್ವಕ್ಕು": [{"type": "noun", "defs": ["the bark of the tree Butea bojapatra which is smooth and which can be peeled of easily."]}], "ಭೂರ್ಜಪತ್ರ": [{"type": "noun", "defs": ["= ಭೂರ್ಜ."]}], "ಭೂರ್ಜಾರ": [{"type": "noun", "defs": ["a kind of tree."]}], "ಭೂಲಾಯಿ": [{"type": "noun", "defs": ["a kind of fold-songs, prevalent in the Bīdar district of Karnāṭaka."]}], "ಭೂಲೋಕ": [{"type": "noun", "defs": ["the planet which we live on."]}], "ಭೂವರ": [{"type": "noun", "defs": ["a ruler; a king."]}], "ಭೂವಲಯ": [{"type": "noun", "defs": ["the entire earth."]}], "ಭೂವಳಯ": [{"type": "noun", "defs": ["= ಭೂವಲಯ."]}], "ಭೂವಿಜ್ಞಾನ": [{"type": "noun", "defs": ["the science that deals with the dynamics and physical history and nature of the earth, formation and composition of the rocks, and the physical, chemical, and biological changes that the earth has undergone or is undergoing; geology."]}], "ಭೂವಿಜ್ಞಾನಿ": [{"type": "noun", "defs": ["(masc.) a specialist in geology; a geologist."]}], "ಭೂಶಿರ": [{"type": "noun", "defs": ["a piece of high-land projecting into a body of water; cape; promontory; headland."]}], "ಭೂಶುದ್ಧಿ": [{"type": "noun", "defs": ["a religious purification of the site before commencing construction of a building on it."]}], "ಭೂಶೋಧನೆ": [{"type": "noun", "defs": ["the scientific study of the life and culture of past, esp. ancient, peoples, as by excavation of ancient cities, relics, artifacts, etc."]}], "ಭೂಷಣ": [{"type": "noun", "defs": ["the act of decorating, adorning; decoration; embellishment.", "the state of being decorated.", "anything used for decorating; an ornament."]}], "ಭೂಷಣಾಂಗ": [{"type": "noun", "defs": ["(jain.) a mythological tree in the heaven, that is supposed to yield the ornaments one wished for."]}], "ಭೂಷಿತ": [{"type": "adjective", "defs": ["decorated; embellished; adorned."]}, {"type": "noun", "defs": ["a man who is adorned with."]}], "ಭೂಷಿತೆ": [{"type": "noun", "defs": ["a woman who is adorned with."]}], "ಭೂಷಿಸು": [{"type": "verb", "defs": ["to add grace to; to embellish."]}], "ಭೂಷೆ": [{"type": "noun", "defs": ["= ಭೂಷಣ - 3."]}], "ಭೂಷ್ಣು": [{"type": "noun", "defs": ["that which comes to existence repeatedly or grows despite cutting off, severing, etc. (as hair, nail, etc.).", "the desire for a living a good life.", "Viṣṇu."]}], "ಭೂಷ್ಯ": [{"type": "adjective", "defs": ["that is to be or fit to be decorated."]}, {"type": "noun", "defs": ["that which is to be ornamented, embellished.", "a thing, event, etc. that is laudable.", "praise; commendation; laudation."]}], "ಭೂಸಕ್ಕರೆ": [{"type": "noun", "defs": ["a species of bulbous plant (as the plant Beta vulgaris of Chenopodiaceae family, from the roots of which sugar is extracted)."]}], "ಭೂಸವೆತ": [{"type": "noun", "defs": ["an eroding of soil on the surface of the earth, caused by wind, flowing water, etc.; soil erosion."]}], "ಭೂಸಾರ": [{"type": "noun", "defs": ["any material that helps quality or quantity of plant growth improve."]}], "ಭೂಸಾರತೆ": [{"type": "noun", "defs": ["the quality of any material that helps quality or quantity of plant growth improve."]}], "ಭೂಸುರ": [{"type": "noun", "defs": ["a brāhmaṇa, considered as a divinity on the earth."]}], "ಭೂಸ್ತøಣ": [{"type": "noun", "defs": ["the grass Cymbopogon schoenanthus ( = Andropogon schoenanthus) of Poaceae family; lemon grass."]}], "ಭೂಸ್ಥಾಪನೆ": [{"type": "noun", "defs": ["a deposit, as of valuables, kept under the surface of the earth, for purpose of keeping it from the knowledge of others."]}], "ಭೂಸ್ಥಿತಿ": [{"type": "noun", "defs": ["the land features of a particular region.", "land property owned by a person."]}], "ಭೂಸ್ವಾಮ್ಯ": [{"type": "noun", "defs": ["the ownership of a land; legal right of possession of an extent of land and the fact of owning it."]}], "ಭೂಳೋಕ": [{"type": "noun", "defs": ["= ಭೂಲೋಕ."]}], "ಭೃಂಗ": [{"type": "noun", "defs": ["any of a number of related large, hairy, yellow-and-black social bees (esp. of genus Bombus, family Apidae); bumble bee.", "any of various families of winged hymenopteran insects, characterised by a slender body with the abdomen attached by a narrow stalk, biting mouthparts, and, in the females and workers, a vicious sting that can be used repeatedly; a wasp.", "the fork-tailed shrike, Lanius caerulescens.", "the bird Cuculus melanoleucus.", "a man, who leads an unrestrained, sexually immoral life; a rake; a libertine.", "a golden vase or pitcher.", "the tree Cinnamomum macrocarpum of Lauraceae family.", "the plant Eclipta prostrata ( = E. alba) of Asteraceae family; weed-ham.", "any of a group of minerals (complex silicates) that crystallise in thin, somewhat flexible, translucent or coloured, easily separated layers, resistant to heat and electricity; mica.", "a cloud.", "lack of light; darkness.", "black colour.", "(dance.) a movement, raising one foot above the ground and turning our on the other."]}], "ಭೃಂಗಕೀಟನ್ಯಾಯ": [{"type": "noun", "defs": ["the maximum of a wasp and an insect caught by it, used to denote that a person, constantly meditating on something, would become what is being meditated on."]}], "ಭೃಂಗಗುಣ": [{"type": "noun", "defs": ["Manmatha, who has bumble bees as the string for his bow."]}], "ಭೃಂಗರಾಜ": [{"type": "noun", "defs": ["the plant Eclipta prostrata ( = E. alba) of Asteraceae family.", "a kind of large bumblebee."]}], "ಭೃಂಗವಲ್ಲಿ": [{"type": "noun", "defs": ["= ಭೃಂಗರಾಜ - 1."]}], "ಭೃಂಗಾಯಿ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಭೃಂಗಾರ": [{"type": "noun", "defs": ["a golden pitcher or vase.", "a vase or pitcher (in gen.) 3) gold."]}], "ಭೃಂಗಾರಿ": [{"type": "noun", "defs": ["= ಭೃಂಗಾರ - 2."]}], "ಭೃಂಗಾರು": [{"type": "noun", "defs": ["= ಭೃಂಗಾರ - 1."]}], "ಭೃಂಗಾಲಕ": [{"type": "noun", "defs": ["hair that is jet-black."]}], "ಭೃಂಗಾಳಕ": [{"type": "noun", "defs": ["= ಭೃಂಗಾಲಕ."]}], "ಭೃಂಗಿ": [{"type": "noun", "defs": ["name of one of the attendants of Śiva.", "the fig tree, Ficus carica, of Moraceae family.", "its fruit."]}, {"type": "noun", "defs": ["a female bumble bee."]}], "ಭೃಂಗಿಪ": [{"type": "noun", "defs": ["= ಭೃಂಗಿ1 - 1."]}], "ಭೃಂಗಿರಿಟಿ": [{"type": "noun", "defs": ["= ಭೃಂಗಿ1 - 1."]}], "ಭೃಂಗೀಶ": [{"type": "noun", "defs": ["= ಭೃಂಗಿ1 - 1."]}], "ಭೃಗು": [{"type": "noun", "defs": ["name of a celebrated sage.", "name of another sage, father of Paraśu Rāma.", "Śukra, the preceptor of demons, the presiding deity of the sixth astrological planet (Venus).", "the sloping side of a mountain.", "the sixth day of the week; Friday.", "name of a Dharma Śastra (a body of Hindu Laws)."]}], "ಭೃಗುಪತನ": [{"type": "noun", "defs": ["a falling from the top of a tall, steep rock to end one's life as a retribution for evil done by oneself."]}], "ಭೃಗುವಾರ": [{"type": "noun", "defs": ["the sixth day of the week; Friday."]}], "ಭೃತ": [{"type": "adjective", "defs": ["protected; guarded; saved.", "bearing; carrying.", "gained; acquired.", "filled; full of.", "hired; paid (as a servant)."]}, {"type": "noun", "defs": ["a man appointed for menial or domestic work; a servant a mercenary.", "that which is significant, meaningful."]}], "ಭೃತಕ": [{"type": "adjective", "defs": ["nourished; fostered; helped to sustain.", "working or done for payment only; a mercenary."]}, {"type": "noun", "defs": ["any man who will work for money; a labour; a mercenary; a coolie; a servant."]}], "ಭೃತವಂಶ": [{"type": "noun", "defs": ["a man holding a flute (for playing).", "the guardian of a family or lineage."]}], "ಭೃತಿ": [{"type": "noun", "defs": ["the act of nourishing, fastering.", "money that is paid or received for work or services; wages.", "the wealth, whether in money or property, owned or employed in business by an individual, firm, corporation, etc.; capital.", "any nourishing substance that is eaten, drunk or otherwise taken into the body to sustain life, provide energy, promote growth, etc.; food.", "a service rendered for money.", "a giving of something as a gift.", "money earned; wages; earnings."]}], "ಭೃತಿಭುಜ": [{"type": "noun", "defs": ["a man working for wages; a servant; a coolie."]}], "ಭೃತ್ಯ": [{"type": "noun", "defs": ["a man employed by another, esp. to perform domestic or menial duties.", "an adviser, counsel or minister.", "an individual person, as a native, inhabitant or subject of a nation."]}], "ಭೃತ್ಯತೆ": [{"type": "noun", "defs": ["the condition of being or the occupation of a servant; service."]}], "ಭೃತ್ಯತ್ವ": [{"type": "noun", "defs": ["= ಭೃತ್ಯತೆ."]}], "ಭೃತ್ಯಭಾವ": [{"type": "noun", "defs": ["= ಭೃತ್ಯತೆ."]}], "ಭೃತ್ಯಾಚಾರ": [{"type": "noun", "defs": ["(vīr.) the serving of God, as a servant."]}], "ಭೃತ್ಯಾಚಾರಿ": [{"type": "noun", "defs": ["(vīr.) a man serving God, as a servant."]}], "ಭೃತ್ಯೆ": [{"type": "noun", "defs": ["the act of nourishing, fastering.", "a support, help, prop or buttress.", "any nourishing substances eaten, drunk or otherwise taken into the body to sustain life; food.", "money paid or received for the service; wages.", "the occupation of a servant; service."]}], "ಭೃಶ": [{"type": "adjective", "defs": ["strong; vehement; mighty; powerful."]}, {"type": "noun", "defs": ["the quality or condition of being strong, vehement, mighty or powerful.", "the condition of having (something) abundantly; abundance; plentifulness.", "mental suffering caused by loss, disappointment, etc.; sadness, grief; sorrow.", "a ritualistic declaration, typically based on an appeal to a god or to some revered person or object, that one will speak the truth, keep a promise, remain faithful, etc.; an oath."]}], "ಭೃಷ್ಟ": [{"type": "adjective", "defs": ["fried or roasted."]}], "ಭೆಟ್ಟಿ": [{"type": "noun", "defs": ["= ಭೇಟಿ."]}], "ಭೇಕ": [{"type": "noun", "defs": ["any of various families of tailless, leaping anuran amphibians with long, powerful hind legs, short forelegs, a smooth skin, and webbed feet; a frog.", "a cowardly, timid man; a chicken-hearted fellow.", "a cloud."]}], "ಭೇಕಾಸನ": [{"type": "noun", "defs": ["a yogic posture in which lying on one's chest, bending back the legs at knees, holding the tip of the feet with respective hands, and raising the head to the maximum extent."]}], "ಭೇಕಿ": [{"type": "noun", "defs": ["a female frog."]}], "ಭೇಕಿಸು": [{"type": "verb", "defs": ["to make a deep, hoarse sound, as that of a frog; to croak.", "(fig.) to mumble or mutter a complaint repeatedly or irritatingly."]}], "ಭೇಟಿ": [{"type": "noun", "defs": ["the act or an instance of visiting for seeing, talking, checking, etc.; a visit."]}], "ಭೇತಾಳ": [{"type": "noun", "defs": ["the tree Sterculia foetida of Sterculiaceae family; the dung tree."]}], "ಭೇದ": [{"type": "noun", "defs": ["the act of breaking (into pieces).", "the act of tearing (into pieces).", "the act of dividing.", "a long, deep, narrow split, found on the surface; a rift; a crack.", "an injury, damaging the tissue breaking of the skin caused by a blow, stroke of a weapon, etc. or dashing against hard substance, etc.; a wound.", "a distributing of something divided; distribution; apportionment.", "the degree by which one differs from another; the fact of being dissimilar and the extent of this; difference.", "a kind, type or sort.", "a divulging of a secret or a secret being divulged; disclosure; divulgence.", "the act or process of changing, substitution, alteration or variation; a change.", "difference between the opinions of two persons; the condition of having divurgent opinions.", "a person who hates another intensely; a foe; an enemy.", "the state, fact or feeling of being two or being different from another; duality.", "evacuation of bowels; a passing of waste matters from the large intestine; defecation.", "a large scale agitation (in a society).", "emotional disburbance (within oneself).", "the fact of being defeated; a defeat.", "a sudden, sharp pain caused by involuntary contraction of a muscle or muscles from chill, strain, etc.; cramp.", "a either temporary or permanent loss or impairment of voluntary movement, sensation in a body part; paralysis.", "a contracting, compressing or being contracted, compressed; contraction.", "(astrol. astron.) a conjugation of a few planets.", "water.", "(in politics) an expediency of causing difference of opinions among the opponents, thus breaking of their strength."]}, {"type": "noun", "defs": ["the plant Sida cordifolia ( = S. carpinifolia) of Molvaceae family.", "the pea plant Vigna unguiculata ( = V. catjang, = V. sinensis, = Dolichos sinensis, = D. catjang) of papilionaceae family.", "its edible pea; cow pea."]}], "ಭೇದಂಬಡು": [{"type": "verb", "defs": ["to feel the difference; to have difference between.", "to go away from; to part."]}], "ಭೇದಂಬಡೆ": [{"type": "verb", "defs": ["to have the difference; to be differentiated.", "to be separated from."]}], "ಭೇದಕ": [{"type": "adjective", "defs": ["breaking; tending to break, split.", "dividing; separating.", "defining, explaining or communicating precisely, accurately."]}, {"type": "noun", "defs": ["the act or an instance of breaking, splitting, destroying.", "he who does this; a destroyer.", "the process of separating of a physical or abstract thing, as a method of studying its nature, constitution, proportion and interrelationship of ingredients, etc.; analysis.", "a man who analyses for any of these purposes; an analyser.", "an adjective that helps to separate a thing, person, etc. from a class or group.", "(phil.) a reducing of a huge or incomprehensible thing into small or comprensible size."]}], "ಭೇದಕಾತಿಶಯೋಕ್ತಿ": [{"type": "noun", "defs": ["(rhet.) exaggerating an object as extraordinary using hyperbolic language."]}], "ಭೇದಗೆಡು": [{"type": "verb", "defs": ["(the difference between two objects) to be lost."]}], "ಭೇದತಂತ್ರ": [{"type": "noun", "defs": ["an artifice by which a misunderstanding, dislike or aversion is created between two person, who were otherwise friendly or affectionate."]}], "ಭೇದದರ್ಶನ": [{"type": "noun", "defs": ["the illusion that same thing is seen, conceived as two different things."]}], "ಭೇದದೃಷ್ಟಿ": [{"type": "noun", "defs": ["the view that the individual soul is different from the Supreme Soul."]}], "ಭೇದನ": [{"type": "noun", "defs": ["the act of breaking, shattering.", "the act or an instance of dividing; division.", "the act of causing (a group, political party, etc.) to separate into divisions or factions; creating rift, disunity between or among.", "the act of making something lose, strengthless, etc.", "a divulging of a secret; divulgence.", "lack of unity; disunity.", "the pungent-smelling gum resin obtained from Ferula Asafoetida, used in treating illness, and in cooking; asafoetida.", "frequent evacuation of bowels in loose or liquid form.", "any swine, esp. a domesticated adult (Sus scrofa); a hog."]}], "ಭೇದಬುದ್ಧಿ": [{"type": "noun", "defs": ["the tendency to favour unfairly (usu. one at the cost of another) or to prefer one unduly; partiality.", "the feeling, knowledge that one thing is different from another (esp. the individual soul from the Supreme Soul)."]}], "ಭೇದಭಾವ": [{"type": "noun", "defs": ["= ಭೇದಬುದ್ಧಿ."]}], "ಭೇದಶ್ರುತಿ": [{"type": "noun", "defs": ["the belief, conception that conscious, unconscious and the Supreme are different."]}], "ಭೇದಾಭೇದ": [{"type": "noun", "defs": ["similarity and dissimilarity or oneness and difference between two objects."]}], "ಭೇದಿ": [{"type": "noun", "defs": ["breaking; splitting.", "destroying; demolishing."]}, {"type": "noun", "defs": ["the act of breaking or splitting.", "a destroying or being destroyed; destruction.", "waste matter excreted from the bowels in liquid or loose form.", "ಭೇದಿ ಮಾತ್ರೆ bhēdi mātre a tablet given for frequent and lose passing of stools or for curing constipation; ಭೇದಿಯಾಗು bhēdiyāgu (faeces) to be discharged in loose or liquid form; ಭೇದಿ ಕಟ್ಟು bhēdi kṭṭu (passing of stools in liquid or loose form) to be stopped; ಭೇದಿಗೆ ಕೊಡು bhēdige koḍu to give a medicine for constipation or for frequent and lose passing of stools; 2. (fig.) to terrify; to frighten."]}], "ಭೇದಿಗ": [{"type": "noun", "defs": ["a man who splits a group, political party, etc. (by creating misunderstanding, dislike or aversion among the members)."]}], "ಭೇದಿತ": [{"type": "adjective", "defs": ["broken; split.", "destroyed; demolished."]}, {"type": "noun", "defs": ["that which is broken or split.", "a thing that is destroyed or demolished."]}], "ಭೇದಿಸು": [{"type": "verb", "defs": ["to sever, fracture, part; to break.", "to shatter, crush, destroy; to break.", "to divide into parts by force; to break.", "to gain victory over in battle, competition; to defeat; to vanquish, to overcome.", "to cause to fail, frustrate (another).", "to remove or keep (an evil) from happening.", "to contradict (a statement or allegation); to declare to be untrue or untenable.", "to pass through (by breaking something using force).", "to find out, expose a secret.", "to cause to have disagreement, disunity with.", "to find out (something) by deep analysis, probing, etc.", "to see or recognise the difference between.", "to be separated (from)."]}], "ಭೇದಿಸೊಪ್ಪು": [{"type": "noun", "defs": ["the spurge plant Euphorbia geniculata of Euphorbiaceae family."]}], "ಭೇದೋಪಾಯ": [{"type": "noun", "defs": ["(in politics) an expediency of causing difference of opinions among the oponents, thus breaking of their strength."]}], "ಭೇದ್ಯ": [{"type": "adjective", "defs": ["fit or proper to be broken.", "that can be broken.", "that can be broken and entered into.", "that can be exposed, solved (as a secret or mystery).", "susceptible to distracting, instigating tendency or element."]}, {"type": "noun", "defs": ["that which can be broken, split or demolished.", "the noun which is qualified by an adjective; that which can be separated from others with the help of an adjective.", "(phil.) that which is to be or can be excluded from being generalised."]}], "ಭೇನ": [{"type": "noun", "defs": ["the moon, as the lord of stars."]}], "ಭೇನಚೂಡ": [{"type": "noun", "defs": ["Śiva, whose head is adorned with the moon."]}], "ಭೇರ": [{"type": "noun", "defs": ["= ಭೇರಿ."]}], "ಭೇರಿ": [{"type": "noun", "defs": ["a percussion instrument consisting of big hollow cylinder with a mebrane stretched tightly over one end, the other being closed, played by beating with sticks; a huge drum."]}], "ಭೇರುಂಡ": [{"type": "adjective", "defs": ["making very afraid; filling with terror; frightening or alarming greatly."]}, {"type": "noun", "defs": ["a mythical bird having two heads, believed to be stronger than lions; a griffin-like bird."]}], "ಭೇರುಂಡವಕ್ಕಿ": [{"type": "noun", "defs": ["= ಭೇರುಂಡ2."]}], "ಭೇಲ್": [{"type": "noun", "defs": ["a kind of eatable prepared by mixing two or three different eatable."]}], "ಭೇಶ": [{"type": "noun", "defs": ["= ಭೇನ.", "the lord of light, as the sun."]}], "ಭೇಶಚೂಡ": [{"type": "noun", "defs": ["= ಭೇನಚೂಡ."]}], "ಭೇಷ್": [{"type": "interjection", "defs": ["(used in praising a performer) well done!; very good!; excellent!; Bravo!."]}], "ಭೇಷಜ": [{"type": "noun", "defs": ["a substance or preparation used in the treatment of illness; a medicine.", "a means which helps overcome, prevent, avoid something (esp. an evil)."]}], "ಭೇಳ": [{"type": "noun", "defs": ["= ಭೇಲ್."]}], "ಭೈಕ್ಷ": [{"type": "noun", "defs": ["the act of wandering and requesting for alms.", "money, food, clothes, etc. given as alms.", "a beseeching, imploring for kindness, pity, etc."]}], "ಭೈಕ್ಷಶುದ್ಧಿ": [{"type": "noun", "defs": ["(jain.) a realigious cleansing or purification of the food before it is eaten."]}], "ಭೈಕ್ಷೆ": [{"type": "noun", "defs": ["= ಭೈಕ್ಷ."]}], "ಭೈತ್ರ": [{"type": "noun", "defs": ["a small water vessel or any device for transport by water; a boat or raft."]}]}