{"ಚುಂಚುರ": [{"type": "noun", "defs": ["= ಚುಂಚುಪತ್ರ."]}], "ಚುಂಚುರುಚು": [{"type": "noun", "defs": ["a kind of plant ."]}], "ಚುಂಚುಲೆ": [{"type": "noun", "defs": ["a kind of military weapon."]}], "ಚುಂಚುಲೋವೆ": [{"type": "noun", "defs": ["that part of the roof of a building, projecting beyond the wall, sloping outward; the roof-ledge."]}], "ಚುಂಚುಱು": [{"type": "noun", "defs": ["= ಚುಂಚು1."]}], "ಚುಂಚುಱುದಲೆ": [{"type": "noun", "defs": ["= ಚುಂಚುದಲೆ - 1."]}], "ಚುಂಟಿ": [{"type": "noun", "defs": ["= ಚುಂಡಿ."]}], "ಚುಂಡ": [{"type": "noun", "defs": ["(dial.) a man with short hair."]}], "ಚುಂಡಿ": [{"type": "noun", "defs": ["a small well or reservoir."]}], "ಚುಂಡಿಲಿ": [{"type": "noun", "defs": ["= ಚುಂಚಿಲಿ."]}], "ಚುಂಡೆ": [{"type": "noun", "defs": ["the plant Solanum ferox of Solanaceae family; Indian night-shade.", "its fruit."]}], "ಚುಂದಿ": [{"type": "noun", "defs": ["a woman who procures men for a prostitute."]}], "ಚುಂದು": [{"type": "verb", "defs": ["to be in a horizontal, recumbent or prostrate position, as on a bed or the ground; to recline; to lie.", "to engage in sexual intercourse; to copulate."]}], "ಚುಂಬಕ": [{"type": "noun", "defs": ["a man who kisses or is kissing.", "a man given to excessive sexual indulgence; a lascivious or licentious man; a lecher.", "a man who attracts, fascinates others with a view to cheating; a cheat.", "a material that has the property of attracting iron pieces towards; a magnet."]}], "ಚುಂಬಕಗಾಳಿ": [{"type": "noun", "defs": ["the wind that has the power to charm, as the cool, gentle breeze."]}], "ಚುಂಬಕತ್ವ": [{"type": "noun", "defs": ["the power or quality of attracting, charming or fascinating others.", "the property, quality or condition of being magnetic; magnetism."]}], "ಚುಂಬನ": [{"type": "noun", "defs": ["the act or an instance of touching or pressing with the lips slightly pursed, and then often parting them and emitting a smacking sound, in an expression of affection, love, greeting, reverence, etc.; a kiss.", "a light, gentle touch; a slight contact."]}], "ಚುಂಬನಗೊಡು": [{"type": "verb", "defs": ["to give a kiss to (a person or thing); touch or caress with the lips; to kiss."]}], "ಚುಂಬಿ": [{"type": "adjective", "defs": ["touching( gently)."]}], "ಚುಂಬಿತ": [{"type": "adjective", "defs": ["kissed; caressed with the lips.", "touched; reached."]}, {"type": "noun", "defs": ["that which is kissed.", "he who has been kissed."]}], "ಚುಂಬಿತೆ": [{"type": "noun", "defs": ["a woman who has been kissed."]}], "ಚುಂಬಿಸು": [{"type": "verb", "defs": ["to touch or press with the lips slightly pursed, and then often to part them and to emit a smacking sound, in an expression of affection, love, greeting, reverence, etc.; to kiss.", "to touch gently or lightly."]}], "ಚುಕತಾ": [{"type": "noun", "defs": ["= ಚುಕ್ತಾ."]}], "ಚುಕಾಣಿ": [{"type": "noun", "defs": ["= ಚುಕ್ಕಾಣಿ."]}], "ಚುಕಾಯಿಸು": [{"type": "verb", "defs": ["to advance (vehemently to catch, seize, etc.).", "to complete; to finish.", "to place or put in order.", "to fix the price for.", "to repay the loan taken from another."]}], "ಚುಕಿ": [{"type": "noun", "defs": ["the thing that is lacking or needed; deficiency; a fault; incompleteness."]}], "ಚುಕುಚುಕು": [{"type": "noun", "defs": ["(a child's term) a train or locomotive; choo-choo.", "the sound of a steam locomotive."]}], "ಚುಕುಳ": [{"type": "noun", "defs": ["the plant Asclepias rosea of Asclepiadaceae family."]}], "ಚುಕ್ಕಣ": [{"type": "noun", "defs": ["= ಚುಕ್ಕಾಣಿ."]}], "ಚುಕ್ಕಮನ": [{"type": "noun", "defs": ["lack of tolerance, liberality; the prejudiced, bigoted mind; meanness."]}], "ಚುಕ್ಕಾಣಿ": [{"type": "noun", "defs": ["the helm - a) the wheel or tiller by which a ship or boat is steered; b) the complete steering gear, including the wheel or tiller, rudder, etc.", "the control or leadership of an organisation, government, etc.; the position of control.", "ಚುಕ್ಕಾಣಿ ಹಿಡಿ cukkāṇi hiḍi (fig.) to hold the position of a leader of an organisation, government; to lead."]}], "ಚುಕ್ಕಾಣಿಗ": [{"type": "noun", "defs": ["a person who steers a ship.", "(fig.) a leader."]}], "ಚುಕ್ಕಾಣಿಚಕ್ರ": [{"type": "noun", "defs": ["= ಚುಕ್ಕಾಣಿ - 1."]}], "ಚುಕ್ಕಿ": [{"type": "noun", "defs": ["= ಚುಕ್ಕೆ1.", "ಚುಕ್ಕಿಯ ಮಾತು cukkiya mātu (fig.) useless or foolish talk."]}, {"type": "noun", "defs": ["= ಚುಕ್ಕೆ2."]}, {"type": "noun", "defs": ["the planet second in order from the sun, and the most brilliant planet in the solar system, having an equatorial diameter of 7521 miles, a mean distance from the sun of 67.2 million miles, a period of revolution of 224.68 days, and no moons; the Venus.", "(myth.) Śukrācārya, the preceptor of demons."]}], "ಚುಕ್ಕಿಗುವರ": [{"type": "noun", "defs": ["(myth.) any of the demons, disciples of Śukrācārya."]}], "ಚುಕ್ಕಿತ": [{"type": "noun", "defs": ["(dance.) a facial gesture, drawing the lips and gently showing the teeth."]}], "ಚುಕ್ಕಿಪಾಲ": [{"type": "noun", "defs": ["the tree Ziziphus glabrata (= Z. trinerva) of Rhamnaceae family; jagged jujube."]}], "ಚುಕ್ಕಿವಟ್ಟೆ": [{"type": "noun", "defs": ["the space in which stars (and other heavenly bodies) move; the sky."]}], "ಚುಕ್ಕಿಸು": [{"type": "verb", "defs": ["to shrink oneself from embarrassment, diffidence, shyness, etc."]}], "ಚುಕ್ಕಿಸೊಪ್ಪು": [{"type": "noun", "defs": ["= ಚುಕ್ಕೆ2."]}], "ಚುಕ್ಕುತಟ್ಟು": [{"type": "verb", "defs": ["to gently pat on the back (of a child) lulling to sleep."]}], "ಚುಕ್ಕುಬಡಿ": [{"type": "verb", "defs": ["= ಚುಕ್ಕುತಟ್ಟು."]}], "ಚುಕ್ಕೆ": [{"type": "noun", "defs": ["any of the self-luminous celestial objects seen as points of light in the sky, having continuous nuclear reactions which send heat, light, etc. in all directions; a star.", "any tiny, round mark (as the one made with a pointed object); a dot.", "(fig.) a worthless, useless person.", "ಚುಕ್ಕೆಯಾಗು cukkeyāgu to become a target for verbal attack, blame, humiliation, etc."]}, {"type": "noun", "defs": ["the tall, coarse weed Rumex vesicarius of Polygonaceae family, with stout taproots and sour leaves; yellow-dock; sorrel."]}, {"type": "noun", "defs": ["= ಚುಕ್ಕಿ3."]}], "ಚುಕ್ಕೆಗಳೆ": [{"type": "verb", "defs": ["to treat with disrespect or contemptuously; to talk disdainfully; to slight; to snub."]}], "ಚುಕ್ಕೆಜಿಂಕೆ": [{"type": "noun", "defs": ["the deer, Cervus (Axis) axis, of India and Sri Lanka, having a reddish-brown coat spotted with white, and branched, annually shed antlers; spotted deer; chital; axis."]}], "ಚುಕ್ಕೆದುಪ್ಪಿ": [{"type": "noun", "defs": ["= ಚುಕ್ಕೆಜಿಂಕೆ."]}], "ಚುಕ್ಕೆಬೆಕ್ಕು": [{"type": "noun", "defs": ["the cat Felis rubiginosa (= Prionailarus rubiginosa) with brown spots, that live in forests; spotted cat."]}], "ಚುಕ್ಕೆಸೊಪ್ಪು": [{"type": "noun", "defs": ["= ಚುಕ್ಕೆ2."]}], "ಚುಕ್ತ": [{"type": "noun", "defs": ["= ಚುಕ್ತಾ."]}], "ಚುಕ್ತಾ": [{"type": "noun", "defs": ["a repaying off of one's debt fully."]}], "ಚುಕ್ತಿ": [{"type": "noun", "defs": ["= ಚುಕ್ತಾ."]}], "ಚುಕ್ತಿಪಟ್ಟಿ": [{"type": "noun", "defs": ["a list of names of persons or bodies that owe money to a loaner, bank or finance institution."]}], "ಚುಕ್ರ": [{"type": "noun", "defs": ["= ಚುಕ್ಕೆ2.", "a liquor that has turned sour.", "the plant Spondias pinnata (= S. mangifera) of Anacardiaceae family; wild mango tree.", "its plum; wild hog plum."]}], "ಚುಕ್ರಾಸಿ": [{"type": "noun", "defs": ["the large, evergreen tree Chukrasia tabularis of Meliaceae family.", "its wood."]}], "ಚುಕ್ರಿಕೆ": [{"type": "noun", "defs": ["the plant Oxalis corniculata (= O. pusilla, = Xanthoxalis corniculata) of Oxalidaceae family, with cloverlike compound leaves that contain oxalic acid, found in cool, shaded, damp woods; wood sorrel."]}], "ಚುಚಲ": [{"type": "noun", "defs": ["= ಚುಚಲಿ."]}], "ಚುಚಲಿ": [{"type": "noun", "defs": ["the jute plant Corchorus olitorius of Tiliaceae family, which yields a strong, glossy fibre used for making burlap, sacks, mats, rope, etc."]}], "ಚುಚುಂದರ": [{"type": "noun", "defs": ["a kind of mouse, that is small in size, with long, pointed snout."]}], "ಚುಚುಂದರಿ": [{"type": "noun", "defs": ["= ಚುಚುಂದರ."]}], "ಚುಚುಂದ್ರಿ": [{"type": "noun", "defs": ["= ಚುಚುಂದರ.", "an arrow (with a poison smeared to its point)."]}], "ಚುಚುಜ": [{"type": "noun", "defs": ["the tree Helicteres isora of Sterculiaceae family; east Indian screw pine."]}], "ಚುಚುರು": [{"type": "noun", "defs": ["= ಚುಜ್ಜಲು - 3."]}], "ಚುಚುಲು": [{"type": "noun", "defs": ["= ಚುಜ್ಜಲು."]}], "ಚುಚೇಂದ್ರಿ": [{"type": "noun", "defs": ["= ಚುಚುಂದ್ರಿ."]}], "ಚುಚ್ಚಳ": [{"type": "adjective", "defs": ["that is not regarded or accepted as socially standard."]}], "ಚುಚ್ಚಿಸು": [{"type": "verb", "defs": ["to cause to pierce, stab or penetrate."]}], "ಚುಚ್ಚು": [{"type": "verb", "defs": ["to pass into or through as a pointed instrument does; penetrate; to pierce, stab or penetrate.", "to make a hole or holes in.", "to speak harshly with a view to inflicting pain into another's mind; to make a caustic or sneering remark.", "ಚುಚ್ಚಿಕೊಡು cucci koḍu to give another a malicious, false or defamatory report about (a third person); to create a malicious, spiteful relation between two persons, by slandering; ಚುಚ್ಚಿ ನುಡಿ cucci nuḍi to talk with biting, pungent remarks inflicting pain to another."]}, {"type": "verb", "defs": ["to burn or reduce to ashes; to injure, damage or destroy by fire.", "to cause to undergo, to inflict, pain; to cause agony."]}, {"type": "noun", "defs": ["the act or an instance of piercing or stabbing (with a pointed object)."]}, {"type": "noun", "defs": ["anything that is small, tiny or little."]}], "ಚುಚ್ಚುಕ": [{"type": "noun", "defs": ["a man who, from behind, incites difference of opinion, quarrel or hatred between or among others."]}], "ಚುಚ್ಚುಕಳಿಲೆ": [{"type": "noun", "defs": ["an eatable made by spicing and seasoning young bamboo shoots."]}], "ಚುಚ್ಚುಕೂದಲು": [{"type": "noun", "defs": ["short, prickly hair; bristle-hair."]}], "ಚುಚ್ಚುಗ": [{"type": "noun", "defs": ["a kitchen apparatus with a long handle and flattened at the other end, used to mix, overturn, hot stuff being cooked."]}], "ಚುಚ್ಚುಗಲೆ": [{"type": "noun", "defs": ["the dark brownish or black mark on the skin remaining after a deep wound is healed."]}], "ಚುಚ್ಚುಗೊಂಡೆಯ": [{"type": "noun", "defs": ["a slandering that besmirches or sullies another's reputation and inflicts great mental pain to that person."]}], "ಚುಚ್ಚುನುಡಿ": [{"type": "noun", "defs": ["harsh speech or words, sneering remark, etc. intended to cause mental pain."]}], "ಚುಚ್ಚುನೋಟ": [{"type": "noun", "defs": ["a sharp, suspicious, angry or sneering look that is uncomfortable to the one being looked at; a looking at with hatred; looking daggers."]}], "ಚುಚ್ಚುಮದ್ದು": [{"type": "noun", "defs": ["a liquid medicine injected into the body; injection."]}], "ಚುಚ್ಚುಮಾತು": [{"type": "noun", "defs": ["= ಚುಚ್ಚುನುಡಿ."]}], "ಚುಚ್ಚುರೊಟ್ಟಿ": [{"type": "noun", "defs": ["a kind of flat cake with a hole at the centre, baked on a frying pan."]}], "ಚುಚ್ಚುಳ": [{"type": "noun", "defs": ["."]}], "ಚುಜ್ಜಲು": [{"type": "noun", "defs": ["the tree Albizzia amara (= A. wightii, = Mimosa amara) of Mimosae family, the powder of the dried leaves of which is mixed with soap-nut powder.", "the tree Acacia amara of the same family; oil-cake tree.", "the plant Corchorus trilocularis of Tiliaceae family."]}], "ಚುಜ್ಜುಲು": [{"type": "noun", "defs": ["= ಚುಜ್ಜಲು."]}], "ಚುಟಕ": [{"type": "noun", "defs": ["a poem, passage, talk etc. that is short or shortened.", "a kind of poem that is usu. of four lines, witty, sarcastic, etc."]}], "ಚುಟಕಿ": [{"type": "noun", "defs": ["= ಚುಟಿಕೆ."]}], "ಚುಟಕು": [{"type": "noun", "defs": ["= ಚುಟಿಕೆ."]}], "ಚುಟಕೆ": [{"type": "noun", "defs": ["= ಚುಟಿಕೆ."]}], "ಚುಟಿ": [{"type": "noun", "defs": ["the quality of being swift, vehement or forceful.", "the quality characterised by action, motion, energetic work, willing participation, etc.", "skill in performing, getting something done, deceiving, etc.; craftiness; skill; trick.", "great ability or proficiency; expertness that comes from training, practice, etc.; skill.", "the quality of being sharp, keen or pointed; sharpness.", "the quality of moving, doing rapidly; swiftness; quick motion.", "a sign, mark or symbol.", "something that helps to solve a problem, find something, etc.; a clue."]}], "ಚುಟಿಕೆ": [{"type": "noun", "defs": ["the sharp, short sound made by snapping a finger with the thumb.", "a small quantity (of something) that can be held between the thumb and a finger; a pinch.", "a kind of tuft for intertwining with the braid.", "a series of short stitches.", "anything that is small in size or smaller than the normal one.", "a branding on the forehead, head with a hot piece of bangle to cure convulsion, paroxysm.", "a pair of small, hollowed pieces of wood or ivory held in the hand by a connecting cord clicked together with the fingers to beat time to music; castanets.", "the cracking of the finger knuckles making a sharp, short sound or sounds."]}], "ಚುಟಿಕೆಹಾಕು": [{"type": "verb", "defs": ["to snap a finger and the thumb to produce a sharp, short cracking sound.", "to brand with a hot piece of bangle to cure convulsion, paroxysm, etc.", "to beat a pair small, hollowed pieces of wood or ivory, holding them between a finger and the thumb to keep time in music."]}], "ಚುಟಿಗೆ": [{"type": "noun", "defs": ["= ಚುಟಿಕೆ."]}], "ಚುಟುಕ": [{"type": "noun", "defs": ["= ಚುಟಿಕೆ."]}, {"type": "noun", "defs": ["= ಚುಟಕ."]}], "ಚುಟುಕಿ": [{"type": "noun", "defs": ["= ಚುಟಿಕೆ."]}], "ಚುಟುಕು": [{"type": "noun", "defs": ["= ಚುಟಿಕೆ."]}], "ಚುಟ್ಟ": [{"type": "noun", "defs": ["= ಚುಟ್ಟಾ."]}, {"type": "noun", "defs": ["that which is small in size; a little thing.", "a small ball of powdered tobacco prepared for inhaling by sniffing; a snuff-ball."]}], "ಚುಟ್ಟಾ": [{"type": "noun", "defs": ["a more or less cylindrical roll of tobacco cured for smoking, wrapped in a tobacco leaf; a cigar."]}], "ಚುಟ್ಟಿ": [{"type": "noun", "defs": ["a frontal worn on the forehead; a frontlet."]}], "ಚುಡಾಯಿಸು": [{"type": "verb", "defs": ["to irritate or provoke with persistent petty distractions, playful fooling, trifling raillery or other annoyance; to annoy; to tease."]}], "ಚುಡಿತ": [{"type": "noun", "defs": ["calumnious, slanderous; defamatory talk or speech etc."]}, {"type": "noun", "defs": ["capable of cutting, piercing with ease; sharp."]}], "ಚುಡುವ": [{"type": "noun", "defs": ["flattened rice, made by soaking the paddy in water and pounding, spiced and seasoned."]}], "ಚುಣಕ": [{"type": "noun", "defs": ["the annual plant Cicer arietinum of Papilionaceae family; chicken pea plant.", "its edible pea; chicken pea."]}], "ಚುಣಚುಣಿ": [{"type": "noun", "defs": ["= ಚುನಿಚುನಿ."]}], "ಚುಣಿ": [{"type": "noun", "defs": ["the part of something that faces forward or is regarded as facing forward; most important side; forepart.", "beginning - a) a starting or commencing; b) the time of starting.", "the part of an army which goes ahead of the main body; vanguard.", "the parts of a birḍs jaws that are covered with a horny or leathery sheath; the beak.", "the last point, part or extremity of anything; end."]}], "ಚುಣುಕು": [{"type": "verb", "defs": ["to slip down or away (loosening oneself from another's grip or hold).", "to go quietly or secretly; move without attracting notice.", "to flash, appear at once and disappear immediately.", "to shrink, contract or lose one's vehemence, energy, etc."]}, {"type": "noun", "defs": ["a slender, thin, small or subtle thing.", "the behaviour that is lacking seriousness; frivolous conduct.", "the quality or fact of being shorter than the normal one of the species; shortness."]}], "ಚುಣುಗು": [{"type": "verb", "defs": ["= ಚುಣುಕು1."]}], "ಚುಣ್ಣ": [{"type": "noun", "defs": ["(dial.) a plant disease that affects sweet potato."]}], "ಚುತಿ": [{"type": "noun", "defs": ["a falling down (from a good position, status, etc.); the fact or state of being ruined."]}], "ಚುತಿಸು": [{"type": "verb", "defs": ["to go or come to ruin; to be ruined."]}], "ಚುತ್ತು": [{"type": "verb", "defs": ["to be tired out; to become weary."]}], "ಚುದ್ರತನ": [{"type": "noun", "defs": ["the quality of being petty, small-minded, slanderous ; pettiness."]}], "ಚುನಮರಿ": [{"type": "noun", "defs": ["paddy that is soaked and parched; parched rice."]}], "ಚುನಮರಿ ಉಂಡೆ": [{"type": "noun", "defs": ["a kind of eatable in the shape of a small ball, made of parched rice."]}], "ಚುನಾಮುರಿ": [{"type": "noun", "defs": ["= ಚುನಮರಿ."]}], "ಚುನಾಯಿ": [{"type": "noun", "defs": ["= ಚುನಾವಣೆ."]}], "ಚುನಾಯಿಕೆ": [{"type": "noun", "defs": ["= ಚುನಾವಣೆ."]}], "ಚುನಾಯಿತ": [{"type": "adjective", "defs": ["selected (for a post, esp. in an organisation or government) by voting; elected."]}, {"type": "noun", "defs": ["a man selected (for a post, esp. in an organisation or government) by voting by a large number of persons as their representative; an elected male representative."]}], "ಚುನಾಯಿತಾಣ": [{"type": "noun", "defs": ["a small temporary structure or enclosure or a building used for voting at elections."]}], "ಚುನಾಯಿತೆ": [{"type": "noun", "defs": ["a woman selected (for a post, esp. in an organisation or government) by voting by a large number of persons as their representative; an elected female representative."]}], "ಚುನಾಯಿಸು": [{"type": "verb", "defs": ["to choose or select by vote, as for an office or as a representative; to elect."]}], "ಚುನಾವಣೆ": [{"type": "noun", "defs": ["election - a) the selection of a person or persons for office by vote as a representative or representatives; b) the act of electing."]}], "ಚುನಾವಣೆಗೊಳ್ಳು": [{"type": "verb", "defs": ["to be selected by other members or large number of people, as their representative, to an office."]}], "ಚುನಿಚುನಿ": [{"type": "noun", "defs": ["the vine Cardiospermum halicacabum of Sapindacee family."]}], "ಚುನ್ನ": [{"type": "adjective", "defs": ["of inferior quality or character; lacking in dignity or elevation; low; mean."]}, {"type": "noun", "defs": ["a harsh, verbal, insulting, criticism.", "a remark characterised by sarcasm; a caustic remark.", "any flaw, defect, fault or shortcoming.", "a worthless, low or mean thing.", "a felt or expressed desire for something; a wish.", "a narrow-minded, undignified man.", "ಚುನ್ನಮಾಡು cunna māḍu = ಚುನ್ನವಾಡು; ಚುನ್ನವಾಡಿಸು cunnavāḍisu to cause to, to incite (someone) to, deride, mock, belittle another; ಚುನ್ನವಾಡು cunnavāḍu to laugh at in or regard with scorn or contempt; to scoff or jeer at; to mock; 2. to abuse, blame, to revile; 3. to make cutting or caustic remark."]}], "ಚುನ್ನಂಗೆಯ್": [{"type": "verb", "defs": ["to speak, laugh at or treat (someone) scornfully; to ridicule; to lookdown; to disdain."]}], "ಚುನ್ನಕ": [{"type": "noun", "defs": ["a man who uses abusive language; he who looks down another or others."]}], "ಚುನ್ನಗಾರ್ತಿ": [{"type": "noun", "defs": ["a woman who uses abusive language; she who looks down another or others in contempt."]}], "ಚುನ್ನಗೈ": [{"type": "verb", "defs": ["= ಚುನ್ನಂಗೆಯ್."]}], "ಚುನ್ನನುಡಿ": [{"type": "noun", "defs": ["a verbal remark that is deriding or sarcastic."]}], "ಚುನ್ನಾಟ": [{"type": "noun", "defs": ["the act or an instance of treating another contemptuously; an insulting or humiliating."]}], "ಚುಬುಕ": [{"type": "noun", "defs": ["the lower extremity of the face, below the mouth; the projecting part of the lower jaw; the chin."]}], "ಚುಬುಕಿರಿ": [{"type": "verb", "defs": ["to draw the fingers gently on the face towards the point of the chin.", "(fig.) to treat a person or subject lightly or without due seriousness."]}], "ಚುಬುಕಿಱಿ": [{"type": "verb", "defs": ["= ಚುಬುಕಿರಿ."]}], "ಚುಬುಕು": [{"type": "verb", "defs": ["to make crunching sound while eating something; to do such a sound in appreciation of the taste of a thing being eaten.", "to make an indistinct, short sound touching the tip of the tongue to the root of upper, front teeth, as appreciation, expressing pity etc."]}, {"type": "noun", "defs": ["a lash attached to a stick for urging on animals or punishing etc.", "the quality of moving, acting, reacting swiftly; swiftness; quickness; nimbleness; agility."]}], "ಚುಮಚುಮ": [{"type": "noun", "defs": ["= ಚುಮುಚುಮು2."]}], "ಚುಮುಕಿಸು": [{"type": "verb", "defs": ["to scatter (liquid, ashes, powder, etc.) in small drops or particles; to sprinkle."]}], "ಚುಮುಚುಮು": [{"type": "adjective", "defs": ["(a meaningless word used as an adjective to modify) the heat of the rising sun."]}, {"type": "noun", "defs": ["a light pain, burning sensation as felt when struck with the palm on the body or caused by a woud, scratch, etc.; smarting sensation."]}], "ಚುಮುಚುಮುಗುಟ್ಟು": [{"type": "verb", "defs": ["(a light pain, burning sensation) to be felt (when struck with the palm, stick, whip, etc. on the body)."]}], "ಚುಮ್ಮ": [{"type": "adjective", "defs": ["affected by unhappiness or grief; feeling, showing or accompanied by anguish, sorrowful or mournful; sad."]}], "ಚುಮ್ಮಿಸು": [{"type": "verb", "defs": ["to inflict with distress, suffering or pain; to cause grief, anguish."]}], "ಚುಮ್ಮುಚುಮ್ಮು": [{"type": "noun", "defs": ["= ಚುಮುಚುಮು1."]}], "ಚುಮ್ಮುಟು": [{"type": "noun", "defs": ["a feeling of contempt for anything regarded as unworthy; haughty contempt; scorn; disdain."]}], "ಚುಮ್ಮೆನ್": [{"type": "verb", "defs": ["to produce a short, sharp hissing 'chuy' sound (as the hot iron when splashed with water on)."]}], "ಚುಯ್ಯನೆ": [{"type": "adverb", "defs": ["with a short, sharp hissing or 'chuy' sound (as the one made by a hot iron when splashed with water on)."]}], "ಚುರಕ್": [{"type": "noun", "defs": ["an onomatopoeic word to express the feeling of sudden, sharp, but not lasting, pain burning sensation, etc."]}], "ಚುರಚುರನೆ": [{"type": "adverb", "defs": ["with a gulping, sipping sound; with a sound as the one made by small piece of dried wood, twig, bamboo, etc. while being consumed by fire."]}], "ಚುರಮರಿ": [{"type": "noun", "defs": ["= ಚುರುಮುರಿ."]}], "ಚುರಮುರಿ": [{"type": "noun", "defs": ["= ಚುರುಮುರಿ."]}], "ಚುರಿ": [{"type": "noun", "defs": ["an instrument for cutting or stabbing instrument with a sharp metal blade, either single or double-edged, fitted with or hinged into a handle; a knife."]}, {"type": "noun", "defs": ["a small well or reservoir."]}], "ಚುರಿತಕ": [{"type": "noun", "defs": ["a scratch made by sharp finger-nail."]}], "ಚುರಿಮುರಿ": [{"type": "noun", "defs": ["= ಚುರುಮುರಿ."]}], "ಚುರುಕ": [{"type": "noun", "defs": ["an agile, nimble, quick-responding and brisk man.", "a man who is quick, acute or penetrating in perception or intellect; a sharp, cleaver or smart man."]}], "ಚುರುಕು": [{"type": "adjective", "defs": ["cutting; able to cut or pierce easily and effectively; sharp; keen; acute.", "clever, intelligent, smart."]}, {"type": "noun", "defs": ["the quality that makes a thing (as the blade of a knife) suitable for use in cutting or piercing; sharpness.", "a thing that is biting. piercing or sharp, keen, etc.", "the quality of a person who is quick in grasping, thinking or learning; dexterousness; adroitness.", "excessive heat of fire or bodily heat.", "the ability or quality of being quick; quickness; nimbleness; agility.", "dearness in price.", "sharp, biting or smarting pain or sensation (caused by a slapping, whipping, poignant or pungent remark, etc.).", "ಚುರುಕುಮಾಡು curuku māḍu = ಚುರುಕುಗೊಳಿಸು; ಚುರುಕುಮುಟ್ಟಿಸು curuku muṭṭisu to punish, by beating; 2. (fig.) to cause pain by scolding, condemning sharply; ಚುರುಕು ಮೆಣಸಿನಕಾಯಿ curuku meṇasina kāyi the plant Capsicum minimum of Solanaceae family; 2. its small but very hot pod; needle pepper; 3. (fig.) a small boy or girl, small in stature but very sharp, intelligent and active."]}], "ಚುರುಕುಗೊಳಿಸು": [{"type": "verb", "defs": ["to cause to move more rapidly; to make (someone or something) more active; to give impetus, to activate, to hasten; to quicken."]}], "ಚುರುಕುತನ": [{"type": "noun", "defs": ["the quality of being quick, agile, nimble; quickness; nimbleness; swiftness.", "the quality of being clever, shrewd or smart; shrewdness."]}], "ಚುರುಕೆ": [{"type": "noun", "defs": ["= ಚುರುಚುರಕೆ."]}], "ಚುರುಕೆನ್": [{"type": "verb", "defs": ["to be heated, burned.", "(the mind) to feel psychological pain, distress, agony etc."]}], "ಚುರುಗುಟ್ಟು": [{"type": "verb", "defs": ["(the sun-light) to be hot.", "(the mind) to feel psychological pain, distress, agony etc.", "(the body system) to feel the sensation or pain of, hunger.", "to feel smarting or burning sensation."]}], "ಚುರುಗುಡು": [{"type": "verb", "defs": ["= ಚುರುಗುಟ್ಟು."]}], "ಚುರುಚಂಗಿ": [{"type": "noun", "defs": ["= ಚುರುಚುರಕೆ."]}], "ಚುರುಚುರಕೆ": [{"type": "noun", "defs": ["the common stinging nettle Urtica dioca of Urticaceae family."]}], "ಚುರುಚುರು": [{"type": "noun", "defs": ["the sound made by water while boiling.", "a sound imitating it.", "the smarting sensation (as felt when a hot thing is touched)."]}], "ಚುರುಚುರುಗುಟ್ಟು": [{"type": "verb", "defs": ["= ಚುರುಗುಟ್ಟು."]}], "ಚುರುಚುರೆನ್ನು": [{"type": "verb", "defs": ["= ಚುರುಗುಟ್ಟು - 4."]}], "ಚುರುಟು": [{"type": "noun", "defs": ["a more or less cylindrical roll of tobacco cured for smoking, wrapped in a tobacco leaf; a cigar."]}], "ಚುರುಮರಿ": [{"type": "noun", "defs": ["= ಚುರುಮುರಿ."]}], "ಚುರುಮುರಿ": [{"type": "noun", "defs": ["paddy that is soaked and parched; parched rice."]}], "ಚುರುಳೊಮುದು": [{"type": "noun", "defs": ["betel leaf or leaves with pieces of areca nut."]}], "ಚುರೂಟು": [{"type": "noun", "defs": ["= ಚುರುಟು."]}], "ಚುರ್ಕಿ": [{"type": "noun", "defs": ["a mixture of brick pieces and lime, of which a water-proof layer is applied on top of the roof of a building."]}], "ಚುರ್ಕಿಗಾರೆ": [{"type": "noun", "defs": ["= ಚುರ್ಕಿ."]}], "ಚುರ್ಚಿ": [{"type": "noun", "defs": ["a kind of eye-disease characterised by redness and inflammation of the eye-balls.", "the climbing nettle Tragia involucrata of Euphorbiaceae family."]}], "ಚುರ್ಚು": [{"type": "verb", "defs": ["to pass into or through as a pointed instrument does; penetrate; to pierce, stab or penetrate.", "to make a hole or holes in.", "to speak harshly with a view to inflicting pain into another's mind; to make a caustic or sneering remark; ಚುರ್ಚಿ ನುಡಿ curci nuḍi to talk with biting, pungent remarks inflicting pain to another."]}, {"type": "verb", "defs": ["to burn or reduce to ashes; to injure, damage or destroy by fire.", "to cause to undergo, to inflict, pain; to cause agony."]}], "ಚುರ್ಚುಂಗೊಳ್ಳಿ": [{"type": "noun", "defs": ["= ಚುರ್ಚುಗೊಳ್ಳಿ."]}], "ಚುರ್ಚುಗೊಳ್ಳಿ": [{"type": "noun", "defs": ["a piece of burning wood; a firebrand."]}], "ಚುರ್ಚೆ": [{"type": "noun", "defs": ["ಚುರ್ಚಿ - 2.", "a kind of high rising tree."]}], "ಚುಲಕ": [{"type": "noun", "defs": ["the palm of the hand, hollowed as to hold some liquid."]}, {"type": "noun", "defs": ["= ಚುಳುಕು."]}], "ಚುಲಕತನ": [{"type": "noun", "defs": ["= ಚುಳುಕು - 2."]}], "ಚುಲುಕ": [{"type": "noun", "defs": ["= ಚುಲಕ1. 2.a small casket for collyrium."]}], "ಚುಲುಕು": [{"type": "noun", "defs": ["= ಚುಳುಕು."]}], "ಚುಲುಕುಗಾಣು": [{"type": "verb", "defs": ["to treat with disrespect or indifference; to slight."]}], "ಚುಲುಕುತನ": [{"type": "noun", "defs": ["= ಚುಳುಕು - 2."]}], "ಚುಲುಕೋದಕ": [{"type": "noun", "defs": ["that much quantity of water which can be held in the hollowed palm."]}], "ಚುಲ್ಟಾರಿ": [{"type": "noun", "defs": ["a little boy or girl.", "(fig.) an immature or novice person."]}], "ಚುಲ್ಲ": [{"type": "adjective", "defs": ["not conforming to what is accepted as standard or decent manner; indecent; mean; unseemly; improper."]}, {"type": "noun", "defs": ["the quality of being improper, indecent, unseemly.", "a man whose behaviour is characterised by such a quality or qualities."]}, {"type": "noun", "defs": ["the eye with continuous discharge of rheum.", "a man with such an eye."]}], "ಚುಲ್ಲಕ": [{"type": "adjective", "defs": ["= ಚುಲ್ಲ1."]}, {"type": "noun", "defs": ["a man with narrow mentality; a mean fellow."]}], "ಚುಲ್ಲಿ": [{"type": "noun", "defs": ["a small structure of cement, brick or mud used for cooking food, using firewood or coal as fuel."]}], "ಚುಲ್ಲಿಕ": [{"type": "adjective", "defs": ["= ಚುಲ್ಲ1."]}, {"type": "noun", "defs": ["= ಚುಲ್ಲಕ2."]}], "ಚುಲ್ಲುಕ": [{"type": "adjective", "defs": ["= ಚುಲ್ಲ1."]}, {"type": "noun", "defs": ["= ಚುಲ್ಲಕ2."]}], "ಚುಸ್ತ": [{"type": "noun", "defs": ["roast meat.", "the burnt exterior of roast meat."]}], "ಚುಳಕ": [{"type": "adjective", "defs": ["delicately suggestive; not grossly obvious; subtle."]}, {"type": "adjective", "defs": ["= ಚುಲಕ1."]}], "ಚುಳಕಪಾನ": [{"type": "noun", "defs": ["= ಚುಲುಕೋದಕ."]}], "ಚುಳಕೆ": [{"type": "noun", "defs": ["= ಚುಳಿಕೆ."]}], "ಚುಳಿ": [{"type": "noun", "defs": ["the part of something that faces forward or is regarded as facing forward; most important side; forepart.", "beginning - a) a starting or commencing; b) the time of starting.", "the part of an army which goes ahead of the main body; vanguard.", "the parts of a birḍs jaws that are covered with a horny or leathery sheath; the beak.", "the last point, part or extremity of anything; end."]}], "ಚುಳಿಕೆ": [{"type": "noun", "defs": ["a sharp pointed stick carried by travellers; a pike-staff.", "a stick used to beat cotton with."]}], "ಚುಳುಕ": [{"type": "noun", "defs": ["= ಚುಲಕ1."]}], "ಚುಳುಕಾಡು": [{"type": "verb", "defs": ["to play in deep water."]}], "ಚುಳುಕಿ": [{"type": "noun", "defs": ["the fibrous tissue around the individual segments of a jackfruit."]}], "ಚುಳುಕು": [{"type": "noun", "defs": ["a slender, thin, small or subtle thing.", "the behaviour that is lacking seriousness; frivolous conduct.", "the quality or fact of being shorter than the normal one of the species; shortness."]}], "ಚುಳಕುತನ": [{"type": "noun", "defs": ["= ಚುಳುಕು - 2."]}], "ಚುಳುಕೋದಕ": [{"type": "noun", "defs": ["= ಚುಲುಕೋದಕ."]}], "ಚುಳ್ಕಾಡು": [{"type": "verb", "defs": ["= ಚುಳುಕಾಡು."]}], "ಚುಳ್ಕು": [{"type": "noun", "defs": ["= ಚುಳುಕು."]}], "ಚುಳ್ಕೋದಕ": [{"type": "noun", "defs": ["= ಚುಲುಕೋದಕ."]}], "ಚುಳ್ಳನೆ": [{"type": "adverb", "defs": ["causing (sharp) pain; painfully."]}], "ಚುಳ್ಳಿ": [{"type": "noun", "defs": ["the ebony tree Diospyros ebenum (= D. assimilis) of Ebenaceae family; Ceylon ebony.", "the tree Cinnamomum zeylanicum of Lauraceae family, bark of which is used as spice; common cinnamon."]}, {"type": "noun", "defs": ["a contracting of one's lip into folds or wrinkles; a puckering or pursing."]}], "ಚುಳ್ಳಿಮುಳ್ಳಿ": [{"type": "noun", "defs": ["the plant Barleria mysorensis of Acanthaceae family; Mysore prickly purple dye."]}], "ಚುಳ್ಳಿಸು": [{"type": "verb", "defs": ["to wry or writhe (one's face)."]}], "ಚುಱಚಿ": [{"type": "noun", "defs": ["the common stinging nettle Urtica dioca of Urticaceae family."]}], "ಚುಱುಕು": [{"type": "adjective", "defs": ["cutting; able to cut or pierce easily and effectively; sharp; keen; acute.", "clever, intelligent, smart."]}, {"type": "noun", "defs": ["the quality that makes a thing (as the blade of a knife) suitable for use in cutting or piercing; sharpness.", "a thing that is biting. piercing or sharp, keen, etc.", "the quality of a person who is quick in grasping, thinking or learning; dexterousness; adroitness.", "excessive heat of fire or bodily heat.", "the ability or quality of being quick; quickness; nimbleness; agility.", "dearness in price.", "sharp, biting or smarting pain or sensation (caused by a slapping, whipping, poignant or pungent remark, etc.)."]}], "ಚುಱುಚುಱಿಗ": [{"type": "noun", "defs": ["a man who walks, runs swiftly."]}], "ಚುಱಱನೆ": [{"type": "adverb", "defs": ["swiftly; quickly."]}], "ಚುಱೆಱನ್": [{"type": "verb", "defs": ["to be heated, burnt.", "(the mind) to feel psychological pain, distress, agony etc."]}], "ಚುೞ್ಚು": [{"type": "noun", "defs": ["= ಚುರ್ಚು2."]}], "ಚೂ": [{"type": "noun", "defs": ["an indeclinable used to urge a dog to bark at or fall upon."]}], "ಚೂಕ": [{"type": "noun", "defs": ["a contemptible, despicable or base-spirited man; an abject fellow."]}], "ಚೂಕಿ": [{"type": "noun", "defs": ["= ಚೂಕು."]}], "ಚೂಕು": [{"type": "noun", "defs": ["the thing that is lacking or needed; deficiency; a fault; incompleteness."]}], "ಚೂಕನ್ನ": [{"type": "noun", "defs": ["a dog set on (another dog or person).", "(fig.) a person who indiscriminately follows another's orders or acts on another's wish."]}], "ಚೂಚಕ": [{"type": "noun", "defs": ["a small flat ornament worn as a frontlet at the partition of hair in combing.", "a cluster, bunch of flowers, fruits, nuts, etc."]}, {"type": "noun", "defs": ["= ಚೂಚುಕ."]}], "ಚೂಚು": [{"type": "noun", "defs": ["the horny bill of a bird; the beak.", "the projected part of the face as the snout of a mouse.", "that part of an outward-sloping roof of a building, projecting beyond the wall; the roof-ledge."]}, {"type": "adjective", "defs": ["tapering to a point; pointed."]}], "ಚೂಚುಕ": [{"type": "noun", "defs": ["the small protuberance on a breast or udder through which, in the female, the milk passes in suckling the young; the teat; the nipple."]}], "ಚೂಜಿ": [{"type": "noun", "defs": ["a very thin small piece of smooth steel etc. pointed at one end and with a slit (eye) for thread at the other, used in sewing by hand or surgical sutures; a needle."]}], "ಚೂಟ್": [{"type": "noun", "defs": ["a going away; departure."]}], "ಚೂಟಾಟ": [{"type": "noun", "defs": ["a children's game in which one child try to catch others who run hither and thither."]}], "ಚೂಟಿ": [{"type": "noun", "defs": ["the quality of being swift, vehement or forceful.", "the quality characterised by action, motion, energetic work, willing participation, etc.", "skill in performing, getting something done, deceiving, etc.; craftiness; skill; trick.", "great ability or proficiency; expertness that comes from training, practice, etc.; skill.", "the quality of being sharp, keen or pointed; sharpness.", "the quality of moving, doing rapidly; swiftness; quick motion.", "a sign, mark or symbol.", "something that helps to solve a problem, find something, etc.; a clue."]}, {"type": "noun", "defs": ["the object to be attained; an intention or purpose; an aim."]}, {"type": "noun", "defs": ["a period of suspension of work, study or other activity, usu. used for rest, recreation or travel; recess or holiday; vacation.", "cancellation of or release from a debt, tax, penalty, etc."]}], "ಚೂಟಿಕಾತಿ": [{"type": "noun", "defs": ["an active, diligent, clever girl or woman."]}], "ಚೂಟು": [{"type": "verb", "defs": ["to squeeze or compress tightly between the thumb, and a finger (to inflict pain); to nip; to pinch.", "to cut, take off by nipping with one's nails."]}, {"type": "noun", "defs": ["= ಚೂಟಿ1."]}], "ಚೂಟುಗಾರ": [{"type": "noun", "defs": ["a contriver - a) he who can plan with ingenuity; b) he who can bring about or effect by a plan, scheme, etc; c) he who plots or plans secretly (a crime, conspiracy, etc.)."]}], "ಚೂಡ": [{"type": "noun", "defs": ["a bunch of hairs (on the head).", "the natural tuft on the top of the head of a peacock or the comb of a rooster.", "the top of anything; summit; ridge."]}, {"type": "noun", "defs": ["thick, matted hair."]}], "ಚೂಡಕ": [{"type": "noun", "defs": ["a small flat ornament worn as a frontlet at the partition of hair in combing."]}], "ಚೂಡಾ": [{"type": "noun", "defs": ["flattened rice, made by soaking the paddy in water and pounding, spiced and seasoned."]}], "ಚೂಡಾಂತ": [{"type": "noun", "defs": ["the final point or thing; the ultimate; the pinnacle."]}], "ಚೂಡಾಕರಣ": [{"type": "noun", "defs": ["= ಚೂಡಾಕರ್ಮ."]}], "ಚೂಡಾಕರ್ಮ": [{"type": "noun", "defs": ["a ritual of tonsuring a male child for the first time."]}], "ಚೂಡಾಗ್ರ": [{"type": "noun", "defs": ["= ಚೂಡಾಂತ."]}], "ಚೂಡಾಟ": [{"type": "noun", "defs": ["= ಚೂಟಾಟ."]}], "ಚೂಡಾಮಣಿ": [{"type": "noun", "defs": ["a small flat ornament, with a jewel, worn as a frontlet at the partition of hair in combing.", "a person or thing that is par excellent in a particular class."]}], "ಚೂಡಾರತ್ನ": [{"type": "noun", "defs": ["= ಚೂಡಾಮಣಿ."]}], "ಚೂಡಾಲ": [{"type": "noun", "defs": ["the fragrant grass Cyperus haspan of Cyperaceae family."]}], "ಚೂಡಾಲು": [{"type": "adjective", "defs": ["open on four sides."]}, {"type": "noun", "defs": ["a seat with a square type of canopy standing on railings, open on all the four sides, for the riding on the back of an elephant; an open howdah."]}], "ಚೂಡಿ": [{"type": "noun", "defs": ["a long piece of resinous wood or twisted tow dipped in tallow, etc., flaming at one end, used as a portable light; a torch.", "the piece of wood used for this."]}, {"type": "noun", "defs": ["= ಚೂಟಿ1."]}], "ಚೂಡಿಕೆ": [{"type": "noun", "defs": ["the peak or apex."]}], "ಚೂಡೆ": [{"type": "noun", "defs": ["a bunch of hairs (on the head).", "the natural tuft on the top of the head of a peacock or the comb of a rooster.", "a bunch of feathers tied to one's crown, hat, etc.", "the upper part of the body in humans, joined to the trunk by the neck; the head.", "the top of anything; summit; ridge.", "a kind of armlet."]}], "ಚೂಡೋದಯ": [{"type": "noun", "defs": ["= ಚೂಡಾಕರ್ಮ."]}], "ಚೂಣಿ": [{"type": "noun", "defs": ["the part of something that faces forward or is regarded as facing forward; most important side; forepart.", "beginning - a) a starting or commencing; b) the time of starting.", "the part of an army which goes ahead of the main body; vanguard.", "the parts of a birḍs jaws that are covered with a horny or leathery sheath; the beak.", "the last point, part or extremity of anything; end."]}], "ಚೂಣಿಗ": [{"type": "noun", "defs": ["a soldier in the forefront (of an army)."]}], "ಚೂಣಿಗಾಳಗ": [{"type": "noun", "defs": ["= ಚೂಣಿಗಾಳೆಗ."]}], "ಚೂಣಿಗಾಳೆಗ": [{"type": "noun", "defs": ["the fight between the vanguards of two rival armies."]}], "ಚೂಣಿನೋಟ": [{"type": "noun", "defs": ["a looking from the outer corner of the eyes."]}], "ಚೂಣಿಯಾಳ್": [{"type": "noun", "defs": ["= ಚೂಣಿಗ."]}], "ಚೂತ": [{"type": "noun", "defs": ["the evergreen tree Mangifera indica of Anacardiaceae family with yellow-red, oblong fruit having juicy pulp, thick rind and a hard stone; mango tree."]}], "ಚೂತಕ": [{"type": "noun", "defs": ["a small well or reservoir."]}], "ಚೂತಕುಜ": [{"type": "noun", "defs": ["= ಚೂತ.", "2.(pros.) a kind of metre with twenty syllables in each line of a poetry."]}], "ಚೂತಡಿಂಭ": [{"type": "noun", "defs": ["a young mango leaf or leaves."]}], "ಚೂಪು": [{"type": "noun", "defs": ["the act or power of seeing with the eye; sense of sight; vision.", "the organ of sight; the eye."]}, {"type": "adjective", "defs": ["having a sharp point or edge; suitable for use in cutting; sharp."]}, {"type": "noun", "defs": ["a piece of wood or stone that is tapering from a thick back to a thin edge, used as a wedge."]}], "ಚೂಪುಗಾರಿಕೆ": [{"type": "noun", "defs": ["pretentious or conspicuous show; display intended to impress others; ostentation; pomp."]}, {"type": "noun", "defs": ["the quality of having or showing skill; artistic ability; artistry; skilfulness; dexterity."]}], "ಚೂಪುಗೊಳಿಸು": [{"type": "verb", "defs": ["to sharpen by rubbing, grinding or honing."]}], "ಚೂಪುಗೋಲು": [{"type": "noun", "defs": ["a narrow, upright, pointed stake used in fences; a picket; a pale."]}], "ಚೂಬಿಡು": [{"type": "verb", "defs": ["to urge a dog to bark at or fall upon.", "(fig.) to incite a person against another to quarrel with."]}], "ಚೂರ್": [{"type": "verb", "defs": ["to become sharpened, honed."]}], "ಚೂರಣ": [{"type": "noun", "defs": ["any dry substance reduced to small particles or dust by crushing, grinding, etc.; powder."]}], "ಚೂರಣಿಸು": [{"type": "verb", "defs": ["to reduced (a substance) to powder by grinding, crushing, etc; to powder."]}], "ಚೂರಿ": [{"type": "noun", "defs": ["an instrument for cutting or stabbing instrument with a sharp metal blade, either single or double-edged, fitted with or hinged into a handle; a knife.", "ಚೂರಿಯಿಡು cūriyiḍu = ಚೂರಿಹಾಕು; ಚೂರಿಹಾಕು cūri hāku to stab with a knife; 2. (fig.) to harm (someone) by treachery; ಚೂರಿ ಹದ ಆದರೂ ಮರ ಕಡಿಯಲಾರದು cūri hada ādarū mara kaḍiyalāradu (prov.) however efficient a thing is, it has its own limitations; a pen-knife cannot cut Falkland wood."]}], "ಚೂರಿಕೆ": [{"type": "noun", "defs": ["the quality of cutting, piercing; sharpness, keenness."]}], "ಚೂರಿಪಾನ": [{"type": "noun", "defs": ["a triangular, perpendicular parasol or fan carried in a procession before a deity or king."]}], "ಚೂರಿಸು": [{"type": "verb", "defs": ["to reduce to powder or small pieces; to powder; to pulverise.", "to bother, molest or annoy."]}, {"type": "verb", "defs": ["to pierce or wound with a pointed tool or weapon as a knife or dagger.", "to push or stretch oneself forward.", "to become or grow red or hot (with anger); to be blazing."]}], "ಚೂರು": [{"type": "verb", "defs": ["to rub or scrape slightly, as with the fingernails, to relieve itching; to scratch."]}, {"type": "noun", "defs": ["the lower edge of a roof, usu. projecting beyond the sides of a building; the eves."]}, {"type": "noun", "defs": ["a part or fragment broken or separated from the whole; a piece."]}, {"type": "adjective", "defs": ["small in size; not big, large or great.", "small in amount, number or degree; not much."]}, {"type": "adverb", "defs": ["in a small degree; to a slight extent; only slightly; not much."]}], "ಚೂರ್ಚಗೊಳಿಸು": [{"type": "verb", "defs": ["to become pointed towards (as opp. to becoming diversified)."]}], "ಚೂರ್ಣ": [{"type": "noun", "defs": ["= ಚೂರ್ಣಗೆಡ್ಡೆ."]}, {"type": "noun", "defs": ["a white caustic alkaline substance (calcium oxide) obtained by heating limestone and used for making mortar, white-washing walls; lime.", "a substance in the form of fine dry particles; powder; dust.", "any aromatic powder (as of sandal, camphor, etc.).", "a piece of a whole; a fragment.", "a method thieving or cheating, using charming powders.", "(rhet.) lucidity in the style of prose writing; a composition with simple and short compounds."]}], "ಚೂರ್ಣಂಗೆಯ್": [{"type": "verb", "defs": ["= ಚೂರ್ಣಿಸು."]}], "ಚೂರ್ಣಕ": [{"type": "noun", "defs": ["the act or process of pulverising, powdering.", "a machine or device used for this purpose.", "(rhet.) lucidity in the style of prose writing; a composition with simple and short compounds."]}], "ಚೂರ್ಣಕುಂತಲ": [{"type": "noun", "defs": ["the lock of hair that grows above the forehead; the forelock."]}], "ಚೂರ್ಣಕುಂತಳ": [{"type": "noun", "defs": ["= ಚೂರ್ಣಕುಂತಲ."]}], "ಚೂರ್ಣಗಡ್ಡೆ": [{"type": "noun", "defs": ["= ಚೂರ್ಣಗೆಡ್ಡೆ."]}], "ಚೂರ್ಣಗೆಡ್ಡೆ": [{"type": "noun", "defs": ["the edible, starchy, tuberous root of the plant Amorphophallus campanulatum (= Arum campanulatum) of Araceae family; elephant yam.", "the plant itself."]}], "ಚೂರ್ಣನ": [{"type": "noun", "defs": ["the act or process of pulverising, powdering."]}], "ಚೂರ್ಣನೀಯ": [{"type": "adjective", "defs": ["that can be powdered."]}], "ಚೂರ್ಣಮಾಡು": [{"type": "verb", "defs": ["= ಚೂರ್ಣಿಸು."]}], "ಚೂರ್ಣಯೋಗ": [{"type": "noun", "defs": ["a method thieving or cheating, using charming powders."]}], "ಚೂರ್ಣವಾಸ": [{"type": "noun", "defs": ["any aromatic powder (as of sandal, camphor, etc.)."]}], "ಚೂರ್ಣಾಳಕ": [{"type": "noun", "defs": ["= ಚೂರ್ಣಕುಂತಲ."]}], "ಚೂರ್ಣಿ": [{"type": "noun", "defs": ["a sum of one hundred cowries.", "(log.) a putting forward an argument that is unintelligible to the other."]}], "ಚೂರ್ಣಿಕೆ": [{"type": "noun", "defs": ["a lucid, prose composition with simple and short compounds."]}], "ಚೂರ್ಣಿಗ": [{"type": "noun", "defs": ["a man who pulverises, powders.", "a destroyer."]}], "ಚೂರ್ಣಿಸು": [{"type": "verb", "defs": ["to reduce to powder or small pieces; to powder; to pulverise.", "to bother, molest or annoy."]}], "ಚೂರ್ಣೀಕರಿಸು": [{"type": "verb", "defs": ["= ಚೂರ್ಣಿಸು."]}], "ಚೂರ್ಮೊನೆ": [{"type": "noun", "defs": ["the sharp blade (of a cutting instrument)."]}], "ಚೂಲ್": [{"type": "noun", "defs": ["= ಚೂಲು."]}], "ಚೂಲ": [{"type": "noun", "defs": ["a bunch of hairs (on the head).", "the natural tuft on the top of the head of a peacock or the comb of a rooster.", "the top of anything; summit; ridge."]}], "ಚೂಲಿಕೆ": [{"type": "noun", "defs": ["the root of an elephant's ear.", "the crest of a rooster.", "the peak or apex of a tree or mountain.", "the front portion.", "a hinting or indicating of the future event in a drama (by characters behind the stage).", "the hair growing on the head."]}], "ಚೂಲು": [{"type": "noun", "defs": ["(a term used with reference to animals) the condition of having an offspring developing in the uterus; pregnancy.", "a giving birth; delivery."]}], "ಚೂಷೆ": [{"type": "noun", "defs": ["a leathern band put around the belly of an elephant; a leather-girth."]}], "ಚೂಳ": [{"type": "noun", "defs": ["= ಚೂಲ."]}], "ಚೂಳಯ": [{"type": "noun", "defs": ["= ಚೂಳೆಯ."]}], "ಚೂಳಾಕರಣ": [{"type": "noun", "defs": ["= ಚೂಳಾಕರ್ಮ."]}], "ಚೂಳಾಕರ್ಮ": [{"type": "noun", "defs": ["a ritual of tonsuring a male child for the first time."]}], "ಚೂಳಾಮಣಿ": [{"type": "noun", "defs": ["a small flat ornament, with a jewel, worn as a frontlet at the partition of hair in combing.", "a person or thing that is par excellent in a particular class."]}], "ಚೂಳಾಯ್ತ": [{"type": "noun", "defs": ["one of the men who heralds by turn; an official herald.", "a man who recites auspicious hymns or a formal expression of high praise of the king in a palace.", "he who invites another for war, wrestling, etc.", "the duty of a messenger.", "a man who writes, conveys letters or messages."]}], "ಚೂಳಿ": [{"type": "noun", "defs": ["the part of something that faces forward or is regarded as facing forward; most important side; forepart.", "a beginning - a) a starting or commencing; b) the time of starting.", "the part of an army which goes ahead of the main body; vanguard.", "the parts of a birḍs jaws that are covered with a horny or leathery sheath; the beak.", "the last point, part or extremity of anything; end."]}, {"type": "noun", "defs": ["braided hair; plait."]}], "ಚೂಳಿಕಾವರ್ಧನ": [{"type": "noun", "defs": ["a rite performed at the first pregnancy of a Hindu woman."]}], "ಚೂಳಿಕೆ": [{"type": "noun", "defs": ["= ಚೂಲಿಕೆ."]}], "ಚೂಳಿಗಲಹ": [{"type": "noun", "defs": ["the fight between the vanguards of two rival armies."]}]}