{"ಕರಂಜಿಕಾಯ್": [{"type": "noun", "defs": ["a kind of sweet pancake made of sesame seeds, jaggery."]}], "ಕರಂಜಿಕಾಯಿ": [{"type": "noun", "defs": ["= ಕರಂಜಿಕಾಯ್."]}], "ಕರಂಜಿಕೆ": [{"type": "noun", "defs": ["the plant Sphaeranthus indicus of Asteraceae family.", "its fruit."]}], "ಕರಂಜಿಗೆ": [{"type": "noun", "defs": ["= ಕರಂಜಿಕೆ."]}, {"type": "noun", "defs": ["= ಕರಂಜಿಕಾಯ್."]}], "ಕರಂಟ": [{"type": "noun", "defs": ["the hard outer case of a coconut nut kernel; coconut shell.", "a hand-device made of coconut shell for drawing the thread from coir.", "(fig.) a beggaṛs alms-vessel; [rightly: karaṭa]."]}], "ಕರಂಟು": [{"type": "verb", "defs": ["(dial.) to be burnt, scorched or singed."]}], "ಕರಂಡ": [{"type": "noun", "defs": ["a small box or chest, with a lid; a casket.", "a basket made of thin splits of bamboo.", "the plant Carissa carundas of Apocynaceae family.", "its fruit.", "(sculpture.) one of the twelve kinds of head-gear."]}], "ಕರಂಡಕ": [{"type": "noun", "defs": ["= ಕರಂಡ - 1."]}], "ಕರಂಡಗೆ": [{"type": "noun", "defs": ["= ಕರಂಡ."]}], "ಕರಂಡಿ": [{"type": "noun", "defs": ["(dial.) an iron ladle used in seasoning food with oil, spices, etc.", "(dial.) a round vessel or pot, with a liquid."]}], "ಕರಂಡಿಕೆ": [{"type": "noun", "defs": ["= ಕರಂಡ - 1."]}], "ಕರಂಡಿಗೆ": [{"type": "noun", "defs": ["= ಕರಂಡ."]}], "ಕರಂಡೆ": [{"type": "noun", "defs": ["= ಕರಂಜಿಕೆ."]}, {"type": "noun", "defs": ["= ಕರಂಡ - 3 & 4."]}], "ಕರಂಪು": [{"type": "noun", "defs": ["= ಕರಂಬು2."]}], "ಕರಂಬ": [{"type": "noun", "defs": ["the main stem of a herbaceous plant; stalk."]}, {"type": "adjective", "defs": ["joined or mingled in a single mass or compound; blended; mixed.", "made up of different or incongruous parts, groups, elements, etc."]}], "ಕರಂಬವಾಸಿಗ": [{"type": "noun", "defs": ["a garland or wreath made of different kinds of flowers."]}], "ಕರಂಬಳ": [{"type": "noun", "defs": ["the plant Dillenia pentagyna of Dilleniaceae family."]}], "ಕರಂಬಿಡಿ": [{"type": "verb", "defs": ["to hold or seize with the hand.", "to take (a girl) in marriage as one's wife."]}], "ಕರಂಬು": [{"type": "noun", "defs": ["land that is uncultivated or left uncultivated."]}, {"type": "noun", "defs": ["a bad smell."]}], "ಕರಂಭ": [{"type": "noun", "defs": ["a dish made of the flour of a parched cereal (Rāgi, paddy,etc.) mixed with curds."]}], "ಕರಂಭಕ": [{"type": "noun", "defs": ["= ಕರಂಭ."]}], "ಕರಂಭತ್ತ": [{"type": "noun", "defs": ["a cutting tool, operated by hand or machinary, having a blade with a series of sharp teeth, used to cut esp. wood with a to-and-fro or circular movement; a saw."]}], "ಕರಕ": [{"type": "noun", "defs": ["a small water container with a handle, a snout or nozzle.", "frozen rain falling in a shower or storm of pellets; hail.", "the tree bearing this fruit, Punica granatum of Punicaceae family and its fruit; pomegranate.", "a large area covered chiefly with trees and undergrowth; a forest.", "the tree Terminalia chebula of Combretaceae family.", "its nut; myrobalan.", "a structure or place where a bird lays eggs and shelters its young; a nest.", "a water pitcher; a pot.", "the hard outer cover of the coconut kernal; coconut shell.", "the terminal part of the arm from the wrist to the tip of fingers; the hand.", "a regular and mandatory payment made to a ruler by his subordinate ruler; tribute.", "a kind of bird."]}], "ಕರಕಂದು": [{"type": "noun", "defs": ["the tree Ziziphus Mauritiana (= Z.jujuba) of Rhamnaceae family and its fruit; Indian plum."]}], "ಕರಕಕಾಯಿ": [{"type": "noun", "defs": ["the nut of the plant Terminalia chebula of Combretaceae family; myrobalan."]}], "ಕರಕಣಿ": [{"type": "noun", "defs": ["the plant Buddeleda asiatica of Loganiaceae family."]}], "ಕರಕದರಿ": [{"type": "noun", "defs": ["a sect among Jōgis whose mother tongue is Marāṭhi."]}], "ಕರಕನ್ನ": [{"type": "noun", "defs": ["cooked rice that is charred by overheating."]}], "ಕರಕರ": [{"type": "noun", "defs": ["the sound made by gnawing while biting with the teeth.", "the act of tormenting, as by inflicting constant pain or causing persistent fear, etc.; an instance of this; harassment."]}], "ಕರಕರಸು": [{"type": "verb", "defs": ["= ಕರಕರಿಸು."]}], "ಕರಕರಿ": [{"type": "noun", "defs": ["= ಕರಕರ."]}], "ಕರಕರಿಸು": [{"type": "verb", "defs": ["to torment, as by constant pain, fear, etc.; to harass; to gnaw."]}], "ಕರಕರೆ": [{"type": "noun", "defs": ["= ಕರಕರ."]}], "ಕರಕರೆಗೊಳ್": [{"type": "verb", "defs": ["= ಕರಕರೆಗೊಳು."]}], "ಕರಕರೆಗೊಳು": [{"type": "verb", "defs": ["to give way to anxiety or unease; to allow one's mind to dwell on difficulty or troubles; to worry.", "to get excited or stirred by zeal."]}], "ಕರಕಲುರೋಗ": [{"type": "noun", "defs": ["an infectious disease caused by the bacillus Mycobacterium tuberculosis, characterised by tubercles, esp. in the lungs; tuberculosis."]}], "ಕರಕವೃಷ್ಟಿ": [{"type": "noun", "defs": ["a heavy dropping, down pour of hails."]}], "ಕರಕಷ್ಟ": [{"type": "noun", "defs": ["a very difficult condition.", "a wretched, miserable condition."]}], "ಕರಕಾನಿ": [{"type": "noun", "defs": ["= ಕರಕಣಿ."]}], "ಕರಕಿ": [{"type": "noun", "defs": ["the climber Grewia orientalis of Tiliaceae plant."]}], "ಕರಕು": [{"type": "noun", "defs": ["that which is charred by overheating.", "the condition of being charred."]}, {"type": "noun", "defs": ["a contagious skin disease with severe itching and red papules, caused by the itch mite; scabies."]}], "ಕರಕೂನ": [{"type": "noun", "defs": ["a man whose back is sharply bent forward."]}], "ಕರಕೆ": [{"type": "noun", "defs": ["a beggar's alms-vessel.", "pellets of frozen rain falling in showers from cumulonimbus clouds; hail."]}], "ಕರಕೆಲೆ": [{"type": "noun", "defs": ["the plant Grewia aspera of Tiliaceae family."]}], "ಕರಕೋಪಲ": [{"type": "noun", "defs": ["rounded piece of ice that is larger than 5 mm and sometimes falls during thunderstorms; a frozen raindrop; a hailstone:."]}], "ಕರಗ": [{"type": "noun", "defs": ["a water-jar.", "a festival observed on the full moon-day of the 12th month of a lunar year, in which a man, dressed as a woman runs on the roads carrying on his head jars filled with water without holdig them.", "a folk dance prevailing in some parts of Tamiḷ Nāḍu and Kēraḷa.", "ಕರಗದಮ್ಮ karagadamma a female deity of ಕರಗ."]}], "ಕರಗಂದುಗ": [{"type": "noun", "defs": ["an inflated ball played with hands."]}], "ಕರಗಂಧ": [{"type": "noun", "defs": ["the plant Uraria lagopodioides.", "the grass Cynodon dactylon (=Panicum dactylon) of Poaceae family."]}], "ಕರಗಂಬೊಱು": [{"type": "verb", "defs": ["to carry the water-vessel on the head.", "(fig.) to undertake religiously a task to do."]}], "ಕರಗತ": [{"type": "adjective", "defs": ["acquainted by experience and study; skilled or learned (in a specified subject); versed."]}, {"type": "noun", "defs": ["that which is acquainted with, mastered over, controlled."]}], "ಕರಗನ್ನೆ": [{"type": "noun", "defs": ["the plant Celastrus paniculata of Celastraceae family."]}], "ಕರಗಪಡಿ": [{"type": "noun", "defs": ["= ಕರಗುಪಡಿ."]}], "ಕರಗಬಳ": [{"type": "noun", "defs": ["= ಕರಗವಳ."]}], "ಕರಗಮಾನ್ಯ": [{"type": "noun", "defs": ["an endowment of land for the purpose of Karaga festival."]}], "ಕರಗಲ": [{"type": "adjective", "defs": ["becoming lean gradually; losing much flesh or weight day by day."]}], "ಕರಗಲು": [{"type": "noun", "defs": ["a fruit ripened too much, that has lost its natural taste.", "the state of being in very advanced age; ripe age."]}], "ಕರಗಲೆ": [{"type": "noun", "defs": ["the plant Grewia villosa of Tiliaceae family."]}], "ಕರಗವಳ": [{"type": "noun", "defs": ["a servant whose work is to supply water from a well (using a water pot)."]}], "ಕರಗವಿಡಿ": [{"type": "verb", "defs": ["to carry the water-vessel on the head."]}], "ಕರಗಲಂತಿಕೆ": [{"type": "noun", "defs": ["a small water container with a handle, a snout or nozzle."]}], "ಕರಗಸ": [{"type": "noun", "defs": ["a cutting tool, operated by hand or machinary, having a blade with a series of sharp teeth, used to cut esp. wood with a to-and-fro or circular movement; a saw."]}, {"type": "noun", "defs": ["a genus of fish."]}], "ಕರಗಸಿಗ": [{"type": "noun", "defs": ["a man who cuts wood etc. with a saw."]}], "ಕರಗಹಿ": [{"type": "noun", "defs": ["very bitter taste."]}], "ಕರಗಳಂತಿಕೆ": [{"type": "noun", "defs": ["= ಕರಗಲಂತಿಕೆ."]}], "ಕರಗಳಂತಿಗೆ": [{"type": "noun", "defs": ["= ಕರಗಲಂತಿಕೆ."]}], "ಕರಗಳ್ಳ": [{"type": "noun", "defs": ["he who avoids or escapes from, paying tax to the government by illegal means; a tax-evader."]}], "ಕರಗಾಣ": [{"type": "noun", "defs": ["a hand operated oil making machine (as opp. to bullock-driven or power-driven one)."]}], "ಕರಗಿಸು": [{"type": "verb", "defs": ["to cause (a solid) to become liquid; to melt; to liquefy.", "to cause to lose fat or weight; to make (something or someone) lean.", "to spend, use wastefully or extravagantly; to squander.", "to soften a person by love, begging, etc."]}], "ಕರಗು": [{"type": "verb", "defs": ["to become liquefied by heat; to melt.", "to be merged with a liquid (losing one's identity); to melt.", "to become lean; to lose fat from the body; to lose vigour or vitality; to fail in health; to become weak.", "to lose one's physical form; to disappear.", "to become compassionate; to be softened as a result of pity, love, etc.; to melt.", "to cause to change to a liquid condition by heat."]}], "ಕರಗುಪಡಿ": [{"type": "noun", "defs": ["the fact of (something) being sold.", "a tax on sales, usu. levied as a percentage of, and added to, the price paid by the consumer; sales tax."]}], "ಕರಗುಹ": [{"type": "noun", "defs": ["the act or fact of (something) melting.", "the act or fact of (someone) becoming softened by pity, love, etc."]}], "ಕರಗ್ರ": [{"type": "noun", "defs": ["a plantain leaf from which the tip is cut off."]}], "ಕರಗ್ರಹಣ": [{"type": "noun", "defs": ["the act of holding another's hand.", "marriage (in which the bridegroom holds the bride's hand symbolising the marriage)."]}], "ಕರಚಿ": [{"type": "noun", "defs": ["a kind of tree."]}], "ಕರಚಿಕಾಯಿ": [{"type": "noun", "defs": ["= ಕರಜಿಕಾಯಿ."]}], "ಕರಚುರಿ": [{"type": "noun", "defs": ["a sword."]}], "ಕರಚೋ": [{"type": "noun", "defs": ["a tree."]}], "ಕರಜ": [{"type": "noun", "defs": ["the tree Pongamia pinnata (= P. glabra) of Papilionaceae family; Indian beach."]}, {"type": "noun", "defs": ["that which grows from the hand (out at the ends of the fingers); a nail.", "any hand-made thing.", "a kind of perfume."]}], "ಕರಜಾಂಶು": [{"type": "noun", "defs": ["the lustre of one's nails (of the hand)."]}], "ಕರಜಾತ": [{"type": "noun", "defs": ["= ಕರಜ2 - 1.", "2) one who has been initiated by a religious teacher (in relation with that teacher)."]}], "ಕರಜಿಕಾಯಿ": [{"type": "noun", "defs": ["a kind of sweet pancake made of sesame seeds, jaggery."]}], "ಕರಜಿಗೆ": [{"type": "noun", "defs": ["= ಕರಜಿಕಾಯಿ."]}, {"type": "noun", "defs": ["the plant Carissa carundas of Apocynaceae family.", "its fruit."]}], "ಕರಜಿಗೆಕಾಯ್": [{"type": "noun", "defs": ["= ಕರಜಿಕಾಯಿ."]}], "ಕರಜೀಕಾಯಿ": [{"type": "noun", "defs": ["= ಕರಜಿಕಾಯಿ."]}], "ಕರಟ": [{"type": "noun", "defs": ["the hard outer case of a coconut kernel; coconut shell.", "a hand-device made of coconut shell for drawing the thread from coir.", "(fig.) a beggar's alms-vessel.", "ಕರಟಕಟ್ಟು karaṭakaṭṭu to become hardened."]}, {"type": "noun", "defs": ["either of the flat surfaces alongside the forehead, in front of each ear of an elephant; the temples.", "any large bird of the genus Corvus, having a powerful black beak, a harsh call, and usu. glossy black plumage; a crow.", "any of various small tailless amphibians of the order Anura, having a moist smooth skin and legs developed for jumping; a frog.", "the region of the atmosphere and the blue canopy above as seen from the earth; the sky.", "the spiritual or immaterial part of a human being or animal, often regarded as immortal; the soul.", "a kind of musical instrument.", "an orange-flowered thistle-like plant, Carthamus tinctorius, whose seeds yield an edible oil; safflower plant.", "one who propounds or believes in, the theory or belief that god does not exist; an atheist.", "a degraded brāhmaṇa."]}], "ಕರಟಕ": [{"type": "noun", "defs": ["= ಕರಟ2 - 1 & 2.", "a man who makes a malicious, false, and injurious statement about another with an intention to tarnishing the latter's opportunity, credit, position, etc."]}], "ಕರಟಲು": [{"type": "noun", "defs": ["(dial.) a feeling of discontented or resentful longing aroused by another's better fortune, well-being, etc.; envy."]}], "ಕರಟಿ": [{"type": "noun", "defs": ["an elephant."]}, {"type": "noun", "defs": ["a kind of weapon."]}], "ಕರಟು": [{"type": "verb", "defs": ["to burn oneself to become coal; to become charred by burning.", "to become pitiless, ruthless."]}, {"type": "verb", "defs": ["(growth, development) to get stunted; to grow dwarf.", "to have a stunted growth; to become stunted."]}, {"type": "noun", "defs": ["the state or codition of growth, development being stunted; stunted growth."]}, {"type": "noun", "defs": ["a tall bird of the family Gruidae, with long legs, long neck, and straight bill; a crane."]}], "ಕರಟುಕಾಯಿ": [{"type": "noun", "defs": ["a fruit consisting of a hard or tough shell around an edible kernel (as coconut, peanut, almond, etc.); a nut."]}], "ಕರಟುಬೀಳು": [{"type": "verb", "defs": ["= ಕರಟು2."]}], "ಕರಟುಮುರಟು": [{"type": "adjective", "defs": ["rough and knotty."]}], "ಕರಟುಮೊರಟು": [{"type": "adjective", "defs": ["= ಕರಟುಮುರಟು."]}], "ಕರಟೆ": [{"type": "noun", "defs": ["= ಕರಟ2 - 2."]}], "ಕರಡ": [{"type": "noun", "defs": ["dried grass in a forest or on a mountain or hill."]}], "ಕರಡಕ": [{"type": "noun", "defs": ["the tree Ehretia laevis of Ehretiaceae family; Nilagiri ivory wood."]}], "ಕರಡಕ್ಕಿ": [{"type": "noun", "defs": ["rice that is not polished well."]}], "ಕರಡಗೆ": [{"type": "noun", "defs": ["a small box or chest, with a lid; a casket.", "a basket made of thin splits of bamboo."]}], "ಕರಡಚ್ಚು": [{"type": "noun", "defs": ["a trial impression taken for checking errors, making corrections before final printing; a proof."]}], "ಕರಡಜ್ವರ": [{"type": "noun", "defs": ["an acute inflammation of the eyes and upper respiratory tract, accompanied by sneezing, which is an allergic reaction, caused mainly by the pollen of some grasses and trees; pollenosis; hay-fever."]}], "ಕರಡವುಲ್": [{"type": "noun", "defs": ["= ಕರಡಹುಲ್ಲು."]}], "ಕರಡ ಹಂಜಿಹುಲ್ಲು": [{"type": "noun", "defs": ["the grass Cymbopogon coloratus of Poaceae family."]}], "ಕರಡಹುಲ್ಲು": [{"type": "noun", "defs": ["the grass Heteropogon contortus (= Andropogon contortus) of Poaceae family."]}], "ಕರಡಾ ಕಾಸಿಹುಲ್ಲು": [{"type": "noun", "defs": ["the grass Bothriochloa intermedia (= Andropogon intermedius) of Poaceae family."]}], "ಕರಡಿ": [{"type": "noun", "defs": ["a bear (Melursus ursinus) with shaggy, black fur, a flexible snout, and long, white claws, found in India and Sri Lanka and feeds chiefly on fruits and insects; sloth bear.", "ಕರಡಿಗೆ ಹೆದರದವ, ಕಂಬಳಿಗೆ ಹೆದರ‍್ಯಾನೆ? karaḍige hedaradava kambaḷige hedaryāne? is he who has slain a lion scared of a mouse?."]}, {"type": "noun", "defs": ["= ಕರಡೆ2."]}, {"type": "noun", "defs": ["the tree Chukrasia tabularis of Meliaceae family; Jamaica cedar."]}], "ಕರಡಿಕಣ್ಣಿನ ಗಿಡ": [{"type": "noun", "defs": ["= ಕರಡಿಕಣ್ಣಿನ ಗೆಡ್ಡೆ."]}], "ಕರಡಿಕಣ್ಣಿನ ಗೆಡ್ಡೆ": [{"type": "noun", "defs": ["the plant Gloriosa superba of Liliaceae family."]}], "ಕರಡಿಕೆ": [{"type": "noun", "defs": ["= ಕರಡಗೆ."]}], "ಕರಡಿಗೆ": [{"type": "noun", "defs": ["= ಕರಡಗೆ."]}], "ಕರಡಿಗೊಲ್ಲ": [{"type": "noun", "defs": ["a sub-sect among the Kāḍugolla, a tribal community engaged in pasturing."]}], "ಕರಡಿಮಜಲು": [{"type": "noun", "defs": ["= ಕರಡೆ2.", "the act and skill of playing the drum karaḍe."]}], "ಕರಡಿಮೇಳ": [{"type": "noun", "defs": ["= ಕರಡಿಮಜಲು."]}], "ಕರಡು": [{"type": "verb", "defs": ["to move, shake, agitate, etc., esp. slightly; to move a spoon, ladle or other implement round and round in (a liquid etc.), esp. to mix the ingredients or constituents; to stir.", "to disturb the quiet of; to evoke strong feelings in.", "to be stirred to action or strong feeling; to be aroused; to be excited.", "to gather; to collect together; to glean."]}, {"type": "noun", "defs": ["= ಕರಡ."]}, {"type": "adjective", "defs": ["rough - a) having an uneven or irregular surface, not smooth or level or polished; b) harsh, rude, brutal, etc.; not gentle or mild.", "ಕರಡಾಗು karaḍāgu to be spoiled; to become useless; ಕರಡುಮಾಡು karaḍu māḍu to spoil; to render useless."]}, {"type": "noun", "defs": ["a physical or moral defect; a stain; a flaw; a blemish."]}, {"type": "noun", "defs": ["the state or codition of growth, development being stunted; stunted growth."]}, {"type": "noun", "defs": ["a draft - a) a preliminary written version of a speech, document, etc.; b) a rough preliminary outline of a scheme; c) a sketch of a work to be carried out.", "a thing made to imitate or be identical to another; a copy."]}, {"type": "noun", "defs": ["the plant Celosia argentea of Amaranthaceae family.", "the plant Olax scandens of Olacaceae family."]}], "ಕರಡುಕಟ್ಟು": [{"type": "verb", "defs": ["= ಕರಡುಗಟ್ಟು."]}], "ಕರಡುಗಟ್ಟು": [{"type": "verb", "defs": ["(growth, development) to get stunted; to grow dwarf."]}], "ಕರಡುಗೊಳಿಸು": [{"type": "verb", "defs": ["to spoil; to render useless."]}], "ಕರಡುಪ್ರತಿ": [{"type": "noun", "defs": ["= ಕರಡು6 - 1."]}], "ಕರಡುಬರ್ಬರ": [{"type": "noun", "defs": ["a white (colourless and effulgent) gem; (?)."]}], "ಕರಡುಮುತ್ತು": [{"type": "noun", "defs": ["a defective pearl."]}], "ಕರಡುಮುರುಡು": [{"type": "adjective", "defs": ["rough and knotty."]}], "ಕರಡುಯಾಕೆ": [{"type": "noun", "defs": ["the plant Olax wightiana of Olacaceae family."]}], "ಕರಡುಸಾಲ": [{"type": "noun", "defs": ["a debt that is not recoverable; a bad debt."]}], "ಕರಡೆ": [{"type": "noun", "defs": ["= ಕರಡ."]}, {"type": "noun", "defs": ["a kind of percussion instrument (drum), that is oblong, played on both sides, used in folk dance."]}, {"type": "adjective", "defs": ["= ಕರಡು3."]}], "ಕರಡೆಕಾಗದ": [{"type": "noun", "defs": ["a kind of paper with rough surface."]}], "ಕರಡೋಲೆ": [{"type": "noun", "defs": ["a trial impression taken forchecking errors, making corrections before final printing; a proof.", "ಕರಡೋಲೆಯೋದುಗ karaḍōleyōduga he who reads, and makes correction on, the trial impression before final printing; a proof-reader."]}], "ಕರಣ": [{"type": "noun", "defs": ["an act; an action; a deed; a work.", "a thing by means of which something is done; means; an instrument; a device.", "any of the five organs (the eye, nose, skin, ear or tongue) of C human being; an organ of sense.", "a gesture or motion that conveys information, gives a command, etc.; a sign.", "the body (of a human being).", "a piece of land used for farming, agriculture; a field.", "something one intends to get or do; an intention; a purpose.", "a writer or accountsman.", "(gram.) the sense expressed by the instrumental case.", "(dance) coordinated movements of the hands and feet.", "(astrol.) one of the eleven divisions of a lunar day.", "a symbol for the number five 5.", "a man whose mother belongs to fourth caste and father to the trading caste."]}], "ಕರಣಗ್ರಂಥ": [{"type": "noun", "defs": ["an ancient book in Jainism on astrology."]}], "ಕರಣಗ್ರಾಮ": [{"type": "noun", "defs": ["the organs of sense (collectively)."]}], "ಕರಣಚತುಷ್ಟಯ": [{"type": "noun", "defs": ["(phil.) the four faculties - the mind, reasoning, intellect and ego."]}], "ಕರಣಜಯಿತ್ವ": [{"type": "noun", "defs": ["the quality or fact of a person who has over the influence of orgns of sense."]}], "ಕರಣತ್ರಯ": [{"type": "noun", "defs": ["the combination of the mind, speech and the body."]}], "ಕರಣವೃತ್ತಿ": [{"type": "noun", "defs": ["the functions of the organs of sense."]}], "ಕರಣವೇದ್ಯ": [{"type": "adjective", "defs": ["that can be perceived by any of the organs of sense."]}, {"type": "noun", "defs": ["that which can be perceived by any of the organs of sense; the object of perception."]}], "ಕರಣವೇಳೆ": [{"type": "noun", "defs": ["= ಕರಣ - 11."]}], "ಕರಣಶಾಲೆ": [{"type": "noun", "defs": ["the office of an accountant."]}], "ಕರಣಶುದ್ಧಿ": [{"type": "noun", "defs": ["purity of mind, speech and body."]}], "ಕರಣಶುದ್ಧಿವಡೆ": [{"type": "verb", "defs": ["to keep one's mind, speech and body sinless."]}], "ಕರಣಸಮಾಧಿ": [{"type": "noun", "defs": ["a complete subjugation of passion of the organs of sense."]}], "ಕರಣಸಾಲೆ": [{"type": "noun", "defs": ["= ಕರಣಶಾಲೆ."]}], "ಕರಣಹಸಿಗೆ": [{"type": "noun", "defs": ["= ಕರಣಹಸುಗೆ."]}], "ಕರಣಹಸುಗೆ": [{"type": "noun", "defs": ["(vīr.) an explaining in detail the elements, structure and principles of physical body and metaphysics."]}], "ಕರಣಾಗ್ರಣಿ": [{"type": "noun", "defs": ["the chief accountant.", "an eminent accountant."]}], "ಕರಣಾಧಿಪತಿತ್ವ": [{"type": "noun", "defs": ["the office, position and duties of the chief accountant."]}], "ಕರಣಾನುಯೋಗ": [{"type": "noun", "defs": ["(Jain.) the scripture that contains the life history, renunciation, teachings etc. of thīrthankaras."]}], "ಕರಣಿ": [{"type": "noun", "defs": ["= ಕರಣೆ1."]}, {"type": "noun", "defs": ["= ಕರಣೆ2."]}, {"type": "noun", "defs": ["a woman whose parents belong to different castes or religions.", "(math.) a surd or irrational number."]}, {"type": "noun", "defs": ["= ಕರಣಿಕ."]}, {"type": "noun", "defs": ["an elephant's elongated prehensile nose; the trunk."]}, {"type": "noun", "defs": ["the plant Aloe perfoliata of Liliaceae family."]}], "ಕರಣಿಕ": [{"type": "noun", "defs": ["a professional keeper or inspector of accounts; an accountant."]}], "ಕರಣಿಕತನ": [{"type": "noun", "defs": ["= ಕರಣಿತ್ವ."]}], "ಕರಣಿಕತ್ವ": [{"type": "noun", "defs": ["the duty of or the fact of being, an accountant."]}], "ಕರಣಿಕಮಂಡಳೀಕ": [{"type": "noun", "defs": ["the chief accountant.", "an eminent accountant."]}], "ಕರಣಿಕರ": [{"type": "noun", "defs": ["the evergreen tree Pterospermum acerifolium of Sterculiaceae family."]}], "ಕರಣಿಕಶಾಲೆ": [{"type": "noun", "defs": ["= ಕರಣಶಾಲೆ."]}], "ಕರಣಿಗ": [{"type": "noun", "defs": ["= ಕರಣಿಕ."]}], "ಕರಣಿಗೆ": [{"type": "noun", "defs": ["= ಕರಣೆ2 - 2."]}], "ಕರಣೀಕ": [{"type": "noun", "defs": ["= ಕರಣಿಕ."]}], "ಕರಣೀಕತನ": [{"type": "noun", "defs": ["= ಕರಣಿತ್ವ."]}], "ಕರಣೀಯ": [{"type": "adjective", "defs": ["that is to be done.", "fit to be done."]}], "ಕರಣೆ": [{"type": "noun", "defs": ["a cogulated mass (as of curds); a thick mass of coagulated liquid, esp. of blood; a clot.", "a paste applied to the central part of the skin or parchment of a Mridanga, tabala."]}, {"type": "noun", "defs": ["a long brass blow-pipe.", "a small hand-held tool with a flat pointed blade, used to apply and spread mortar etc by a mason; a trowel."]}], "ಕರಣೇಂದ್ರಿಯ": [{"type": "noun", "defs": ["any of the five organs (the eye, nose, skin, ear or tongue) of human being; an organ of sense."]}], "ಕರತನ": [{"type": "noun", "defs": ["the quality of being highly sharp, intense; the greatest degree (of anything)."]}], "ಕರತರ್ಜನ": [{"type": "noun", "defs": ["a gesture or motion of one hand or a finger that conveys information, gives a command, etc.; a sign."]}], "ಕರತಲ": [{"type": "noun", "defs": ["the inner surface of the hand between the wrist and fingers; the palm."]}], "ಕರತಲಾಮಲಕ": [{"type": "noun", "defs": ["(fig.) a plainly evident or crystal clear thing or matter; a thing as plain as the nose on a maṇs face.", "(fig.) complete knowledge (of something, some subject,etc.)."]}], "ಕರತಳ": [{"type": "noun", "defs": ["= ಕರತಲ."]}], "ಕರತಳಾಮಳಕ": [{"type": "noun", "defs": ["= ಕರತಲಾಮಲಕ."]}], "ಕರತಾಡನ": [{"type": "noun", "defs": ["the act of clapping; an expression of approbation, esp. from an audience etc. by clapping; applause."]}], "ಕರತಾಲ": [{"type": "noun", "defs": ["= ಕರತಾಳ2."]}], "ಕರತಾಳ": [{"type": "noun", "defs": ["= ಕರತಾಳೆ."]}, {"type": "noun", "defs": ["a pair of small concave plates used as a percussion instrument, producing metallic sound.", "a keeping of time in music by slapping rhythmically with one hand on the other or thigh."]}], "ಕರತಾಳಿ": [{"type": "noun", "defs": ["= ಕರತಾಳೆ."]}], "ಕರತಾಳೆ": [{"type": "noun", "defs": ["the tree Corypha umbraculifera of Aracaceae family; umbrella palm."]}], "ಕರತ್ರಾಣ": [{"type": "noun", "defs": ["a metal or leather cover for the hands to protect from being injured or wounded."]}], "ಕರದಂಟು": [{"type": "noun", "defs": ["a sweet cake made of the flour of Bengal gram, jaggery, groundnut, etc."]}], "ಕರದಂಡ": [{"type": "noun", "defs": ["a lotus flower.", "a rigorous punishment."]}, {"type": "noun", "defs": ["a hand stick or walking stick."]}], "ಕರದಮ": [{"type": "noun", "defs": ["watery mud; slush; mire.", "perfumed water."]}], "ಕರದೀಪ": [{"type": "noun", "defs": ["a lamp with a handle; a handy lamp."]}], "ಕರದೀವಿಗೆ": [{"type": "noun", "defs": ["= ಕರದೀಪ."]}], "ಕರದುಂದು": [{"type": "noun", "defs": ["a spending of money wastefully, extravagantly."]}], "ಕರಧೈರ್ಯ": [{"type": "noun", "defs": ["extraordinary courage."]}], "ಕರನಾಶ": [{"type": "noun", "defs": ["a complete destruction, annihilation."]}], "ಕರನಿರಾಕರಣೆ": [{"type": "noun", "defs": ["(hist.) refusal to pay a tax or taxes to the government (as a protest against its policies)."]}], "ಕರನ್ಯಾಸ": [{"type": "noun", "defs": ["a touching of the a finger or fingerss with another finger, reciting appropriate mystic hymns."]}], "ಕರಪ": [{"type": "noun", "defs": ["the process or an instance of inviting."]}], "ಕರಪಟಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["the learning of the act or practice of stealing; art of thievery."]}], "ಕರಪತ್ರ": [{"type": "noun", "defs": ["a hand tool with a toothed metal blade used to cut wood or other material by means of a to-and-fro motion; a saw.", "a toothed sword."]}, {"type": "noun", "defs": ["a small printed notice or advertisement distributed by hand; a handbill."]}], "ಕರಪಲ": [{"type": "noun", "defs": ["the act or an instance of plucking at the bedclothes by a delirious patient; carphology.", "a frequent, unintentional movement of limbs.", "(fig.) a tendency or disposition to annoy or vex with playful tricks; mischief."]}], "ಕರಪಲ್ಲವ": [{"type": "noun", "defs": ["a hand that is tender."]}], "ಕರಪಾಣಿ": [{"type": "noun", "defs": ["a noncontagious skin disease with inflammation, itching, discharge from blisters and the formation of scales; eczema."]}], "ಕರಪಾತ್ರ": [{"type": "noun", "defs": ["the cavity formed by both the palms joined together while the hands are stretched.", "a small vessel held in the hand.", "he who begs with stretched hands; a mendicant."]}], "ಕರಪಾತ್ರೆ": [{"type": "noun", "defs": ["a small bowl held in the hand.", "an alms bowl of a beggar.", "the hallowed palm stretched for food."]}], "ಕರಪಾದಿ": [{"type": "noun", "defs": ["any of the mammals in which hands and legs have separate functions (as opp. to other mammals which walk on all the four legs and do not have special application of forelegs)."]}], "ಕರಪಾಲ": [{"type": "noun", "defs": ["a weapon for cutting and thrusting, consisting of a hilt with a cross-guard and a long straight or curved blade with a sharp point; a sword; a scimitar."]}], "ಕರಪಾಲಮೇಳ": [{"type": "noun", "defs": ["a folk dance by a group of Śaivas performed with tambour and tambourines (shallow, single-headed hand-drums having jingling metal disks in the rim played by shaking, hitting with the knuckles) etc."]}], "ಕರಪಾಲಿಕೆ": [{"type": "noun", "defs": ["a small sword; a knife; a scimitar.", "a short, thick stick; a cudgel."]}], "ಕರಪೀಠ": [{"type": "noun", "defs": ["a small, flat piece of wooden plank tied to the palms for crawling on the ground by a lame person.", "a heavy wooden piece used to ram the ground while leveling."]}], "ಕರಪೀಡನ": [{"type": "noun", "defs": ["a squeezing with the hand.", "a vexing by levying unduly heavy taxes.", "marriage (in which the bridegroom holds the bride's hand symbolising the marriage)."]}], "ಕರಪುಟ": [{"type": "noun", "defs": ["the cavity formed by open hands joined together and folded slightly; the hollow of the palms.", "a hand gesture, joining both the palms and holding the tips of the fingers pointing upward, showing reverence, humility, etc."]}], "ಕರಪುರಿ": [{"type": "noun", "defs": ["the state or condition of food not being digested; impaired digestion; indigestion."]}], "ಕರಪೆ": [{"type": "noun", "defs": ["the tree Clausena indica of Rutaceae family."]}], "ಕರಬ": [{"type": "noun", "defs": ["the plat Centrantherum anthelmenticum (= Vernonia anthelmentica of Asteraceae family.", "its seed; (?)."]}, {"type": "noun", "defs": ["a leguminous tree (Ceratonia siliqua) of the E Mediterranean, bearing long, flat, leathery, brown pods with a sweet pulp; (?)."]}], "ಕರಬದರ": [{"type": "noun", "defs": ["(fig.) a plainly evident or crystal clear thing or matter; a thing as plain as the nose on a maṇs face."]}], "ಕರಬಾಲ": [{"type": "noun", "defs": ["= ಕರಪಾಲ."]}], "ಕರಬಾಲಿಕೆ": [{"type": "noun", "defs": ["= ಕರಪಾಲಿಕೆ."]}], "ಕರಬಾಳೆ": [{"type": "noun", "defs": ["a plantain tree bearing small fruit of dark colour (from 200 to 400 in a bunch);(?)."]}], "ಕರಬೂಜ": [{"type": "noun", "defs": ["the trailing vine Citrullus vulgaris of Cucurbitaceae family widely cultivated for its gourd; water melon plant.", "its large, round or oblong, edible fruit with hard, green rind and sweet, juicy, red pulp containing many seeds; water melon."]}], "ಕರಬೂಜು": [{"type": "noun", "defs": ["= ಕರಬೂಜ."]}], "ಕರಬೇ": [{"type": "noun", "defs": ["= ಕರಪೆ."]}], "ಕರಬೋನ": [{"type": "noun", "defs": ["a wide-mouthed small vessel."]}], "ಕರಭ": [{"type": "noun", "defs": ["the part of the hand consisting of the five bones between the wrist and the fingers; metacarpus.", "the distance from the tip of the ring finger and the tip of the thumb (of the same hand), when stretched apart.", "a large cud-chewing mammal, domesticated in parts of Africa and Asia, with slender legs, broad cushioned feet, and either one or two fatty humps on the back; a camel.", "a young camel.", "the young of any animal.", "a kind musical instrument.", "a northern constellation between Ursa Major and Cassiopeia; Camelopardus."]}], "ಕರಭರಕ್ಷಮ": [{"type": "adjective", "defs": ["that is capable of giving more tax (to the government); that can be levied with relatively heavy tax."]}], "ಕರಭೂಜ": [{"type": "noun", "defs": ["= ಕರಬೂಜ."]}], "ಕರಭೂಷಣ": [{"type": "noun", "defs": ["any ornament for the hand."]}], "ಕರಮ": [{"type": "noun", "defs": ["a way a thing is or must be done or happens or must happen; a manner."]}, {"type": "noun", "defs": ["a kind of dance in country side, performed during rainy season."]}], "ಕರಮರಿಕೆ": [{"type": "noun", "defs": ["= ಕರಮರ್ದ."]}], "ಕರಮರೆ": [{"type": "noun", "defs": ["a small mark or stain (on, otherwise, a clean surface) a spot.", "(fig.) a moral blemish or stain."]}], "ಕರಮರ್ದ": [{"type": "noun", "defs": ["the plant Carissa carundas of Apocynaceae family.", "its fruit."]}], "ಕರಮರ್ದಕ": [{"type": "noun", "defs": ["= ಕರಮರ್ದ."]}], "ಕರಮರ್ದನ": [{"type": "noun", "defs": ["the act of squeezing, massaging with the hand or hands."]}], "ಕರಮರ್ದಿ": [{"type": "noun", "defs": ["= ಕರಮರ್ದ."]}], "ಕರಮಾನ್ಯ": [{"type": "noun", "defs": ["a endowment income from which is exempt from taxation; a tax-exempt gift."]}], "ಕರಮಾಪಕ": [{"type": "noun", "defs": ["an automatic device in taxicabs that computes and registers the fare due; a taxi-meter."]}], "ಕರಮುಂಡು": [{"type": "noun", "defs": ["(dial.) a half-burnt body of a dead person in the crematory."]}], "ಕರಮುಕ್ತ": [{"type": "adjective", "defs": ["freed from the hand (said of an arrow shot, a weapon thrown etc.)."]}, {"type": "noun", "defs": ["any weapon, missile that is thrown, shot by the hand."]}], "ಕರಮೆ": [{"type": "adverb", "defs": ["excessively; abundantly.", "specially; mainly; to a marked degree; especially."]}], "ಕರಯಿಸು": [{"type": "verb", "defs": ["to cause to invite, call; to cause to come."]}], "ಕರರುಹ": [{"type": "noun", "defs": ["that which grows from the hand (out at the ends of the fingers); a nail."]}], "ಕರಲ": [{"type": "noun", "defs": ["a particular kind of physical exercise by wrestlers and body-builders."]}], "ಕರಲಾಗು": [{"type": "noun", "defs": ["the skill in using one's hands or body; adroitness; dexterity."]}], "ಕರಲು": [{"type": "noun", "defs": ["salty, brackish earth (as a marshy or nearly marshy tract of land); saline soil."]}, {"type": "noun", "defs": ["stunted growth; dwarfish stature; the quality of being short of natural growth or development level."]}], "ಕರಲೇಸು": [{"type": "noun", "defs": ["the quality or condition of being very much suitable."]}], "ಕರವಂಡಿ": [{"type": "noun", "defs": ["= ಕರಮರ್ದ."]}], "ಕರವಂಡಿಗೆ": [{"type": "noun", "defs": ["= ಕರಮರ್ದ."]}], "ಕರವಂದ": [{"type": "noun", "defs": ["(obs.) a kind of tax."]}, {"type": "noun", "defs": ["= ಕರಮರ್ದ."]}], "ಕರವಂದಿಗೆ": [{"type": "noun", "defs": ["= ಕರಮರ್ದ."]}], "ಕರವಟ್ಟಿ": [{"type": "noun", "defs": ["a yard or enclosure for domestic cows; a cow-shed."]}], "ಕರವಡಿಗೆ": [{"type": "noun", "defs": ["= ಕರಮರ್ದ."]}], "ಕರವತ": [{"type": "noun", "defs": ["= ಕರವತ್ತ."]}], "ಕರವತಕಾಟಿ": [{"type": "noun", "defs": ["the border of a sari, dhōti, etc. designed of embroidered in a zigzag manner."]}], "ಕರವತಧಡಿ": [{"type": "noun", "defs": ["= ಕರವತಕಾಟಿ."]}], "ಕರವತಿ": [{"type": "noun", "defs": ["= ಕರವತಿಗೆ1."]}], "ಕರವತಿಗೆ": [{"type": "noun", "defs": ["a small jar, water pot, with a handle (and a nozzle).", "a leather bag, with a small mouth, for carrying water."]}, {"type": "noun", "defs": ["= ಕರವತ್ತ - 1."]}], "ಕರವತ್ತ": [{"type": "noun", "defs": ["a hand tool with a toothed metal blade used to cut wood or other material by means of a to-and-fro motion; a saw.", "a sari or dhōti with the border embroidered or designed in a zigzag manner."]}], "ಕರವತ್ತಕಾಟು": [{"type": "noun", "defs": ["= ಕರವತಕಾಟಿ."]}], "ಕರವತ್ತಿ": [{"type": "noun", "defs": ["= ಕರವತಿಗೆ1."]}], "ಕರವತ್ತುಕಾಟಿ": [{"type": "noun", "defs": ["= ಕರವತಕಾಟಿ."]}], "ಕರವದಿ": [{"type": "noun", "defs": ["the plant Carissa carundas of Apocynaceae family and its fruit."]}], "ಕರವಸ್ತ್ರ": [{"type": "noun", "defs": ["a square piece of cotton, linen, silk, etc., usu. carried in the pocket for wiping one's face, hands, etc.; a handkerchief."]}], "ಕರವಳ": [{"type": "noun", "defs": ["a man armed with a sword."]}, {"type": "noun", "defs": ["a lock in wrestling, in which one wrestler sitting on the other one who has fallen with his back on the floor, twisting the latteṛs legs."]}], "ಕರವಳಯ": [{"type": "noun", "defs": ["a bracelet of glass or metal worn around the wrist."]}], "ಕರವಳಿ": [{"type": "noun", "defs": ["the border of the land near the sea; seashore; coast."]}], "ಕರವಳಿಗೊಳ್": [{"type": "verb", "defs": ["to go or move alongside or towards the sea."]}], "ಕರವಾಯಿ": [{"type": "noun", "defs": ["a heavy, thick, short metal bar used by a smith working in bronze or brass."]}], "ಕರವಾಲ": [{"type": "noun", "defs": ["a weapon (as a cutlass or rapier) with a long blade for cutting or thrusting; a sword."]}], "ಕರವಾಳ್": [{"type": "noun", "defs": ["= ಕರವಾಲ."]}], "ಕರವಾಳ": [{"type": "noun", "defs": ["= ಕರವಾಲ."]}], "ಕರವಾಳಿ": [{"type": "noun", "defs": ["= ಕರವಾಲ."]}], "ಕರವಾಳು": [{"type": "noun", "defs": ["= ಕರವಾಲ."]}], "ಕರವಿಕೀರ್ಣ": [{"type": "adjective", "defs": ["sprinkled, thrown or scattered out with the hand."]}], "ಕರವಕೀರ್ಣ": [{"type": "noun", "defs": ["the act of throwing, sprinkling or scattering out with the hand."]}], "ಕರವಿಡಿ": [{"type": "verb", "defs": ["to hold (another's) hand.", "to take (a girl) in marriage.", "to help or support in times of distress."]}], "ಕರವಿಮೋಚನ": [{"type": "noun", "defs": ["the act or an instance of getting freed from another's hand."]}], "ಕರವೀರ": [{"type": "noun", "defs": ["the plant Nerium indicum (= N. ororum, = N. oleander) of Apocynaceae family.", "its red flower; Indian oleander."]}], "ಕರವು": [{"type": "noun", "defs": ["(dial.) (as cows) the giving of milk."]}], "ಕರವೇೞಿ": [{"type": "noun", "defs": ["a person who is very easily frightened or intimidated by danger, uncertainty."]}], "ಕರವೊಳ್ಳಿತು": [{"type": "noun", "defs": ["the quality or condition of being very much suitable."]}], "ಕರಶಾಖೆ": [{"type": "noun", "defs": ["any of the five terminal projections of the hand; a finger."]}], "ಕರಶೀಕರ": [{"type": "noun", "defs": ["a drop of water ejected with force from the trunk of an elephant."]}], "ಕರಸಂಪುಟ": [{"type": "noun", "defs": ["a hand gesture, joining both the palms and holding the tips of the fingers pointing upward, showing reverence, humility, etc."]}], "ಕರಸಾಣೆ": [{"type": "noun", "defs": ["a fine-grained stone used to sharpen cutting tools; a whetstone."]}], "ಕರಸಾಣೆಗಾಣಿಸು": [{"type": "verb", "defs": ["to sharpen (the blade of a weapon) on a whetstone."]}], "ಕರಸಾಮುದ್ರಿಕ": [{"type": "noun", "defs": ["supposed (or pretended) insight into the future of a person predicted by analysing the lines and other features on the palm of that person; palmistry."]}], "ಕರಸಾಲ": [{"type": "noun", "defs": ["the continuous absence of rain and resulting in shortage or lack of agricultural and other products.", "a very difficult situation."]}], "ಕರಸೀಕರ": [{"type": "noun", "defs": ["= ಕರಶೀಕರ."]}], "ಕರಸು": [{"type": "verb", "defs": ["to cause to invite, call; to cause to come."]}], "ಕರಸೆ": [{"type": "noun", "defs": ["a variety of flat-bodied inland fish."]}], "ಕರಸ್ಥಲ": [{"type": "noun", "defs": ["the inside of the hand; the palm."]}], "ಕರಸ್ಥಳ": [{"type": "noun", "defs": ["= ಕರಸ್ಥಲ."]}], "ಕರಹ": [{"type": "noun", "defs": ["the process or an instance of inviting; an invitation.", "a call or the sound made in calling (a person)."]}], "ಕರಹಟ": [{"type": "noun", "defs": ["= ಕರಹಡ."]}], "ಕರಹಟಿಗ": [{"type": "noun", "defs": ["= ಕರಹಡಿಗ.", "a man employed to look after a building, property, etc.against thieves, vandals, tresspassers, etc.; a watchman."]}], "ಕರಹಟ್ಟಿ": [{"type": "noun", "defs": ["a yard or enclosure for domestic cows; a cow-shed."]}], "ಕರಹಡ": [{"type": "noun", "defs": ["name of an erstwhile country (prob. the present ಕರಹಡ in Satāra district in Mahārāṣṭra)."]}], "ಕರಹಡಿಗ": [{"type": "noun", "defs": ["a man from or belonging to or was born in, the ಕರಹಡ country."]}], "ಕರಹಡಿಚ": [{"type": "noun", "defs": ["a man who was born in the ಕರಹಡ country."]}], "ಕರಹಡಿಚೆ": [{"type": "noun", "defs": ["a woman who was born in the ಕರಹಡ country."]}], "ಕರಹತ್ತ": [{"type": "noun", "defs": ["a hand tool with a toothed metal blade used to cut wood or other material by means of a to-and-fro motion; a saw."]}], "ಕರಹತ್ತಮಲ್ಲ": [{"type": "noun", "defs": ["(a title) a man who slays his enemies (in the battlefield)."]}], "ಕರಹಾಟ": [{"type": "noun", "defs": ["= ಕರಹಡ."]}], "ಕರಹಾಟಕ": [{"type": "noun", "defs": ["the plant Xeromphis spinosa (= Gardenia floribunda, = Randia dumetorum) of Rubiaceae family.", "its nut used for causing vomit; an emetic nut."]}], "ಕರಹಾಡ": [{"type": "noun", "defs": ["= ಕರಹಡ."]}], "ಕರಳಿ": [{"type": "noun", "defs": ["a kind of crab."]}, {"type": "noun", "defs": ["a rough, handspun cotton cloth."]}, {"type": "noun", "defs": ["the evergreen tree Carallia lucida (= C. integirrima) of Rhizophoraceae family."]}], "ಕರಳಿಕೆ": [{"type": "noun", "defs": ["(dial.) a mark left on the skin when tied fast."]}], "ಕರಳು": [{"type": "noun", "defs": ["salty, brackish soil."]}], "ಕರಳೆ": [{"type": "noun", "defs": ["= ಕರಳಿ2."]}], "ಕರೞ್ಮಣಿ": [{"type": "noun", "defs": ["a gem that is not polished."]}], "ಕರಾಂಗುಲಿ": [{"type": "noun", "defs": ["any of the fingers of the hand."]}], "ಕರಾಂಗುಲಿಗೂಡು": [{"type": "verb", "defs": ["to hold with the fingers."]}], "ಕರಾಂಗುಳಿ": [{"type": "noun", "defs": ["= ಕರಾಂಗುಲಿ."]}], "ಕರಾಕರಣೆ": [{"type": "noun", "defs": ["the act or process of collecting taxes; tax collection."]}], "ಕರಾಗ್ರ": [{"type": "noun", "defs": ["the tip of the hand (tip of the fingers).", "the tip of the trunk of an elephant."]}], "ಕರಾಚಿ": [{"type": "noun", "defs": ["a kind of tree."]}], "ಕರಾಚೂರಿ": [{"type": "noun", "defs": ["a sword; a scimitar."]}, {"type": "noun", "defs": ["a person who speaks truth frankly; an outspoken person."]}]}