{"ತತ್ತಱಿದಱಿ": [{"type": "verb", "defs": ["= ತತ್ತರದರಿ."]}], "ತತ್ತೞ": [{"type": "noun", "defs": ["= ತತ್ತಳ1."]}], "ತತ್ತೞಗುದಿ": [{"type": "verb", "defs": ["to boil with a vehement bubbling sound."]}, {"type": "noun", "defs": ["the state of boiling vehemently with bubbling sound."]}], "ತತ್ತೞದುೞಿ": [{"type": "verb", "defs": ["to tread heavily as to crush (something) into a shapeless mass."]}], "ತತ್ತಿ": [{"type": "noun", "defs": ["the hard-shelled, oval or round reproductive body produced by a female bird, fish, reptile, etc. containing nutritive food and protective envelopes for a new individual; an egg."]}, {"type": "noun", "defs": ["the tree Garceinia indica (=G. purpurea) of Guttifereae family.", "its sour fruit."]}], "ತತ್ತಿಕ್ಕು": [{"type": "verb", "defs": ["to put (oneself) with another to become one or a cohesive combination."]}], "ತತ್ತು": [{"type": "verb", "defs": ["to clasp (another) in one's arms; to blend, mingle or associate oneself with cohesively."]}, {"type": "noun", "defs": ["the act of joining, mixing, associating oneself with another; the condition of being so.", "a part or portion of a whole that belongs or is allotted to an individual; a share.", "ತತ್ತು ಮಾಡಿಸು tattu māḍisu to cause to unite, associate or blend."]}, {"type": "noun", "defs": ["an instance or the fact of tripping or missing one's step in walking, running, etc.; a falling top forward; stumble.", "liability to injury, damage, etc.; danger; peril."]}, {"type": "noun", "defs": ["(a pronoun used as a noun, meaning) the Supreme; the God; He.", "ತತ್ತಾಗು tattāgu to become one with the God."]}], "ತತ್ತುಕ": [{"type": "noun", "defs": ["one who keeps company with another; a companion."]}], "ತತ್ತುಗಾಱಿಕೆ": [{"type": "noun", "defs": ["that quality of association of two or more persons, things, that is cohesive."]}], "ತತ್ತುಗೊಳ್": [{"type": "verb", "defs": ["to unite, associate oneself with."]}], "ತತ್ತುಪಣ": [{"type": "noun", "defs": ["the act of uniting, associating, blending (different things) together."]}], "ತತ್ತುವ": [{"type": "noun", "defs": ["= ತತ್ತ್ವ."]}], "ತತ್ತ್ವ": [{"type": "noun", "defs": ["the state of being perfectly united with the Ultimate and Supreme Principle.", "that which actually is or is really true; the fundamental truth; reality.", "that which makes something what it is; the intrinsic, fundamental nature or most important quality (of something).", "any of the five substances (earth, water, air, fire, and ether or space) (or, according to some, four substances without ether) believed to constitute all physical matter.", "any of the three broadly classified basic qualities (being sattva, rajas and tamas).", "(phil.) according to Sānkhya system, any of the twenty-five basic elements.", "a symbol for the number twenty-five.", "an accepted or professed rule of action or conduct or a personal or specific basis of conduct or management; a principle.", "a fundamental, primary or general law or truth from which others are derived.", "what is intended to be or actually is, expressed or indicated; signification; meaning; import.", "(rhet.) a kind of figure of speech in which two or more meanings are suggested by a single word or phrase.", "(mus.) a slow pace or rhythm."]}], "ತತ್ತ್ವಕಾರಣ": [{"type": "noun", "defs": ["the Supreme being the active and fundamental principle."]}], "ತತ್ತ್ವಜ್ಞ": [{"type": "noun", "defs": ["a man who knows the true nature of things, nature, Brahman, etc.", "a man who lives by or expounds a system of philosophy; a man who sees visions; a prophet, seer or philosopher."]}], "ತತ್ತ್ವಜ್ಞಾನ": [{"type": "noun", "defs": ["knowledge of the truth; a thorough knowledge of the principles of philosophy or science."]}], "ತತ್ತ್ವಜ್ಞಾನಿ": [{"type": "noun", "defs": ["= ತತ್ತ್ವಜ್ಞ."]}], "ತತ್ತ್ವಜ್ಞೆ": [{"type": "noun", "defs": ["a woman who knows the true nature of things, nature, Brahman, etc.", "a woman who lives by or expounds a system of philosophy or who sees visions; a prophet, seer or philosopher."]}], "ತತ್ತ್ವದರ್ಶಿ": [{"type": "noun", "defs": ["= ತತ್ತ್ವಜ್ಞ."]}], "ತತ್ತ್ವದೃಷ್ಟಿ": [{"type": "noun", "defs": ["the way, manner, disposition or process of or suited to philosophy."]}], "ತತ್ತ್ವಪರಿಣತ": [{"type": "noun", "defs": ["= ತತ್ತ್ವಜ್ಞ."]}], "ತತ್ತ್ವಪರಿಣಿತೆ": [{"type": "noun", "defs": ["= ತತ್ತ್ವಜ್ಞೆ."]}], "ತತ್ತ್ವಪ್ರಣಾಲಿ": [{"type": "noun", "defs": ["one's moral, social or philosophical motives, intentions or methods."]}], "ತತ್ತ್ವಪ್ರತಿಪಾದನ": [{"type": "noun", "defs": ["= ತತ್ತ್ವಪ್ರತಿಪಾದನೆ."]}], "ತತ್ತ್ವಪ್ರತಿಪಾದನೆ": [{"type": "noun", "defs": ["a propounding of a principle, philosophy, etc."]}], "ತತ್ತ್ವಮಸಿ": [{"type": "noun", "defs": ["(phil.) a significant sentence in philosophy meaning that the knower is not different from, but the same as, the knowable, i.e. the Supreme; 'thou art one with the Supreme'; 'thou art That'."]}], "ತತ್ತ್ವರಹಸ್ಯ": [{"type": "noun", "defs": ["the occult essence of philosophical principle or the True Being."]}], "ತತ್ತ್ವವೇದಿ": [{"type": "noun", "defs": ["= ತತ್ತ್ವಜ್ಞ."]}], "ತತ್ತ್ವಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["philosophy - a) a search for a general understanding of values and reality by chiefly speculative rather than observational means; b) a discipline comprising as its core logic, aesthetics, ethics, metaphysics, and epistemology for the analysis of the principles underlying conduct, thought, knowledge, and the nature of the universe; c) pursuit of wisdom; d) a system of analysis of the grounds of and concepts expressing fundamental beliefs."]}], "ತತ್ತ್ವಸುವಾಲೆ": [{"type": "noun", "defs": ["a kind of songs used to convey moral, religious or metaphysical concepts in lucid manner."]}], "ತತ್ತ್ವಾತೀತ": [{"type": "adjective", "defs": ["surpassing, not being subject to, religious, metaphysical principles."]}, {"type": "noun", "defs": ["he who is beyond the limits of the philosophical principles."]}], "ತತ್ತ್ವಾತೀತೆ": [{"type": "noun", "defs": ["she who is beyond the limits of the philosophical principles."]}], "ತತ್ತ್ವಾಧಿಕಾರಿ": [{"type": "noun", "defs": ["a person who is qualified for receiving religious or metaphysical knowledge."]}], "ತತ್ತ್ವಾನುಭಾವ": [{"type": "noun", "defs": ["the realisation of philosophical or religious truth or principles."]}], "ತತ್ತ್ವಾರ್ಥ": [{"type": "noun", "defs": ["the quality or state of being real; reality; fact."]}], "ತತ್ತ್ವಾಲೋಕ": [{"type": "noun", "defs": ["= ತತ್ತ್ವಜ್ಞಾನ."]}], "ತತ್ಥಳಿಸು": [{"type": "verb", "defs": ["to shine brightly.", "to be afraid of; to get bewildered or confounded.", "to boil with bubbles and a bubbling sound."]}], "ತತ್ಪರ": [{"type": "adjective", "defs": ["that follows; following; subsequent.", "secondary or minor, but usu. associated.", "paying the entire attention to; wholly occupied by or interested in; absorbed.", "zealously devoted to."]}, {"type": "noun", "defs": ["(usu. in compositions) a man who is engrossed in, devotedly given to."]}], "ತತ್ಪರತೆ": [{"type": "noun", "defs": ["the fact, state or quality of being sincere, ardently dedicated and loyal; total devotion.", "the fact, state or quality of being totally absorbed or engrossed in."]}], "ತತ್ಪುರುಷ": [{"type": "noun", "defs": ["the Supreme Lord.", "one of the five faces of Śiva.", "(gram.) a class of compounds in which the second of the two words compounded being prominent and qualified by the first one without losing its grammatical independence and literary meaning."]}], "ತತ್ಪರೆ": [{"type": "noun", "defs": ["(usu. in compositions) a woman who is engrossed in, devotedly given to."]}], "ತತ್ಪೂರ್ತ": [{"type": "adjective", "defs": ["made or meant for the particular end or case at hand without consideration of general or wider application."]}], "ತತ್ಪೂರ್ವ": [{"type": "noun", "defs": ["preceding a particular event, time, etc."]}], "ತತ್ರಾಣಿ": [{"type": "noun", "defs": ["(dial.) an earthen water jug."]}], "ತತ್ರಾಪಿ": [{"type": "noun", "defs": ["especially; particularly; specifically."]}], "ತತ್ವ": [{"type": "noun", "defs": ["= ತತ್ತ್ವ."]}, {"type": "noun", "defs": ["the letter or the sound of 'ತ '."]}], "ತತ್ವಜ್ಞ": [{"type": "noun", "defs": ["= ತತ್ತ್ವಜ್ಞ."]}], "ತತ್ವಜ್ಞಾನ": [{"type": "noun", "defs": ["= ತತ್ತ್ವಜ್ಞಾನ."]}], "ತತ್ವಜ್ಞಾನಿ": [{"type": "noun", "defs": ["= ತತ್ತ್ವಜ್ಞ."]}], "ತತ್ವಜ್ಞೆ": [{"type": "noun", "defs": ["= ತತ್ತ್ವಜ್ಞೆ."]}], "ತತ್ವದೃಷ್ಟಿ": [{"type": "noun", "defs": ["= ತತ್ತ್ವದೃಷ್ಟಿ."]}], "ತತ್ವಪದ": [{"type": "noun", "defs": ["a song used to convey moral, religious or metaphysical concepts in lucid manner."]}], "ತತ್ವಮಸಿ": [{"type": "noun", "defs": ["= ತತ್ತ್ವಮಸಿ."]}], "ತತ್ವವಿದ": [{"type": "noun", "defs": ["= ತತ್ತ್ವಜ್ಞ."]}], "ತತ್ವವಿದೆ": [{"type": "noun", "defs": ["= ತತ್ತ್ವಜ್ಞೆ."]}], "ತತ್ವವೇತ್ತ": [{"type": "noun", "defs": ["= ತತ್ತ್ವಜ್ಞ."]}], "ತತ್ವವೇದಿ": [{"type": "noun", "defs": ["= ತತ್ತ್ವಜ್ಞ."]}], "ತತ್ವಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["= ತತ್ತ್ವಶಾಸ್ತ್ರ."]}], "ತತ್ವಸುವ್ವಾಲಿ": [{"type": "noun", "defs": ["= ತತ್ತ್ವಸುವಾಲೆ."]}], "ತತ್ವಾಂಧ": [{"type": "noun", "defs": ["a man who lacks intelligence that is required for understanding philosophy.", "a man who is unreasoningly devoted to his own view or stand on the philosophy, religion, etc."]}], "ತತ್ವಾತ್ಮಕ": [{"type": "adjective", "defs": ["of, relating to, based on or characterised by metaphysics or philosophy."]}, {"type": "noun", "defs": ["the Supreme Being as the personification of metaphysical or philosophical principles."]}], "ತತ್ವಾರ": [{"type": "noun", "defs": ["the condition of lacking or being not available; lack; absence; deficiency.", "ತತ್ವಾರವಾಗು tatvāravāgu to be wanted; to be lacking or not available; ಹೆಸರು ಕ್ಷೀರಸಾಗರಭಟ್ಟ, ಮನೆಯಲ್ಲಿ ಮಜ್ಜಿಗೆಗೆ ತತ್ವಾರ hesaru kṣīrasāgara bhaṭṭa, maneyalli majjigege tatvāra (prov.) his second name is king, working as a menial."]}], "ತತ್ವಾರ್ಥ": [{"type": "noun", "defs": ["= ತತ್ತ್ವಾರ್ಥ."]}], "ತತ್ವಾಲೋಕ": [{"type": "noun", "defs": ["= ತತ್ತ್ವಜ್ಞಾನ."]}], "ತತ್ಸಮ": [{"type": "adjective", "defs": ["being equal to (that); being at par with (that)."]}, {"type": "noun", "defs": ["a work of another language (esp. of Samskřta) being used in Kannaḍa without any or with little modification."]}], "ತತ್ಸವಿತುರ್ವರೇಣ್ಯ": [{"type": "noun", "defs": ["an ardent brāhmaṇa following religious rites as per the scriptures."]}], "ತತ್ಸಾಲ್": [{"type": "noun", "defs": ["= ತತ್ಸಾಲೆ."]}], "ತತ್ಸಾಲೆ": [{"type": "noun", "defs": ["the plant Grewia tiliaefolia of Tiliaceae family."]}], "ತಥಪಣೆ": [{"type": "noun", "defs": ["the state or quality of being in harmony with; an orderly agreement.", "a scheme or programme for making, doing or achieving something.", "the fact or condition of being spread or extended over an area; the space, amount or degree to which a thing extends."]}], "ತಥಾಗತ": [{"type": "adjective", "defs": ["being in a particular condition or state (referred to earlier)."]}, {"type": "noun", "defs": ["Gautama Buddha, founder of Buddhism.", "a Buddha or Jaina mendicant.", "any of the celebrated Jaina spiritual teachers."]}], "ತಥಾಗತಮತ": [{"type": "noun", "defs": ["Buddhism, a religion founded by Gautama Buddha in India in 6th century b.c. (and later spread to China, Burma, Japan, Tibet, and parts of southeast Asia), holding that suffering in life caused by unabated desire can be overcome through enlightenment and self-denial which enable one to escape from endless sequence of births and deaths to which all beings are otherwise subject."]}], "ತಥಾಸ್ತು": [{"type": "independent clause", "defs": ["(basically a sentence, meaning) may it be so! so be it!."]}], "ತಥ್ಯ": [{"type": "noun", "defs": ["the quality or state of being true or being in accordance with experience, facts or reality; conformity with fact; truth."]}], "ತಥ್ಯೆ": [{"type": "noun", "defs": ["= ತಥ್ಯ."]}], "ತದಕಲ್": [{"type": "noun", "defs": ["the act of striking; a blow; a stroke."]}], "ತದಕು": [{"type": "verb", "defs": ["to give a blow or hit with or as with the fist, a weapon, hammer, etc.; to strike.", "to pound or crush (something) using force.", "to compress from two or more sides; to press hard as to extract liquid, juice, etc.; to squeeze."]}, {"type": "noun", "defs": ["the act of hitting, blowing or striking with or as with the first or a weapon."]}, {"type": "noun", "defs": ["the tree Boswellia serata (= B. thurifera) of Burseraceae family; Indian olibanum tree.", "its fruit."]}], "ತದಕುಗ": [{"type": "noun", "defs": ["a person who hits, strikes or delivers a blow."]}], "ತದನಂತರ": [{"type": "noun", "defs": ["an occasion or time subsequent to (that)."]}, {"type": "adverb", "defs": ["subsequent to (that); at a time later to( that); afterward."]}], "ತದನಂತರಂ": [{"type": "adverb", "defs": ["= ತದನಂತರ2."]}], "ತದನುಸಾರ": [{"type": "adverb", "defs": ["in accordance; correspondingly; accordingly."]}], "ತದನುಸಾರವಾಗಿ": [{"type": "adverb", "defs": ["= ತದನುಸಾರ."]}], "ತದರ್ಥ": [{"type": "adjective", "defs": ["made or meant for the particular end or case at hand without consideration of general or wider application."]}], "ತದಸು": [{"type": "verb", "defs": ["to cause to beat or strike with.", "to have sexual intercourse."]}], "ತದಸ್ತು": [{"type": "independent clause", "defs": ["(basically being a sentence, conveying approval or agreement) okay."]}], "ತದಾತನ": [{"type": "adjective", "defs": ["of or at this time; existing or happening now."]}, {"type": "noun", "defs": ["that which belongs to a particular (or present) time.", "the present time."]}], "ತದಾತ್ವ": [{"type": "noun", "defs": ["the present time.0."]}], "ತದಾನೀಂ": [{"type": "adverb", "defs": ["at that time; then."]}], "ತದಾರಭ್ಯ": [{"type": "adverb", "defs": ["from that point of time; since then."]}], "ತದಿಕು": [{"type": "noun", "defs": ["= ತದಕು2."]}, {"type": "noun", "defs": ["= ತದಕು3."]}], "ತದಿಗಿಣ": [{"type": "noun", "defs": ["(mus.) the onomatopoeic sound representing a group of four short syllables produced while playing a percussion instrument."]}], "ತದಿಗಿಣಿಸು": [{"type": "verb", "defs": ["to flap the wings rapidly, as in short flight or without flying at all; to flutter."]}], "ತದಿಗಿಲು": [{"type": "noun", "defs": ["= ತದುಕಿಲು."]}], "ತದಿಗೆ": [{"type": "noun", "defs": ["the third day of the lunar fortnight."]}], "ತದೀಯ": [{"type": "adjective", "defs": ["of, belonging to, made by or done by a third person (referred to earlier); his or hers."]}], "ತದುಕ": [{"type": "noun", "defs": ["= ತದಕು3."]}], "ತದುಕಿಲು": [{"type": "noun", "defs": ["a kind of ."]}], "ತದುಕು": [{"type": "verb", "defs": ["= ತದಕು1."]}, {"type": "noun", "defs": ["= ತದಕು3."]}], "ತದುಕ್ತ": [{"type": "adjective", "defs": ["said, prescribed, in or by that (book, scripture, etc.)."]}], "ತದುಗತ": [{"type": "adjective", "defs": ["= ತದ್ಗತ1."]}, {"type": "noun", "defs": ["= ತದ್ಗತ2."]}], "ತದೆ": [{"type": "verb", "defs": ["to beat to a pulp, powder; to pound; to hammer; to crush.", "to flatten, erase or spoil the shape of, something by squeezing, moving the hand, foot, etc. to and fro or in a circular manner.", "to tread heavily; to tramp.", "to deliver a blow; to strike.", "to make a loud sound."]}, {"type": "noun", "defs": ["a blow; a stroke."]}], "ತದೆವಡೆ": [{"type": "verb", "defs": ["to receive, sustain a blow; to be beaten."]}], "ತದೇಕಚಿತ್ತ": [{"type": "noun", "defs": ["the mind focused or that is concentrating on (a particular object).", "a man engrossed in, devotedly engaged in."]}], "ತದೇಕಚಿತ್ತೆ": [{"type": "noun", "defs": ["a woman engrossed in, devotedly engaged in."]}], "ತದ್ಗತ": [{"type": "noun", "defs": ["engrossed, interested or ardently engaged in."]}, {"type": "noun", "defs": ["a man who is devotedly engaged, absorbingly interested in."]}], "ತದ್ಗುಣ": [{"type": "noun", "defs": ["= ತದ್ಗುಣಾಲಂಕಾರ."]}], "ತದ್ಗುಣಾಲಂಕಾರ": [{"type": "noun", "defs": ["(rhet.) a figure of speech in which a thing is said to have acquired the quality or qualities of another, losing its own."]}], "ತದ್ದಲು": [{"type": "noun", "defs": ["a gate or small door made of a bamboo-strips, dried thorny bushes, fixed to a fence at the entrance.", "a screen made by weaving thin strips of bamboo, used as a partition wall, screen, etc."]}], "ತದ್ದಿನ": [{"type": "noun", "defs": ["that day.", "the day of ritual ceremony at which offerings are made to one's deceased ancestors (usu. annually)."]}], "ತದ್ದು": [{"type": "noun", "defs": ["a non-contiguous skin disorder of unknown cause, characterised by inflammation, itching, and the formation of scales; eczema.", "a temporary eruption of spots on the skin."]}], "ತದ್ಧಿತ": [{"type": "noun", "defs": ["good, compatible or congenial to (that)."]}, {"type": "noun", "defs": ["(gram.) an affix used to form a noun from another noun.", "(gram.) a noun so formed."]}], "ತದ್ಧಿತಾಂತ": [{"type": "noun", "defs": ["= ತದ್ಧಿತ2 - 2."]}], "ತದ್ಬಲ": [{"type": "noun", "defs": ["a kind of bow.", "a kind of arrow."]}], "ತದ್ಬಳ": [{"type": "noun", "defs": ["= ತದ್ಬಲ."]}], "ತದ್ಭವ": [{"type": "adjective", "defs": ["born or coming from that."]}, {"type": "noun", "defs": ["he or that which is born from (that).", "that (particular) birth; one's previous birth.", "(gram.) a word of another language (esp. of Samskřta or Prākřta) adapted to the Kannaḍa tongue, with suitable modification."]}], "ತದ್ರೂಪ": [{"type": "noun", "defs": ["the quality or state of being very much alike; likeness."]}], "ತದ್ರೂಪು": [{"type": "noun", "defs": ["= ತದ್ರೂಪ."]}], "ತದ್ವತ್ತು": [{"type": "adjective", "defs": ["being very much like (another) in appearance or nature.", "ತದ್ವತ್ತಾಗಿ tadvattāgi just as it is; without any changes."]}], "ತದ್ವಿಪರೀತ": [{"type": "noun", "defs": ["that state or quality of being exactly contrary or opposite."]}], "ತದ್ವಿರುದ್ಧ": [{"type": "adjective", "defs": ["different in every way; exactly opposite.", "mutually opposite or contradictory."]}], "ತನಕ": [{"type": "adverb", "defs": ["up to the place of.", "up to a specified time.", "to the point, degree."]}], "ತನಕರ": [{"type": "adverb", "defs": ["= ತನಕ."]}], "ತನಕರಂ": [{"type": "adverb", "defs": ["= ತನಕ."]}], "ತನಕಲಿ": [{"type": "noun", "defs": ["the plant Aeschynomene aspera of Papilionaceae family; Indian cork plant."]}], "ತನಕಿ": [{"type": "noun", "defs": ["= ತನಿಖೆ."]}], "ತನಕ್ಕ": [{"type": "adverb", "defs": ["= ತನಕ."]}], "ತನಖಾ": [{"type": "noun", "defs": ["= ತನಖೆ2."]}], "ತನಖೆ": [{"type": "noun", "defs": ["= ತನಿಖೆ."]}, {"type": "noun", "defs": ["fixed compensation paid regularly for services."]}], "ತನಗುಟ್ಟಿಸು": [{"type": "verb", "defs": ["to play a string instrument."]}], "ತನತು": [{"type": "pronoun", "defs": ["(used reflexively) that or those belonging to oneself."]}], "ತನತ್ತು": [{"type": "pronoun", "defs": ["= ತನತು."]}], "ತನನ": [{"type": "noun", "defs": ["a singing without articulating words but using syllables 'ತ', 'ನ'."]}], "ತನನನ": [{"type": "noun", "defs": ["= ತನನ."]}], "ತನನನವೆನ್ನು": [{"type": "noun", "defs": ["= ತನನವೆನ್ನು."]}], "ತನನವೆನು": [{"type": "noun", "defs": ["= ತನನವೆನ್ನು."]}], "ತನನವೆನ್ನು": [{"type": "verb", "defs": ["to sing without articulating words but using syllables 'ತ', 'ನ', etc.", "(fig.) to become joyful; to be elated."]}], "ತನಮನಿ": [{"type": "noun", "defs": ["a neck-ornament of women."]}], "ತನಯ": [{"type": "noun", "defs": ["a boy or man as related to either or both patents; a son."]}], "ತನಯಸ್ಥಾನ": [{"type": "noun", "defs": ["(astrol.) the fifth house from one's birth house in one's zodiac, believed to have influence of planets on one's son."]}], "ತನಯಳ್": [{"type": "noun", "defs": ["= ತನಯೆ."]}], "ತನಯೆ": [{"type": "noun", "defs": ["a girl or woman as related to either or both patents; a daughter."]}], "ತನಸಿ": [{"type": "noun", "defs": ["the plant Gymnosporia montana (=Celastrus montana) of Celastraceae family."]}], "ತನಿ": [{"type": "verb", "defs": ["to be without involving any other person; to be alone.", "to grow or develop fully (as a harvested fruit).", "to become plentiful, excessive; to become more or increase (oneself) in number, effect or influence.", "to be or become pleasant and comfortable."]}, {"type": "adjective", "defs": ["set apart or divided from the rest or others; performed alone; not joined, united or connected.", "fully grown or developed.", "that is more than normal; being to much or too great.", "agreeable; pleasing; pleasant; comfortable.", "new; fresh; recently made, grown or found.", "free from any adulterant; pure."]}, {"type": "noun", "defs": ["the state of being alone or aloof; singleness.", "the quality that pleases the senses; beauty."]}, {"type": "noun", "defs": ["an oblation offered (to a deity to pacify)."]}], "ತನಿಕಛೇರಿ": [{"type": "noun", "defs": ["a musical programme on an instrument (without accompanying usu. a vocalist)."]}], "ತನಿಕಿ": [{"type": "noun", "defs": ["= ತನಿಖೆ."]}], "ತನಿಕೆ": [{"type": "noun", "defs": ["= ತನಿಖೆ."]}], "ತನಿಖಿ": [{"type": "noun", "defs": ["= ತನಿಖೆ."]}], "ತನಿಖಿಸು": [{"type": "verb", "defs": ["to search out and examine systematically the particulars of in an attempt to know the facts about something hidden or complex, esp. in an attempt to find a motive, cause or culprit."]}], "ತನಿಖೆ": [{"type": "noun", "defs": ["the act of inquiring; an investigation or examination.", "an official register recording the details of land holdings of individual farmers of a village, revenue to be paid by them, etc."]}], "ತನಿಗರ್ಪು": [{"type": "noun", "defs": ["the jet black colour."]}], "ತನಿಗಲಿ": [{"type": "noun", "defs": ["a man, esp. a soldier, who can fight single-handedly, i.e. without requiring support from others."]}], "ತನಿಗುದಿ": [{"type": "verb", "defs": ["to boil with vehement bubbling sound."]}, {"type": "noun", "defs": ["a boiling with heavy bubbling sound."]}], "ತನಿಗುದಿಗುದಿ": [{"type": "verb", "defs": ["= ತನಿಗುದಿ1."]}], "ತನಿಗುಳ್ಳ": [{"type": "noun", "defs": ["the plant Solanum ferox of Solanaceae family, akin to brinjal.", "its fruit."]}], "ತನಿಗೆಂಡ": [{"type": "noun", "defs": ["brightly burning coal."]}], "ತನಿಗೆಚ್ಚು": [{"type": "noun", "defs": ["great valour."]}], "ತನಿಗೆಡು": [{"type": "verb", "defs": ["(beauty, tidiness, elegance) to be lost."]}], "ತನಿಗೆಡೆ": [{"type": "verb", "defs": ["to collapse suddenly."]}], "ತನಿಗೆತ್ತು": [{"type": "verb", "defs": ["to shake or tremble severely."]}, {"type": "noun", "defs": ["a trembling intensely."]}], "ತನಿಗೆರಳ್": [{"type": "verb", "defs": ["to become violent with intense anger."]}], "ತನಿಗೊಳ್ಳು": [{"type": "verb", "defs": ["to grow (oneself) well."]}], "ತನಿಚೂಣಿ": [{"type": "noun", "defs": ["a strong, defensive battalion of an army which goes ahead of the main body."]}], "ತನಿಜಡಿ": [{"type": "verb", "defs": ["to sink or bend from weight or pressure."]}], "ತನಿಜವ್ವನ": [{"type": "noun", "defs": ["prime youth.", "the corpulent, female breast."]}], "ತನಿಬಾಳೆ": [{"type": "noun", "defs": ["a variety in plantain.", "its fruit."]}], "ತನಿಬಿಡು": [{"type": "verb", "defs": ["(in a musical concert) to allow accompanying instrumentalists (esp. those accompanying on percussion instruments) to play."]}], "ತನಿಮಸಗು": [{"type": "verb", "defs": ["to become excessively angry."]}], "ತನಿಮಾಡಿಸು": [{"type": "verb", "defs": ["to pacify or quiet ( a deity) by offering oblations."]}], "ತನಿಮಾವು": [{"type": "noun", "defs": ["a variety in mango trees.", "its fruit."]}], "ತನಿಯನ್": [{"type": "noun", "defs": ["a stray verse in salutation of one's preceptor, teacher."]}], "ತನಿಯೆರೆ": [{"type": "verb", "defs": ["to offer oblation (to a deity)."]}], "ತನಿಯೆರೆತ": [{"type": "noun", "defs": ["the act of offering an oblation (to a deity)."]}], "ತನಿವಗೆ": [{"type": "noun", "defs": ["a friendly, kindly or benevolent attitude."]}], "ತನಿವಡಹ": [{"type": "noun", "defs": ["a continuous and heavy rain."]}], "ತನಿವಣ್": [{"type": "noun", "defs": ["= ತನಿವಣ್ಣು."]}], "ತನಿವಣ್ಣು": [{"type": "noun", "defs": ["a fruit that is delicious."]}], "ತನಿವದನು": [{"type": "noun", "defs": ["the right stage of growth or development (of a fruit) at which it is ready for reaping, gathering, eating or use."]}], "ತನಿವರಿ": [{"type": "verb", "defs": ["to move with high spirits as from great joy.", "to spread (all over) profusely, abundantly."]}], "ತನಿವು": [{"type": "noun", "defs": ["the state of being satisfied; the feeling of satisfaction; gratification.", "the condition of temperature being below normal; coldness.", "the condition of being fatigued; weariness; exhaustion.", "a longing or craving, as for something that brings satisfaction; a desire."]}], "ತನಿವೊಗರ್": [{"type": "noun", "defs": ["brilliant lustre."]}], "ತನಿಸೊಕ್ಕು": [{"type": "verb", "defs": ["to be or become heavily intoxicated."]}, {"type": "noun", "defs": ["excessive intoxication."]}], "ತನಿಸೊರ್ಕು": [{"type": "noun", "defs": ["= ತನಿಸೊಕ್ಕು2."]}], "ತನಿಹೊಟ್ಟು": [{"type": "noun", "defs": ["the dry outer covering removed from grains; husked hull."]}], "ತನು": [{"type": "adjective", "defs": ["having a circumference that is small in proportion to the height or length; thin.", "thin or slight (as to look light and graceful); slender.", "small in size, amount, extent, etc.; small; meagre."]}, {"type": "noun", "defs": ["the whole physical structure of a human being or animal; the body.", "the soft and flexible external covering or integument of an animal body; skin; ತನು ಮಾಡು tanu māḍu to cause to become thin, slender."]}], "ತನುಗಾತ್ರ": [{"type": "noun", "defs": ["a thin body.", "a man whose body is thin."]}], "ತನುಗಾತ್ರಿ": [{"type": "noun", "defs": ["a slender-bodied woman."]}], "ತನುಗೆಡು": [{"type": "verb", "defs": ["(the body) to become thin."]}], "ತನುಗೊಳ್": [{"type": "verb", "defs": ["(a deity or principle) to manifest in a physical form."]}], "ತನುಗ್ರಹಣ": [{"type": "noun", "defs": ["the act or fact of (a deity or principle) manifesting in a physical form."]}], "ತನುಜ": [{"type": "noun", "defs": ["a boy or man as related to either or both patents; a son.", "a young animal as related to either or both of its parents."]}], "ತನುಜನ್ಮ": [{"type": "noun", "defs": ["= ತನುಜ - 1."]}], "ತನುಜಾತ": [{"type": "noun", "defs": ["= ತನುಜ - 1."]}], "ತನುಜಾತಕಾಮೇಷ್ಟಿ": [{"type": "noun", "defs": ["a religious sacrifice propitiating a deity for getting a child or children."]}], "ತನುಜಾತೆ": [{"type": "noun", "defs": ["= ತನುಜೆ."]}], "ತನುಜೆ": [{"type": "noun", "defs": ["a girl or woman as related to either or both patents; a daughter."]}], "ತನುತರ": [{"type": "adjective", "defs": ["having a slim, trim figure; slender.", "of low or poor quality; meagre; mean."]}], "ತನುತಲ": [{"type": "noun", "defs": ["the lowest part of the body; the foot."]}], "ತನುತಾಪ": [{"type": "noun", "defs": ["the degree of heat of a living body."]}], "ತನುತೆ": [{"type": "noun", "defs": ["the quality or state of being thin or slender."]}], "ತನುತ್ರ": [{"type": "noun", "defs": ["a covering worn as a defence against weapons; an armour."]}], "ತನುತ್ರಯ": [{"type": "noun", "defs": ["(pl.) (phil.) the three bodies - physical, subtle and causal."]}], "ತನುತ್ರಾಣ": [{"type": "noun", "defs": ["= ತನುತ್ರ.", "the physical strength (of a person)."]}], "ತನುತ್ವ": [{"type": "noun", "defs": ["= ತನುತೆ.", "the act or fact of having a body or manifesting in a physical form."]}], "ತನುತ್ವಂಬಡೆ": [{"type": "verb", "defs": ["to become thin or slender."]}], "ತನುದಂಡ": [{"type": "noun", "defs": ["= ತನುದಂಡನೆ."]}], "ತನುದಂಡನೆ": [{"type": "noun", "defs": ["the act or an instance of subjecting another or oneself to physical strain (as a punishment or penance)."]}], "ತನುಧರ್ಮ": [{"type": "noun", "defs": ["any trait, principal characteristics, biological need etc. that is peculiar to the body."]}], "ತನುಧಾತುಜ್ಞ": [{"type": "noun", "defs": ["a medical doctor; a physician."]}], "ತನುಭವ": [{"type": "noun", "defs": ["= ತನುಜ - 1."]}], "ತನುಭವೆ": [{"type": "noun", "defs": ["= ತನುಜೆ."]}], "ತನುಮಧ್ಯ": [{"type": "noun", "defs": ["the waist that is slender.", "(pros.) a syllabic foot with six syllables."]}], "ತನುಮಧ್ಯೆ": [{"type": "noun", "defs": ["a woman whose waist is slender."]}], "ತನುಮಾನಸ": [{"type": "noun", "defs": ["a restricting or containing one's passions, desires, etc."]}], "ತನುಮೆ": [{"type": "noun", "defs": ["= ತನ್ಮೆ."]}], "ತನುರುಹ": [{"type": "noun", "defs": ["hair growing on the body."]}], "ತನುವಾತ": [{"type": "noun", "defs": ["(Jain.) one of the three air (or ether) believed to be holding all the eight worlds."]}], "ತನುವಿಕಾರ": [{"type": "noun", "defs": ["the condition of the body being mutilated, damaged or crippled.", "(dance.) the act of moving, twisting, turning the parts of the body, esp. hands, legs, face, in excited or exaggerated manners, to express different sentiments."]}], "ತನುವಿಡಿ": [{"type": "verb", "defs": ["to appear in a physical form; to take a body; to manifest (oneself).", "to continue to live; to hold one's life.", "to save one's own life."]}], "ತನುವು": [{"type": "noun", "defs": ["humid condition; moistness; dampness; humidity."]}], "ತನುವೆರಸು": [{"type": "adverb", "defs": ["with one's physical body (said of going to the Heaven while being alive)."]}], "ತನುವೆಳೆ": [{"type": "verb", "defs": ["(the body) to grow, develop toward maturity."]}], "ತನುವೇರು": [{"type": "verb", "defs": ["to become humid or more humid; to become cool or cooler."]}], "ತನುಸಂಭವ": [{"type": "noun", "defs": ["= ತನುಜ - 1."]}], "ತನುಸಂಭವೆ": [{"type": "noun", "defs": ["= ತನುಜೆ."]}], "ತನುಸಿದ್ಧ": [{"type": "noun", "defs": ["a man having absolute control and mastery over the functions of his body."]}], "ತನುಸ್ಥಾನ": [{"type": "noun", "defs": ["(astrol.) the birth-house in the zodiac."]}], "ತನೂಜ": [{"type": "noun", "defs": ["= ತನುಜ - 1.", "(astrol.) the fifth house from one's birth house in one's zodiac, believed to have influence of planets on one's son."]}], "ತನೂಜಮಂದಿರ": [{"type": "noun", "defs": ["= ತನೂಜ - 2."]}], "ತನೂಜಾತ": [{"type": "noun", "defs": ["= ತನುಜ - 1."]}], "ತನೂಜಾತೆ": [{"type": "noun", "defs": ["= ತನುಜೆ."]}], "ತನೂಜೆ": [{"type": "noun", "defs": ["= ತನುಜೆ."]}], "ತನೂದರ": [{"type": "noun", "defs": ["the belly that is thin or slender."]}], "ತನೂದರಿ": [{"type": "noun", "defs": ["a woman whose belly is slender."]}], "ತನೂನಪಾತು": [{"type": "noun", "defs": ["fire."]}], "ತನೂಭವ": [{"type": "noun", "defs": ["= ತನೂಜ."]}], "ತನೂರುಹ": [{"type": "noun", "defs": ["1 = ತನುರುಹ.", "2.either of the two forelimbs of most birds and of bats, corresponding to the human arms, that are specialised for flight; a wing."]}], "ತನೆ": [{"type": "verb", "defs": ["(said of animals) the condition, quality or period of being pregnant; pregnancy.", "(gen.) a cow having an offspring developing within.", "the yellow, principal substance of an egg, as distinguished from the albumen or white; the yolk; vitellus.", "ತನೆಯಾಗು taneyāgu (a female animal) to have an offspring developing in the uterus."]}], "ತನೆತುಂಬು": [{"type": "verb", "defs": ["= ತನೆಯಾಗು."]}], "ತನೆನಿಲ್": [{"type": "verb", "defs": ["(the female reproductive cell) to be impregnated successfully."]}], "ತನೆಬಲಿ": [{"type": "verb", "defs": ["(the unborn young of an animal) to develop in the uterus (of its mother)."]}], "ತನೆಯಿರು": [{"type": "verb", "defs": ["(said of animals) to have an offspring developing within."]}], "ತನ್ನ": [{"type": "pronoun", "defs": ["the pronoun (corresponding to he, she, it in English) used in reflexive or reciprocal sense in possessive case.", "ತನ್ನ ಮರಿ ಹೊನ್ನ ಮರಿ, ಪರರ ಮರಿ ಕಾಗೆ ಮರಿ tanna mari honna mari, parara mari kāge mari (prov.) whatever that belongs to one is superior, but that which belongs to others are necessarily inferior; the crow thinks her own bird the fairest."]}], "ತನ್ನತನ": [{"type": "noun", "defs": ["(used reflexively of third person singular nouns) individuality such as the sum of the characteristics or qualities peculiar to a person."]}], "ತನ್ನತು": [{"type": "noun", "defs": ["= ತನ್ನದು."]}], "ತನ್ನದು": [{"type": "pronoun", "defs": ["(used reflexively) that or those belonging to oneself."]}], "ತನ್ನವಿಕೆ": [{"type": "noun", "defs": ["= ತನುವು."]}], "ತನ್ನಾಕಾರ": [{"type": "noun", "defs": ["the refrain of a musical composition that is partly composed of musical notes to be sung as such along with its lyrical part."]}], "ತನ್ನೆಲೆ": [{"type": "noun", "defs": ["the plant Crotalaria rubiginosa of Papilionaceae family."]}], "ತನ್ನೆಲೆವುಳುಕ": [{"type": "noun", "defs": ["= ತನ್ನೆಲೆ."]}], "ತನ್ನೆಲೆಹುಳಿಗ": [{"type": "noun", "defs": ["= ತನ್ನೆಲೆ."]}], "ತನ್ಮಯ": [{"type": "adjective", "defs": ["deeply interested or involved; wholly occupied; preoccupied; absorbed."]}, {"type": "noun", "defs": ["a man engaged or involved (in something) with great interest."]}], "ತನ್ಮಯತೆ": [{"type": "noun", "defs": ["the quality or state of being wholly involved, engrossed in."]}], "ತನ್ಮಯತ್ವ": [{"type": "noun", "defs": ["= ತನ್ಮಯತೆ."]}], "ತನ್ಮಾತ್ರ": [{"type": "noun", "defs": ["(phil.) the five subtle and primary elements (sound, taste, physical feeling, vision and smell) that are the essence of five basic elements."]}], "ತನ್ಮಾತ್ರೆ": [{"type": "noun", "defs": ["= ತನ್ಮಾತ್ರ."]}], "ತನ್ಮೂಲಕ": [{"type": "adverb", "defs": ["by means of or through (that)."]}], "ತನ್ಮೆ": [{"type": "noun", "defs": ["a particular way, course, method of doing or to be observed in doing (something); manner, mode."]}], "ತನ್ವಂಗಿ": [{"type": "noun", "defs": ["a woman with slender, graceful body."]}], "ತನ್ವಿ": [{"type": "noun", "defs": ["= ತನ್ವಂಗಿ.", "(pros.) a metre in which each foot has twenty-four syllables."]}], "ತಪ": [{"type": "noun", "defs": ["the eleventh month in Hindu calendar."]}, {"type": "noun", "defs": ["the quality of being hot; hotness; heat.", "brightness; radiance; brilliance.", "the warmest season of the year; summer.", "a restraining of one's biological needs, controlling of passions as a penance and living a moral and austere life, to achieve spiritual height.", "an afflicted condition; pain; suffering; affliction."]}, {"type": "noun", "defs": ["a term of twelve years."]}], "ತಪಂಗೆಯ್": [{"type": "verb", "defs": ["= ತಪಗೈ."]}], "ತಪಂಗೊಳ್": [{"type": "verb", "defs": ["= ತಪಗೈ."]}], "ತಪಂಬಡು": [{"type": "verb", "defs": ["= ತಪಗೈ.", "to undergo much hotness.", "to suffer afflictions."]}], "ತಪಂಬಡುಹ": [{"type": "noun", "defs": ["the act of meditating living an ascetic's life.", "the fact or an instance of suffering severly."]}], "ತಪಃಕ್ಲಾಂತ": [{"type": "adjective", "defs": ["(physically) undergone penance or austere life."]}], "ತಪಃಪರೀಷಹ": [{"type": "noun", "defs": ["any of the obstacles that come in the way of one's ascetic life."]}], "ತಪಃಪ್ರಭಾವ": [{"type": "noun", "defs": ["the mystic power got by long penance and religious austerity."]}], "ತಪಕೀರ": [{"type": "noun", "defs": ["a preparation of powdered tobacco which is taken into the nostrils by inhalation; snuff."]}], "ತಪಕ್ಕನೆ": [{"type": "adverb", "defs": ["(usu. used to modify the verb ಬೀಳು = to fall) suddenly."]}], "ತಪಗುಟ್ಟು": [{"type": "verb", "defs": ["to feel acute sorrow or be distressed; to grieve."]}], "ತಪಗುಡು": [{"type": "verb", "defs": ["to be or become completely wet."]}], "ತಪಗೆಯ್": [{"type": "verb", "defs": ["= ತಪಗೈ."]}], "ತಪಗೇಡಿ": [{"type": "noun", "defs": ["a person who poses obstacles in the way of another's meditation or religious life."]}], "ತಪಗೈ": [{"type": "verb", "defs": ["to meditate on the Supreme, leading a strict, self-discipline and self-denial life."]}], "ತಪಟೆ": [{"type": "noun", "defs": ["a kind of flat and percussion instrument, with a short brim, on which a skin membrane is tightly spread, and usu. played with two sticks."]}], "ತಪತಪನೆ": [{"type": "adverb", "defs": ["(usu. used to modify the verb ತೊಟ್ಟಿಕ್ಕು= to fall in drops) continuously."]}], "ತಪತಿ": [{"type": "noun", "defs": ["name of a river in Maharashtra, in western India, joining Arabian sea."]}], "ತಪನ": [{"type": "adjective", "defs": ["that burns; burning."]}, {"type": "noun", "defs": ["the sun.", "intense emotional suffering caused by loss, disaster, misfortune, etc.; deep sadness.", "much hotness."]}], "ತಪನಕರ": [{"type": "noun", "defs": ["the (hot) rays of the sun."]}], "ತಪನಾತಪ": [{"type": "noun", "defs": ["the hot sun-light."]}], "ತಪನೀಯ": [{"type": "adjective", "defs": ["that is to be heated or burnt."]}, {"type": "noun", "defs": ["gold."]}], "ತಪನೆ": [{"type": "noun", "defs": ["ತಪನ2 – 2 & 3."]}], "ತಪನೋದಯ": [{"type": "noun", "defs": ["the appearance of the sun above the eastern horizon; the sun-rise."]}], "ತಪನೋಪಲ": [{"type": "noun", "defs": ["a kind of stone supposed to emit sparks when exposed to sun-light."]}], "ತಪಮಾನ್": [{"type": "verb", "defs": ["= ತಪಂಗೆಯ್."]}], "ತಪಮಿರ್": [{"type": "verb", "defs": ["= ತಪಂಗೆಯ್."]}], "ತಪರಾಕಿ": [{"type": "noun", "defs": ["a slapping on another's face with ones open palm."]}], "ತಪರಾಕು": [{"type": "noun", "defs": ["= ತಪರಾಕಿ."]}], "ತಪರಾಕೆ": [{"type": "noun", "defs": ["= ತಪರಾಕಿ."]}], "ತಪರು": [{"type": "noun", "defs": ["a fruit in which the seed is not developed, hence useless."]}], "ತಪರ್ಲೋಕ": [{"type": "noun", "defs": ["[rightly, ತಪೋಲೋಕ] the one of the seven worlds that are believed to be in the region above our earth."]}], "ತಪಲೆ": [{"type": "noun", "defs": ["a wide-mouthed kitchen vessel of either copper or bronze."]}], "ತಪಶೀಲ": [{"type": "noun", "defs": ["= ತಪಸೀಲು."]}], "ತಪಶೀಲು": [{"type": "noun", "defs": ["= ತಪಸೀಲು."]}], "ತಪಶೀಲುವಾರು": [{"type": "adjective", "defs": ["detailed; having or giving (all) details."]}, {"type": "adverb", "defs": ["in detail."]}], "ತಪಶ್ಚರಣ": [{"type": "noun", "defs": ["= ತಪಶ್ಚರ್ಯೆ."]}], "ತಪಶ್ಚರಣೆ": [{"type": "noun", "defs": ["= ತಪಶ್ಚರ್ಯೆ."]}], "ತಪಶ್ಚರಿತ": [{"type": "noun", "defs": ["a man engaged in the practice of penance for realisation of philosophical truth and principles of being."]}], "ತಪಶ್ಚರಿತೆ": [{"type": "noun", "defs": ["a woman engaged in the practice of penance for realisation of philosophical truth and principles of being."]}], "ತಪಶ್ಚರಿಯ": [{"type": "noun", "defs": ["= ತಪಶ್ಚರ್ಯೆ."]}], "ತಪಶ್ಚರ್ಯೆ": [{"type": "noun", "defs": ["the practice of penance usu. for realisation of philosophical truth and principles of being."]}]}