{"ಕಱೆಮನ": [{"type": "noun", "defs": ["a wicked, depraved, corrupt mind."]}], "ಕಱೆಮಱೆ": [{"type": "noun", "defs": ["(pl.) deficiencies and lacunae 2) hypocrisy; pretensiousness."]}], "ಕಱೆವು": [{"type": "noun", "defs": ["(as cows) the giving of milk.", "a cow or buffalo that is giving milk."]}], "ಕಱೆವೆಟ್ಟು": [{"type": "noun", "defs": ["Nīlagiri, the blue mlountain range in Tamiḷ Nāḍu, South India."]}], "ಕಱೆವೆರಸು": [{"type": "verb", "defs": ["to have a stain, black spot on."]}], "ಕಱೆಸು": [{"type": "verb", "defs": ["to cause to fall like rain.", "to cause to draw or squeeze (milk from a cow etc.)."]}], "ಕಱೆಹ": [{"type": "noun", "defs": ["the act of drawing or squeezing milk from the mammary glands of (a cow etc.).", "that which gives milk (as a cow, buffalow etc.)."]}], "ಕಱ್ವು": [{"type": "verb", "defs": ["to become very angry."]}], "ಕಱಱನೆ": [{"type": "adverb", "defs": ["being or turning black; looking dark; darkly."]}], "ಕೞಕೞ": [{"type": "noun", "defs": ["= ಕೞಕುೞ."]}], "ಕೞಕೞಿಸು": [{"type": "verb", "defs": ["to shine with a sparkling light; to be bright; to glisten; to sparkle; to glitter."]}], "ಕೞಕುೞ": [{"type": "noun", "defs": ["absence of order; chaotic or perplexed condition."]}], "ಕೞಚು": [{"type": "verb", "defs": ["= ಕೞಲ್ಚು."]}], "ಕೞನಿ": [{"type": "noun", "defs": ["a field where rice is cultivated."]}], "ಕೞಮ": [{"type": "noun", "defs": ["= ಕೞವೆ."]}], "ಕೞಮಚೂರ್ಣ": [{"type": "noun", "defs": ["rice flour."]}], "ಕೞಮೆ": [{"type": "noun", "defs": ["= ಕೞವೆ."]}], "ಕೞಲ್": [{"type": "verb", "defs": ["to become physically weak; to lose strength; to lose fat; to become lean.", "to lose confidence.", "to fall down or fall to pieces, as when supports or sides fail to hold; to collapse.", "to become loose.", "to react sharply or angrily.", "ಕೞಲೆಗುಟ್ಟು kałaleguṭṭu to bank as to make the object fall down; ಕೞಲೆನುಡಿ kałale nuḍi to speak as to alleviate (pain, grief, etc.) or cool down."]}, {"type": "noun", "defs": ["the state or condition of being loose, supportless.", "the state or condition of being faded away, lean, weak."]}, {"type": "noun", "defs": ["milk that is coagulated; curds.", "the watery part of the curd remaining after the butter is churned and taken out; butter-milk."]}, {"type": "noun", "defs": ["an ornament with small bells for wearing around the ankle; an anklet."]}], "ಕೞಲಿಸು": [{"type": "verb", "defs": ["to cause to become lose and fall down; to loosen the hold as to cause (something) to collapse.", "to reduce the size, volume of; to weaken."]}], "ಕೞಲು": [{"type": "noun", "defs": ["= ಕೞಲ್4."]}], "ಕೞಲುಲಿ": [{"type": "noun", "defs": ["the chiming sound of an anklet."]}], "ಕೞಲುಳಿ": [{"type": "noun", "defs": ["= ಕೞಲುಲಿ."]}], "ಕೞಲೆ": [{"type": "noun", "defs": ["a small thorny branch of a plant."]}], "ಕೞಲೆಗಟ್ಟು": [{"type": "verb", "defs": ["to tie both hands together on one's back."]}], "ಕೞಲ್ಚು": [{"type": "verb", "defs": ["to separate; to divide; to disunite.", "to remove (as a part from a whole).", "to turn aside; to fend off; to ward off.", "to scatter (a liquid, powder etc.) in drops upon.", "to loosen; to make loose; to free from restrictions.", "to extract; to take out; to draw out.", "to slip down; to fall down."]}, {"type": "noun", "defs": ["the act of removing.", "the act of turning aside, fending off."]}], "ಕೞವೆ": [{"type": "noun", "defs": ["rice in the husk, the seed of the aquatic cereal grass Oryza sativa of Poaceae family; paddy."]}], "ಕೞವೆಗಿಡು": [{"type": "noun", "defs": ["the plant Carissa carandus of Apocynaceae family and its fruit."]}], "ಕೞಿ": [{"type": "verb", "defs": ["to cease to exist; to die.", "to pass - a) to go or move forward, through or out; b) to spend (one's time, days, life etc.).", "to slip by; to elapse; to pass (as time).", "to avoid happening; to fend off.", "to drive out or away.", "to go beyond (one's capacity, power, etc.); to become impossible.", "to deduct; to subtract."]}, {"type": "verb", "defs": ["to grow or become ripe; to ripe.", "to advance in age; to become old.", "to lose strength, vigor, etc. (as in advanced age)."]}, {"type": "noun", "defs": ["a wooden pin used to insert a) in to the hole of the latch of a door for preventing it from being opened or b) in to the hole of a yoke to hold the cord preventing from an ox disengaging itself from the yoke."]}, {"type": "noun", "defs": ["a thick liquid food made by boiling rice, ragi (finger millet) or jowar flour in water; a kind of porridge.", "soft mud; slush; soggy earth."]}], "ಕೞಿಪು": [{"type": "verb", "defs": ["to send (a person) off or away; to send to; to despatch (a person or goods).", "to spend (one's time, days, life etc.).", "to pass over; to go from one side to the other of; to go across.", "to kill."]}, {"type": "noun", "defs": ["a discoloration, a spot or mark caused esp. by a contact with foreign matter and not easily removed (as on a cloth).", "a blemish, damage to a reputation etc.", "a thing of inferior quality."]}], "ಕೞಿಪ್ಪು": [{"type": "verb", "defs": ["= ಕೞಿಪು1."]}], "ಕೞಿಯಲರ್": [{"type": "noun", "defs": ["a flower that has lost its frehness or strength; a withered flower."]}], "ಕೞಿಯುಣ್": [{"type": "verb", "defs": ["to eat too much or greedily."]}], "ಕೞಿಯೇಱ್": [{"type": "verb", "defs": ["a serious wound.", "a heavy blow causing it."]}], "ಕೞಿಯೋದು": [{"type": "verb", "defs": ["to read or study elaborately and completely."]}], "ಕೞಿಲೆ": [{"type": "noun", "defs": ["the shoot of a bamboo."]}], "ಕೞಿವಣ್": [{"type": "noun", "defs": ["a fruit fully grown or developed; esp. ready to be harvested and used for food.", "a fruit that is overripe nearing decaying."]}], "ಕೞಿವಗಲ್": [{"type": "noun", "defs": ["the last part of a day; ending of a day."]}], "ಕೞಿವದ": [{"type": "noun", "defs": ["the state of being sunk down, bent down; loss of vitality or strength.", "the state of being well grown; ripe condition or age."]}], "ಕೞಿವರಿ": [{"type": "verb", "defs": ["to go or run to a great distance."]}], "ಕೞಿವು": [{"type": "noun", "defs": ["the end of one's existence; death; cessasion.", "the state of being defeated; a defeat."]}], "ಕೞಿವೂ": [{"type": "noun", "defs": ["= ಕೞಿಯಲರ್."]}], "ಕೞಿವೊಡಲ್": [{"type": "noun", "defs": ["the body (of human beings, animals,etc.) considered as impermanent one."]}], "ಕೞು": [{"type": "noun", "defs": ["a sharp pointed iron stick used to drive an elephant."]}], "ಕೞುಪು": [{"type": "verb", "defs": ["= ಕೞಿಪು1."]}], "ಕೞೆ": [{"type": "verb", "defs": ["= ಕೞಿ1."]}, {"type": "noun", "defs": ["a slender hollow bamboo, with holes along its length, used as a musical instrument; a musical bamboo-pipe."]}], "ಕೞ್ಕನೆ": [{"type": "adverb", "defs": ["immediately; suddenly.", "unexpectedly."]}], "ಕೞ್ಕು": [{"type": "verb", "defs": ["to fear; to be afraid (of)."]}, {"type": "noun", "defs": ["fear; apprehension."]}], "ಕೞ್ಕೆ": [{"type": "noun", "defs": ["= ಕೞ್ಕು2."]}], "ಕೞ್ಗನೆ": [{"type": "adverb", "defs": ["darkly; blackly; gloomingly."]}], "ಕೞ್ಗು": [{"type": "verb", "defs": ["to become dark or black."]}, {"type": "noun", "defs": ["the colour of charcoal; black colour.", "the dark brown colour."]}], "ಕೞ್ಗುದಿ": [{"type": "noun", "defs": ["the perplexed state of mind."]}], "ಕೞ್ಗೊಲೆ": [{"type": "noun", "defs": ["a killing that is outrageously evil or wicked; an abominable murder.", "tormentation, distress etc. that cannot be endured or tolerated.", "destruction or spoiling of a language, art, public or private properties,etc., with a malicious intention."]}], "ಕೞ್ಗೊಲೆಗೊಳ್": [{"type": "verb", "defs": ["to murder heinously."]}], "ಕೞ್ಚಿಸು": [{"type": "verb", "defs": ["to cause to clean by means of water or other liquid, as by dipping, tumbling or scrubbing, often with soap, a detergent, etc.; to get washed."]}], "ಕೞ್ಚು": [{"type": "verb", "defs": ["to clean by means of water or other liquid, as by dipping, tumbling or scrubbing, often with a piece of soap, a detergent, etc.; to wash."]}], "ಕೞ್ತಲಿಸು": [{"type": "verb", "defs": ["to cause darkness; to make dark or darker; to darken.", "to become dark or darker.", "to make another unable to see (a thing)."]}], "ಕೞ್ತಲೆ": [{"type": "noun", "defs": ["partial or total absence of light.", "lack of spiritual or intellectual knowledge."]}], "ಕೞ್ತಲೆವಗೆಯ": [{"type": "noun", "defs": ["the sun or moon (who disperse darkness)."]}], "ಕೞ್ತಲೆವಣಿ": [{"type": "noun", "defs": ["the moon (as the jewel in the sky during night)."]}], "ಕೞ್ತಲೆವಿಡು": [{"type": "verb", "defs": ["to cause to become dark; to make dark or darker."]}], "ಕೞ್ತು": [{"type": "noun", "defs": ["the part of the body connecting the head to the shoulders; the neck.", "the shoulder - a) the joint connecting the arm or forelimb with the body b) the part of the body including this joint and extending to the base of the neck."]}], "ಕೞ್ತೆ": [{"type": "noun", "defs": ["any of a number of horselike perissodactylous mammals (family Equidae) having long ears and a short mane, and are domesticated, known for hard work; a donkey.", "a person regarded as stupid, foolish or obstinate."]}], "ಕೞ್ತೆಕುಟಿಗ": [{"type": "noun", "defs": ["a man who tends donkies."]}], "ಕೞ್ತೆಗಿರಿ": [{"type": "noun", "defs": ["a kind of medicinal plant."]}], "ಕೞ್ದಿಂಗಳ್": [{"type": "noun", "defs": ["the day on which the moon has its first phase, that is when it is between the earth and the sun, with its dark side toward the earth; new-moon day; the last day of the lunar month."]}], "ಕೞ್ಪ": [{"type": "noun", "defs": ["[rightly ಕಲ್ಪ] a commandment or direction meant as a rule of action or conduct ; a precept.", "a minor scripture that deals with the rules for ceremonial acts or sacrifices.", "one of the eighteen traditional writings or scriptures of Hindus.", "a measure of time, as a day of the universe; (myth.) a period of thousand yugas (eras).", "a thing or option chosen in place of another.", "(myth.) the Final Deluge, at the final destruction of the universe.", "medical treatment of the sick.", "the wish-yielding tree of the Heaven.", "(Jain.) one of the sixteen heavens.", "(Jain.) a cycle of duration which includes universal progression and retrogression.", "one of the four kinds of sacred ash."]}], "ಕೞ್ಪಕುಜಾತ": [{"type": "noun", "defs": ["[rightly ಕಲ್ಪಕುಜಾತ] (myth.) a wish-yielding tree of the Heavens.", "(fig.) a person who grants to another all that is wished for."]}], "ಕೞ್ಪಭೂಜ": [{"type": "noun", "defs": ["[rightly ಕಲ್ಪಭೂಜ]= ಕೞ್ಪಕುಜಾತ."]}], "ಕೞ್ಪಾಂತ": [{"type": "noun", "defs": ["the end of an era of the universe; the final destruction of the universe."]}], "ಕೞ್ಪು": [{"type": "verb", "defs": ["= ಕೞಿಪು1."]}, {"type": "adjective", "defs": ["black - very dark, having no colour from the absorption of all or nearly all incident light; b) completely dark from the absence of a source of light."]}, {"type": "noun", "defs": ["the colour that is black; black colour.", "a medicated black lotion for the eyes.", "absence of light; darkness."]}], "ಕೞ್ಪೆಱು": [{"type": "verb", "defs": ["to become black; to become darker (in complexion)."]}], "ಕೞ್ಮು": [{"type": "verb", "defs": ["= ಕೞ್ಚು."]}], "ಕಾ": [{"type": "verb", "defs": ["to watch over and defend or protect from harm; to guard from or against.", "to keep watch by (a door etc.) so as to control entry or exit.", "to supervise (prisoners etc.) and prevent from escaping; to keep watch (cattle, sheep etc. while grazing).", "to stay in a place or remain in readiness or in anticipation (until something expected happens or for someone to arrive or catch up); to wait.", "to be, remain or delay in expectation or anticipation of; await.", "to be ready or at hand.", "to be eager to do (something).", "to keep (something) from otherś knowledge.", "to excuse or forgive (a person for some fault).", "ಕಾದಿಡು kādiḍu to keep back, store up or set apart for later use or for some special purpose; to reserve; ಕಾದುಕೊಂಡಿರು kādukoṇḍiru to keep oneself waiting (for); 2. to take care of another or something as a care-taker; 3. to wait for a right opportunity."]}], "ಕಾಂಕಳಿ": [{"type": "noun", "defs": ["the tree Flacourtia jongamans (= F. Cataphracta) of Flacourtiaceae family.", "its plum; East Indian plum."]}], "ಕಾಂಕೆ": [{"type": "noun", "defs": ["heat - a) the condition of being hot; b) the sensation or perception of this; c) a form of energy arising from the random motion of the molecules of bodies, which may be transferred by conduction, convection or radiation; d) the amount of this needed to cause a specific process or evolved in a process."]}, {"type": "noun", "defs": ["desire - a) an unsatisfied longing or craving; b) an expression of this; c) something desired."]}], "ಕಾಂಕ್ರೀಟು": [{"type": "noun", "defs": ["a hard, compact building material formed when a mixture of cement, sand, gravel, and water dries; concrete."]}], "ಕಾಂಕ್ಷಿತ": [{"type": "adjective", "defs": ["desired; longed; craved."]}, {"type": "noun", "defs": ["a strong craving for; a desire.", "that which is desired.", "a person desiring or desirous of."]}], "ಕಾಂಕ್ಷಿಸು": [{"type": "verb", "defs": ["to wish or long for; to crave; to desire."]}], "ಕಾಂಕ್ಷೆ": [{"type": "noun", "defs": ["a strong wish or craving; a desire.", "an eye-disease."]}], "ಕಾಂಗಡಿ": [{"type": "noun", "defs": ["a cradle type hanger."]}], "ಕಾಂಗರೂ": [{"type": "noun", "defs": ["any of various leaping, plant-eating marsupials (family Macropodidae) native to Australia and neighboring islands, with short forelegs, strong, large hind legs, and a long, thick tail, the female of which has a pouch or marsupium, in front, for her young; a kangaroo."]}], "ಕಾಂಗಾರ": [{"type": "noun", "defs": ["a person who is employed to do physical work for wages, esp. in order to earn a living in an industry, farm or public works as road or tank building, building constuction, etc."]}], "ಕಾಂಗಾರಿ": [{"type": "noun", "defs": ["the work by a person in an industry, farm, public works as road, tank building, building construction etc., for wages."]}], "ಕಾಂಗು": [{"type": "adjective", "defs": ["of dark blue or black colour."]}, {"type": "noun", "defs": ["the dark blue or black colour.", "a piece of dark blue or black cloth."]}], "ಕಾಂಗೂಲ": [{"type": "noun", "defs": ["(dance.) a single-hand gesture with slightly hollowed palm, bending the ring-finger, stretching the little finger slightly backward, other two fingers and thumb straightened and held like the eye of a coconut."]}], "ಕಾಂಗ್ರೆಸ್ಸು": [{"type": "noun", "defs": ["an assembly or conference, esp. a formal assembly of representatives, as from various nations or associations, to discuss problems.", "the legislature of the U.S., consisting of the Senate and the House of Representatives.", "a broadly-based party in India, arising directly from the Indian independence movement (which met as the Indian National Congress from 1885), after Independence, became purely a political party and subsequently split into several parties."]}], "ಕಾಂಚಣ": [{"type": "noun", "defs": ["= ಕಾಂಚಾಣ1."]}], "ಕಾಂಚನ": [{"type": "noun", "defs": ["a yellow malleable ductile high-density metallic element resistant to chemical reaction, occurring naturally in quartz veins and gravel, and precious as a monetary medium, in jewellery, etc. (symbol Au); gold.", "a current medium of exchange in the form of coins and bank notes; money.", "the quality, condition or fact of shining by reflected light; gloss; sheen; lustre; brilliancy.", "wealth - a) much money or property; great amount of worldly possessions; riches; b) the state of having much money or property; affluence.", "the filament of a lotus flower.", "arsenic trisulfide, As2S3, having a lemon-yellow colour and a resinous luster, used as a pigment; orpiment.", "the plant Datura stramonium of Solanaceae family.", "the tree Mesua ferrea of Guttiferae family.", "its flower."]}], "ಕಾಂಚನಕದಳಿ": [{"type": "noun", "defs": ["the plantain tree Musa rubra of Musaceae family.", "its fruit."]}], "ಕಾಂಚನಪ್ರಸವ": [{"type": "noun", "defs": ["the tree Mesua ferrea ofGuttiferae family.", "its flower."]}], "ಕಾಂಚನಮಾಲೆ": [{"type": "noun", "defs": ["a gold necklace.", "(pros.) name of a meter that has one group of three syllables (of which the first one being long and the other two short) followed by two long syllables (-uu, -, -)."]}], "ಕಾಂಚನಮೃಗ": [{"type": "noun", "defs": ["(fig.) an attractive, enchanting, but deluding object."]}], "ಕಾಂಚನವರ್ಣ": [{"type": "noun", "defs": ["golden yellow colour."]}], "ಕಾಂಚನವೃಷ್ಟಿ": [{"type": "noun", "defs": ["(fig.) a shower of gold or money."]}], "ಕಾಂಚನಸರೋರುಹ": [{"type": "noun", "defs": ["a gold-coloured lotus flower."]}], "ಕಾಂಚನಾದ್ರಿ": [{"type": "noun", "defs": ["Mēru, a mythological golden mountain."]}], "ಕಾಂಚನಾರಕ": [{"type": "noun", "defs": ["the tree Bauhinia purpurea of Caesalpiniaceae family having two-lobed leaves and large, flat flowers; pink bauninia."]}], "ಕಾಂಚನಾಲ": [{"type": "noun", "defs": ["= ಕಾಂಚನಾರಕ."]}], "ಕಾಂಚನಿ": [{"type": "noun", "defs": ["powdered rhizome of the plant Curcuma longa of zingiberaceae family, used as a yellow dye or a seasoning and in medicine; turmeric powder."]}], "ಕಾಂಚನಿಸು": [{"type": "verb", "defs": ["to turn (a thing) into gold or golden colour."]}], "ಕಾಂಚಾಣ": [{"type": "noun", "defs": ["= ಕಾಂಚನ - 1 & 2."]}, {"type": "noun", "defs": ["= ಕಾಂಚಾಳ."]}], "ಕಾಂಚಾರ": [{"type": "noun", "defs": ["= ಕಾಂಚಾಳ."]}], "ಕಾಂಚಾಳ": [{"type": "noun", "defs": ["the tree Bauhinia purpurea of Caesalpiniaceae family having two-lobed leaves and large, flat flowers; pink bauninia."]}], "ಕಾಂಚಿ": [{"type": "noun", "defs": ["the grass Sorghum nitidum (= Andropogon serratus) of Poaceae family."]}, {"type": "noun", "defs": ["an ornamental metal belt worn around the waist by women; a woman's girdle.", "the plant Abrus precatorius of Papilionaceae family; wild liquorice.", "the plant Trevia polycarpa (= T. nudiflora) of Euphorbiaceae family; river portia.", "name of a city in TamiḷNāḍu in South India."]}], "ಕಾಂಚಿಕ": [{"type": "noun", "defs": ["a dish consisting of cereal boiled in water and served with buttermilk; a liquid food chiefly for invalids; sour gruel."]}], "ಕಾಂಚಿತ": [{"type": "noun", "defs": ["a service to a god; a worshipping."]}], "ಕಾಂಚಿವಾಳ": [{"type": "noun", "defs": ["= ಕಾಂಚಾಳ."]}], "ಕಾಂಚೀಕಳಾಪ": [{"type": "noun", "defs": ["= ಕಾಂಚಿ2 - 1."]}], "ಕಾಂಚೀದಾಮ": [{"type": "noun", "defs": ["= ಕಾಂಚಿ2 - 1."]}], "ಕಾಂಚೀಪಟ್ಟಿಕೆ": [{"type": "noun", "defs": ["= ಕಾಂಚಿ2 - 1."]}], "ಕಾಂಚೀಪದ": [{"type": "noun", "defs": ["the part of the body between the ribs and the hips; the waist.", "the part of a woman's body that includes hips and loins of a woman."]}], "ಕಾಂಜನಿ": [{"type": "noun", "defs": ["a plant."]}], "ಕಾಂಜರ": [{"type": "noun", "defs": ["= ಕಾಂಜಿವಾರ."]}], "ಕಾಂಜಿ": [{"type": "noun", "defs": ["= ಕಾಂಚಿಕ."]}], "ಕಾಂಜಿಕ": [{"type": "noun", "defs": ["= ಕಾಂಚಿಕ."]}], "ಕಾಂಜಿರ": [{"type": "noun", "defs": ["= ಕಾಂಜಿವಾರ."]}], "ಕಾಂಜಿವಾರ": [{"type": "noun", "defs": ["the tree Strychnos nux-vomica of Loganiaceae family and its poisonous nut containing strychnine, brucine and other alkaloids; nux-vomica."]}], "ಕಾಂಜೀರ": [{"type": "noun", "defs": ["= ಕಾಂಜಿವಾರ."]}], "ಕಾಂಡ": [{"type": "noun", "defs": ["the main upward-growing axis of a plant, having nodes and bearing leaves, usu. extending in a direction opposite to that of the root and above the ground, and serving to support the plant and to transport and store food materials, esp. the main stalk or trunk of a tree, shrub or other plant, from which leaves, flowers, and fruit develop; a stem.", "a slender, pointed missile shot from a bow; an arrow.", "any of the main divisions of a book or other writing; a chapter.", "a group of people, animal gathered at a place; a multitude.", "a good or right occasion; an opportunity.", "right or superior knowledge.", "water.", "the apparent blue canopy on our heads; the sky.", "praise; flattery.", "blame; censure.", "a cover; a veil; a screen.", "a mingling with others; a meeting.", "speed; quickness.", "a horse.", "a group of mean, wicked persons.", "a despicable, contemptible thing.", "the tree Terminalia catapa of Combretaceae family; Indian almond; country almond.", "the long bone of the arm or leg.", "the slender, jointed, usu. flexible stem of any of certain plants, as bamboo or rattan; a cane.", "a stick; a staff.", "a private place.", "an old measure of quantity."]}], "ಕಾಂಡಜ": [{"type": "noun", "defs": ["that which is born in water; the lotus plant.", "its flower."]}], "ಕಾಂಡಜಜ": [{"type": "noun", "defs": ["Brahma, who was born from a lotus."]}], "ಕಾಂಡತಿಕ್ತೆ": [{"type": "noun", "defs": ["a plant."]}], "ಕಾಂಡಧಿ": [{"type": "noun", "defs": ["a great receptacle of water; ocean.", "a portable case for holding arrows; a quiver."]}], "ಕಾಂಡಪಟ": [{"type": "noun", "defs": ["any piece of cloth used as a concealing or separating screen or curtain;l a veil."]}], "ಕಾಂಡಪೃಷ್ಠ": [{"type": "noun", "defs": ["a man who carries a case holding arrows, on his back as an archer, soldier or hunter, etc."]}], "ಕಾಂಡರಂಧ್ರ": [{"type": "noun", "defs": ["any of the raised pores in the stems of woody plants that allow gas exchange between the atmosphere and the internal tissues; a lenticel."]}], "ಕಾಂಡರುಹೆ": [{"type": "noun", "defs": ["the plant Helleborus niger of Ranunculaceae family; black hellebore."]}], "ಕಾಂಡಲ": [{"type": "noun", "defs": ["the tree Avicennia officinalis (= A. tomentosa) of Verbenaceae family; white mangrove.", "the tree Rhizophora mucronata of Rhizophoraceae family; demon candle."]}], "ಕಾಂಡಲು": [{"type": "noun", "defs": ["= ಕಾಂಡಲ."]}], "ಕಾಂಡಲೆ": [{"type": "noun", "defs": ["the tree Kandelia candel (= K. rheedi) of Rhizophoraceae family; candle mangrove."]}], "ಕಾಂಡವೃಕ್ಷ": [{"type": "noun", "defs": ["the tree Terminalia catapa of Combretaceae family; Indian almond; country almond."]}], "ಕಾಂಡಸ್ಪøಷ್ಟ": [{"type": "noun", "defs": ["one who lives by arms; a warrior; a soldier."]}], "ಕಾಂಡಾಲ": [{"type": "noun", "defs": ["a big closely-knit bamboo basket for storing grains."]}], "ಕಾಂಡಾಸನ": [{"type": "noun", "defs": ["a bow, on the string of which an arrow to be shot is placed."]}], "ಕಾಂಡಿಕೆ": [{"type": "noun", "defs": ["the creeper Cucumis melo (= C. utilissimus) of Cucurbitaceae family.", "its gourd."]}], "ಕಾಂಡೀರ": [{"type": "adjective", "defs": ["armed with arrows (and a bow)."]}, {"type": "noun", "defs": ["a man who uses arrows; an archer.", "a kind of medicinal plant."]}], "ಕಾಂಡೇಕ್ಷು": [{"type": "noun", "defs": ["the plant Barleria longiflora of Acanthaceae family; nail dye.", "the grass Saccharum spontaneum of Poaceae family; thatch grass."]}], "ಕಾಂಡೇರಿ": [{"type": "noun", "defs": ["the creeper Cissus quadrangularis (= Vitis quadrangularis) of Vitaceae family."]}], "ಕಾಂಡ್ಲ": [{"type": "noun", "defs": ["= ಕಾಂಡಲ."]}], "ಕಾಂತ": [{"type": "noun", "defs": ["the state or condition or fact of a word ending with 'ಕ'."]}, {"type": "adjective", "defs": ["desired; longed; craved; loved.", "attracting; charming; beautiful."]}, {"type": "noun", "defs": ["a man with reference to a woman to whom he is married; a husband.", "a man who is loved by or who loves, a woman; a lover.", "(in comp.) a stone.", "the normal place of dwelling; a house.", "the moon.", "iron.", "Křṣṇa.", "Skanda (Subrahmaṇya).", "any piece of certain kinds of material that has the property of attracting iron; a magnet.", "(rhet.) the style that is pleasant, lucid, vivid and very attractive considered as the merits in poetics."]}], "ಕಾಂತಕಾಮಿ": [{"type": "noun", "defs": ["the ruddy goose considered to be a pattern of conjugal attachment."]}], "ಕಾಂತಕ್ಷೇತ್ರ": [{"type": "noun", "defs": ["a region of variable force around magnets, magnetic materials or current-carrying conductors; a physical field that arises from an electric charge in motion, producing a force on a moving electric charge; a magnetic field."]}], "ಕಾಂತಗುಣ": [{"type": "noun", "defs": ["(rhet.) the style that is pleasant, lucid, vivid and very attractive considered as the merits in poetics.", "the quality of a magnet, whether natural or electrical."]}], "ಕಾಂತಗೋಳ": [{"type": "noun", "defs": ["that region surrounding a planet in which the planeṭs magnetic field is stronger than the interplanetary field; magneto sphere."]}], "ಕಾಂತಚೋದನೆ": [{"type": "noun", "defs": ["the act or process by which an electric or magnetic effect is produced in an electrical conductor or magnetizable body when it is exposed to the influence or variation of a field of force; induction."]}], "ಕಾಂತತ್ವ": [{"type": "noun", "defs": ["magnetism - a) the property, quality or condition of being magnetic; b) the force to which this is due."]}], "ಕಾಂತಧ್ರುವ": [{"type": "noun", "defs": ["a magnetic pole - a) either pole of a magnet, where the magnetic lines of force seem to be concentrated; b) either point on the earth's surface toward which the needle of a magnetic compass points (which does not precisely coincide with respective geographical pole)."]}], "ಕಾಂತಧ್ರುವಸೂಚಿ": [{"type": "noun", "defs": ["an instrument showing the direction of magnetic north and bearings from it; a (magnetic) compass."]}], "ಕಾಂತಪರಿಮಂಡಲ": [{"type": "noun", "defs": ["a closed path, usu. of magnetic material, that confines the magnetic flux; magnetic circuit."]}], "ಕಾಂತಪುಷ್ಪ": [{"type": "noun", "defs": ["the large, flat flowers of the tree Bauhinia purpurea of Caesalpiniaceae family having two-lobed leaves; pink bauninia."]}], "ಕಾಂತಪ್ರವರ್ಧಕ": [{"type": "noun", "defs": ["a tubeless, sensitive amplifier that controls the flow of current from an alternating voltage source by applying a weak signal to the control windings; a magnetic amplifier."]}], "ಕಾಂತಪ್ರವಾಹ": [{"type": "noun", "defs": ["the component of a magnetic field perpendicular to an area multiplied by the size of that area; a measure of the number of magnetic field lines passing through the area; magnetic flux."]}], "ಕಾಂತಬಲಮಾಪಕ": [{"type": "noun", "defs": ["= ಕಾಂತಮಾಪಕ."]}], "ಕಾಂತಮಂಡಲ": [{"type": "noun", "defs": ["a closed path, usu. of magnetic material, that confines the magnetic flux; a magnetic circuit."]}], "ಕಾಂತಮಸೂರ": [{"type": "noun", "defs": ["a device producing a magnetic field capable of focusing a beam of charged particles; a magnetic lens."]}], "ಕಾಂತಮಾಪಕ": [{"type": "noun", "defs": ["a magnetometer - a) an instrument for measuring magnetic forces, esp. the earth's magnetic field; b) an instrument for detecting the presence of magnetic materials by their influence on the local magnetic field: often used to screen for weapons at airports, etc."]}], "ಕಾಂತಲಕ": [{"type": "noun", "defs": ["the tree Lagerstroemia lanceolata of Lythraceae family.", "the tree Credela toona."]}], "ಕಾಂತವಿದ್ಯುತ್": [{"type": "noun", "defs": ["electricity produced by magnetic power; magnetic electricity."]}], "ಕಾಂತವಿದ್ಯುತ್ತು": [{"type": "noun", "defs": ["= ಕಾಂತವಿದ್ಯುತ್."]}], "ಕಾಂತಶಕ್ತಿ": [{"type": "noun", "defs": ["the repelling or attracting force between a magnet and a ferromagnetic material, between a magnet and a current-carrying conductor, etc.; magnetic force."]}], "ಕಾಂತಸದ್ಮ": [{"type": "noun", "defs": ["a husband's house (as dif. from a woman's parents' house)."]}], "ಕಾಂತಸೂಚಿ": [{"type": "noun", "defs": ["a slender bar of magnetised steel which, when mounted so as to swing freely on a pivot, will point along the line of the magnetic meridian toward the magnetic poles, approximately north and south; a magnetic needle."]}], "ಕಾಂತಳಗಿ": [{"type": "noun", "defs": ["= ಕಾಂತಲಕ."]}], "ಕಾಂತಾಂತಿಕ": [{"type": "noun", "defs": ["that which is very beautiful.", "the quality of being so."]}], "ಕಾಂತಾಕದಂಬ": [{"type": "noun", "defs": ["an assemblage of women."]}], "ಕಾಂತಾಜಾಲ": [{"type": "noun", "defs": ["= ಕಾಂತಾಕದಂಬ."]}], "ಕಾಂತಾತತಿ": [{"type": "noun", "defs": ["= ಕಾಂತಾಕದಂಬ."]}], "ಕಾಂತಾದರ್ಶಿ": [{"type": "noun", "defs": ["a man who brings or causes to have a good, ideal vision."]}], "ಕಾಂತಾದಿವಟಕ": [{"type": "noun", "defs": ["a medicinal substance."]}], "ಕಾಂತಾನತಿಮಾಪಕ": [{"type": "noun", "defs": ["a freely rotating, magnetised needle, that is horizontal at the magnetic equator (aclinic line) but vertical at the magnetic poles, used to indicate the direction of the earth's magnetism."]}], "ಕಾಂತಾಮಣಿ": [{"type": "noun", "defs": ["a virtuous woman.", "(mus.) the sixty first of the seventy two modes, in Karnāṭaka system."]}], "ಕಾಂತಾರ": [{"type": "noun", "defs": ["a large area covered chiefly with trees and undergrowth; a forest.", "a road that is difficult to traverse.", "a small excavation, pit; a hole; a cavity.", "a variety in sugarcane; red sugar cane.", "the tree mountain ebony.", "the grass Bambusa arundinacae of Poaceae family; spiny bamboo.", "any of the lotus plant and its flower.", "any circumstance, event or condition that accompanies something and indicates its existence or occurrence; sign; indication; a symptom.", "a difficult, harsh or unpleasant word."]}], "ಕಾಂತಾರಕ": [{"type": "noun", "defs": ["= ಕಾಂತಾರ - 4."]}], "ಕಾಂತಾರಚರ್ಯೆ": [{"type": "noun", "defs": ["the wandering by Jaina mendicants in forest for alms."]}], "ಕಾಂತಾಭಿಕ್ಷೆ": [{"type": "noun", "defs": ["= ಕಾಂತಾರಚರ್ಯೆ."]}], "ಕಾಂತಾಸಮ್ಮಿತ": [{"type": "noun", "defs": ["(rhet.) the lucid, vivid and very attractive style of a literary work."]}], "ಕಾಂತಿ": [{"type": "noun", "defs": ["the fact of being brilliant; great brightness, radiance, intensity, splendor; brilliance.", "a wish; a desire.", "the quality of being attractive or fascinating; beauty.", "personal decoration; embellishment; ornamentation.", "one of the sixteen apparent digits of the moon.", "a lovely or desirable woman.", "(rhet.) the beauty enhanced by love or its treatment, a style that is regarded as merit in poetics."]}], "ಕಾಂತಿಗುಂದು": [{"type": "verb", "defs": ["to lose lustre, brilliance, colour, etc.; to become dull; to be faded."]}], "ಕಾಂತಿಗೂಡು": [{"type": "verb", "defs": ["to gain brilliance, lustre; to become splindid; to look colourful, attractive."]}], "ಕಾಂತಿಗೆಡು": [{"type": "verb", "defs": ["= ಕಾಂತಿಗುಂದು."]}], "ಕಾಂತಿತ್ವ": [{"type": "noun", "defs": ["the fact of being brilliant; great brightness, radiance, intensity, splendor, etc; brilliance.", "the pleasant poietical style."]}], "ಕಾಂತಿದೋಱು": [{"type": "verb", "defs": ["to look bright, brilliant.", "(brightness, brilliance) to be seen (on one's face, etc.)."]}], "ಕಾಂತಿಪರ": [{"type": "noun", "defs": ["the small fragrant plant Artemisia pallens of Asteraceae family."]}], "ಕಾಂತಿಭಾಸ": [{"type": "noun", "defs": ["a sensation of light produced by mechanical or electrical stimulation of the retina, as by pressure on the eyeball through the closed eyelid; phosphene."]}], "ಕಾಂತಿಮಂತ": [{"type": "noun", "defs": ["= ಕಾಂತಿವಂತ.", "2) the moon."]}], "ಕಾಂತಿಮುದ್ರಣ": [{"type": "noun", "defs": ["a process of printing from a plate, etc. prepared by methods combining photography and lithography; photolithography."]}], "ಕಾಂತಿಯಿಡು": [{"type": "verb", "defs": ["to cause to shine; to make a thing brighter."]}], "ಕಾಂತಿವಂತ": [{"type": "noun", "defs": ["a very splendid man; a man having or showing keen intelligence, great talent or skill."]}], "ಕಾಂತಿವರ್ಧಕ": [{"type": "adjective", "defs": ["that improves the appearance; beautifying; cosmetic."]}, {"type": "noun", "defs": ["any cosmetic preparation for the skin, hair, etc., as rouge and powder; a blusher; a cosmetic."]}], "ಕಾಂತಿವಿಡಿ": [{"type": "verb", "defs": ["to become brilliant, splendid or more brilliant or splendid; to look active, energitic."]}], "ಕಾಂತಿಸ್ತಂಭ": [{"type": "noun", "defs": ["a post supporting a lamp; a lamp-post."]}], "ಕಾಂತಿಹೀನ": [{"type": "adjective", "defs": ["lacking (one's original) brightness, lustre; dull; dim."]}, {"type": "noun", "defs": ["a man who is or looking dull."]}], "ಕಾಂತಿಹೀನತೆ": [{"type": "noun", "defs": ["the quality of or fact of being dull, dim, colourless; dullness."]}], "ಕಾಂತಿಹೀನೆ": [{"type": "noun", "defs": ["a woman who is or looking dull."]}], "ಕಾಂತೆ": [{"type": "noun", "defs": ["a beloved or lovely woman.", "a woman in relation to a man to whom she is married; a wife.", "(in gen.) a woman.", "a creeper.", "the plant Amomum subulatum of Zingiberaceae family.", "its seed capsule or seed; large cardamom.", "the earth."]}], "ಕಾಂತ್ಯಾಕರ": [{"type": "noun", "defs": ["a source from which light, brightness or lustre comes forth.", "a beautiful thing.", "the moon."]}], "ಕಾಂತ್ಯಾಸ್ಪದ": [{"type": "noun", "defs": ["he from whom rays of light emanate.", "a handsome man."]}], "ಕಾಂದಲ್": [{"type": "noun", "defs": ["the tree Avicennia officinalis (= A. tomentosa) of Verbenaceae family; white mangrove.", "the tree Rhizophora mucronata of Rhizophoraceae family; demon candle."]}], "ಕಾಂದವ": [{"type": "noun", "defs": ["anything baked or roasted in an iron pan or oven."]}], "ಕಾಂದವಿಕ": [{"type": "noun", "defs": ["a man who bakes (something) in an iron pan or oven; a baker.", "a person whose work or business is making or selling confectionery; a confectioner."]}], "ಕಾಂದಾಭಜಿ": [{"type": "noun", "defs": ["a fried eatable of onion dipped in the paste of horsegram, salt, chillies, etc. and fried deep in oil."]}], "ಕಾಂದಿಶೀಕ": [{"type": "noun", "defs": ["a man put to fright; he who is terrified, bewildered or afraid."]}], "ಕಾಂದಿಸೀಕ": [{"type": "noun", "defs": ["= ಕಾಂದಿಶೀಕ."]}], "ಕಾಂದಸೀಕತೆ": [{"type": "noun", "defs": ["the state of being bewildered; bewilderment."]}], "ಕಾಂದೇನವಮಿ": [{"type": "noun", "defs": ["(dial.) the ninth day of the fourth Hindu calendar month."]}], "ಕಾಂಪಿಲ್ಯ": [{"type": "noun", "defs": ["the plant Croton polyandrum of Euphorbiaceae family."]}], "ಕಾಂಪಿಲ್ಲ": [{"type": "noun", "defs": ["= ಕಾಂಪಿಲ್ಯ."]}], "ಕಾಂಪು": [{"type": "noun", "defs": ["the act or duty of guarding; careful watch; wariness; defense; protection; a guarding."]}], "ಕಾಂಪೊಂಡು": [{"type": "noun", "defs": ["= ಕಾಂಪೌಂಡು."]}], "ಕಾಂಪೋಸ್ಟ್": [{"type": "noun", "defs": ["a compost - a) a mixture; a compound; b) a mixture of decomposing vegetable refuse, manure, etc. for fertilising and conditioning soil."]}], "ಕಾಂಪೋಸ್ಟ್‍ಗೊಬ್ಬರ": [{"type": "noun", "defs": ["= ಕಾಂಪೋಸ್ಟ್ - 2."]}], "ಕಾಂಪೌಂಡು": [{"type": "noun", "defs": ["an enclosed space with a building or group of buildings within it; a compound.", "a wall, usu. short in height, that encloses a building or group of buildings."]}], "ಕಾಂಪೌಂಡರು": [{"type": "noun", "defs": ["a person, in a hospital, who makes a compound of ingredients, e.g. drugs or issues drugs to patients as per the physiciaṇs instructions; a compounder."]}], "ಕಾಂಬಲ": [{"type": "adjective", "defs": ["covered with awoollen cloth or blanket."]}, {"type": "noun", "defs": ["a carriage covered with a woollen cloth or blanket."]}], "ಕಾಂಬವಿಕ": [{"type": "noun", "defs": ["a dealer in shells; a vendor of shell ornaments."]}], "ಕಾಂಬಳ": [{"type": "adjective", "defs": ["= ಕಾಂಬಲ1."]}, {"type": "noun", "defs": ["= ಕಾಂಬಲ2."]}], "ಕಾಂಬೊಲ": [{"type": "noun", "defs": ["the range, extent or horizontal distance that a person can see without any external aid (as binocular, telescope etc.)."]}], "ಕಾಂಬೋಜ": [{"type": "adjective", "defs": ["of, belonging to or born in Afghanistan; of the people or their language, culture of that country; Afghan."]}, {"type": "noun", "defs": ["a country in south central Asia, between Iran and Pakistan, having Kabul as its capital."]}], "ಕಾಂಬೋಜಿ": [{"type": "noun", "defs": ["= ಕಾಂಬೋದಿ.", "a horse bred in Afghanistan.", "the tree Acacia leucophloea (= Mimosa leucophloea) of Mimosae family; white babool."]}], "ಕಾಂಬೋದಿ": [{"type": "noun", "defs": ["(mus.) a mode, having six notes in ascending orders and seven in descending, derived from the main mode Harikāmbōdi, in Karnāṭaka system."]}], "ಕಾಂಬೋಧಿ": [{"type": "noun", "defs": ["= ಕಾಂಬೋದಿ."]}], "ಕಾಂಭೋಜ": [{"type": "noun", "defs": ["= ಕಾಂಬೋಜ2.", "a person belonging to the country Kāmbōja."]}], "ಕಾಂಭೋಜಕ": [{"type": "noun", "defs": ["= ಕಾಂಬೋಜಿ - 1 & 2."]}], "ಕಾಂಭೋಜಿ": [{"type": "noun", "defs": ["= ಕಾಂಬೋದಿ."]}], "ಕಾಂಸ": [{"type": "noun", "defs": ["= ಕಾಂಸ್ಯ."]}], "ಕಾಂಸಕ": [{"type": "noun", "defs": ["= ಕಾಂಸ್ಯ."]}], "ಕಾಂಸಾಳ": [{"type": "noun", "defs": ["a pair of large bronze cymbals."]}], "ಕಾಂಸುಳಿ": [{"type": "noun", "defs": ["the plant Sida indica."]}], "ಕಾಂಸ್ಯ": [{"type": "noun", "defs": ["an alloy of copper with up to one-third tin; bronze.", "any kitchen vessel made of bronze."]}], "ಕಾಂಸ್ಯತಾಲ": [{"type": "noun", "defs": ["a pair of small circular, slightly concave bronze plates used as a percussion instrument producing a metallic sound; a pair of bronze cymbals."]}], "ಕಾಂಸ್ಯತಾಳ": [{"type": "noun", "defs": ["= ಕಾಂಸ್ಯತಾಲ."]}], "ಕಾಂಸ್ಯತೋರಣ": [{"type": "noun", "defs": ["a chain of leaves carved or moulded in bronze hung across the top frame of the door (of a temple, room meant for meditation) as a decoration; a bronze festoon."]}], "ಕಾಂಸ್ಯಯುಗ": [{"type": "noun", "defs": ["a phase of some human cultures (between 3500-1000 B.C.), usu. after a Stone Age and before an Iron Age, characterised by bronze tools and weapons; Bronze Age."]}], "ಕಾಕ": [{"type": "noun", "defs": ["the younger brother of one's father; paternal uncle."]}, {"type": "noun", "defs": ["a moderately large blace bird of the genus Corvus.", "(fig.) a despicable man; a contemptible fellow.", "(in Rāmāyaṇa) a demon slain by Rāma.", "the tree Ziziphus glabrata (= Z. trinerva) of Rhamnaceae family.", "a lame man; a man with a defective leg.", "a sectarial mark on the forehead."]}, {"type": "noun", "defs": ["a number of Māpiḷḷai community of Malabar area."]}], "ಕಾಕಂಗೆಡು": [{"type": "verb", "defs": ["to be warded off; to be parried away."]}], "ಕಾಕಂಚಿ": [{"type": "noun", "defs": ["the plant Atalantia monophylla (=Limonia monophylla) of Rutaceae family.", "its fruit."]}], "ಕಾಕಂಬಿ": [{"type": "noun", "defs": ["the drainings of jaggery or crude sugar; treacle; molasses."]}], "ಕಾಕಂಬಿಸೀರೆ": [{"type": "noun", "defs": ["a long, unsewn cloth, in gen. of a woman, of the colour of molasses (light brown)."]}], "ಕಾಕಕಂಠ": [{"type": "noun", "defs": ["a harsh, strident tone (as of a crow or raven)."]}], "ಕಾಕಚಿಂಚಿ": [{"type": "noun", "defs": ["the plant, Abrus precatorius of Papilionaceae family; wild liquorice.", "its seed."]}], "ಕಾಕಚೋರ": [{"type": "noun", "defs": ["the Plant Chrysopogan aciculatus (= Andropogon aciculatus) of Poaceae family."]}], "ಕಾಕಜಂಘೆ": [{"type": "noun", "defs": ["= ಕಾಕಚಿಂಚಿ."]}], "ಕಾಕಜಾತ": [{"type": "noun", "defs": ["that which has been hatched by a crow; a cuckoo."]}], "ಕಾಕಜ್ವರ": [{"type": "noun", "defs": ["a burning fever occuring every third day, marked by blackening of the body."]}], "ಕಾಕಡ": [{"type": "noun", "defs": ["the plant Flacourtia montana (= F. cataphracta) of Flacourtiaceae family.", "the flowering creeper, Jasminum pubescens of Oleaeceae family.", "its flower."]}, {"type": "noun", "defs": ["a coarse wick made of cloth."]}], "ಕಾಕಡಸಿಂಗಿ": [{"type": "noun", "defs": ["the plant Pistacia khinjauk (= P. integerrima) of Anacardiaceae family."]}], "ಕಾಕಡೆ": [{"type": "noun", "defs": ["= ಕಾಕಡ1 - 1."]}], "ಕಾಕತನ": [{"type": "noun", "defs": ["the quality of being mean, vicious, wicked; wickedness."]}], "ಕಾಕತಾಲನ್ಯಾಯ": [{"type": "noun", "defs": ["= ಕಾಕತಾಲೀಯನ್ಯಾಯ."]}], "ಕಾಕತಾಲೀಯ": [{"type": "adjective", "defs": ["happening simultaneously without having causal connection."]}, {"type": "noun", "defs": ["the occurrence of events simultaneously without any causal connection between them; coincidence."]}], "ಕಾಕತಾಲೀಯತೆ": [{"type": "noun", "defs": ["= ಕಾಕತಾಳೀಯತೆ."]}], "ಕಾಕತಾಲೀಯನ್ಯಾಯ": [{"type": "noun", "defs": ["a maxim of a palm fruit falling, without any causal connection, on the head of a crow, to explain the unexpected coincidental occurences; post hoc; ergo proper hoc."]}, {"type": "noun", "defs": ["= ಕಾಕತಾಲೀಯನ್ಯಾಯ."]}], "ಕಾಕತಾಳನ್ಯಾಯ": [{"type": "noun", "defs": ["= ಕಾಕತಾಲೀಯನ್ಯಾಯ."]}], "ಕಾಕತಾಳೀಯ": [{"type": "adjective", "defs": ["= ಕಾಕತಾಲೀಯ1."]}, {"type": "noun", "defs": ["= ಕಾಕತಾಲೀಯ2."]}], "ಕಾಕತಾಳೀಯತೆ": [{"type": "noun", "defs": ["the fact or an instance of two independent events happening simultaneously without any causal connection between them."]}], "ಕಾಕತಿಂದುಕ": [{"type": "noun", "defs": ["the tree Diospyras kanjilali of Ebenaceae family.", "the tree Diospyros melanoxylon of Ebenaceae family; crow ebony."]}], "ಕಾಕತುಂಡ": [{"type": "noun", "defs": ["a variety in sandal tree, black kind ofloe.", "the wood of that tree.", "a kind of black ebony."]}], "ಕಾಕತುಂಡಿ": [{"type": "noun", "defs": ["the plant Asclepias curassavica of Asclepiadaceae family.", "the shrubby plant Leea hirta.", "the plant Xanthochymus pictorius."]}], "ಕಾಕತುಂಡಿಕೆ": [{"type": "noun", "defs": ["= ಕಾಕಚಿಂಚಿ.", "the tree Pongamia glabra of Papilionaceae family.", "the plant Xanthochymus pictorius."]}], "ಕಾಕತುಂಬುರು": [{"type": "noun", "defs": ["the tree Diospyras kanjilali of Ebenaceae family; black ebony."]}], "ಕಾಕದಂತ": [{"type": "noun", "defs": ["(fig.) an improbable or nonexistent thing (as finding of a crow's teeth)."]}], "ಕಾಕದೃಷ್ಟಿ": [{"type": "noun", "defs": ["crows act of look; crow's view.", "the manner in which a crow views at an object (the supposition being that the crow has but one eye).", "(fig.) an evil look, which causes ill-luck to the object or to its possessor so seen.", "an evil view having a wicked intention."]}], "ಕಾಕದೊಂಡೆ": [{"type": "noun", "defs": ["the tree Pongamia glabra of Papilionaceae family.", "the plant Xanthochymus pictorius."]}], "ಕಾಕಧ್ವಜ": [{"type": "noun", "defs": ["the banner which has the symbol of a crow.", "Karṇa, one of the main character in Mahābhārata, whose banner had the symbol of a crow."]}], "ಕಾಕನಾಸಿಕೆ": [{"type": "noun", "defs": ["= ಕಾಕತುಂಡಿಕೆ - 3."]}], "ಕಾಕನಿಶೆ": [{"type": "noun", "defs": ["the night that is absolutely dark."]}], "ಕಾಕಪಕ್ಷ": [{"type": "noun", "defs": ["a crow's wing.", "side locks of hair on the temples of boys.", "a lock of hair left unshaven on the crown of the head."]}], "ಕಾಕಪತಾಕ": [{"type": "noun", "defs": ["= ಕಾಕಧ್ವಜ."]}], "ಕಾಕಪದ": [{"type": "noun", "defs": ["= ಕಾಕಪಾದ - 1 & 2.", "a particular mode or position in sexual intercourse."]}], "ಕಾಕಪರ್ಣಿ": [{"type": "noun", "defs": ["the plant Phaseolus trilobus of Papilionaceae family.", "its pea."]}], "ಕಾಕಪಾದ": [{"type": "noun", "defs": ["a crow's foot.", "the sign ' ^ ' used in writing to denote something left out but to be inserted.", "a particular kind of defect in gems.", "one of the six types of rythmic cycle in Karnāṭaka music system."]}], "ಕಾಕಪಿಂಡ": [{"type": "noun", "defs": ["a lump of rice offered to crows at the obsequial ceremonies for the manes."]}], "ಕಾಕಪಿಟ್ಲ": [{"type": "noun", "defs": ["the plant, Solanum nigrum of Solanaceae family."]}], "ಕಾಕಪೀಲುಕ": [{"type": "noun", "defs": ["the tree Diospyros kanjilali of Ebenaceae family.", "the tree Diospyros tomentosa of Ebenaceae family."]}], "ಕಾಕಪುಷ್ಟ": [{"type": "adjective", "defs": ["not nourished with adequate nutrition or nourished with faulty nutrition."]}, {"type": "noun", "defs": ["that which has been hatched, nourished and nurtured by a crow; a cuckoo."]}], "ಕಾಕಪುಷ್ಟಿ": [{"type": "noun", "defs": ["inadequate, imperfect or faulty nutrition; malnutrition."]}], "ಕಾಕಪೇಯ": [{"type": "noun", "defs": ["a small quantity of drinking water, just enough to satisfy a crow's thirst."]}], "ಕಾಕಪೋಕ": [{"type": "noun", "defs": ["an impudent, lewd man; a wretched fellow."]}], "ಕಾಕಪೌರುಷ": [{"type": "noun", "defs": ["pretended valour of a coward.", "a coward pretending to be brave."]}], "ಕಾಕಪ್ಪಿ": [{"type": "noun", "defs": ["a worthless object."]}], "ಕಾಕಬಂಜೆ": [{"type": "noun", "defs": ["a woman who has borne but one child."]}], "ಕಾಕಬಲಿ": [{"type": "noun", "defs": ["an offering of food to crows."]}], "ಕಾಕಬುದ್ಧಿ": [{"type": "noun", "defs": ["distressingly bad or despicable quality of the mind; a wretched notion."]}], "ಕಾಕಬ್ಬು": [{"type": "noun", "defs": ["the grass Saccharum spontaneum of Poaceae family; thatch grass, used for mats, roofs, etc."]}], "ಕಾಕಭಾಜನ": [{"type": "noun", "defs": ["that portion of food meant for crows.", "that type of food fit to be eaten only by crows.", "anything offered to an undeserved person."]}], "ಕಾಕಭೋಜನ": [{"type": "noun", "defs": ["a crow's food.", "food offered to an undeserved person."]}], "ಕಾಕಮಂಚಿ": [{"type": "noun", "defs": ["the plant Solanum nigrum of Solanaceae family.", "its fruit; black night shade.", "the plant Solanum trilobatum of the same family."]}], "ಕಾಕಮರ": [{"type": "noun", "defs": ["the tree Ziziphus glabrata (= Z. trinerva) of Rhamnaceae family; jagged jujube tree."]}], "ಕಾಕಮಾಚಿ": [{"type": "noun", "defs": ["- ಕಾಕಮಂಚಿ - 1 & 2."]}], "ಕಾಕಮಾಚೀಘೃತ": [{"type": "noun", "defs": ["the juice from the leaves of the plant Solanum nigrum, distilled and used in medicines."]}], "ಕಾಕಮಾರಿ": [{"type": "noun", "defs": ["the plant Anamirta paniculata (= A. cocculus, = Cocculus indicus) of Menispermaceae family.", "the plant Cocculus suberosus of Menispermaceae family."]}], "ಕಾಕಮುಂಚಿ": [{"type": "noun", "defs": ["= ಕಾಕಮಂಚಿ."]}], "ಕಾಕಮುಖ": [{"type": "adjective", "defs": ["(said of the face of a person) like a crow's face."]}, {"type": "noun", "defs": ["a crow's face.", "a dark species of Agallochum, black sandalwood."]}], "ಕಾಕಮುದ್ಗೆ": [{"type": "noun", "defs": ["the plant Phaseolus trilobus of Papilionaceae family.", "its pea."]}], "ಕಾಕರಗಲ್ಲು": [{"type": "noun", "defs": ["a stone piece having sharp edges."]}], "ಕಾಕರತ್ನ": [{"type": "noun", "defs": ["a gem of inferior quality, supposed to bring misfortune to its possessor."]}], "ಕಾಕರಲತೆ": [{"type": "noun", "defs": ["the creeper Cardiospermum halicacabum of Sapindaceae family."]}], "ಕಾಕರಲಿಪಿ": [{"type": "noun", "defs": ["- ಕಾಕಲಿಪಿ - 1."]}], "ಕಾಕರವ": [{"type": "noun", "defs": ["the cawing sound of a crow."]}], "ಕಾಕರಿಪು": [{"type": "noun", "defs": ["the enemy of a crow; an owl.", "Rāma, the enemy of the demon Kāka."]}]}