{"ಉಪ್ಪ": [{"type": "noun", "defs": ["(a nursery term) a kiss."]}], "ಉಪ್ಪ್ಪಂಗ": [{"type": "noun", "defs": ["a kind of musical instrument."]}], "ಉಪ್ಪಂಡ": [{"type": "noun", "defs": ["disdainful pride; haughtiness; imperiousness; overbearing manner."]}], "ಉಪ್ಪಗಚಿ": [{"type": "noun", "defs": ["the plant Azima tetracantha of Salvadoraceae family.", "its berry; thorny berry."]}], "ಉಪ್ಪಗರಿ": [{"type": "noun", "defs": ["an eatable made of parched and beaten rice, coconut gratings, salt, pepper, etc. and eaten while taking liquor."]}], "ಉಪ್ಪಚ್ಚಿ": [{"type": "noun", "defs": ["= ಉಪ್ಪಗಚಿ."]}], "ಉಪ್ಪಟ": [{"type": "noun", "defs": ["a good dress; a beautiful garment."]}], "ಉಪ್ಪಟ್ಟ": [{"type": "noun", "defs": ["= ಉಪ್ಪಟ."]}], "ಉಪ್ಪಟ್ಟವರ್ಷೆ": [{"type": "noun", "defs": ["she who donates good garments generously."]}], "ಉಪ್ಪಡ": [{"type": "noun", "defs": ["= ಉಪ್ಪಟ."]}, {"type": "noun", "defs": ["salted and dried vegetable."]}, {"type": "noun", "defs": ["= ಉಪ್ಪವಡ."]}], "ಉಪ್ಪಡಪದ": [{"type": "noun", "defs": ["= ಉಪ್ಪವಡ -2."]}], "ಉಪ್ಪಯಣ": [{"type": "noun", "defs": ["a brief or temporary stay at a place in the course of a journey; a sojourn; a stop-over."]}], "ಉಪ್ಪಯಣಂಗೆಯ್": [{"type": "verb", "defs": ["to stay for a while at a place in the course of a journey; to sojourn."]}], "ಉಪ್ಪರ": [{"type": "adjective", "defs": ["very high; tall; lofty."]}, {"type": "noun", "defs": ["that which is tall.", "the quality of being tall; loftiness; height.", "the quality that makes anything excel another; greatness.", "ಉಪ್ಪರದ ಸಾಧನೆ upparada sādhane a jumping in the air and touching one's buttocks with the heals of the legs folded back; ಉಪ್ಪರಮಾಡು uppara māḍu to raise; to increase the height; ಉಪ್ಪರಂಗಟ್ಟು upparaŋgaṭṭu to build high (as a wall, fame etc.); 2. to raise one's stature; ಉಪ್ಪರಂನೆಗೆ upparam nege to jump high."]}], "ಉಪ್ಪರಗುಡಿ": [{"type": "noun", "defs": ["a banner raised to a considerable height."]}], "ಉಪ್ಪರಗೋಂಟೆ": [{"type": "noun", "defs": ["a fort of more than normal height."]}], "ಉಪ್ಪರಜವ್ವನೆ": [{"type": "noun", "defs": ["a woman in the spring time of her youth."]}], "ಉಪ್ಪರಟಿ": [{"type": "noun", "defs": ["an order, system or manner that is opposed to the regular one; the state or quality of being perverse."]}], "ಉಪ್ಪರಣೆ": [{"type": "noun", "defs": ["a loose long cloth to cover the upper portion of the body or worn loosely above the upper garment."]}], "ಉಪ್ಪರದಂಡೆ": [{"type": "noun", "defs": ["a particular posture or attitude in dancing."]}], "ಉಪ್ಪರಮನೆ": [{"type": "noun", "defs": ["a house having more than one storey."]}], "ಉಪ್ಪರಮುಡಿ": [{"type": "noun", "defs": ["a knot of the hair, tied on the head."]}], "ಉಪ್ಪರವಟ್ಟ": [{"type": "noun", "defs": ["a higher level (in place or quality); a superior class.", "ಉಪ್ಪರವಟ್ಟದಕ್ಕರ upparavaṭṭadakkara higher knowledge; knowledge of better things."]}, {"type": "noun", "defs": ["cloth (coloured one, bunting etc.) used to decorate the upper portion of a frame (pandal) made for auspicious purposes."]}], "ಉಪ್ಪರವೊಯ್ಲು": [{"type": "noun", "defs": ["a blow or stroke from above."]}], "ಉಪ್ಪರಸಂಚ": [{"type": "noun", "defs": ["a style or mode in sword-fighting (swinging the swords above certain height)."]}], "ಉಪ್ಪರಸಾಲೆ": [{"type": "noun", "defs": ["a house having more than one storey."]}], "ಉಪ್ಪರಾಂತಿ": [{"type": "noun", "defs": ["= ಉಪ್ಪಲಿಗೆ."]}], "ಉಪ್ಪರಿಕೆ": [{"type": "noun", "defs": ["= ಉಪ್ಪರಿಗೆ."]}], "ಉಪ್ಪರಿಗೆ": [{"type": "noun", "defs": ["a section or horizontal division of a building, above the ground floor, extending from the floor to the ceiling or roof lying directly above it; an upper storey.", "ಉಪ್ಪರಿಗೆ ವಠಾರ upparige vaṭhāra a multi-storeyed building with several parts used as separate residences; an apartment."]}], "ಉಪ್ಪರಿಸು": [{"type": "verb", "defs": ["to spring into the air; to jump up; to move freely in the air to reach a lower place; to jump down.", "to spread (oneself) or be defused throughout; to pervade.", "to be filled with excessive joy; (the spirits) to be raised.", "to cause to rise; to move to a higher level; to raise.", "to open the top portion of something or the lid of a tin."]}], "ಉಪ್ಪಲ": [{"type": "noun", "defs": ["salt earth; saline soil."]}, {"type": "noun", "defs": ["= ಉಪ್ಪಳ."]}], "ಉಪ್ಪಲಿಕ": [{"type": "noun", "defs": ["= ಉಪ್ಪಲಿಗ."]}], "ಉಪ್ಪಲಿಗ": [{"type": "noun", "defs": ["a caste the members of which are usually engaged in manufacture of salt.", "a male member of that caste; a salt-maker.", "a man engaged, by profession, in masonry; a mason."]}], "ಉಪ್ಪಲಿಗೆ": [{"type": "noun", "defs": ["the plant Macaranga indica of Euphorbiaceae; Indian lotus croton.", "the plant Macaranga peltata ( = M. roxburghii) of the same family; Roxburgh lotus croton."]}], "ಉಪ್ಪಲೀಕ": [{"type": "noun", "defs": ["= ಉಪ್ಪಲಿಗ."]}], "ಉಪ್ಪವಡ": [{"type": "noun", "defs": ["a getting up from the (usu. night) sleep in the morning.", "a song to be sung or meant to be sung, in the morning (usu. supplicating a god to rise from the sleep)."]}], "ಉಪ್ಪವಡಂದಳೆ": [{"type": "verb", "defs": ["= ಉಪ್ಪವಡಿಸು."]}], "ಉಪ್ಪವಡಂಬಡೆ": [{"type": "verb", "defs": ["= ಉಪ್ಪವಡಿಸು."]}], "ಉಪ್ಪವಡಗೀತ": [{"type": "noun", "defs": ["= ಉಪ್ಪವಡ - 2."]}], "ಉಪ್ಪವಡವಾಡು": [{"type": "verb", "defs": ["to sing ಉಪ್ಪವಡಗೀತ."]}], "ಉಪ್ಪವಡಿಸು": [{"type": "verb", "defs": ["to rise, get up or get out of the bed; to come out of sleep; to awake."]}], "ಉಪ್ಪವರೆ": [{"type": "noun", "defs": ["the plant Glycine javanica of Papilionaceae family, a fast growing hairy perennial vine.", "its bean; Rhodesian kudzu."]}], "ಉಪ್ಪಳ": [{"type": "noun", "defs": ["the water plant Nymphaea nouchali ( = N. pubescens) of Nymphaeaceae family.", "its flower; white lotus."]}], "ಉಪ್ಪಳಗಂಪು": [{"type": "noun", "defs": ["the smell of white lotus (Nymphaea nouchali) flower."]}], "ಉಪ್ಪಳಗಣ್": [{"type": "noun", "defs": ["a beautiful eye (that can be likened to the beauty of fully blown white lotus (Nymphaea nouchali) flower."]}], "ಉಪ್ಪಳಿಗೆ": [{"type": "noun", "defs": ["= ಉಪ್ಪಲಿಗೆ."]}], "ಉಪ್ಪಳಿಸು": [{"type": "verb", "defs": ["= ಉಪ್ಪರಿಸು."]}], "ಉಪ್ಪಾಟ": [{"type": "noun", "defs": ["a kind of game."]}], "ಉಪ್ಪಾತಿ": [{"type": "noun", "defs": ["the tree Avicennia officinalis ( = A. tomentosa) of Verbenaceae family; common white mangrove."]}], "ಉಪ್ಪಾರ": [{"type": "noun", "defs": ["a caste the members of which are usually engaged in manufacture of salt.", "a male member of that caste; a salt maker.", "a man engaged, by profession, in masonry; a mason."]}, {"type": "noun", "defs": ["an offering of food to an idol of a deity."]}], "ಉಪ್ಪಾರತಿ": [{"type": "noun", "defs": ["a female member of the salt-maker caste ಉಪ್ಪಾರ."]}, {"type": "noun", "defs": ["a waiving of the arm, holding a fistful of salt (which is burnt later) in front of a person, to ward of evil effects."]}], "ಉಪ್ಪಾರತುಪ್ಪದೀವಿಗೆ": [{"type": "noun", "defs": ["the lamp, using ghee (clarified butter) as fuel, lighted in front of a deity."]}], "ಉಪ್ಪಾರದೀಪಮಾಲೆ": [{"type": "noun", "defs": ["a series of ಉಪ್ಪಾರತುಪ್ಪದೀವಿಗೆ."]}], "ಉಪ್ಪಾರದೀವಿಗೆ": [{"type": "noun", "defs": ["= ಉಪ್ಪಾರತುಪ್ಪದೀವಿಗೆ."]}], "ಉಪ್ಪಾರಮೋಳೆ": [{"type": "noun", "defs": ["a heap of raw, unrefined salt.", "a tax levied on the unrefined salt."]}], "ಉಪ್ಪಾರಿಕೆ": [{"type": "noun", "defs": ["the work or profession of making salt.", "the work, profession or trade of building with stone, brick, cement, etc.; masonry."]}], "ಉಪ್ಪಾರಿತ": [{"type": "noun", "defs": ["a medicinal plant."]}], "ಉಪ್ಪಾಲ": [{"type": "noun", "defs": ["the tree Mallotus albus var. occidentalis of Euphorbiaceae family:."]}], "ಉಪ್ಪಾಱ": [{"type": "noun", "defs": ["= ಉಪ್ಪಾರ1."]}], "ಉಪ್ಪಿ": [{"type": "noun", "defs": ["the plant Azima tetracantha of Salvadoraceae family.", "its berry; thorn berry."]}], "ಉಪ್ಪಿಕ್ಕು": [{"type": "verb", "defs": ["= ಉಪ್ಪಿಡು."]}], "ಉಪ್ಪಿಗ": [{"type": "noun", "defs": ["= ಉಪ್ಪಾರ1."]}], "ಉಪ್ಪಿಟ್ಟು": [{"type": "noun", "defs": ["a savoury dish made using coarse flour of rice or wheat."]}], "ಉಪ್ಪಿಡು": [{"type": "verb", "defs": ["to put a spoonful of salt on the dining platter.", "to help another earn his livelihood.", "ಉಪ್ಪಿಟ್ಟವರನ್ನು ಮುಪ್ಪಿನ ತನಕ ನೆನೆ uppiṭṭavarannu muppinatanaka nene (prov.) be ever grateful to those who helped you."]}], "ಉಪ್ಪಿನಕಾಯ್": [{"type": "noun", "defs": ["= ಉಪ್ಪಿನಕಾಯಿ."]}], "ಉಪ್ಪಿನಕಾಯಿ": [{"type": "noun", "defs": ["a vegetable, fruit or a combination of both, preserved in vinegar or spicy solution, and served to add taste or as an appetising relish; a pickle.", "ಊಟಕ್ಕೆ ಇಲ್ಲದ ಉಪ್ಪಿನಕಾಯಿ ಯಾತಕ್ಕೂ ಬೇಡ ūṭakke illada uppinakāyi yātakkū bēḍa (prov.) a thing, however valuable it is, becomes useless if not got when it is required; advice after injury is like medicine after death; ಮಾತಿಗೆ ಮೊದಲು ಗಾದೆ, ಊಟಕ್ಕೆ ಮೊದಲು ಉಪ್ಪಿನಕಾಯಿ mātige modla gāde, ūṭakke modalu uppinakāyi (prov.) (said of a person who tends to quote a proverb frequently) to use proverbs frequently or always."]}], "ಉಪ್ಪಿನಾಗರ": [{"type": "noun", "defs": ["a place where salt is made or stored."]}], "ಉಪ್ಪಿಲಕ": [{"type": "noun", "defs": ["= ಉಪ್ಪಾರ1."]}], "ಉಪ್ಪಿಲಿಕದೆಱೆ": [{"type": "noun", "defs": ["a tax levied on salt making industry."]}], "ಉಪ್ಪಿಲಿಬಳ್ಳಿ": [{"type": "noun", "defs": ["the creeper Pentatropis microphylla of Asclepiadaceae family."]}], "ಉಪ್ಪು": [{"type": "noun", "defs": ["sodium chloride, NaCl, a white, crystalline substance with a characteristic taste, found in natural beds, in sea water, etc., and used for seasoning and preserving foods, etc.; (common) salt.", "the taste of common salt.", "a favour or service; an obligation.", "ಉಪ್ಪಿನ ಗೊಬ್ಬರ uppina gobbara a chemical fertiliser put on or in the soil to improve the quality or quantity of plant growth; ಉಪ್ಪಿನಮಾಳ uppina māḷa = ಉಪ್ಪಿನಮೋಳೆ; ಉಪ್ಪಿನಮಾಳೆ uppina māḷe = ಉಪ್ಪಿನಮೋಳೆ; ಉಪ್ಪಿನಮೇಳೆ uppina mēḷe = ಉಪ್ಪಿನಮೋಳೆ; ಉಪ್ಪಿನಮೊಳೆ uppina moḷe = ಉಪ್ಪಿನಮೋಳೆ; ಉಪ್ಪಿನಮೋಳೆ uppina mōḷe the heap of raw, unrefined salt; 2.a tax levied on the unrefined salt; ಉಪ್ಪಿನ ಋಣ uppina řṇa the condition or fact of being indebted to another for a help (esp. in getting one's livelihood) received; ಉಪ್ಪಿನ ಗಿಡ uppina giḍa a short weed with edible leaves, Oxalis corniculata ( = O. pusilla, = Xanthoxalis corniculata) of Oxalidaceae family; Indian sorrel; ಉಪ್ಪು ಸೊಪ್ಪಾಗು uppu soppāgu to change the basic nature (of a person); ಉಪ್ಪು ಹಾಕು uppu hāku to add salt (to a food preparation); 2. not to show any concern, interest or fear; ಉಪ್ಪು ಹುಟ್ಟದಿರು uppu huṭṭadiru (one's credibility) to be lost; ಉಪ್ಪು ಹುಳಿ ತಿನ್ನುವ ದೇಹ uppu huḷi tinnuva dēha (fig.) (a statement generalising the mankind) one has feelings or faults that are natural because these are common for all human beings; 'a person of flesh and blood'; ಉಪ್ಪಿಲ್ಲ, ಹುಳಿಯಿಲ್ಲ uppilla, huḷiyilla not interesting or satisfying; dull; empty; jejune; ಉಪ್ಪು ಕಾರ (ಖಾರ) ಹಚ್ಚು uppu kāra (khāra) haccu (fig.) to report, convey in an exciting, provocating or exaggerated manner to give a curious or dimmer picture than the fact is; ಉಪ್ಪು ತಿಂದ ಮನೆಗೆ ಎರಡು ಬಗೆ uppu tinda manege eraḍu bage (prov.) to be ungrateful to one from whom timely help was received; ಉಪ್ಪು ತಿಂದವ ನೀರು ಕುಡಿದಾನು uppu tindava nīru kuḍidānu (prov.) one has to inevitably face the consequence of one's own deed; ಉಪ್ಪಿನವ ಕೆಟ್ಟೆ ಅಂದರೆ, ತೆಂಗಿನಕಾಯಿಯವ ಹೊರಳಿಹೊರಳಿ ಅತ್ತ uppinava keṭṭe andare, teŋgina kāyiyav horaḷi horaḷi atta (prov.) show hypocritical sympathy; ತಾಯಿಗಿಂತ ಬಂಧುವಿಲ್ಲ ಉಪ್ಪಿಗಿಂತ ರುಚಿಯಿಲ್ಲ utāyiginta bandhuvilla, uppiginta ruciyilla (prov.) one's mother is his or her best well-wisher; ಉರಿಯುವುದಕ್ಕೆ ಉಪ್ಪು ಹಾಕು/ಹಚ್ಚು uriyuvudakke uppu hāku/haccu (prov.) to behave rudely, annoyingly with someone who is already agonised or in great pain; to cause to increase another's pain, anger etc.; to add insult to injury; ಒಬ್ಬನ ಉಪ್ಪು ತಿಂದಿರು obbana uppu tindiru (fig.) to be indebted to another for the help received while in distress."]}, {"type": "noun", "defs": ["a place of one's normal stay; a residence.", "the state of being.", "(in games like kuṇṭu bille) a square marked with cross lines where the player has the protection against making mistakes or from being declared out.", "(in games) a defeat imposed on one's rival.", "a particular kind of game played by women."]}, {"type": "noun", "defs": ["(dial.) a treating (a child) very tenderly; foolish or excessive fondling; a pampering; a coddling."]}], "ಉಪ್ಪುಕಂಡ": [{"type": "noun", "defs": ["green chilly filled with salt and dried (used as a relish)."]}], "ಉಪ್ಪುಕಡಲು": [{"type": "noun", "defs": ["the sea or ocean, as a great body of salt water."]}], "ಉಪ್ಪುಕಡಲೆ": [{"type": "noun", "defs": ["chickpea (the edible seed of Cicer arietinum of Papilionaceae family) seasoned with salt, pepper, mustard, etc."]}], "ಉಪ್ಪುಕಡ್ಡಿ": [{"type": "noun", "defs": ["the grass Chloris barbata of Poaceae family."]}], "ಉಪ್ಪುಕಡ್ಡಿ ಆಟ": [{"type": "noun", "defs": ["(dial.) a kind of game played by childreṇ."]}], "ಉಪ್ಪುಕಾಗದ": [{"type": "noun", "defs": ["a piece of paper coated with a mixture of powdered emery and glue, used for polishing and cleaning metal, wood surface etc.; emery paper."]}], "ಉಪ್ಪುಕಾರ": [{"type": "noun", "defs": ["a mixture of salt and pepper powder used to add taste."]}], "ಉಪ್ಪುಕಾರಹಚ್ಚು": [{"type": "verb", "defs": ["to make a report or gossip more interesting, lively, sharply penetrating or biting by exaggerating the facts or alluding false statements."]}], "ಉಪ್ಪುಕೊರಚ": [{"type": "noun", "defs": ["a sub-sect among koraca whose main profession is making baskets and other bamboo-based products."]}], "ಉಪ್ಪುಗಡಲ್": [{"type": "noun", "defs": ["= ಉಪ್ಪುಕಡಲು."]}], "ಉಪ್ಪುಗಡಲೆ": [{"type": "noun", "defs": ["= ಉಪ್ಪುಕಡಲೆ."]}], "ಉಪ್ಪುಗಡ್ಡಿ": [{"type": "noun", "defs": ["the plant Chloris barbata of Poaceae family."]}], "ಉಪ್ಪುಗಾಯ್": [{"type": "noun", "defs": ["= ಉಪ್ಪುಗಾಯಿ."]}], "ಉಪ್ಪುಗಾಯಿ": [{"type": "noun", "defs": ["a fruit (as green mango, ripe lemon etc.) or a combination of them, preserved in vinegar or spicy solution, and served to add taste or as an appetising relish; a pickle."]}], "ಉಪ್ಪುಗಾವು": [{"type": "noun", "defs": ["treatment of bodily pain or injury by the application of heated salt, held in a cloth."]}], "ಉಪ್ಪುಗಾಳು": [{"type": "noun", "defs": ["any pulse or pea seasoned with salt, pepper, etc. used as a relish."]}], "ಉಪ್ಪುಗೂಚಿ": [{"type": "noun", "defs": ["the plant Azima tetracantha of Salvadoraceae family.", "its berry; thorn berry."]}], "ಉಪ್ಪುಣ್ಣು": [{"type": "verb", "defs": ["to be under another's obligation for the sustenance, favour received."]}], "ಉಪ್ಪುನೀರ್": [{"type": "noun", "defs": ["= ಉಪ್ಪುನೀರು."]}], "ಉಪ್ಪುನೀರು": [{"type": "noun", "defs": ["water saturated or strongly impregnated with salt; brine; salt water.", "sea water.", "hard water that contains several salts in it."]}], "ಉಪ್ಪುನೆಲ": [{"type": "noun", "defs": ["a soil rich in salts; saline soil."]}], "ಉಪ್ಪುನೇರಳೆ": [{"type": "noun", "defs": ["the small tree or shrubby plant Morus alba of Moraceae family, grown for its leaves used as a feed for silk-worms; mulberry."]}], "ಉಪ್ಪುನೇರಿಳೆ": [{"type": "noun", "defs": ["= ಉಪ್ಪುನೇರಳೆ."]}], "ಉಪ್ಪುಬಾಳಕ": [{"type": "noun", "defs": ["green chilly filled with salt and dried (used as a relish)."]}], "ಉಪ್ಪುಮಡಿ": [{"type": "noun", "defs": ["a salt-bed made for manufacture of salt."]}], "ಉಪ್ಪುಮಣ್ಣು": [{"type": "noun", "defs": ["the soil rich in various salts; saline earth."]}], "ಉಪ್ಪುಮಾ": [{"type": "noun", "defs": ["a savoury dish made using coarse flour of rice or wheat (popularly known as ಉಪ್ಪಿಟ್ಟು)."]}], "ಉಪ್ಪುಮೀನು": [{"type": "noun", "defs": ["fish processed using salt as a preservative."]}], "ಉಪ್ಪುರ": [{"type": "adjective", "defs": ["veryhigh; tall; lofty."]}, {"type": "noun", "defs": ["that which is tall; the quality of being tall; loftiness; height.", "the quality that makes anything excel another; greatness."]}], "ಉಪ್ಪುರಗುಡಿ": [{"type": "noun", "defs": ["a banner raised to a considerable height."]}], "ಉಪ್ಪುರಿ": [{"type": "noun", "defs": ["a plant ."]}], "ಉಪ್ಪುರೇವು": [{"type": "noun", "defs": ["an area where salt-beds are made for making salt (esp. on a sea-shore)."]}], "ಉಪ್ಪುವಡ್ಡ": [{"type": "noun", "defs": ["a sub-sect among ಒಡ್ಡ caste whose main profession is working in stone quarries, road-making etc."]}], "ಉಪ್ಪುಹುಲ್ಲು": [{"type": "noun", "defs": ["a kind of grass, the leaves of which are saltish in taste."]}], "ಉಪ್ಪುಳ": [{"type": "noun", "defs": ["expanded; grown wider; blown (as a flower)."]}], "ಉಪ್ಪುಳಗಣ್": [{"type": "noun", "defs": ["an eye that is large and round like a saucer."]}], "ಉಪ್ಪೂಡು": [{"type": "verb", "defs": ["to apply, smear salt (as in food processing)."]}], "ಉಪ್ಪೆಗಚಿ": [{"type": "noun", "defs": ["= ಉಪ್ಪುಗೂಚಿ."]}], "ಉಪ್ಪೆಸರು": [{"type": "noun", "defs": ["a kind of soup made using salt, but without pepper, sour-tamarind pods, etc."]}], "ಉಪ್ಪೇರಿ": [{"type": "noun", "defs": ["a thin slice or small piece of potato, green banana, etc. salted and spiced, fried in oil, that is used as food; a chip."]}], "ಉಪ್ಪೊಂಗು": [{"type": "verb", "defs": ["to be elated from excessive joy."]}], "ಉಪ್ರುಂಜಿ": [{"type": "noun", "defs": ["the tree Avicennia officinalis ( = A. tomentosa) of Verbenaceae family; common white mangrove."]}], "ಉಫ್": [{"type": "interjection", "defs": ["an interjection expressing boredom, weariness, etc."]}], "ಉಬಯ": [{"type": "pronoun", "defs": ["(correctly, ಉಭಯ) the two; the one and the other; both."]}], "ಉಬಲು": [{"type": "noun", "defs": ["the plant Nauclea missionis of Rubiaceae family."]}], "ಉಬಿಕು": [{"type": "verb", "defs": ["to become more, excessive; to increase; to become bigger in size."]}], "ಉಬುಬು": [{"type": "interjection", "defs": ["an interjection expressing joy, elation, triumph, etc.; hurrah."]}], "ಉಬ್ಬಚ್ಚು": [{"type": "noun", "defs": ["an embossed figure or a metal plate; a raised print on a paper; an embossed ornamentation; embossment."]}], "ಉಬ್ಬಚ್ಚುಗಾರ": [{"type": "noun", "defs": ["one who decorates or covers with designs, patterns, etc. raised above the surface; an embosser."]}], "ಉಬ್ಬಟೆ": [{"type": "noun", "defs": ["excessiveness of quantity, triumph or excellence.", "marked courage or bravery; valour.", "the infliction of torture; annoyance.", "the domineering or overbearing tendency or behaviour; arrogance."]}], "ಉಬ್ಬಟೆಗಾಣ್": [{"type": "verb", "defs": ["to see or reach the condition of excessiveness, excellence etc."]}], "ಉಬ್ಬಡಿಗ": [{"type": "noun", "defs": ["= ಉಬ್ಬದಿಗ."]}], "ಉಬ್ಬಣ": [{"type": "noun", "defs": ["a door-fastening bar; a bolt.", "a heavy, short bar used as a weapon."]}, {"type": "noun", "defs": ["superiority; excellence; pre-eminence.", "excessiveness; abundance."]}], "ಉಬ್ಬಣಿಸು": [{"type": "verb", "defs": ["to become more, excessive.", "to become superior, excellent or pre-eminent."]}], "ಉಬ್ಬದಿಗ": [{"type": "noun", "defs": ["the state or quality of exceeding what is usual, normal, proper, necessary or common."]}], "ಉಬ್ಬರ": [{"type": "noun", "defs": ["the state of being swollen or enlarged; excessiveness; abundance.", "the state or quality of being great in quantity or merit.", "the festive and excited mood caused by excessive joy, accompanied quick and lively action; alacrity; conviviality.", "the condition of being agitated, perturbed.", "the rise of the surface of oceans, seas caused by the attraction of the moon or sun; tide; flood-tide."]}], "ಉಬ್ಬರಂ": [{"type": "adverb", "defs": ["excessively; in great quantity, number, speed etc."]}], "ಉಬ್ಬರಂಬರಿ": [{"type": "verb", "defs": ["to flow violently and in flood; to rise, flow or gush out in or as in a flood."]}], "ಉಬ್ಬರಗಹಳೆ": [{"type": "noun", "defs": ["a high-sounding trumpet that can make loud tone."]}], "ಉಬ್ಬರಗಿಡಿ": [{"type": "noun", "defs": ["a glowing bit of matter thrown off by a fire; a hurled spark."]}], "ಉಬ್ಬರಣೆ": [{"type": "noun", "defs": ["excitement from pleasure or excessive joy."]}], "ಉಬ್ಬರಬವರ": [{"type": "noun", "defs": ["a fierce battle."]}], "ಉಬ್ಬರಮುರಿ": [{"type": "verb", "defs": ["to burn ablaze and violently."]}], "ಉಬ್ಬರವರಿ": [{"type": "verb", "defs": ["= ಉಬ್ಬರಂಬರಿ."]}], "ಉಬ್ಬರವಾತು": [{"type": "noun", "defs": ["unrestrained speech going beyond the normal, accepted norms or limits."]}], "ಉಬ್ಬರವಿಳಿತ": [{"type": "noun", "defs": ["(pl.) the alternate rise and fall of the surface of oceans, seas, and the bays, rivers, etc. connected with them, caused by the attraction of the moon or sun; tides."]}], "ಉಬ್ಬರಿ": [{"type": "verb", "defs": ["= ಉಬ್ಬರಂಬರಿ."]}], "ಉಬ್ಬರಿಕೆ": [{"type": "noun", "defs": ["the act or an instance of swelling, becoming huge, flowing as flood-tide, etc."]}], "ಉಬ್ಬರಿಗ": [{"type": "noun", "defs": ["= ಉಬ್ಬದಿಗ."]}], "ಉಬ್ಬರಿಸು": [{"type": "verb", "defs": ["to swell; - a) to increase in volume or become larger as a result of pressure from within; to expand; to dilate; b) to become larger at a particular point; curve out; bulge; protrude.", "to become great (as a flood, sea waves, etc.) or loud (as noise).", "to be expressed; to come out vehemently (as one's feelings).", "to be filled with pride and arrogance.", "to be elated (as from joy).", "to be dissatisfied; to show one's difference of opinion (in a rude manner).", "to cause to swell or inflate."]}], "ಉಬ್ಬಲ": [{"type": "noun", "defs": ["wet, soggy earth; soft mud; mire."]}], "ಉಬ್ಬಲು": [{"type": "noun", "defs": ["the husk of paddy, wheat or other grain separated in hulling, threshing or winnowing; chaff; hull.", "hair or wool that has fallen on its own from the body."]}, {"type": "noun", "defs": ["a gateway made of bamboo or wooden poles placed horizontally and fastened to two vertical posts, which can be operated by drawing out or pushed in on either side."]}, {"type": "noun", "defs": ["the state or quality of exceeding what is usual, normal, proper, necessary or common."]}], "ಉಬ್ಬಸ": [{"type": "noun", "defs": ["difficult situation; distress; strait; trouble.", "difficult breathing; panting for breath.", "a generally chronic disorder characterised by wheezing, coughing, difficulty in breathing, and a suffocating feeling, caused by an allergy to inhaled substances, stress, etc.; asthma.", "a feeling of resentful or discontented longing aroused by another person's better fortune, situation, etc.; envy."]}], "ಉಬ್ಬಸಂಬಡು": [{"type": "verb", "defs": ["= ಉಬ್ಬಸಪಡು."]}], "ಉಬ್ಬಸಗಳಿ": [{"type": "verb", "defs": ["to remove difficulty; to help come out of distress.", "to become enthusiastic and energetic."]}], "ಉಬ್ಬಸಗೊಳ್": [{"type": "verb", "defs": ["to suffer from breathing difficulty; to pant for breath.", "to be distressed, anxious to be suffering."]}], "ಉಬ್ಬಸಗೊಳಿಸು": [{"type": "verb", "defs": ["to inflict pain, distress on; to cause to undergo difficult situation."]}], "ಉಬ್ಬಸಪಡು": [{"type": "verb", "defs": ["to undergo or feel difficulty; to be distressed.", "to breath rapidly, heavily or with difficulty; to suffer from the obstruction in breathing.", "to suffer from asthma; to be asthmatic.", "to become depressed; to be gloomy; to lose spirits."]}], "ಉಬ್ಬಸಬಡು": [{"type": "verb", "defs": ["= ಉಬ್ಬಸಪಡು."]}], "ಉಬ್ಬಸರೆ": [{"type": "noun", "defs": ["a kind of medicinal plant."]}], "ಉಬ್ಬಸವಡು": [{"type": "verb", "defs": ["= ಉಬ್ಬಸಪಡು."]}], "ಉಬ್ಬಸವೆಱು": [{"type": "verb", "defs": ["to have difficulty in breathing; to gasp for breath."]}], "ಉಬ್ಬಳ": [{"type": "noun", "defs": ["= ಉಬ್ಬಳಿಕೆ1."]}], "ಉಬ್ಬಳಿಕೆ": [{"type": "noun", "defs": ["a feeling of sickness, with a propensity to vomit; nausea.", "sour belching caused by indigestion or heart-burn.", "a long, deep and audible breath taken in expressing sorrow, relief, fatigue, longing, etc.; a sigh."]}, {"type": "noun", "defs": ["the state or quality of exceeding what is usual, normal, proper, necessary or common."]}], "ಉಬ್ಬಳಿಕೆವಾತು": [{"type": "noun", "defs": ["arrogant words; overbearing speech."]}], "ಉಬ್ಬಳಿಸು": [{"type": "verb", "defs": ["to eject (matter) from the stomach through the mouth; to vomit.", "to become sick; to feel nausea.", "to have aversion; to dislike utterly."]}], "ಉಬ್ಬಾಟ": [{"type": "noun", "defs": ["the overbearing activity, behaviour; disdainful treatment."]}], "ಉಬ್ಬಾರ": [{"type": "noun", "defs": ["the state of being elated or swollen from joy; high spirits."]}], "ಉಬ್ಬಾಳಿ": [{"type": "noun", "defs": ["a person who becomes excited from even slight flattery.", "marked courage or bravery.", "imperiousness; domineering quality."]}], "ಉಬ್ಬಾಳಿಕೆ": [{"type": "noun", "defs": ["a ruling imperiously over others; royal power, authority marked by arrogance."]}], "ಉಬ್ಬಾಳಿಗ": [{"type": "noun", "defs": ["a man acting or doing with enthusiasm, arrogance but with little thought."]}], "ಉಬ್ಬಾಳಿಸು": [{"type": "verb", "defs": ["to act, rush in enthusiasm, with arrogance but with little thought."]}], "ಉಬ್ಬಾಳು": [{"type": "noun", "defs": ["a man with pride and arrogance.", "a man susceptible to flattery.", "a man of high standing or social status.", "an enthusiastic, zealous man.", "intense and passionate zeal; enthusiasm."]}], "ಉಬ್ಬಾಳುತನ": [{"type": "noun", "defs": ["personal bravery, courage."]}], "ಉಬ್ಬಿಕೆ": [{"type": "noun", "defs": ["the act or an instance of swelling."]}], "ಉಬ್ಬಿಕ್ಕಿಸು": [{"type": "verb", "defs": ["to cause to increase and spread through out."]}], "ಉಬ್ಬಿನ": [{"type": "noun", "defs": ["adversity; calamity; grievous distress."]}, {"type": "noun", "defs": ["the tree Polyalthia longifolia of Annonaceae family; Indian mast tree."]}], "ಉಬ್ಬಿಸು": [{"type": "verb", "defs": ["to become more or excessive.", "to cause to become more or excessive.", "to flatter and make (someone) feel great; to coax with flattery and insincere talk; to wheedle; to cajole."]}], "ಉಬ್ಬಿಱಿ": [{"type": "verb", "defs": ["to come out; to be expressed; to be conspicuous; to become obvious.", "to rejoice; to be elated from joy."]}], "ಉಬ್ಬಿಱಿತ": [{"type": "noun", "defs": ["a powerful thrust; a heavy stabbing."]}], "ಉಬ್ಬು": [{"type": "verb", "defs": ["to happen; to become obvious or conspicuous.", "to become more, enlarged, swell or huge.", "to enjoy; to rejoice.", "to become elongated; to be stretched and made longer.", "to become susceptible to flattery; to be gratified being praised.", "ಉಬ್ಬಿದ ಕಪ್ಪೆ ಆನೆಯ ನುಂಗೀತೆ? ubbida kappa āneya nuŋgīte? (prov.) an ant-hill, however big it grows, cannot challenge the Everest."]}, {"type": "noun", "defs": ["growth; development; progress.", "the force of forward movement; speed; vehemence.", "joy; pleasure.", "pride; arrogance.", "convexity - a) the quality or condition of being convex; a protuberance; a boss; a knob; b) a convex surface.", "a bruised area of tissue, of a surface of the body.", "ಉಬ್ಬು ಏಳು ubbu ēḷu (a swelling) to appear on the skin (as from a blow on the body)."]}], "ಉಬ್ಬುಕೊಬ್ಬು": [{"type": "noun", "defs": ["= ಉಬ್ಬುಗೊಬ್ಬು."]}], "ಉಬ್ಬುಗಣ್ಣು": [{"type": "noun", "defs": ["an eye with the eye-ball projecting out."]}], "ಉಬ್ಬುಗನ್ನಡಿ": [{"type": "noun", "defs": ["a mirror the surface of which is curving outward (like the surface of a sphere) a convex-mirror."]}], "ಉಬ್ಬುಗಲ್ಲ": [{"type": "noun", "defs": ["a bulging out chin; a prominent chin."]}], "ಉಬ್ಬುಗವಳ": [{"type": "noun", "defs": ["an eatable, esp. the betal leaves with areca nut, that excites or intensifies the sentiments.", "a big lump of food."]}], "ಉಬ್ಬುಗುಂದು": [{"type": "verb", "defs": ["(enthusiasm, zeal, etc.) to become less; to fade."]}], "ಉಬ್ಬುಗುದುರೆ": [{"type": "noun", "defs": ["an enthusiastic, zealous horse."]}], "ಉಬ್ಬುಗೆಡು": [{"type": "verb", "defs": ["= ಉಬ್ಬುಗುಂದು."]}], "ಉಬ್ಬುಗೆನ್ನೆ": [{"type": "noun", "defs": ["a bulging out cheek; a prominent cheek."]}], "ಉಬ್ಬುಗೊಬ್ಬು": [{"type": "noun", "defs": ["excessive pride, arrogance."]}], "ಉಬ್ಬುಗೋಮಾಳೆ": [{"type": "noun", "defs": ["a thick, corpulent neck."]}], "ಉಬ್ಬುಚಿತ್ರ": [{"type": "noun", "defs": ["a raised work, figure, print etc.; a figure or form that stands out on (a surface); an embossed work; embossment."]}], "ಉಬ್ಬುಚಿತ್ರಕಾರ": [{"type": "noun", "defs": ["an artist skilled in the techniques of carving, drawing or sculpturing etc. on a raised metal or paper sheet; an embossing artist."]}], "ಉಬ್ಬುಡುಗು": [{"type": "verb", "defs": ["(one's pride, arrogance) to get subdued, destroyed."]}], "ಉಬ್ಬುಮೀನು": [{"type": "noun", "defs": ["any of a family Tetraodontidae (order - Tetraodontiformes),of small, marine bony fishes capable of expanding their body by swallowing water or air; globe fish."]}], "ಉಬ್ಬುರೊಟ್ಟಿ": [{"type": "noun", "defs": ["a kind of bread that is soft, bulging, and usu. leavened."]}], "ಉಬ್ಬುವಾತು": [{"type": "noun", "defs": ["zealous, pompous talk or speech."]}], "ಉಬ್ಬುಹಣೆ": [{"type": "noun", "defs": ["a prominent, bulging out forehead."]}], "ಉಬ್ಬುಹಲ್ಲ": [{"type": "noun", "defs": ["a man with teeth projecting out."]}], "ಉಬ್ಬುಹಲ್ಲಿ": [{"type": "noun", "defs": ["a woman whose teeth are projecting out."]}], "ಉಬ್ಬುಹಲ್ಲು": [{"type": "noun", "defs": ["a projecting tooth."]}], "ಉಬ್ಬುಹೊಳೆ": [{"type": "noun", "defs": ["an overflowing river; a river in inundation."]}], "ಉಬ್ಬೆ": [{"type": "noun", "defs": ["heat; hotness; high temperature.", "mental distress; anxiety; mental turmoil.", "fervent activity; vehemence; zeal.", "a process of washing cloth using boiling water, washing soda (sodium carbonate), etc. 5) an artificial process of making the fruits ripe fast by keeping them packed in straw, rice, etc.", "undue pride; haughtiness.", "ಉಬ್ಬೆಗೆ ಹಾಕು ubbege hāku to wash (dirty clothes) in steam; 2. to give the clothes for washing in this manner.", "to keep the unripe fruits packed in straw or rice to hasten their ripening."]}, {"type": "noun", "defs": ["(correctly ಒಬ್ಬೆ) 1. the quantity (of grains, etc.) that can be pounded, ground in a mortar.", "in taking meals, that much quantity of rice one mixes with soup or any spicy liquids."]}, {"type": "noun", "defs": ["(correctly, ಪುಬ್ಬೆ) 1. the eleventh lunar mansion.", "the rain falling during the association of this lunar mansion with the moon."]}], "ಉಬ್ಬೆಕಾಣಿಕೆ": [{"type": "noun", "defs": ["the tax paid by washermen."]}], "ಉಬ್ಬೆಕುಳ್ಳ": [{"type": "noun", "defs": ["a jaylike passerine bird (family Corvidae) characterised by black colouring, a long, tapering tail, and a habit of noisy chattering; black magpie."]}], "ಉಬ್ಬೆಗ": [{"type": "noun", "defs": ["the state of being distressed; worry; mental pain, suffering; anxiety; irritation of the mind; vexation.", "harm; danger; adversity.", "the quality or state of being vehement; intensity; vehemence.", "fear; fright."]}], "ಉಬ್ಬೆಗಂಗೊಳ್": [{"type": "verb", "defs": ["to become anxious; to be mentally troubled; to worry about.", "to be afraid of; to become apprehensive of."]}], "ಉಬ್ಬೆಗಂಬಡಿಸು": [{"type": "verb", "defs": ["to annoy; to molest; to trouble.", "to cause to be afraid of."]}], "ಉಬ್ಬೆಗಂಬಡು": [{"type": "verb", "defs": ["to feel the anxiety; to have uncertainty in the mind.", "to fear."]}], "ಉಬ್ಬೆಮನೆ": [{"type": "noun", "defs": ["a house where dirty clothes are washed in boiling water and washing soda (sodium carbonate).", "(fig.) a room or a house not having sufficient ventilation and hence, is suffocating and hot."]}], "ಉಬ್ಬೆಮೆ": [{"type": "noun", "defs": ["greatly bewildered state of the mind.", "painful or apprehensive uneasiness of the mind; fearful concern; anxiety."]}], "ಉಬ್ಬೆಳೆ": [{"type": "noun", "defs": ["a thread that is looking prominent in a woven fabric."]}], "ಉಬ್ಬೇಗ": [{"type": "noun", "defs": ["= ಉಬ್ಬೆಗ."]}], "ಉಬ್ಬೇಗೆ": [{"type": "noun", "defs": ["= ಉಬ್ಬೆಗ."]}], "ಉಬ್ಬೇಣು": [{"type": "noun", "defs": ["the long, thick crest of something; a thick ridge."]}], "ಉಬ್ಬೇಳ್": [{"type": "verb", "defs": ["= ಉಬ್ಬೇಳು."]}], "ಉಬ್ಬೇಳು": [{"type": "verb", "defs": ["to jump up vehemently; to spring upward rapidly and suddenly.", "to get up and rush in a fit of frenzy."]}], "ಉಬ್ಬೇಱು": [{"type": "verb", "defs": ["to rejoice greatly; to be full of joy; to be jubilant."]}], "ಉಬ್ಬೇಱುವೊಯ್ಲು": [{"type": "noun", "defs": ["= ಉಬ್ಬೇಱುಹೊಯ್ಲು."]}], "ಉಬ್ಬೇಱುಹೊಯ್ಲು": [{"type": "noun", "defs": ["a heavy stroke struck in a fit of frenzy."]}], "ಉಬ್ಬೊಟ್ಟೆ": [{"type": "noun", "defs": ["a swollen belly."]}], "ಉಭಯ": [{"type": "adjective", "defs": ["both."]}, {"type": "pronoun", "defs": ["the two; the one and the other; both."]}], "ಉಭಯಕುಶಲೋಪರಿ": [{"type": "noun", "defs": ["the welfare of both (the first and the second persons)."]}], "ಉಭಯಕುಶಲೋಪರಿ ಸಾಂಪ್ರತ": [{"type": "noun", "defs": ["a formal mode of commencing a personal letter meaning 'after discussing the welfare of both of us (i.e. the first and the second persons), now, that.'."]}], "ಉಭಯಕರ್ತೃಕ": [{"type": "adjective", "defs": ["having written by two authors; made by two persons."]}], "ಉಭಯಕರ್ಮ": [{"type": "noun", "defs": ["(pl.) the virtuous and sinful deeds.", "(pl.) the duties stipulated to be done in this world and in the other world after one's death and departure from this world."]}], "ಉಭಯಕವಿ": [{"type": "noun", "defs": ["a poet who can author in two languages, chiefly in Kannaḍa and Samskřta."]}], "ಉಭಯಕವಿಚಕ್ರವರ್ತಿ": [{"type": "noun", "defs": ["a superior, unequalled poet among poets who can write both in Kannaḍa and Samskřta languages."]}], "ಉಭಯಕವಿತ್ವ": [{"type": "noun", "defs": ["the talent of a bi-lingual (Kannaḍa and Samskřta) poet.", "such compositions."]}], "ಉಭಯಕುಲ": [{"type": "noun", "defs": ["(pl.) (said in relation to a married woman) the two families (that of her father's and another of her husband's)."]}], "ಉಭಯಗುಣ": [{"type": "noun", "defs": ["(rhet.) (pl.) the word and its meaningfulness."]}], "ಉಭಯಜೀವಿ": [{"type": "noun", "defs": ["any of cold-blooded, scaleless vertebrates of Amphibia class, consisting of frogs, toads, newts, salamanders, and caecilians, that usu. begin life in water as tadpoles with gills and later develop lungs and live on land; an amphibian."]}], "ಉಭಯತರು": [{"type": "noun", "defs": ["= (correctly) ಉಭಯತ್ರರು."]}], "ಉಭಯತೋಮುಖಿ": [{"type": "noun", "defs": ["= ಉಭಯಮುಖಿ."]}], "ಉಭಯರ್ತರು": [{"type": "noun", "defs": ["= (correctly) ಉಭಯತ್ರರು."]}], "ಉಭಯತ್ರ": [{"type": "adverb", "defs": ["at both the places, regions; on both sides."]}], "ಉಭಯತ್ರರು": [{"type": "noun", "defs": ["(pl.) the two parties (having something to do with each other); both the (concerned) persons or parties."]}], "ಉಭಯತ್ವ": [{"type": "noun", "defs": ["the state of being dual; duality."]}], "ಉಭಯನರಹುರಿ": [{"type": "noun", "defs": ["(gram. a wrong compound) a class of molluscs with two ventral and two lateral nerve cords."]}], "ಉಭಯಪಕ್ಷ": [{"type": "noun", "defs": ["(pl.) both the parties (concerned)."]}], "ಉಭಯಪಾದಿ": [{"type": "noun", "defs": ["any of malacostracan crustaceans of Amphipoda order, with a vertically thin body and one set of legs for jumping or walking and another set for swimming, as the sand hopper; an amphipod."]}], "ಉಭಯಪಾರ್ಶ್ವ": [{"type": "noun", "defs": ["(pl.) both the sides (i.e. left and right sides)."]}], "ಉಭಯಬಲ": [{"type": "noun", "defs": ["the two rival military forces."]}], "ಉಭಯಭಾಷೆ": [{"type": "noun", "defs": ["(pl.) both the languages.", "(pl.) Kannaḍa and Samskřta languages."]}], "ಉಭಯಭ್ರಷ್ಟ": [{"type": "noun", "defs": ["he who is discredited. or unworthy to be in this world as well as the heaven after one's death.", "he who has been abandoned by both the rival groups, parties or countries."]}], "ಉಭಯಮಾತ್ರಕ": [{"type": "noun", "defs": ["a long syllable having twice the length of a short one."]}], "ಉಭಯಮುಖಿ": [{"type": "noun", "defs": ["a cow in the stage of giving birth to a calf.", "one whose character trait includes elements of both extroversion and introversion; an ambivert."]}], "ಉಭಯಮುಖಿಗುಡು": [{"type": "verb", "defs": ["to gift a cow that is about to give birth to a calf."]}], "ಉಭಯರಾಶಿ": [{"type": "noun", "defs": ["(pl.) both the groups.", "(pl.) both the heaps of grains, one for the former and the other for the government.", "(astrol.) the point of time of change over from one zodiac sign to the next."]}], "ಉಭಯಲಿಂಗ": [{"type": "noun", "defs": ["a person having both the male and female characteristics.", "(gram.) a word that can be used in both masculine and feminine senses.", "(pl.) both the liŋgas, i.e. the one which is tied to one's neck and the soul (considered as a liŋga)."]}], "ಉಭಯಲಿಂಗಪ್ರಸಾದ": [{"type": "noun", "defs": ["the divine blessing of both the liŋgas (i.e. of ಉಭಯಲಿಂಗ - 3)."]}], "ಉಭಯಲಿಂಗಸಂಗಿ": [{"type": "noun", "defs": ["he who is in contact or devoted to both the liŋgas (i.e. of ಉಭಯಲಿಂಗ - 3)."]}], "ಉಭಯಲಿಂಗಿ": [{"type": "noun", "defs": ["an animal or plant with the sexual organs of both the male and the female; a hermaphrodite.", "a person having both the male and female characteristics.", "(gram.) a word that has only one grammatical form to denote both masculine and feminine gender."]}], "ಉಭಯಲೋಕ": [{"type": "noun", "defs": ["(pl.) both the worlds, i.e. being the one in which we are currently living and another being the heaven."]}], "ಉಭಯವಂಶ": [{"type": "noun", "defs": ["(said in relation to a married woman) the two families - that of her father and another of her husband."]}], "ಉಭಯವರ್ತಿ": [{"type": "adjective", "defs": ["acting in both (i.e. in two contrasting) ways; having both acid and basic or electropositive and electronegative properties; amphoteric."]}, {"type": "noun", "defs": ["that which acts in both ways e.g. as acid and base, electropositive and electronegative."]}], "ಉಭಯವಾಸಿ": [{"type": "noun", "defs": ["= ಉಭಯಜೀವಿ."]}], "ಉಭಯವೇದಾಂತ": [{"type": "noun", "defs": ["the synchronisation of the vēdas, upanishads etc. with the Dravidian philosophical thoughts esp. of Tamil Aḷvārs."]}], "ಉಭಯವ್ಯಂಜನ": [{"type": "noun", "defs": ["a man having feminine characters; a womanish man.", "a weak, timid, unmanly man; an effeminate man."]}], "ಉಭಯವ್ಯತಿರೇಕ": [{"type": "noun", "defs": ["(rhet.) a figure of speech."]}], "ಉಭಯವ್ಯಾಕರಣ": [{"type": "noun", "defs": ["(pl.) the grammars of both Kannaḍa and Samskřta languages."]}], "ಉಭಯಸಂಕಟ": [{"type": "noun", "defs": ["a situation in which both the alternatives available are equally unpleasant or dangerous."]}], "ಉಭಯಸಂಸ್ಕಾರ": [{"type": "noun", "defs": ["initiation to the fundamental principles of both the liŋgas (i.e. ಉಭಯಲಿಂಗ - 3)."]}], "ಉಭಯಸಮ್ಮತ": [{"type": "adjective", "defs": ["agreeable to both the parties (of a transaction or connected with the same business of two rival groups)."]}], "ಉಭಯಸಾಧಾರಣ": [{"type": "noun", "defs": ["that which is common to both the parties (concerned)."]}], "ಉಭಯಸಾಮ್ಯ": [{"type": "noun", "defs": ["the quality or characteristics that is common between two things, persons, situations, etc."]}], "ಉಭಯಾಯತ್ತ": [{"type": "noun", "defs": ["that which is common to both the king and his minister."]}], "ಉಭಯಾಯಿ": [{"type": "adjective", "defs": ["fit, proper for both this physical world and the heaven.", "favourable to both the parties."]}], "ಉಭಯಾಯಿತನ": [{"type": "noun", "defs": ["the quality or fact of being a well-wisher to both the parties."]}], "ಉಭಯಾರೂಢ": [{"type": "noun", "defs": ["he who is expert or has deep knowledge in both the philosophies, i.e. Karma (action) and jṇāna (Supreme knowledge)."]}], "ಉಭಯಾರೂಢೆ": [{"type": "noun", "defs": ["she who is expert or has deep knowledge in both the philosophies, i.e. Karma (action) and jṇāna (Supreme knowledge)."]}], "ಉಭಯಾಲಂಕಾರ": [{"type": "noun", "defs": ["(pl.) (rhet.) both the figures of speech - one emanating from the word as such, and the other from its sense (ಶಬ್ದಾಲಂಕಾರ and ಅರ್ಥಾಲಂಕಾರ respectively)."]}], "ಉಭಯೋನ್ನತ": [{"type": "adjective", "defs": ["convex on both sides; bi-convex."]}], "ಉಭಯೋಷ್ಠ್ಯ": [{"type": "adjective", "defs": ["(of a sound etc.) made with closed or nearly closed lips; bilabial."]}], "ಉಭ ಶುಭ": [{"type": "noun", "defs": ["(only in the usage ಉಭ ಇಲ್ಲ, ಶುಭ ಇಲ್ಲ) being quiet, saying neither in favour nor against."]}], "ಉಮತ್ತ": [{"type": "noun", "defs": ["a small poisonous annual weed, Datura stramonium of Solanaceae family; stramonium."]}], "ಉಮದಾ": [{"type": "noun", "defs": ["a man worthy of respect or esteem; a respectable man."]}], "ಉಮರಾ": [{"type": "noun", "defs": ["a man of higher rank or social status; a person regarded as important or influential."]}], "ಉಮರಾವ": [{"type": "noun", "defs": ["= ಉಮರಾ."]}], "ಉಮರಾವು": [{"type": "noun", "defs": ["= ಉಮರಾ."]}], "ಉಮರು": [{"type": "noun", "defs": ["heat; hotness; high temperature."]}], "ಉಮರುಬೊಕ್ಕೆ": [{"type": "noun", "defs": ["a boil on the skin caused by exposure to excessive heat of the sun."]}], "ಉಮಾಧವ": [{"type": "noun", "defs": ["Śiva, as the consort of Goddess Umā."]}], "ಉಮಾಭರಣ": [{"type": "noun", "defs": ["(mus.) a mode, in Karnāṭaka system, derived from the main mode Harikāmbhōji."]}], "ಉಮಾವರ": [{"type": "noun", "defs": ["= ಉಮೇಶ."]}], "ಉಮಿ": [{"type": "noun", "defs": ["the husks of paddy, wheat or other grain separated in hulling, threshing or winnowing; chaff; the hull;", "skin or outer shell of any fruit.", "ಉಮಿ ಕುಟ್ಟಿ ಕೈ ಗುಳ್ಳೆ ಆಯಿತು umi kuṭṭi kai guḷḷe āyitu (prov.) useless work results in but fatigue."]}], "ಉಮುವಿಧಿ": [{"type": "noun", "defs": ["(gram.) the rule regulating the conjugation of 'ಉಮ್ '."]}], "ಉಮುಳ್": [{"type": "verb", "defs": ["= ಉಮುೞ್."]}], "ಉಮುೞ್": [{"type": "verb", "defs": ["to eject from within the mouth; to spit; to eject, throw out."]}], "ಉಮೆ": [{"type": "noun", "defs": ["the Goddess Pārvati, wife of Śiva."]}, {"type": "noun", "defs": ["the plant Psychotria bisulcata of Rubiaceae family."]}], "ಉಮೇದ": [{"type": "noun", "defs": ["= ಉಮೇದು."]}], "ಉಮೇದವಾರಿ": [{"type": "noun", "defs": ["= ಉಮೇದುವಾರಿ."]}], "ಉಮೇದಿ": [{"type": "noun", "defs": ["= ಉಮೇದು."]}], "ಉಮೇದು": [{"type": "noun", "defs": ["strong excitement of feeling; eagerness and ardent interest in pursuit of something; zeal; enthusiasm.", "faith or belief that one will act in right, proper and effective way; confidence; the state of being sure of.", "a strong desire to achieve something; aspiration."]}], "ಉಮೇದುವಾರ": [{"type": "noun", "defs": ["an enthusiastic, zealous man.", "one desirous of learning a trade; an apprentice.", "a man aspiring for a position, membership, as in an election or for passing through an examination."]}], "ಉಮೇದುವಾರಿ": [{"type": "noun", "defs": ["the fact of placing reliance on another; a relying on.", "the strong desire to learn something."]}], "ಉಮೇದುವಾರಿಕೆ": [{"type": "noun", "defs": ["the state of being a candidate for a post, position, membership etc.; candidature."]}], "ಉಮೇಶ": [{"type": "noun", "defs": ["Śiva, as the consort of Goddess Umā.", "a man having good name; a famous man; a celebrity."]}], "ಉಮ್ಮ": [{"type": "noun", "defs": ["a touch or caress with the lips, as an act of affection; a kiss."]}, {"type": "noun", "defs": ["heat; hotness; high temperature.", "mental distress; anxiety; mental turmoil."]}], "ಉಮ್ಮಗುರು": [{"type": "noun", "defs": ["a boil on the skin caused by exposure to excessive heat of the sun."]}], "ಉಮ್ಮಗೆ": [{"type": "noun", "defs": ["= ಉಮ್ಮಿಗೆ."]}], "ಉಮ್ಮಚ್ಚ": [{"type": "noun", "defs": ["the fact or feeling of being displeased; displeasure.", "hot displeasure; anger."]}, {"type": "noun", "defs": ["the fact or condition of being bewildered due to incomprehensibility or unfamiliarity; bewilderment.", "the depressed state of the mind; sadness.", "enthusiasm; eagerness; zealousness."]}], "ಉಮ್ಮಚ್ಚರ": [{"type": "noun", "defs": ["a strong feeling against someone or a situation which makes one want to hurt someone, be unpleasant, shout at someone, etc.; anger."]}], "ಉಮ್ಮಡಿಕೆ": [{"type": "noun", "defs": ["the quality of being irrationally proud and unduly assuming more importance for oneself than other people."]}], "ಉಮ್ಮತ": [{"type": "noun", "defs": ["= ಉಮ್ಮತ್ತ1."]}], "ಉಮ್ಮತ್ತ": [{"type": "noun", "defs": ["a small poisonous annual weed, Datura stramonium of Solanaceae family; stramonium.", "the plant Datura fastuosa of the same family, with small bright yellow flowers."]}, {"type": "noun", "defs": ["an insane man; a mad man.", "a haughty, arrogant man."]}], "ಉಮ್ಮತ್ತಾಟ್": [{"type": "noun", "defs": ["a kind of dance prevalent among ladies of Koḍava community."]}], "ಉಮ್ಮತ್ತಿ": [{"type": "noun", "defs": ["= ಉಮ್ಮತ್ತ2 - 3."]}]}