{"ಭಸಣಿಗೆ": [{"type": "noun", "defs": ["a conference of people belonging to the same profession.", "a paricular mode in sword-fight.", "a seat to sit on."]}], "ಭಸಿತ": [{"type": "noun", "defs": ["= ಭಸ್ಮ."]}], "ಭಸಿತಧರ": [{"type": "noun", "defs": ["= ಭಸ್ಮಧಾರಿ."]}], "ಭಸಿತಾಂಗ": [{"type": "noun", "defs": ["= ಭಸ್ಮಧಾರಿ.", "Śiva.", "the body that is smeared with sacred ash."]}], "ಭಸ್ತ್ರ": [{"type": "noun", "defs": ["a leather bag."]}], "ಭಸ್ತ್ರಿ": [{"type": "noun", "defs": ["a device for producing a strong current of air, consisting of a chamber that can be expanded to draw in air through an opening and pressed to expel it through a tube; bellows.", "a leather bag."]}], "ಭಸ್ತ್ರಿಕ": [{"type": "noun", "defs": ["= ಭಸ್ತ್ರಿ.", "a vessel-like container made of or reinforced with, leather."]}], "ಭಸ್ತ್ರಿಕೆ": [{"type": "noun", "defs": ["= ಭಸ್ತ್ರಿಕ.", "a particular manner of retaining the inhaled air for sometime, as an exercise in yoga."]}], "ಭಸ್ತ್ರೆ": [{"type": "noun", "defs": ["= ಭಸ್ತ್ರಿ."]}], "ಭಸ್ಮ": [{"type": "noun", "defs": ["the powdery residue of matter that remains after burning; ash.", "the ash of the burnt cowdung cake, regarded as holy."]}], "ಭಸ್ಮಕ": [{"type": "noun", "defs": ["a disease or disorder of the body characterised by the abnormal increase of digestive power, resulting in marbid appetite.", "a particular disease of the eyes."]}], "ಭಸ್ಮಗಂಧಿನಿ": [{"type": "noun", "defs": ["the plant Aloe perfoliata of Liliaceae family.", "a kind of perfume made from this (?) plant."]}], "ಭಸ್ಮಧಾರಿ": [{"type": "noun", "defs": ["a man who has smeared his body with the sacred ash, made by burning cowdung cakes."]}], "ಭಸ್ಮಪುಟ": [{"type": "noun", "defs": ["a kindling of fire for preparing a some oxides, for medicinal purpose."]}], "ಭಸ್ಮರಸ": [{"type": "noun", "defs": ["a substance having mercuric oxide, used for medicinal purpose."]}], "ಭಸ್ಮಾಸುರ": [{"type": "noun", "defs": ["a mythical demon who had got the boon from Śiva, that on whatever he places his palm, would turn into ashes.", "ಭಸ್ಮಾಸುರ ನೃತ್ಯ bhasmāsura nřtya an uncontrolled act of devastation (in a large scale)."]}], "ಭಸ್ಮೀಕರಣ": [{"type": "noun", "defs": ["the act of burning something and reducing it to ashes."]}], "ಭಸ್ಮೀಕರಿಸು": [{"type": "verb", "defs": ["to burn and reduce (something) to ashes."]}], "ಭಳಾರ": [{"type": "noun", "defs": ["a man worthy of respect or reverence by reason of scholarship, noble character and dignity.", "a monk or religious teacher.", "a master, ruler; a king."]}], "ಭಳಾರಿ": [{"type": "noun", "defs": ["name of a folk goddess."]}], "ಭಳಿರೆ": [{"type": "interjection", "defs": ["an interjection used in praising a performer; well done!; bravo!."]}], "ಭೞರಿ": [{"type": "noun", "defs": ["= ಭಳಾರಿ."]}], "ಭೞಾರ": [{"type": "noun", "defs": ["= ಭಳಾರ."]}], "ಭಾಂಕರಿಸು": [{"type": "verb", "defs": ["to make heavy sound (as in sneezing, blowing the nose, etc.).", "to shout aloud; to make a clamour."]}], "ಭಾಂಕಾರ": [{"type": "noun", "defs": ["loud or confused shouting; din of voices; clamour; uproar."]}], "ಭಾಂಕಾರಂಗುಡು": [{"type": "verb", "defs": ["= ಭಾಂಕರಿಸು."]}], "ಭಾಂಕಿ": [{"type": "noun", "defs": ["a kind of bugle."]}], "ಭಾಂಗಣ": [{"type": "noun", "defs": ["the sky, as the region of stars."]}], "ಭಾಂಗಿ": [{"type": "noun", "defs": ["a wrapped bundle conveyed or to be conveyed through postal or railway services; a parcel.", "a large bag filled completely with something and the mouth is tied or stitched with a thread or string."]}], "ಭಾಂಗೀನ": [{"type": "noun", "defs": ["soil that is very much suited for growing hemp (Cannabis sativa).", "a field where hemp is grown."]}], "ಭಾಂಡ": [{"type": "noun", "defs": ["a metallic or earthen container.", "any article or device used or needed in a given activity; tool, instrument, utensil, etc.; an implement.", "a kind of musical instrument.", "the harness of a horse; horse-trappings.", "an ornament.", "the wealth, whether in money or property, owned or employed in business by an individual, firm; capital.", "the path of a river.", "things bought and sold; goods; commodities.", "any collection of articles; paraphernalia.", "a sum of money set aside for some particular purpose; a fund.", "mimicry; buffoonery.", "ಭಾಂಡ ಭಾಜನ bhāṇḍa bhājana (pl.) utensils; kitchen vessles."]}], "ಭಾಂಡವಲ": [{"type": "noun", "defs": ["any form of wealth employed or capable of being employed in the production of more wealth; capital.", "assets remaining after deduction of liabilities; the net worth of a business; capital.", "monetary or material worth, as in commerce or trade; value.", "relative worth, merit, value or importance.", "the collective wealth of a country or its means of producing wealth; resources."]}], "ಭಾಂಡವಲದಾರ": [{"type": "noun", "defs": ["a man who has invested capital in a business enterprise; an investor; a capitalist."]}], "ಭಾಂಡವಲಶಾಹಿ": [{"type": "noun", "defs": ["= ಭಾಂಡವಲದಾರ.", "capitalists as a group or class (as distinguished from labour).", "the control, influence that this class exercises on economy of a nation.", "a person who advocates capitalism in the economy of a nation and supports investors and capitalists."]}], "ಭಾಂಡವಲು": [{"type": "noun", "defs": ["= ಭಾಂಡವಲ."]}], "ಭಾಂಡವಳು": [{"type": "noun", "defs": ["= ಭಾಂಡವಲ."]}], "ಭಾಂಡಸಂಕರ": [{"type": "noun", "defs": ["a defiling of kitchen utensilsl or the vessels meant for using in worship or sacrifice."]}], "ಭಾಂಡಾಗಾರ": [{"type": "noun", "defs": ["= ಭಾಂಡಾರ."]}], "ಭಾಂಡಾರ": [{"type": "noun", "defs": ["a place where the funds of the government, of a corporation or the like are deposited, kept, and disbursed; a treasury.", "a steel or iron box or repository for money, jewels, papers, etc.; a safe; a locker."]}], "ಭಾಂಡಿ": [{"type": "noun", "defs": ["= ಭಾಂಡೆ."]}], "ಭಾಂಡಿಕ": [{"type": "adjective", "defs": ["deserving ridicule; ridiculous."]}, {"type": "noun", "defs": ["a man whose occupation it is to cut and dress the hair of customers and to shave or trim the beard; a barber."]}], "ಭಾಂಡೀರ": [{"type": "noun", "defs": ["the ficus tree Ficus benghalensis ( = F. indica) of Moraceae family; the banyan tree.", "the one of the several vernacular, non-Samskřta, old Indic languages used in ancient India."]}], "ಭಾಂಡು": [{"type": "noun", "defs": ["(dial.) a kind of cheap, cotton sari (sire, a garment worn by Indian women, consisting of a long piece of cotton or silk wrapped around the body with one end draped over the head or over one shoulder)."]}], "ಭಾಂಡೆ": [{"type": "noun", "defs": ["a kitchen vessel."]}], "ಭಾಕರಿ": [{"type": "noun", "defs": ["a thin, flat or bowl-shaped cake of batter fried in a frying pan; a pancake."]}], "ಭಾಕ್ತ": [{"type": "adjective", "defs": ["fit to be eaten; edible.", "relying on another for support or aid; dependent.", "of secondary importance; not important."]}, {"type": "noun", "defs": ["that which is eaten to sustain life, provide energy, promote growth, etc.; food.", "a thing that is relying on another for support, sustenance, etc.", "(rhet.) a word or phrase used only in its secondary or unimportant sense."]}], "ಭಾಕ್ತಿಕ": [{"type": "adjective", "defs": ["characterised by devotion."]}, {"type": "noun", "defs": ["a man strongly devoted to a god or religion."]}], "ಭಾಗ": [{"type": "noun", "defs": ["a portion or division of a whole that is separate or distinct; a part.", "the full or proper portion or part allotted or belonging to or contributed or owed by an individual or group; a share.", "a person's share in or contribution to some action; duty, function or office.", "the point toward which something faces or the line along which something moves or lies; a direction.", "an administrative division consisting of several villages or towns.", "good luck; fortune.", "any of the four equal parts of something; a fourth; a quarter.", "an opportunity or chance.", "(math.) the term above the line in a fraction; the numerator.", "the result obtained when one number is divided by another; the quotient.", "a unit of measure for angles or arcs, one 360th part of the circumference of a circle; a degree.", "(astron.) one 30th part of any of the twelve divisions of a zodiac; a degree."]}], "ಭಾಗಂಗೊಳ್": [{"type": "verb", "defs": ["= ಭಾಗಗೊಳ್ಳು."]}], "ಭಾಗಂಗೊಳು": [{"type": "verb", "defs": ["= ಭಾಗಗೊಳ್ಳು."]}], "ಭಾಗಂಬೋಗು": [{"type": "verb", "defs": ["= ಭಾಗಗೊಳ್ಳು."]}], "ಭಾಗಗೊಳ್ಳು": [{"type": "verb", "defs": ["to be divided, shared (between or among).", "(math.) (a quantity) to be divided by another quantity."]}], "ಭಾಗಧೇಯ": [{"type": "noun", "defs": ["a portion, share of a whole.", "good luck; good fortune.", "property or wealth.", "happiness; prosperity.", "the share of the state; tax; impost.", "a man to whom a share, portion is due; a heir; a co-heir.", "a lucky, fortunate man."]}], "ಭಾಗಲಬ್ಧ": [{"type": "noun", "defs": ["(match.) the result of division; the number of times one quantity is contained in another; the quotient."]}], "ಭಾಗವಂತ": [{"type": "noun", "defs": ["a man to whom a share, portion (as of a property or profit in a business) is due."]}], "ಭಾಗವಡೆ": [{"type": "verb", "defs": ["to be separated (as a part from a whole); to be divided."]}], "ಭಾಗವತ": [{"type": "adjective", "defs": ["relating to a god, esp. to Viṣṇu."]}, {"type": "noun", "defs": ["a staunch follower of the sect that worship Viṣṇu.", "a man who teaches, trains yakṣagāna (a genre of dance drama, having themes selected from epics) and directs its presentation.", "one of the eighteen Purāṇas, and the most popular one among them, dedicated to the glorification of Viṣṇu."]}], "ಭಾಗವತಧರ್ಮ": [{"type": "noun", "defs": ["the cult of worshippers of Viṣṇu, holding him as the Supreme Being."]}], "ಭಾಗವತ ಸಂಪ್ರದಾಯ": [{"type": "noun", "defs": ["one of the three sects of the cult of worshippers of Viṣṇu, holding him as the Supreme Being."]}], "ಭಾಗವತಿಕೆ": [{"type": "noun", "defs": ["the teaching, training people for presenting a Yakṣagāna (a genre of dance drama, having themes selected from epics) or folk drama."]}], "ಭಾಗವಹಿಸು": [{"type": "verb", "defs": ["to have or take a part or share with others (in some activity, enterprise, etc.); to take part in; to participate."]}], "ಭಾಗಶಃ": [{"type": "adjective", "defs": ["partly; not fully or completely."]}], "ಭಾಗಸ": [{"type": "noun", "defs": ["riches; wealth."]}], "ಭಾಗಸ್ತ": [{"type": "noun", "defs": ["= ಭಾಗಸ್ಥ - 1."]}], "ಭಾಗಸ್ಥ": [{"type": "noun", "defs": ["(masc .) one of two or more persons engaged in the same business enterprise and sharing its profits and risks; a partner.", "a man who inherits jointly with another or others or is eligible for a share in a hereditary property."]}], "ಭಾಗಹಾರ": [{"type": "noun", "defs": ["= ಭಾಗಾಹಾರ."]}], "ಭಾಗಾಕಾರ": [{"type": "noun", "defs": ["= ಭಾಗಾಹಾರ."]}], "ಭಾಗಾದಿ": [{"type": "noun", "defs": ["= ಭಾಗಸ್ಥ."]}], "ಭಾಗಾರ": [{"type": "noun", "defs": ["= ಭಾಗಾಹಾರ."]}], "ಭಾಗಾರ್ಹ": [{"type": "noun", "defs": ["he who is eligible for a share in the property, business, etc.; a co-heir."]}], "ಭಾಗಾವಳಿ": [{"type": "noun", "defs": ["a share, portion of a whole (as of a property)."]}], "ಭಾಗಾಹಾರ": [{"type": "noun", "defs": ["(math.) the process of finding how many times a number is contained in another number; division."]}], "ಭಾಗಿ": [{"type": "noun", "defs": ["= ಭಾಗಸ್ಥ.", "a man who is eligible for the fruit of an action.", "a lucky, fortunate man.", "a man who owns something; a owner.", "a man who particiates in an activity, event, work done in concerted manner)."]}], "ಭಾಗಿತ್ವ": [{"type": "noun", "defs": ["an act or instance of participating; participation.", "the fact of taking part, as in some action or attempt; participation."]}], "ಭಾಗಿನೇಯ": [{"type": "noun", "defs": ["one's sister's son; a nephew."]}], "ಭಾಗಿಸು": [{"type": "verb", "defs": ["to separate into parts; to divide.", "to give out in shares; to apportion; to distribute.", "(math.) to separate into equal parts by a divison; to divide."]}], "ಭಾಗಿಸುಹ": [{"type": "noun", "defs": ["the act of separating into parts; a dividing.", "(math.) the process of separating into equal parts by a divison; division."]}], "ಭಾಗೀದಾರ": [{"type": "noun", "defs": ["= ಭಾಗಸ್ಥ."]}], "ಭಾಗೀರಥಿ": [{"type": "noun", "defs": ["the Gangā river (so called because it is believed that this river was brought by king Bhagīratha, from heavens, by pleasing Śiva by his austerities)."]}], "ಭಾಗುರೆ": [{"type": "interjection", "defs": ["an interjection used in praising a performer; well done!; bravo!."]}], "ಭಾಗೆ": [{"type": "noun", "defs": ["the full or proper portion or part allotted or belonging to or contributed or owed by an individual or group; a share.", "the act or process of dividing, apportioning.", "riches; wealth.", "a place; room; space."]}], "ಭಾಗೆಕಾಱ": [{"type": "noun", "defs": ["= ಭಾಗಿ."]}], "ಭಾಗೆಗೊಡು": [{"type": "verb", "defs": ["to give a share (of something to)."]}], "ಭಾಗೇದಾರ": [{"type": "noun", "defs": ["= ಭಾಗಸ್ಥ."]}], "ಭಾಗ್ಯ": [{"type": "noun", "defs": ["fate or destiny (resulting from merit or demerit in former life).", "good luck or fortune.", "happiness; welfare.", "much money or property; great amount of worldly possessions; riches; wealth."]}], "ಭಾಗ್ಯದೈವ": [{"type": "noun", "defs": ["a propitious god.", "(fig.) a person who helped another in achieving prosperity, welfare or fame."]}], "ಭಾಗ್ಯಲಕ್ಷ್ಮಿ": [{"type": "noun", "defs": ["Lakṣhmi, the Goddess of Wealth.", "riches; wealth."]}], "ಭಾಗ್ಯವಂತ": [{"type": "noun", "defs": ["a lucky, fortunate man.", "a wealthy man."]}], "ಭಾಗ್ಯವಂತೆ": [{"type": "noun", "defs": ["a lucky, fortunate woman.", "a wealthy woman."]}], "ಭಾಗ್ಯವತಿ": [{"type": "noun", "defs": ["= ಭಾಗ್ಯವಂತೆ."]}], "ಭಾಗ್ಯಶಾಲಿ": [{"type": "noun", "defs": ["= ಭಾಗ್ಯವಂತ."]}], "ಭಾಗ್ಯಶಾಲಿನಿ": [{"type": "noun", "defs": ["= ಭಾಗ್ಯವಂತೆ."]}], "ಭಾಗ್ಯಹೀನ": [{"type": "adjective", "defs": ["having no good luck; unlucky; unfortunate; ill-fated."]}, {"type": "noun", "defs": ["an ill-fated, unlucky man."]}], "ಭಾಗ್ಯಹೀನೆ": [{"type": "noun", "defs": ["an ill-fated, unlucky woman."]}], "ಭಾಗ್ಯೋದಯ": [{"type": "noun", "defs": ["= ಭಾಗ್ಯ - 2, 3 & 4."]}], "ಭಾಜಕ": [{"type": "adjective", "defs": ["that divides; dividing."]}, {"type": "noun", "defs": ["that which or he who divides; a divider.", "(math.) the number or quantity by which the dividend is divided to produce the quotient; a divisor."]}], "ಭಾಜನ": [{"type": "noun", "defs": ["the act of dividing, apportioning.", "(math.) the process of finding how many times a number is contained in another number; division.", "a man who is awared with the effects (good or bad) of something."]}], "ಭಾಜ್ಯ": [{"type": "adjective", "defs": ["that is to be or can be divided."]}, {"type": "noun", "defs": ["that which is to be divided.", "a share or portion of a hereditary property.", "(math.) the number or quantity to be divided; a dividend."]}], "ಭಾಟ": [{"type": "noun", "defs": ["money paid to an employee for work done; wages.", "a sum of money paid for the temporary possession or use of a house, land, etc.; rent."]}, {"type": "noun", "defs": ["a man employed in royal courts to herald the titles of a king.", "a man who praises another insincerely, with an intention to get an advantage."]}], "ಭಾಟಕ": [{"type": "noun", "defs": ["= ಭಾಟ1."]}], "ಭಾಟಾ": [{"type": "noun", "defs": ["a path or road."]}], "ಭಾಟಾಮಾರ್ಗ": [{"type": "noun", "defs": ["a main road; a highway."]}], "ಭಾಟಿ": [{"type": "noun", "defs": ["= ಭಾಟ1.", "money earned by a prostitute."]}], "ಭಾಟಿಗೆ": [{"type": "noun", "defs": ["the act of betrothing or fact of being betrothed; betrothal; engagement."]}], "ಭಾಟೆ": [{"type": "noun", "defs": ["= ಭಾಟಾ."]}], "ಭಾಟೆಮಾರ್ಗ": [{"type": "noun", "defs": ["= ಭಾಟಾಮಾರ್ಗ."]}], "ಭಾಟ್ಟ": [{"type": "adjective", "defs": ["of or related to Kumārila Bhaṭṭa or the Mīmāmsa philosophy propounded by him."]}, {"type": "noun", "defs": ["a follower of Kumārila Bhaṭṭa or the Mīmāmsa philosophy propounded by him."]}], "ಭಾಟ್ಟದರ್ಶನ": [{"type": "noun", "defs": ["the Mīmamsa philosophy as propounded by Kumarila Bhaṭṭa, a great exponent of this philosophy."]}], "ಭಾಟ್ಟಮತ": [{"type": "noun", "defs": ["= ಭಾಟ್ಟದರ್ಶನ."]}], "ಭಾಡಿಗೆ": [{"type": "noun", "defs": ["a payment for the temporary possession or use of a house, land, vehicle etc. made or to be made at regular intervals by the tenant or user to the owner; rent."]}], "ಭಾಣ": [{"type": "noun", "defs": ["a kind of drama or interlocution enacted by a single person having an imaginary incident of a thief, wicked fellow, etc., as a theme."]}], "ಭಾಣಸವೆರ್ಗಡೆ": [{"type": "noun", "defs": ["= ಭಾಣಸುವೆರ್ಗಡೆ."]}], "ಭಾಣಸಿಗೆ": [{"type": "noun", "defs": ["a woman who cooks food, esp. one whose profession is cooking; a female cook."]}], "ಭಾಣಸುವೆರ್ಗಡೆ": [{"type": "noun", "defs": ["the superintendent of a kitchen (in a palace)."]}], "ಭಾತಾಳ": [{"type": "noun", "defs": ["the tree Sterculia foetida of Sterculiaceae family; dung tree."]}], "ಭಾತಿ": [{"type": "noun", "defs": ["lustre; brilliance; splendour."]}], "ಭಾತಿಸು": [{"type": "verb", "defs": ["to shine brilliantly."]}], "ಭಾತು": [{"type": "noun", "defs": ["the starchy seeds or grain of an annual marsh grass oryza sativa of Poaceae family, cultivated in warm climates and used for food; paddy.", "rice got from husking boiled paddy.", "cooked rice or food (in gen.).", "any of specially prepared rice items."]}], "ಭಾತ್ಕøತಿ": [{"type": "noun", "defs": ["a roaring sound."]}], "ಭಾದು": [{"type": "noun", "defs": ["= ಭಾದ್ರಪದ."]}], "ಭಾದ್ರಪದ": [{"type": "noun", "defs": ["the sixth month in Hindu lunar calendar."]}], "ಭಾದ್ರಪದೆ": [{"type": "noun", "defs": ["(astrol.) the two clusters of starts - a) Makrab and Scheat, and b) Algenib and Alpheratz in the Northern constellations Pegasus and Andromeda."]}], "ಭಾನ": [{"type": "noun", "defs": ["the act or an instance of appearing; appearance.", "the act of perceiving or the ability to perceive; mental grasp of objects, qualities, etc. by means of the senses; awareness; comprehension; perception.", "the state of being conscious; awareness of one's own feelings, what is happening around one, etc.; consciousness.", "the act or power of recollecting or calling back to mind; remembrance.", "light; lustre; brightness."]}], "ಭಾನಗಡಿ": [{"type": "noun", "defs": ["the state or quality of being complex; intricacy; complexity.", "a gross, stupid or careless mistake; a blunder.", "officiousness causing annoyance to others."]}], "ಭಾನಗೇಡಿ": [{"type": "noun", "defs": ["a man lacking forethought and caution; a foolish fellow."]}], "ಭಾನಗೇಡಿತನ": [{"type": "noun", "defs": ["lack of forethought and caution; foolishness."]}], "ಭಾನವ": [{"type": "adjective", "defs": ["of or relating or peculiar to the sun or the Sun-God."]}, {"type": "noun", "defs": ["(myth.) any of the sons of the Sun-God (as Śani, Yama, etc.)."]}], "ಭಾನವಿ": [{"type": "noun", "defs": ["= ಭಾನವ2."]}], "ಭಾನಾಭಿ": [{"type": "noun", "defs": ["the source of light; that which gives forth light."]}], "ಭಾನಾಮತಿ": [{"type": "noun", "defs": ["magic with an evil purpose; sorcery; black magic."]}], "ಭಾನು": [{"type": "noun", "defs": ["light; brightness; splendour.", "a ray of light or a pencil of rays.", "the sun.", "a ruler; a king or emperor.", "(math.) a symbol for the number twelve.", "(pros.) a group consisting of one short syllablic instant followed by one long and another short one (u-u); amphibrachys."]}], "ಭಾನುಜ": [{"type": "noun", "defs": ["= ಭಾನವ2."]}], "ಭಾನುಜೆ": [{"type": "noun", "defs": ["Yamunā, the daughter of the Sun-God, and Goddess of the river Yamunā, a tributary of Gangā."]}], "ಭಾನುಮಂಡಲ": [{"type": "noun", "defs": ["the orb of sunlight."]}], "ಭಾನುಮಂಡಳ": [{"type": "noun", "defs": ["= ಭಾನುಮಂಡಲ."]}], "ಭಾನುಮಂತ": [{"type": "noun", "defs": ["he who is biright or lustrous; the sun."]}], "ಭಾನುಮತಿ": [{"type": "noun", "defs": ["a bright or lustrous woman."]}], "ಭಾನುವಾರ": [{"type": "noun", "defs": ["the first day of the week; Sunday."]}], "ಭಾನೆ": [{"type": "noun", "defs": ["a group of people held together by the same system or methods of music, usu. belonging to a particular teacher or tradition; a tradition of music."]}], "ಭಾಪು": [{"type": "interjection", "defs": ["= ಭಾಪುರೆ."]}], "ಭಾಪುಗೊಳ್": [{"type": "verb", "defs": ["to get commendation, encouragement for one's good performnce."]}], "ಭಾಪುರೆ": [{"type": "interjection", "defs": ["an interjection used in praising a performer; well done!; bravo!."]}], "ಭಾಪ್ಪು": [{"type": "noun", "defs": ["= ಭಾಪುರೆ."]}], "ಭಾಮ": [{"type": "noun", "defs": ["brilliance; lustre; effulgence.", "the sun.", "a strong feeling of displeasure and belligerence aroused by a wrong; wrath; ire.", "the husband of one's sister; a brother-in-law."]}], "ಭಾಮಂಡಲ": [{"type": "noun", "defs": ["an orb of light; halo."]}], "ಭಾಮಂಡಳ": [{"type": "noun", "defs": ["= ಭಾಮಂಡಲ."]}], "ಭಾಮಟ್ಯ": [{"type": "noun", "defs": ["= ಭಾಮಟ್ಯಾ."]}], "ಭಾಮಟ್ಯಾ": [{"type": "noun", "defs": ["a cheat or wicked fellow."]}], "ಭಾಮಿನಿ": [{"type": "noun", "defs": ["a woman (in gen.).", "a beautiful, but short-tempered woman.", "(pros.) a metre, having six lines in a verse, the first, second, fourth and fifth ones having fourteen units, and the third and sixth ones twenty three units ( the group of threee and four units following one another in each line)."]}], "ಭಾಮಿನಿವೃತ್ತ": [{"type": "noun", "defs": ["= ಭಾಮಿನಿ - 3."]}], "ಭಾಮಿನೀದೀರ್ಘದ್ವಿಪದಿ": [{"type": "noun", "defs": ["(pros.) a metre having two lines, having two groups of three and four units each coming alternatively in each line."]}], "ಭಾಮಿನೀಷಟ್ಪದಿ": [{"type": "noun", "defs": ["= ಭಾಮಿನಿ - 3."]}], "ಭಾಮೆ": [{"type": "noun", "defs": ["= ಭಾಮಿನಿ - 1 & 2.", "a woman as related to her husband; a wife."]}], "ಭಾಯಿ": [{"type": "noun", "defs": ["a term used to express fraternal relationship or spirit."]}], "ಭಾರ": [{"type": "noun", "defs": ["the amount or quantity of heaviness or mass; amount a thing weighs; weight.", "that which is carried; a load; a burden.", "the condition, quality, fact or instance of being responsible; obligation, accountability, dependability, etc.; responsibility.", "that which is borne with difficulty; onus.", "the quality or state of being important; consequence; significance.", "extreme degree of anything; intensity.", "the power of persons or things to affect others, seen only in its effects; influence.", "something that is done or is to be done by the compulsion of indebtedness; obligation.", "a bamboo lath having slings on both sides to carry burden on the shoulder or on the back of the neck.", "(arch.) a unit weight equal to twenty tolas.", "(arch.) a unit of weight equal to one tola.", "ಭಾರ ಒಪ್ಪಿಸು bhāra oppisu to assign the responsibility to; ಭಾರ ಬರು bhāra baru (dial.) to be possessed (by an evil spirit); ಭಾರ ಹಾಕು bhara hāku = ಭಾರ ಒಪ್ಪಿಸು; ಭಾರ ಹೊರು bhāra horu to shoulder the responsbibility."]}], "ಭಾರಂಕ": [{"type": "noun", "defs": ["a heavily fought battle.", "a brave soldier."]}], "ಭಾರಂಗಿ": [{"type": "noun", "defs": ["the tree Brucea sumatrana of Simaroubaceae family; brucine wood.", "the medium sized tree Erinocarpus nimmoanus of Tiliaceae family, with large, yellow flowers, the bark of which yields good quality fibre."]}], "ಭಾರಕ": [{"type": "noun", "defs": ["(masc.) a carrier of a burden.", "a man who has shouldered the responsibility.", "a burden; a load.", "a useless man who is a burden to others or to the society.", "a soldier."]}], "ಭಾರಕರ್ತ": [{"type": "noun", "defs": ["God, who takes the responsibility (of all the beings)."]}], "ಭಾರಕಾರಕ": [{"type": "adjective", "defs": ["that causes (something) become heavy or heavier."]}], "ಭಾರಕ್ಷಮ": [{"type": "noun", "defs": ["that which or he who has the ability to bear or carry burden."]}], "ಭಾರಣೆ": [{"type": "noun", "defs": ["= ಭಾರವಣೆ."]}, {"type": "noun", "defs": ["seemingly magical power by which another can be subjugated to one's will."]}], "ಭಾರತ": [{"type": "noun", "defs": ["the largest democratic nation in the world, spreading from the Himalayan mountains in the north to the Kanyākumāri in the south and from eastern border of Pakistan in the west to the western border of Bangla Desh in the east, which became independant on August 15, 1947.", "anything that belongs to India.", "one of the two great epics of India, popularly known as Mahābhārata, writen by Vēda Vyāsa originally in Samskřta, subsequently by others in other languages.", "the great war of Mahābharata, between Pānḍavas and Kauravas for eighteen days.", "Kurukṣētra, the battlefield of Mahābharata war.", "the treatise on the art of dance and drama written by the sage Bharata.", "a man who performs dance, acts in stage plays, etc. a dancer or actor.", "(Dvaita phil.) the Wind-God."]}], "ಭಾರತವರುಷ": [{"type": "noun", "defs": ["= ಭಾರತವರ್ಷ."]}], "ಭಾರತವರ್ಷ": [{"type": "noun", "defs": ["the Indian sub-continent, including the present India, Pakistan, Bangladesh, Burma, Sri Lanka and parts of Afghanistan."]}], "ಭಾರತಹುಣ್ಣಿಮೆ": [{"type": "noun", "defs": ["the full moonday in Māgha, the eleventh month in the Hindu lunar calendar.", "the festival observed on this day."]}], "ಭಾರತಹುಣ್ಣಿವೆ": [{"type": "noun", "defs": ["= ಭಾರತಹುಣ್ಣಿಮೆ."]}], "ಭಾರತಿ": [{"type": "noun", "defs": ["something that is spoken; an utterance; speech.", "Sarasvati, the Goddess of Speech.", "a learned man; a scholar.", "the last name that is appended to the names of pontiffs belonging toādi Śankarācarya tradition.", "the plant Centella asiatica ( = Hydrocotyle asiatica of Apiaceae family."]}], "ಭಾರತಿಕ": [{"type": "adjective", "defs": ["relating to, propounded by the sage Bharata or his treatise, Nāṭya Śastra."]}, {"type": "noun", "defs": ["a man who performs dance, acts in stage plays, etc. a dancer or actor."]}], "ಭಾರತಿಕವಿದ್ಯೆ": [{"type": "noun", "defs": ["the art of dance and drama."]}], "ಭಾರತೀಯ": [{"type": "noun", "defs": ["of, pertaining to or characteristic of India, its languages, people, custom, religion, art, philosophy, etc.; Indian."]}, {"type": "noun", "defs": ["a native of India; an Indian."]}], "ಭಾರತೀಯತೆ": [{"type": "noun", "defs": ["the quality, peculiarity , character of Indian people.", "the nature, style, theme, of Indian literature, art, philosophy, etc."]}], "ಭಾರತೀಯತ್ವ": [{"type": "noun", "defs": ["= ಭಾರತೀಯತೆ."]}], "ಭಾರತೇಯ": [{"type": "noun", "defs": ["= ಭಾರತೀಯ2."]}], "ಭಾರದಡಿ": [{"type": "noun", "defs": ["reputation based on one's good character, behaviour, compassion, clemency, empathy, etc.", "virtue as good character, behaviour compassion, etc."]}], "ಭಾರದ್ವಾಜ": [{"type": "noun", "defs": ["that which is relating to, ascribed to, the sage Bhāradvāja.", "a descendent in the family of this sage.", "Drōṇa, the famous teacher of martial arts, in Mahābhārata, one of the two great epics of India.", "another great mythological sage, considered as one of the seven celebrated sages.", "the lark Mirafra cantillans of Alaudidae family, smaller in size than house sparrow, with light bown body, light brown wings with dark brown spots, dull white breast, white brow, short, somewhat forked tail, brown legs and bill, that nests on the ground; singing bush-lark.", "the planet Mars."]}], "ಭಾರದ್ವಾಜಿ": [{"type": "noun", "defs": ["the shrubby cotton plant Gossipium indicum ( = G. neglectum) of Malvaceae family.", "cotton got from this plant."]}], "ಭಾರಯಷ್ಟಿ": [{"type": "noun", "defs": ["a bamboo lath having slings on both sides to carry burdens on the shoulder or on the back of the neck."]}], "ಭಾರಯಿಸು": [{"type": "verb", "defs": ["= ಭಾರಿಸು."]}], "ಭಾರವಡ್ಡಿಗೆ": [{"type": "noun", "defs": ["the frame of a door; a door-frame."]}], "ಭಾರವಣೆ": [{"type": "noun", "defs": ["a heavy object that is carried; a load; a burden.", "an extremely plentiful or oversufficient quantity or supply; abundance.", "the fact or state of excelling; superiority; eminence.", "a pompous, but vain show.", "a particular burden of obligation upon one who is responsible; responsibility."]}], "ಭಾರವಹ": [{"type": "noun", "defs": ["a man who carries a load.", "a man who is answerable or accountable, as for something within his power, control or management; a responsible man."]}], "ಭಾರವಾಸಿ": [{"type": "noun", "defs": ["a heavy load."]}], "ಭಾರವಾಹ": [{"type": "noun", "defs": ["= ಭಾರವಹ."]}], "ಭಾರವಾಹಕ": [{"type": "noun", "defs": ["= ಭಾರವಹ."]}], "ಭಾರವಾಹಿ": [{"type": "noun", "defs": ["= ಭಾರವಹ."]}], "ಭಾರವಿಸು": [{"type": "verb", "defs": ["= ಭಾರಿಸು."]}], "ಭಾರಸಂಖ್ಯೆ": [{"type": "noun", "defs": ["any fairly large number."]}], "ಭಾರಾಂಕ": [{"type": "noun", "defs": ["a heavily fought battle.", "a a brave soldier."]}], "ಭಾರಾಮಾರ್ಗ": [{"type": "noun", "defs": ["a highway; a main road.", "a tax or an amout of money charged for passing along a highway; a toll."]}], "ಭಾರಾವತಾರ": [{"type": "noun", "defs": ["a relieving a person of his or her burden, load, responsibility, difficulty, agony, etc."]}], "ಭಾರಿ": [{"type": "adjective", "defs": ["of great extent or amount.", "taking up much space; bulky; large.", "big as compared with others of its kind.", "comprehensive; far-reaching.", "operating on a big scale; of a great scope or range.", "grand and pompous.", "physically strong; vigorous; hardy.", "costing much; expensive; dear.", "sumptuous (said of food).", "giving cause for concern; serious (as a disease, wound, etc.).", "causing or likely to cause considerable danger.", "rich; wealthy."]}, {"type": "noun", "defs": ["that which is characterised by heaviness, bulkiness.", "excessiveness.", "importance as a cause or influence; consequence."]}, {"type": "noun", "defs": ["a lion."]}], "ಭಾರಿಕ": [{"type": "noun", "defs": ["= ಭಾರವಹ."]}], "ಭಾರಿಮಾಡು": [{"type": "verb", "defs": ["to solute in a formal and orderly manner."]}], "ಭಾರಿಸು": [{"type": "verb", "defs": ["to become heavy.", "to weigh down with or as with a heavy load.", "to become a burden to.", "to become motionless, inactive.", "to put something heavy to be carried upon or into; to load.", "to become more, excessive.", "to come together to form a group; to assemble.", "to extend oneself or to be extended over a wide area; to become distributed or dispersed; to spread.", "to grow oneself to a serious extent; to become intensive.", "to bring together alarge number of persons, things, etc. to form a group; to assemble.", "to become bulky; to increase one's size."]}], "ಭಾರುಂಡ": [{"type": "noun", "defs": ["a mythical bird having two heads, believed to be stronger than lions; a griffin-like bird."]}], "ಭಾರೈಸು": [{"type": "verb", "defs": ["= ಭಾರಿಸು."]}], "ಭಾರ್ಗವ": [{"type": "noun", "defs": ["name of several mythological characters as - Cyavana, Paraśu Rāma or any of the descendents of the sage Břgu.", "Śukra, the preceptor of demons and the God of planet Venus.", "the planet Venus.", "a professional archer.", "Śiva.", "a man whose profession is to make pottery; a potter.", "a slender, straight, pointed missile to be shot from a bow; an arrow."]}], "ಭಾರ್ಗವಪುರಾಣ": [{"type": "noun", "defs": ["one of the eighteen minor Purāṇas."]}], "ಭಾರ್ಗವಿ": [{"type": "noun", "defs": ["Lakṣmi, the Goddess of Wealth.", "Pārvati, the wife of Śiva.", "(in gen.) grass or a blade of grass."]}], "ಭಾರ್ಯ": [{"type": "noun", "defs": ["that which is to be borne, supported, cherished, nourished or maintained; a dependent.", "a soldier; a mercenary.", "a measure or capacity equal to one fourth of a koḷaga or sixteenth part of a drōṇa."]}], "ಭಾರ್ಯೆ": [{"type": "noun", "defs": ["a woman as related to a man whom she is married to; a wife.", "ಭಾರ್ಯಾ ರೂಪವತೀ ಶತ್ರುಃ bhārya rūpavatī śatru (a Samskřta saying) he who has a white horse and a fair wife must be careful of they being fouled."]}], "ಭಾಲ": [{"type": "noun", "defs": ["the part of the face above the eyebrows; the forehead."]}], "ಭಾಲಪಟ್ಟ": [{"type": "noun", "defs": ["= ಭಾಲ.", "a band tied to the forehead of a sacrificial horse, announcing the name of the performer of the sacrifice, his intention, etc."]}], "ಭಾಲಾಂಬಕ": [{"type": "noun", "defs": ["an eye on the forehead (as of Śiva).", "Śiva."]}], "ಭಾಲಾಕ್ಷ": [{"type": "noun", "defs": ["= ಭಾಲಾಂಬಕ."]}], "ಭಾಲೆ": [{"type": "noun", "defs": ["a stabbing weapon consisting of a long shaft and a pointed, metal head; a spear.", "a slender, long stick."]}], "ಭಾಲ್ಲುಕ": [{"type": "noun", "defs": ["= ಭಾಲ್ಲೂಕ."]}], "ಭಾಲ್ಲೂಕ": [{"type": "noun", "defs": ["any of the plantigrade, carnivorous or omnivorous mammals of the family Ursidae, having massive bodies, coarse heavy fur, relatively short limbs, and almost rudimentary tails; a bear."]}], "ಭಾವ": [{"type": "noun", "defs": ["the husband of one's sister.", "an elder brother of one's husband.", "a son of one's maternal uncle.", "an elder brother of one's wife.", "one's father's siisteṛs son.", "a term used to express one's intimacy."]}, {"type": "noun", "defs": ["the fact or state of existing; existence.", "the act or fact of happening; occurrence.", "a thing that has actually happened or that is really true; thing that has been or is; fact.", "the act or fact of coming into life or of being born; nativity; birth.", "the state of things as they are; reality; actuality.", "the ever-existing Supreme Being.", "that which thinks, perceives, feels, wills, etc.; seat or subject of consciousness; the mental faculty; the mind.", "the natural, inborn qualities, temperment, instincts etc. of an animal.", "general frame of mind in humans; disposition.", "a particular state of mind or feeling; mood.", "a belief not based on absolute certainty or positive knowledge but on what seems true, valid or probable to one's own mind; opinion; judgement.", "that which is apparent to the senses; a phenomenal object.", "the look or outward aspect of a person or thing.", "a movement or movements collectively, of the body or of part of the body, to express or emphasize ideas, emotions, etc.; a gesture.", "the eighth year in the Hindu cycle of sixty years.", "(gram.) the effect of an action.", "(gram.) a noun that expresses the quality, state or abstractness of something; an abstract noun.", "(arith.) a symbol for the the number nine.", "a term (as 'sir') used to address the narrator of a drama.", "(rhet.) wanton sport, dalliance as a subsidiary sentiment used to rouse the main sentiment Śřngāra.", "(arch.) a sense as understood or realised by a person which is different from the one the speaker or writer had (?).", "an astrological house of lunar mansion.", "(jain.) the consequence of effect of something a being experiences or undergoes."]}], "ಭಾವಂಜಿ": [{"type": "noun", "defs": ["the plat Centrantherum anthelmenticum ( = Vernonia anthelmentica) of Asteraceae family.", "its seed; wild cumin; worm seed."]}], "ಭಾವಕ": [{"type": "noun", "defs": ["causing to be or to happen.", "promoting welfare; propitious; auspicious.", "making or capable of making mental images of; imagining; fancying.", "sensitive to art and beauty; showing good taste; aesthetic."]}, {"type": "noun", "defs": ["one's customary frame of mind; one's nature or temperament; disposition.", "a man who is sensitive to art and beauty and has good taste."]}], "ಭಾವಕತ್ವ": [{"type": "noun", "defs": ["the habit, quality or condition of being sentimental; sentimentalism; sentimentality.", "the ability of a person (a reader or one among the audience of a drama) to enjoy the sentiment in a detached manner."]}], "ಭಾವಕಿ": [{"type": "noun", "defs": ["a beautiful woman.", "a woman having good taste and is sensitive to art and beauty."]}], "ಭಾವಕೃದಂತ": [{"type": "noun", "defs": ["(gram.) a noun formed from a verb or verbal root, without making any change."]}], "ಭಾವಗಮ್ಯ": [{"type": "adjective", "defs": ["that is not apparent or perceptible by the senses, but to be understood (said of abstract things)."]}], "ಭಾವಗರ್ಭಿತ": [{"type": "adjective", "defs": ["full of meaning; having or conveying a special or hidden meaning; suggestive."]}], "ಭಾವಗೀತ": [{"type": "noun", "defs": ["= ಭಾವಗೀತೆ."]}], "ಭಾವಗೀತೆ": [{"type": "noun", "defs": ["a poem characterised by or expressing sentiments, enthusiasm, etc.; a lyric poem."]}], "ಭಾವಚಿತ್ರ": [{"type": "noun", "defs": ["a drawn or painted, picture of a person; a portrait.", "a picture of a person photographed with a camera."]}], "ಭಾವಚೇಷ್ಟೆ": [{"type": "noun", "defs": ["a movement or position of the hand, arm, body, head or face that is expressive of an idea, opinion, emotion, etc.; a gesture."]}], "ಭಾವಜ": [{"type": "noun", "defs": ["that which is born in the mind (as a conception, sentiment, feeling, etc.).", "Manmatha, the Love-God."]}], "ಭಾವಜೀವಿ": [{"type": "noun", "defs": ["a person having or showing tender, gentle or delicate feelings or he who is capable of understanding, and responding to, such feelings."]}], "ಭಾವಜ್ಞ": [{"type": "noun", "defs": ["a compassionate man who can understand others feelings, which are not expressly conveyed."]}], "ಭಾವಜ್ಞತೆ": [{"type": "noun", "defs": ["the ability to understand others feelings, which are not expressly conveyed."]}], "ಭಾವಜ್ಞೆ": [{"type": "noun", "defs": ["a compassionate woman who can understand others feelings, which are not expressly conveyed."]}], "ಭಾವತನ": [{"type": "noun", "defs": ["the relation that exists between a person with his or her brother-in-law."]}], "ಭಾವತೀವ್ರತೆ": [{"type": "noun", "defs": ["intensity of a sentiment."]}], "ಭಾವನ": [{"type": "noun", "defs": ["(jain.) a deity belonging to a particular class."]}], "ಭಾವನಾಜೀವಿ": [{"type": "noun", "defs": ["= ಭಾವಜೀವಿ."]}], "ಭಾವನಾತ್ಮಕ": [{"type": "noun", "defs": ["of or having to do with emotion or the emotions; emotional.", "showing emotion, esp. strong emotion; emotional.", "appealing to the emotions; moving people to tears, anger, etc.; emotional."]}], "ಭಾವನಾಮ": [{"type": "noun", "defs": ["(gram.) a noun that expresses the quality, state or abstractness of something; an abstract noun."]}], "ಭಾವನಾಮಯಿ": [{"type": "noun", "defs": ["= ಭಾವಜೀವಿ."]}], "ಭಾವನಾಲವಣ": [{"type": "noun", "defs": ["a kind of medicinal substance."]}], "ಭಾವನಾಲೋಕ": [{"type": "noun", "defs": ["the realm of imagination, fancy or sentiments."]}], "ಭಾವನಾವಾದಕ್ಕಿ": [{"type": "noun", "defs": ["a kind of medicinal substance."]}], "ಭಾವನಾಶಕ್ತಿ": [{"type": "noun", "defs": ["the power of imagination or of understanding others sentiments."]}], "ಭಾವನಿಷ್ಠ": [{"type": "adjective", "defs": ["of, affected by or produced by the mind or a particular state of mind; of or resulting from the feelings or temperament of the subject or person thinking; not objective; personal; subjective.", "determined by and emphasising the ideas, thoughts, feelings, etc. of the artist or writer, not just rigidly transcribing or reflecting reality; subjective.", "(phil.) of or having to do with the perception or conception of a thing by the mind as opposed to its reality independent of the mind; subjective."]}], "ಭಾವನಿಷ್ಠುರ": [{"type": "adjective", "defs": ["having harsh, ruthless feelings."]}, {"type": "noun", "defs": ["a man or that which has harsh, ruthless feelings."]}], "ಭಾವನೆ": [{"type": "noun", "defs": ["a belief not based on absolute certainty or positive knowledge but on what seems true, valid or probable to one's own mind; opinion; judgement.", "act of meditating; deep, continued thought.", "a fond hope or aspiration.", "a process in preparation of medicines, in which substances are mixed well with a liquid and dried.", "(Dvaita phil.) the result of experience that becomes instrumental for the power to remember."]}], "ಭಾವನೆಗೆಯ್": [{"type": "verb", "defs": ["= ಭಾವನೆಗೈ."]}], "ಭಾವನೆಗೈ": [{"type": "verb", "defs": ["to mix a substance with a liquid (as in preparing a medicine).", "to add scent as by mixing with a liquid."]}], "ಭಾವಪರವಶ": [{"type": "adjective", "defs": ["being under the influence of feelings.", "susceptible to the influence of feelings."]}, {"type": "noun", "defs": ["he who is overpowered by the sentiments (and has lost judgement or is not capable of having a pragmatic view)."]}], "ಭಾವಪರವಶತೆ": [{"type": "noun", "defs": ["the state of temporary mental alienation and altered consciousness from excessive joy or as a result of being moved by a strong sentiment; ecstasy."]}], "ಭಾವಪರವಶೆ": [{"type": "noun", "defs": ["she who is overpowered by the sentiments (and has lost judgement or is not capable of having a pragmatic view)."]}], "ಭಾವಪುಷ್ಟಿ": [{"type": "noun", "defs": ["intensity of the sentiments (in a literary work or play)."]}], "ಭಾವಪೂರ್ಣ": [{"type": "adjective", "defs": ["of or having to do with emotion or the emotions; emotional.", "showing emotion, esp. strong emotion; emotional."]}], "ಭಾವಪೂರ್ಣತೆ": [{"type": "noun", "defs": ["the quality or state of being emotional; emotionality."]}], "ಭಾವಪ್ರಧಾನ": [{"type": "adjective", "defs": ["being emotionally strong.", "moved by or capable of moving by emotion or emotions."]}], "ಭಾವಪ್ರಧಾನತೆ": [{"type": "noun", "defs": ["the quality of being emotionally strong; the fact of being moved by or capable of moving by emotion or emotions."]}], "ಭಾವಫಲ": [{"type": "noun", "defs": ["(astrol.) the propitious aspect of a planet while being in a particular house."]}], "ಭಾವಬಿದಿಗೆ": [{"type": "noun", "defs": ["the second day in the eighth month of the Hindu lunar calendar.", "a festival observed on that day."]}], "ಭಾವಮೈದ": [{"type": "noun", "defs": ["= ಭಾವಮೈದುನ."]}], "ಭಾವಮೈದುನ": [{"type": "noun", "defs": ["one's husband's younger brother.", "one's wife's younger brother.", "one's younger sister's husband."]}], "ಭಾವಮೋಕ್ಷ": [{"type": "noun", "defs": ["(jain.) the state of transcending the realm of emotions, feelings or sentiments."]}], "ಭಾವಯಿತ್ರೀ": [{"type": "noun", "defs": ["(rhet.) the ability or talent of a person who can compassionately understand and appreciate the sentiments of a literary or art work, with keen discrimination."]}], "ಭಾವಯೋಗ": [{"type": "noun", "defs": ["(jain.) the nature of a mundane person whose mind absorbs or attracts the agencies that keep him or her in the worldly life itself.", "the condition of being absorbed, completely associated, with the Supreme Being, without being pulled by the worldly pleasures."]}], "ಭಾವಲಹರಿ": [{"type": "noun", "defs": ["the free activity of the mind in imagining, fancying something."]}], "ಭಾವಲಿಂಗ": [{"type": "noun", "defs": ["(vīr.) the mentally formed image of Śiva, created for meditating within."]}], "ಭಾವಲಿಪಿ": [{"type": "noun", "defs": ["symbol or symbols used to represent ideas (as dif. from the symbols in the phonetic system); ideograph."]}], "ಭಾವಲೇಶ್ಯೆ": [{"type": "noun", "defs": ["the influence of the mundane world or life that makes a being bound to the worldly life."]}], "ಭಾವವಚನ": [{"type": "noun", "defs": ["= ಭಾವನಾಮ."]}], "ಭಾವವಾಚಿ": [{"type": "noun", "defs": ["= ಭಾವನಾಮ."]}], "ಭಾವವಿದ": [{"type": "noun", "defs": ["= ಭಾವಜ್ಞ."]}], "ಭಾವವಿದೆ": [{"type": "noun", "defs": ["= ಭಾವಜ್ಞೆ."]}], "ಭಾವಶಬಲತೆ": [{"type": "noun", "defs": ["(rhet.) a combination of several minor sentiments."]}], "ಭಾವಶಬಲತ್ವ": [{"type": "noun", "defs": ["= ಭಾವಶಬಲತೆ."]}], "ಭಾವಶಬಲಾಲಂಕಾರ": [{"type": "noun", "defs": ["(rhet.) a combination of several minor sentiments, each of which leading to another sentiment."]}], "ಭಾವಶಬಳತ್ವ": [{"type": "noun", "defs": ["= ಭಾವಶಬಲತೆ."]}], "ಭಾವಶಬಳತ್ವಾಲಂಕಾರ": [{"type": "noun", "defs": ["= ಭಾವಶಬಲಾಲಂಕಾರ."]}], "ಭಾವಶಾಂತಿ": [{"type": "noun", "defs": ["(rhet.) an allaying the intensity of a sentiment."]}], "ಭಾವಶುದ್ಧ": [{"type": "adjective", "defs": ["(said of feelings, attitude, etc.) free from defects; perfect; faultless."]}], "ಭಾವಶುದ್ಧಿ": [{"type": "noun", "defs": ["the quality or codition of one's feelings, attitude being free from defects, blemishes; purity of the mind; freedom from passions; void of affection or attachment."]}], "ಭಾವಶುದ್ಧಿಗೆಡು": [{"type": "noun", "defs": ["(purity of the mind) to be lost; (the mind) to become corrupt."]}], "ಭಾವಶೂನ್ಯ": [{"type": "adjective", "defs": ["not having, showing or moved by emotion or the emotions; apathetic."]}], "ಭಾವಶೂನ್ಯತೆ": [{"type": "noun", "defs": ["the quality of not having, showing or moved by emotion or the emotions; lack of emotion, feeling."]}], "ಭಾವಸಂಧಿ": [{"type": "noun", "defs": ["(rhet.) an expression of two opposing sentiments together or at the same time."]}], "ಭಾವಸಂಧ್ಯಲಂಕಾರ": [{"type": "noun", "defs": ["(rhet.) a figure of speech expressing two opposing sentiments together or at the same time."]}], "ಭಾವಸಂವರೆ": [{"type": "noun", "defs": ["(jain.) a turning away, averting of the causes of karma which binds the being to the worldy life."]}], "ಭಾವಸಮಾಧಿ": [{"type": "noun", "defs": ["self-absorption, transcending the detracting elements."]}], "ಭಾವಸಾರಾಯ": [{"type": "noun", "defs": ["the essence of a sentiment.", "a man absorbed in the meditation of the Supreme Being."]}], "ಭಾವಸೂಚಕಾವ್ಯಯ": [{"type": "noun", "defs": ["an exclamation inserted into an utterance without grammatical connection to it; an interjection."]}], "ಭಾವಸೂತಕ": [{"type": "noun", "defs": ["(vīr.) detraction of the mind in meditation; corruption of the mind."]}], "ಭಾವಾಜಿ": [{"type": "noun", "defs": ["a respect mode of addressing one's brother-in-law."]}], "ಭಾವಾತಿರೇಕ": [{"type": "noun", "defs": ["unrestrained action or behaviour in expressing one's feelings.", "such a condition."]}], "ಭಾವಾತ್ಮ": [{"type": "noun", "defs": ["a man versed in the Self-knowledge."]}], "ಭಾವಾತ್ಮಕ": [{"type": "adjective", "defs": ["having or showing tender, gentle or delicate feelings, as in aesthetic expression."]}], "ಭಾವಾನುವಾದ": [{"type": "noun", "defs": ["a conversion of a text (usu. from old style or verse form) into a style (usu. in lucid prose) that is easily understood by common people.", "translation of a text of one language into another language, giving the gist (as diff. from the verbatim translation)."]}], "ಭಾವಾಭಾಸ": [{"type": "noun", "defs": ["(rhet.) attribution of a feeling or characteristic to something without judgement or keen discrimination; presentation of a misleading sentiment; pathetic fallacy."]}], "ಭಾವಾಭಿನಯ": [{"type": "noun", "defs": ["a making use of gestures to add naunces or forces to one's speech or as a substitute for speech."]}], "ಭಾವಾಭಿವ್ಯಕ್ತಿ": [{"type": "noun", "defs": ["the act of expressing one's inner feelings."]}], "ಭಾವಾರ್ಥ": [{"type": "noun", "defs": ["the main or essential part of a matter (as of a text, speech, poem, etc.).", "the abstract sense of a word."]}], "ಭಾವಾವಿಷ್ಟ": [{"type": "adjective", "defs": ["being under the strong influence of feelings, sentiments."]}, {"type": "noun", "defs": ["he who is under the strong influence of feelings, sentiments."]}], "ಭಾವಾವಿಷ್ಟತೆ": [{"type": "noun", "defs": ["the state of being subject to strong influence of feelings, sentiments."]}], "ಭಾವಾವಿಷ್ಟೆ": [{"type": "noun", "defs": ["she who is under the strong influence of feelings, sentiments."]}], "ಭಾವಾವೇಗ": [{"type": "noun", "defs": ["vigorous impetuosity caused by intense emotions."]}], "ಭಾವಾವೇಶ": [{"type": "noun", "defs": ["intensity of emotions (which often overcomes judgement)."]}], "ಭಾವಿ": [{"type": "noun", "defs": ["a hole drilled or bored into the earth to obtain water, petroleum, natural gas; a well."]}, {"type": "adjective", "defs": ["happening or likely to happen in future."]}, {"type": "noun", "defs": ["seemingly predetermined, inevitable event.", "a man having or showing or suitably responding to, tender, gentle or delicate feelings.", "(gram.) the future tense."]}], "ಭಾವಿಕ": [{"type": "adjective", "defs": ["present by virtue of nature; innate; not acquired; natural.", "appealing to the emotions; emotional.", "showing or revealing very strong emotions; emotional."]}, {"type": "noun", "defs": ["the quality of being very favourable, propitious; auspiciousness; propitiousness.", "a learned man.", "(rhet.) the ability to delineate events of the past or future, as if they are happening in front of the reader or listener.", "such a description."]}], "ಭಾವಿಕತನ": [{"type": "noun", "defs": ["the tendency of trusting the traditional beliefs, without being analytical or pragmatic."]}]}