{"ಫೇಲೆ": [{"type": "noun", "defs": ["= ಫೇಲ."]}], "ಫೇಳಿ": [{"type": "noun", "defs": ["= ಫೇಲ."]}], "ಫೇಳಿಕೆ": [{"type": "noun", "defs": ["= ಫೇಲ."]}], "ಫೈಲು": [{"type": "noun", "defs": ["a container, as a folder, cabinet, etc., for keeping papers in order; a file.", "an orderly arrangement of papers, cards, etc., as for reference; a file."]}], "ಫೈಸಲ್": [{"type": "noun", "defs": ["= ಫೈಸಲು."]}], "ಫೈಸಲಾತಿ": [{"type": "noun", "defs": ["= ಫೈಸಲು."]}], "ಫೈಸಲು": [{"type": "noun", "defs": ["the act of fixing definitely, determining or deciding (something in doubt); settlement; a resolving of a dispute."]}], "ಫೋಡ್": [{"type": "noun", "defs": ["= ಫೋಡು."]}], "ಫೋಡು": [{"type": "noun", "defs": ["a dividing of a piece of agricultural land."]}], "ಫೋತಿ": [{"type": "noun", "defs": ["the act or fact of dying; permanent ending of all life in a person; death."]}], "ಫೋನು": [{"type": "noun", "defs": ["a system for transmitting speech or computerised information over distances; a telephone."]}], "ಫೋರ್ಜರಿ": [{"type": "adjective", "defs": ["imitating or counterfeiting (documents, signatures, etc.)."]}, {"type": "noun", "defs": ["the act or legal offense of imitating or counterfeiting documents, signatures, etc.; forgery.", "a forged document."]}], "ಫೌಜದಾರ್": [{"type": "noun", "defs": ["= ಫೌಜುದಾರ."]}], "ಫೌಜದಾರ": [{"type": "noun", "defs": ["= ಫೌಜುದಾರ."]}], "ಫೌಜದಾರಿ": [{"type": "noun", "defs": ["= ಫೌಜುದಾರಿ."]}], "ಫೌಜು": [{"type": "noun", "defs": ["the military forces of a nation, exclusive of the navy and the air force; army."]}], "ಫೌಜುದಾರ": [{"type": "noun", "defs": ["the chief of an army.", "a junior officer in the police force."]}], "ಫೌಜುದಾರಿ": [{"type": "noun", "defs": ["an administrative division of a state; a district.", "a court of law where trials are held, criminals are awarded punishments; a criminal court.", "an open, forcible or passive resistence to an authority, administration, etc.; a mutiny; a revolt."]}], "ಫೌಜ್ದಾರ": [{"type": "noun", "defs": ["= ಫೌಜುದಾರ."]}], "ಫ್ಯಾಷನ್ನು": [{"type": "noun", "defs": ["the way in which something is made or done; manner; fashion.", "the current style or mode of dress, speech, conduct, etc.; fashion."]}], "ಫ್ರೋಕ್ತು": [{"type": "noun", "defs": ["= ಫುರೋಕ್ತು."]}], "ಬ": [{"type": "noun", "defs": ["(gen. pronounced with the vowel 'ಅ') the thirty seventh letter of Kannaḍa alphabet and the twenty third consonant.", "(math.) a symbol for the number three."]}], "ಬಂಕ": [{"type": "noun", "defs": ["= ಬಂಕೆ1."]}, {"type": "noun", "defs": ["a position or space beside one; side.", "the state of being near; proximity; nearness; closeness.", "one of the parties in a contest, conflict, etc.; a faction; a side.", "one of the movable feathered or membranous paired appendages by means of which a bird, bat or insect is able to fly.", "an external membranous process of an aquatic animal (as a fish) used in propelling or guiding the body; a fin.", "any of various anatomical structures as of a flying fish or flying lemur providing means of limited flight.", "the period from the day following a full moon-day to new moon-day during which the lighted portion of the moon is gradually reduced to a thin line.", "either side of the stage out of sight of the audience; the side-wing.", "the fleshy side of a person or animal between the ribs and the hip; the flank.", "a set of two things; a pair.", "any of the directions of the compass or the point toward which something faces or the line along which something moves or is moving; a direction."]}, {"type": "noun", "defs": ["a long seat, having four or more legs, for several persons to sit on; a bench.", "a raised platform, adjoining the front portion of the front wall of a house, for people to sit on.", "a structure having a roof resting on poles or pillars, and raised, but level floor."]}], "ಬಂಕಂಗಡಿ": [{"type": "noun", "defs": ["a shop having platforms, attached to the front wall on either side of the entrance."]}], "ಬಂಕಗಾಲು": [{"type": "noun", "defs": ["= ಬಂಕುಡಿಗಾಲು."]}], "ಬಂಕಣ": [{"type": "noun", "defs": ["a small bag or pouch.", "a small pouch having grains, tied to the mouth of a horse.", "a shaped piece of fabric attached inside or outside a garment and forming a pouch used esp. for carrying small articles; a pocket."]}], "ಬಂಕದೆಱೆ": [{"type": "noun", "defs": ["(hist.) a kind of tax."]}], "ಬಂಕಿ": [{"type": "noun", "defs": ["a hook attached to or driven into a wall, wooden pillar, beam, etc. for hanging light objects.", "a kind of curved armlet for the upper arms.", "a hook used in fishing; a fish-hook.", "a kind of angularly curved container for holding perfumes.", "a standard, weight used in weighing perfumes.", "a kind of sickle used by people while splitting bamboos.", "a crooked weapon.", "any small, mechanical device for semi-permanent insertion into the uterus as a contraceptive; a intra-uterine device; a loop."]}], "ಬಂಕು": [{"type": "verb", "defs": ["to become curved, crooked or bent; to bend."]}, {"type": "noun", "defs": ["the quality of state of being crooked; crookedness.", "a steady flow of water (as of a river, stream); a flow.", "the main entrance (of a town, city, etc.).", "a way, path or road.", "an ox with curved horns.", "a loop, ring or other contrivance of metal, wood, leather, etc., suspended from the saddle of a horse to support the rideṛs foot; a stirrup.", "a kind of military weapon."]}], "ಬಂಕುಡಿ": [{"type": "noun", "defs": ["that which is crooked.", "a dagger with a curved blade."]}], "ಬಂಕುಡಿಗಾಲು": [{"type": "noun", "defs": ["a leg that has become crooked as from certain diseases; bow-leg."]}], "ಬಂಕುರು": [{"type": "noun", "defs": ["a kind of fish."]}], "ಬಂಕುಳಿಕಾಲು": [{"type": "noun", "defs": ["= ಬಂಕುಡಿಗಾಲು."]}], "ಬಂಕೆ": [{"type": "noun", "defs": ["a sticky, colloidal carbohydrate found in certain trees and plants, which dissolves in water and used as or in making adhesive; gum.", "a particular kind of gum.", "the rind or peel of fruit."]}, {"type": "noun", "defs": ["= ಬಂಕು2."]}], "ಬಂಕೋಲು": [{"type": "noun", "defs": ["a long shaft attached with a sickle at one end to pluck fruits from a tall tree."]}], "ಬಂಗ": [{"type": "noun", "defs": ["a piece that has come out from the whole; a broken piece or fragment.", "the state of extreme sorrow, pain, anxiety, etc.; physical or mental suffering.", "lack or loss of honour; disgrace; dishonour."]}], "ಬಂಗಡ": [{"type": "noun", "defs": ["the creeper Ipomoea pes-caprae ( = I.biloba) of Convolvulaceae family; goat's foot.", "the plant Operculina turpenthum ( = Ipomoea turpenthum) of the same family; Indian jalap."]}], "ಬಂಗಡೆ": [{"type": "noun", "defs": ["a species of food fish of Arabian sea; Indian mackerel."]}], "ಬಂಗಡ್ಡ": [{"type": "noun", "defs": ["a kind of grass."]}], "ಬಂಗಣ": [{"type": "noun", "defs": ["the medium sized, evergreen tree Carallia lucida ( = C. integirrima) of Rhizophoraceae family."]}], "ಬಂಗರ": [{"type": "noun", "defs": ["= ಬಂಗಾರ."]}, {"type": "noun", "defs": ["the black bumble-bee.", "the act of turning about (vertically on one's central axis), swinging or brandishing.", "(in sword or mace fight) a jumping up and turning in the air, to avoid one's opponent's blow.", "a toy, inversely conical, with a point on which it is made to spin with the help a string or cord; a top.", "a ring-like ornament for the ears.", "the side-lock on either side of the face, between the ears and the cheeks.", "a walking of a horse in a circular manner.", "the tree Ziziphus mauritiana ( = Z. jujuba) of Rhamnaceae family.", "its fruit.", "the medium sized evergreen tree Thespesia populnea of Malvaceae family; Indian tulip.", "(fig.) the male gonad or reproductive gland, either of two oval glands located in the scrotum; testis."]}], "ಬಂಗರಳಿ": [{"type": "noun", "defs": ["the plant (hīla ?)."]}], "ಬಂಗಲೆ": [{"type": "noun", "defs": ["a big house, surrounded by vacant land or garden around it, enclosed by a compound."]}], "ಬಂಗಳಿಚ": [{"type": "noun", "defs": ["(masc.) a native of Bengal, a state in eastern India."]}], "ಬಂಗಾರ": [{"type": "noun", "defs": ["the precious yellow metallic element, highly malleable and ductile, and not subject to oxidation or corrosion (symbol: Au); gold.", "a jar or vase made of gold.", "any golden ornament.", "a term of endearment used in calling children.", "(fig.) an excellent person; a person held in great esteem; a gem.", "any of a group of minerals (complex silicates) that crystallise in tin, somewhat flexible, translucent or coloured, resistant to head and electricity; mica.", "a round ornamental container made of gold; a globe; a bulb.", "a most superior thing.", "ಬಂಗಾರದ ತೊಟ್ಟಿಲಲ್ಲಿ ಹುಟ್ಟಿರು bangārada toṭṭilalli huṭṭiru to possess wealth by birth; to be born with a silver spoon in one's mouth; ಬಂಗಾರದವಳು bangāradavaḷu a concubine (of a king)."]}], "ಬಂಗಾರಕಡ್ಡಿ": [{"type": "noun", "defs": ["= ಬಂಗಾರಸಣ್ಣ."]}], "ಬಂಗಾರಕಾಯಿ": [{"type": "noun", "defs": ["the tree Bixa orellana of Bixaceae family; Chinese dye tree."]}], "ಬಂಗಾರಚೌಕಿ": [{"type": "noun", "defs": ["womeṇs quarters in a palace."]}], "ಬಂಗಾರಸಣ್ಣ": [{"type": "noun", "defs": ["a superior variety of rice."]}], "ಬಂಗಾರಹುಡಿ": [{"type": "noun", "defs": ["the loose, fine particles of gold; gold-powder."]}], "ಬಂಗಾಲ": [{"type": "noun", "defs": ["= ಬಂಗಾಳ."]}], "ಬಂಗಾಲಿ": [{"type": "adjective", "defs": ["= ಬಂಗಾಳಿ1."]}, {"type": "noun", "defs": ["= ಬಂಗಾಳಿ2."]}], "ಬಂಗಾಲಿತನ": [{"type": "noun", "defs": ["= ಬಂಗಾಳಿತನ."]}], "ಬಂಗಾಳ": [{"type": "noun", "defs": ["a former province in Eastern India covering the present West Bengal of India and Bangla Desh, an independent country.", "(mus.) a musical mode in Karnāṭaka system, derived from the main mode Harikāmbhoji."]}], "ಬಂಗಾಳಜಾಲಿ": [{"type": "noun", "defs": ["the acacia tree Acacia auriculiformis of Mimoseae family."]}], "ಬಂಗಾಳಪಚ್ಚೆ": [{"type": "noun", "defs": ["a green or bluish patina formed on copper surfaces exposed to the atmosphere for long periods of time, consisting principally of basic copper sulphate; verdigris."]}], "ಬಂಗಾಳವಿದ್ಯೆ": [{"type": "noun", "defs": ["= ಬಂಗಾಳಿತನ."]}], "ಬಂಗಾಳಿ": [{"type": "adjective", "defs": ["belonging to, is born in, made in Bengal (either West Bengal in India or Bangla Desh)."]}, {"type": "noun", "defs": ["a native of Bengal.", "the language spoken by the people of Bengal.", "the use or practice of tricks or stratagems to deceive; artifice; deception; trickery."]}], "ಬಂಗಾಳಿತನ": [{"type": "noun", "defs": ["the act, tendency or practice of deceiving; artifice; deception; trickery."]}], "ಬಂಗಾಱ": [{"type": "noun", "defs": ["= ಬಂಗಾರ."]}], "ಬಂಗಿ": [{"type": "noun", "defs": ["the hemp plant, Cannabis sativa of Cannabinaceae family; ganja.", "a potion made from the leaves of this plant, such as marijuana and hashish, used to smoke for getting intoxicating effects.", "the tree Thespesia populnea ( = Hibiscus populnea) of malvaceae family; Indian tulip; umbrella tree."]}], "ಬಂಗಿಮುಕ್ಕ": [{"type": "noun", "defs": ["a man addicted to the potion such as marijuana and hashish."]}], "ಬಂಗು": [{"type": "noun", "defs": ["a disease of the skin characterised by black, red and white spots.", "a growth of minute fungi forming on vegetable or animal matter, commonly as a downy or furry coating, and associated with decay or dampness; mould."]}], "ಬಂಗುಡೆ": [{"type": "noun", "defs": ["the sea-fish Indian mackerel, an edible fish, available in plenty in the coasts of Karnāṭaka."]}], "ಬಂಗುರಿಸು": [{"type": "verb", "defs": ["to make a bumbling, buzzing sound."]}], "ಬಂಗ್ಲೆ": [{"type": "noun", "defs": ["= ಬಂಗಲೆ."]}], "ಬಂಚ": [{"type": "noun", "defs": ["all those persons, collectively, considered as descendants of a common progenitor; lineage; family.", "a musical wind instrument, usu. of bamboo, consisting of a tube with a series of finger holes, in which the wind is blown through one hole; a flute."]}], "ಬಂಚನೆ": [{"type": "noun", "defs": ["an act or instance of cheating; deceit."]}], "ಬಂಚರ": [{"type": "noun", "defs": ["a four-stringed, musical instrument, that gives the base pitch."]}], "ಬಂಚಿಸು": [{"type": "verb", "defs": ["to deceive; to cheat; to defraud.", "to keep away from; to avoid."]}], "ಬಂಜ": [{"type": "noun", "defs": ["a man whose testes are incapable of normal reproductive actions."]}], "ಬಂಜಗ": [{"type": "noun", "defs": ["= ಬಂಜ."]}], "ಬಂಜರ": [{"type": "noun", "defs": ["= ಬಂಜರು."]}], "ಬಂಜರು": [{"type": "noun", "defs": ["a tract of land that is unproductive and thus unsuitable for raising crops or any other plants; barren land.", "(fig.) anything that is unproductive or useless;ಬಂಜರಾಗು banjarāgu to become useless, unproductive or useless.", "ಬಂಜರು ಬೀಳು banjaru bīḷu (a tract of land) to become unproductive (being untilled)."]}], "ಬಂಜರುಗಾಡು": [{"type": "noun", "defs": ["= ಬಂಜರು - 1."]}], "ಬಂಜರುಭೂಮಿ": [{"type": "noun", "defs": ["= ಬಂಜರು - 1."]}], "ಬಂಜಾರ": [{"type": "noun", "defs": ["a tribe of wandering people.", "a man belonging to this tribe."]}], "ಬಂಜಾವು": [{"type": "noun", "defs": ["a cow that is incapable of producing a calve; a barren cow."]}], "ಬಂಜು": [{"type": "noun", "defs": ["the quality of being incapable of producing an offspring; barrenness."]}], "ಬಂಜುಗೆಡು": [{"type": "verb", "defs": ["(a tract of land) to become fertile."]}], "ಬಂಜೆ": [{"type": "adjective", "defs": ["incapable of producing an offspring; barren.", "incapable of producing any plant (said of land); barren.", "useless; fruitless.", "incapable of producing results; ineffective."]}, {"type": "noun", "defs": ["that which is barren, sterile.", "the quality or fact of being useless, unproductive or unfruitful.", "a woman who is incapable of giving birth to a child; a barren woman.", "a woman who lacks some essential qualities.", "the climber Momordica dioica of Cucurbitaceae family.", "its bitter fruit; small bitter gourd."]}], "ಬಂಜೆಗೈ": [{"type": "verb", "defs": ["to cause to become useless, fruitless or ineffective."]}], "ಬಂಜೆತನ": [{"type": "noun", "defs": ["the quality of being incapable of producing an offspring; barrenness; sterileness."]}], "ಬಂಜೆವಡಿಸು": [{"type": "verb", "defs": ["= ಬಂಜೆಗೈ."]}], "ಬಂಜೆವಾಗಲ್": [{"type": "noun", "defs": ["= ಬಂಜೆಹಾಗಲ."]}], "ಬಂಜೆವಾಗಲ": [{"type": "noun", "defs": ["= ಬಂಜೆಹಾಗಲ."]}], "ಬಂಜೆವಾತು": [{"type": "noun", "defs": ["empty, useless talk."]}], "ಬಂಜೆಹಾಗಲ": [{"type": "noun", "defs": ["the climber Momordica dioica of Cucurbitaceae family.", "its bitter fruit; small bitter gourd."]}], "ಬಂಟ": [{"type": "noun", "defs": ["a boldly-courageous, brave man.", "a person who serves in an army; a person engaged in military service; a soldier.", "a person employed by another to perform personal and menial duties; a servant.", "a subcaste in the coastal Karnāṭaka, the members of which are engaged mainly in agriculture."]}, {"type": "noun", "defs": ["a man employed in royal courts to herald the titles of a king.", "a man who praises another insincerely, with an intention to get an advantage.", "a learned man; a scholar.", "a man whose profession is worshipping a god in a temple or conducting religious rites.", "a person whose profession is cooking; a cook."]}, {"type": "noun", "defs": ["a variety of horse that is of superior breed."]}], "ಬಂಟತನ": [{"type": "noun", "defs": ["the quality of being bold, brave; bravery; courage.", "the state or quality of being or the duty of, a servant."]}], "ಬಂಟಸಾಮಿ": [{"type": "noun", "defs": ["the chief of a team of persons employed in royal courts whose profession is to herald the title of a king.", "an insincere praiser."]}], "ಬಂಟು": [{"type": "noun", "defs": ["undaunted courage.", "the state or duties of a servant; service.", "a team of guards who are employed for giving personal protection for another person.", "the military force of a nation; an army.", "a servant."]}], "ಬಂಟುಗೆಡು": [{"type": "verb", "defs": ["to become daunted, dismayed; to lose courage."]}], "ಬಂಟುಗೆಯ್": [{"type": "verb", "defs": ["to serve another as a servant."]}], "ಬಂಟುತನ": [{"type": "noun", "defs": ["= ಬಂಟು - 1 & 2."]}], "ಬಂಟೆದೆ": [{"type": "noun", "defs": ["= ಬಂಟು - 1."]}], "ಬಂಟೇಳು": [{"type": "verb", "defs": ["to break away from or rise against constituted authority, as by open rebellion; to revolt; to rebel."]}], "ಬಂಡ": [{"type": "adjective", "defs": ["lacking the sense of shame; shameless; impudent."]}, {"type": "noun", "defs": ["an article of trade or commerce; a commodity.", "a man lacking the sense of shame; a shameless, impudent man.", "a comic performer; a clown; a buffoon.", "the quality or state of being plentiful; plenty; plentifulness."]}, {"type": "adjective", "defs": ["having a defect or flaw; faulty; defective.", "lacking vigour, strength."]}, {"type": "noun", "defs": ["an ox whose tail is cut."]}, {"type": "noun", "defs": ["the fine, soft, curly hair that forms the fleece of sheep; wool."]}, {"type": "noun", "defs": ["the tree Diospyros peregrina ( = D. embryopteris, = D. glutenifera) of Ebenaceae family; river ebony."]}], "ಬಂಡಣ": [{"type": "noun", "defs": ["a hostile encounter or engagement between opposing military forces; battle."]}], "ಬಂಡತನ": [{"type": "noun", "defs": ["the quality of being shameless, impudent; shamelessness; effrontery; impudence."]}], "ಬಂಡಬಾಳು": [{"type": "noun", "defs": ["a living without having self-respect; a deplorably menial life."]}], "ಬಂಡಮಾತು": [{"type": "noun", "defs": ["speech that is devoid of decency, modesty, and propriety."]}], "ಬಂಡಲು": [{"type": "noun", "defs": ["= ಬಂಡಲ್ಲು."]}], "ಬಂಡಲ್ಲು": [{"type": "noun", "defs": ["several objects or a quantity of material gathered or bound together; a bundle.", "a small package of anything; a packet.", "an untenable lie or a set of lies."]}], "ಬಂಡವಲ": [{"type": "noun", "defs": ["= ಬಂಡವಾಳ."]}], "ಬಂಡವಲು": [{"type": "noun", "defs": ["= ಬಂಡವಾಳ."]}], "ಬಂಡವಳ": [{"type": "noun", "defs": ["= ಬಂಡವಾಳ."]}], "ಬಂಡವಳಗಾರ": [{"type": "noun", "defs": ["= ಬಂಡವಾಳಗಾರ."]}], "ಬಂಡವಾಲ": [{"type": "noun", "defs": ["= ಬಂಡವಾಳ."]}], "ಬಂಡವಾಲಶಾಹಿ": [{"type": "noun", "defs": ["= ಬಂಡವಾಳಶಾಹಿ."]}], "ಬಂಡವಾಳ": [{"type": "noun", "defs": ["any form of wealth employed or capable of being employed in the production of more wealth; capital.", "assets remaining after deduction of liabilities; the net worth of a business; capital.", "monetary or material worth, as in commerce or trade; value.", "relative worth, merit, value or importance.", "the collective wealth of a country or its means of producing wealth; resources.", "ಬಂಡವಾಳವಿಲ್ಲದ ಬಡಾಯಿ baṇḍavāḷavillada baḍāyi vanity without having merit or value."]}], "ಬಂಡವಾಳಗಾರ": [{"type": "noun", "defs": ["a man who has invested capital in a business enterprise; an investor; a capitalist."]}], "ಬಂಡವಾಳಗಾರಿಕೆ": [{"type": "noun", "defs": ["the entrepreneurship of a person who invests money and other assets in a business enterprise.", "an economic system in which investment in, and ownership of, the means of production, distribution, and exchange of wealth is made and maintained chiefly by private individuals or corporations, esp. as contrasted to cooperatively or state-owned means of wealth; capitalism."]}], "ಬಂಡವಾಳದಾರ": [{"type": "noun", "defs": ["= ಬಂಡವಾಳಗಾರ."]}], "ಬಂಡವಾಳಶಾಹಿ": [{"type": "noun", "defs": ["= ಬಂಡವಾಳಗಾರ.", "capitalists as a group or class (as distinguished from labour).", "the control, influence that this class exercises on economy of a nation.", "a person who advocates capitalism in the economy of a nation and supports investors and capitalists."]}], "ಬಂಡವಾಳಿಗ": [{"type": "noun", "defs": ["= ಬಂಡವಾಳಗಾರ."]}], "ಬಂಡವಾಳು": [{"type": "noun", "defs": ["= ಬಂಡವಾಳ."]}], "ಬಂಡಸಾಲೆ": [{"type": "noun", "defs": ["a building or a part of one, for the storage of goods, merchandise, etc.; a warehouse.", "a large building."]}], "ಬಂಡಳಿಸು": [{"type": "verb", "defs": ["to repeat, re-utter several times needlessly what is once said."]}], "ಬಂಡಾಟ": [{"type": "noun", "defs": ["shame; embarrassment; humiliation.", "shameless, impudent behaviour.", "a striving or struggling hard to achieve something."]}], "ಬಂಡಾಡು": [{"type": "verb", "defs": ["(honey, nectar) to flow out."]}, {"type": "verb", "defs": ["to resist or rise against some authority, control or tradition; to revolt; to rebel."]}], "ಬಂಡಾಯ": [{"type": "noun", "defs": ["open organised, and armed resistance to one's government or ruler.", "resistance to or defiance of any authority, control or tradition."]}], "ಬಂಡಾಯಗಾರ": [{"type": "noun", "defs": ["a man who refuses allegiance to, resists or rises in arms against the government or ruler of his country; a rebel.", "a man who resists any authority, control, system or tradition; a rebel.", "a man who advocates, struggles and supports radical change in society, literary or art systems, etc."]}], "ಬಂಡಾಯಗಾರ್ತಿ": [{"type": "noun", "defs": ["a woman who refuses allegiance to, resists or rises in arms against the government or ruler of her country; a rebel.", "a woman who resists any authority, control, system or tradition; a rebel.", "a woman who advocates, struggles and supports radical change in society, literary or art systems, etc."]}], "ಬಂಡಾಯಸಾಹಿತಿ": [{"type": "noun", "defs": ["a writer who rebels against romanticism, idealism etc. and who advocates that change for the better in the society can be brought by portraying in literature the actual wretchedness of the downtrodden."]}], "ಬಂಡಾಯಸಾಹಿತ್ಯ": [{"type": "noun", "defs": ["literature produced by writers who are bound by the idea that welfare of the downtrodden people in the society can be achieved by revolting against the dull, unpromising establishment in the literature."]}], "ಬಂಡಾರ": [{"type": "noun", "defs": ["a place where the funds of the government, of a corporation or the like are deposited, kept, and disbursed; a treasury.", "a steel or iron box or repository for money, jewels, papers, etc.; a safe; a locker.", "turmeric powder, saffron powder, etc. used in worshipping deities as Khaṇḍōbā, Yellamma, etc. given to devotees, which is regarded as prasada (having the grace of the deity).", "the yellow, principal substance of an egg, as distinguished from the white substance, albumen; yolk."]}], "ಬಂಡಾರಿ": [{"type": "noun", "defs": ["the chief officer of a government treasury.", "a temple servant of certain class."]}], "ಬಂಡಾರಿಗ": [{"type": "noun", "defs": ["= ಬಂಡಾರಿ - 1."]}], "ಬಂಡಾರಿಸು": [{"type": "verb", "defs": ["to put (a sword, dagger, etc.) into a sheath; to sheathe.", "(a sword, dagger, etc.) to be sheathed.", "(fig.) to be of no practical use; to become useless.", "to cause to shrink, contract in size."]}], "ಬಂಡಾರೆ": [{"type": "noun", "defs": ["= ಬಂಡಾರಿ."]}], "ಬಂಡಾಱ": [{"type": "noun", "defs": ["= ಬಂಡಾರ."]}], "ಬಂಡಾಱಕಾಱ": [{"type": "noun", "defs": ["= ಬಂಡಾರಿ - 1."]}], "ಬಂಡಿ": [{"type": "noun", "defs": ["a vehicle, usu. having two wheels, drawn by animals, used for carrying burdens.", "a light, two-wheeled vehicle for one or two persons, drawn by a horse or horses; a chariot.", "a vehicle in general.", "a wheel."]}, {"type": "noun", "defs": ["an upper garment of men, having sleeves, and covering from shoulder to the waist."]}], "ಬಂಡಿಊಬಿನಹುಲ್ಲು": [{"type": "noun", "defs": ["the grass Aritia adscenscionis of Poaceae family."]}], "ಬಂಡಿಕಾರ": [{"type": "noun", "defs": ["a man who drives a cart or chariot.", "the supervisor of a temple car."]}], "ಬಂಡಿಕಾಱ": [{"type": "noun", "defs": ["= ಬಂಡಿಕಾರ."]}], "ಬಂಡಿಬಸವ": [{"type": "noun", "defs": ["an idol of a bull, having wheels, used by children as a toy.", "any mollusk of the class Gastropoda, having a spirally coiled shell and a ventral muscular foot on which it slowly glides about; a snail."]}], "ಬಂಡಿಬೋವ": [{"type": "noun", "defs": ["= ಬಂಡಿಕಾರ - 1."]}], "ಬಂಡಿಮಾಳ": [{"type": "noun", "defs": ["a place earmarked for parking carts or chariots."]}], "ಬಂಡಿವರಿಯಿಸು": [{"type": "verb", "defs": ["to drive a cart or chariot."]}], "ಬಂಡಿಹೋಕ": [{"type": "noun", "defs": ["a man who travels in a cart."]}], "ಬಂಡು": [{"type": "adjective", "defs": ["soft and wet; boggy; marshy."]}, {"type": "noun", "defs": ["wet an slimy soil; mire.", "the matter that settles to the bottom of a liquid; lees; dregs; sediment.", "a liquid having the solid particles being disintegrated and evenlyand thickly distributed all over a liquid but not dissolved in it."]}, {"type": "noun", "defs": ["the saccharine secretion of a plant, which attracts the insects or birds that pollinate the flower; nectar."]}, {"type": "adjective", "defs": ["lacking a sense of shame; hameless; immodest.", "causing shame or disgrace; shameful; disgraceful."]}, {"type": "noun", "defs": ["the quality of being shameless, impudent; shamelessness; immodesty.", "shameless, immodest behaviour.", "the condition of a person striving hard against adversities, difficult and unfavourable situation to achieve the goal.", "a shameless, immodest woman."]}, {"type": "noun", "defs": ["forcible or passive resistance to lawful authority; mutiny.", "a concerted revolt against discipline or a superior officer; rebellion.", "an impediment; an obstacle."]}], "ಬಂಡುಕೋರ": [{"type": "adjective", "defs": ["defying or resisting some established authority, government or tradition; insubordinate; inclined to rebel; rebellious.", "pertaining to or characteristic of rebels or rebellion; rebellious."]}, {"type": "noun", "defs": ["= ಬಂಡಾಯಗಾರ."]}], "ಬಂಡುಖೋರ": [{"type": "adjective", "defs": ["= ಬಂಡುಕೋರ1."]}, {"type": "noun", "defs": ["= ಬಂಡಾಯಗಾರ."]}], "ಬಂಡುಗ": [{"type": "noun", "defs": ["= ಬಂಡಾಯಗಾರ."]}], "ಬಂಡುಗಟ್ಟು": [{"type": "verb", "defs": ["= ಬಂಡೇಳು."]}], "ಬಂಡುಗಾರ": [{"type": "noun", "defs": ["= ಬಂಡಾಯಗಾರ."]}], "ಬಂಡುಗಾರಿಕೆ": [{"type": "noun", "defs": ["the quality, tendency of a person to raise against or resist some authority, control or tradition.", "an instance of raising against or resisting some authority, conrol or tradition."]}], "ಬಂಡುಗೆಡೆ": [{"type": "verb", "defs": ["to talk immodestly or lacking a sense of shame."]}], "ಬಂಡುಗೆಯ್": [{"type": "verb", "defs": ["= ಬಂಡೇಳು."]}], "ಬಂಡುಗೆಲೆ": [{"type": "verb", "defs": ["= ಬಂಡುಗೆಡೆ."]}], "ಬಂಡುಣ್": [{"type": "verb", "defs": ["(a bee) to drink the nectar of flowers."]}], "ಬಂಡುಣಿ": [{"type": "noun", "defs": ["that whose food is the nectar of flowers; a honey-bee."]}], "ಬಂಡುಣಿಸು": [{"type": "noun", "defs": ["nectar, as the food (of bees)."]}], "ಬಂಡುಬಾಳು": [{"type": "noun", "defs": ["= ಬಂಡಬಾಳು."]}], "ಬಂಡುವಾತು": [{"type": "noun", "defs": ["a speech, word or words uttered without a sense of shame."]}], "ಬಂಡುವೋಗು": [{"type": "verb", "defs": ["to feel shame; to be distressed or embarrassed by feelings of guilt, foolishness or disgrace; to be ashamed."]}], "ಬಂಡೂಲ": [{"type": "noun", "defs": ["the plant Nicandra physalodes of Solanaceae family."]}], "ಬಂಡೆ": [{"type": "noun", "defs": ["a large, detached rock."]}, {"type": "noun", "defs": ["a shameless, impudent or unchaste woman."]}, {"type": "noun", "defs": ["= ಬಂಡ5."]}], "ಬಂಡೆಕಲ್ಲು": [{"type": "noun", "defs": ["= ಬಂಡೆ1."]}], "ಬಂಡೆಗಲ್ಲು": [{"type": "noun", "defs": ["= ಬಂಡೆ1."]}], "ಬಂಡೆಬ್ಬಿಸು": [{"type": "verb", "defs": ["to cause (people or a group of persons) rise against or resist some authority, control or tradition."]}], "ಬಂಡೇಳು": [{"type": "verb", "defs": ["to resist or rise against some authority, control or tradition; to revolt; to rebel."]}], "ಬಂತಲೆ": [{"type": "noun", "defs": ["the large-sized, evergreen tree Alstonia scholaris of Apocynaceae family, whose wood is soft, used for making black boards to write on."]}], "ಬಂತಿ": [{"type": "noun", "defs": ["a number of people or things arranged so as to form a line; a row; a file.", "people sitting down in a row taking meals.", "a group, flock, herd, multitude or troop.", "the act of succeeding or coming after another in order or sequence; succession.", "any of a series of such horizontal lines in parallel, as of seats in a theater or airplane, corn in a field, etc.", "a row of written or printed characters extending across or part way across a page; a line.", "a number of cattle tied one by the side of the other, that are made to go round and round a pole on the threshed crops (as paddy) to separate remaining grains."]}], "ಬಂತಿಗಟ್ಟು": [{"type": "verb", "defs": ["(a large number of persons) to stand in a line; to form a queue.", "to come together in a large group."]}], "ಬಂದ್": [{"type": "noun", "defs": ["= ಬಂದು1."]}], "ಬಂದ": [{"type": "noun", "defs": ["= ಬಂದು1."]}, {"type": "noun", "defs": ["the tree Diospyros peregrina ( = D. Glutenifera) of Ebenaceae family."]}], "ಬಂದಂಬಿಡು": [{"type": "verb", "defs": ["to detatch oneself from the worldly passions, attachments; to become dispassionate."]}], "ಬಂದಣಿಕೆ": [{"type": "noun", "defs": ["a plant that lives on or in another plant and obtains nutriment from the later.", "the plant Dendrophthoe falcata ( = Loranthus longiflorus) of Loranthaceae family.", "the plant Loranthus longiflorus of Loranthaceae family.", "another plant Viscum orientale of the same family.", "the plant Dodonaea viscosa of Sapindaceae family.", "the plant Vanda tessellata ( = V. roxburghii, = Epidendrum tesseloides) of Orchidaceae family.", "creeper Cuscuta feflexa of Convulvaceae family.", "the plant Elytranthe parasitica ( = E. loiceroides ) of Lorathaceae faily.", "(fig.) a person who receives support, advantage or the like, from another or others without giving any useful or proper return, as one who lives on the hospitality of others."]}], "ಬಂದಣಿಗೆ": [{"type": "noun", "defs": ["= ಬಂದಣಿಕೆ."]}], "ಬಂದನಿಕೆ": [{"type": "noun", "defs": ["= ಬಂದಣಿಕೆ."]}], "ಬಂದನಿಕ್ಕಿ": [{"type": "noun", "defs": ["= ಬಂದಣಿಕೆ."]}], "ಬಂದಮಿಣಿ": [{"type": "noun", "defs": ["a piece of rope or cord used to tie to one's legs while climbing areca coconut trees."]}], "ಬಂದರಿ": [{"type": "noun", "defs": ["= ಬಂದಾರಿ."]}], "ಬಂದರಿಕೆ": [{"type": "noun", "defs": ["= ಬಂದಣಿಕೆ."]}], "ಬಂದರು": [{"type": "noun", "defs": ["a place where ships load or unload; a port.", "a place along a coast in which ships may take refuge from storms; harbor."]}], "ಬಂದರೆ": [{"type": "noun", "defs": ["= ಬಂದಾರಿ."]}], "ಬಂದಲಿಕೆ": [{"type": "noun", "defs": ["= ಬಂದಣಿಕೆ."]}], "ಬಂದಳ": [{"type": "noun", "defs": ["a wide mouthed container."]}], "ಬಂದಳಿಕೆ": [{"type": "noun", "defs": ["= ಬಂದಣಿಕೆ."]}], "ಬಂದಾ": [{"type": "noun", "defs": ["a monetary note or coin (as distinguished from monetary notes or coins that are of smaller denominations)."]}], "ಬಂದಾರಿ": [{"type": "noun", "defs": ["= ಬಂದಣಿಕೆ - 5.", "the tree Hymenodictyon excelsum of Rubiaceae family.", "the plant Pentapetes phoenicia of Sterculiaceae family."]}], "ಬಂದಾರಿಕೆ": [{"type": "noun", "defs": ["= ಬಂದಣಿಕೆ."]}], "ಬಂದಿ": [{"type": "noun", "defs": ["the condition of confining or being confined in a prison; imprisonment.", "a building for the confinement of persons held while awaiting trial, persons sentenced after conviction, etc.; prison; jail.", "check; control; restraint.", "a person imprisoned.", "he who arrests, imprisons or restricts the movement of, another.", "an obstacle; a check; an impediment.", "the act of looting or plundering.", "a kind of curved armlet for the upper arms.", "a kind of necklace."]}, {"type": "noun", "defs": ["a man appoined in a royal court for proclaiming and heralding the titles of a king.", "the profession of that man.", "a man who praises another unduly.", "the act of praising, lauding (unduly)."]}], "ಬಂದಿಕಾಯಿ": [{"type": "noun", "defs": ["the tree Memecylon amplexicaule of Melastomataceae family; bilberry tree.", "its berry.", "another tree Memecylon malabaricum of the same family."]}], "ಬಂದಿಕಾರ": [{"type": "noun", "defs": ["a person who captures, arrests or confines another or others in a prison.", "a man who loots, plunders.", "the superintendent of a jail.", "a man who steals; a thief."]}], "ಬಂದಿಕಾಱ": [{"type": "noun", "defs": ["= ಬಂದಿಕಾರ."]}], "ಬಂದಿಕಾಱತನ": [{"type": "noun", "defs": ["the tendency of a person capturing others and confining in jails."]}], "ಬಂದಿಕೋಲು": [{"type": "noun", "defs": ["a kind of cudgel used by wrestlers and gymnasts.", "(dial.) a stick held by the impersonator of Kallurti Bhūta, a demi-god."]}], "ಬಂದಿಖಾನ": [{"type": "noun", "defs": ["= ಬಂದೀಖಾನೆ."]}], "ಬಂದಿಖಾನೆ": [{"type": "noun", "defs": ["= ಬಂದೀಖಾನೆ."]}], "ಬಂದಿಗಟ್ಟಿಸು": [{"type": "verb", "defs": ["to make the bridegroom to tie a tāḷi, a small and round gold ornament, round the neck of the bride as a symbol of marriage."]}], "ಬಂದಿಗಟ್ಟು": [{"type": "verb", "defs": ["(the bridegroom) to tie a tāḷi , a small and round gold ornament, round the neck of the bride, in the marriage."]}], "ಬಂದಿಗಾಱ": [{"type": "noun", "defs": ["= ಬಂದಿಕಾರ."]}], "ಬಂದಿಗೃಹ": [{"type": "noun", "defs": ["= ಬಂದೀಖಾನೆ."]}], "ಬಂದಿಗೆ": [{"type": "noun", "defs": ["the handle of a weapon.", "a weapon having a handle."]}], "ಬಂದಿಗೆಕೋಲು": [{"type": "noun", "defs": ["= ಬಂದಿಕೋಲು - 2.", "a weapon having a handle."]}], "ಬಂದಿಗೊಳ್": [{"type": "verb", "defs": ["= ಬಂದಿಸು2."]}], "ಬಂದಿಗೊಳಿಸು": [{"type": "verb", "defs": ["= ಬಂದಿಸು2."]}], "ಬಂದಿಗೋಲ್": [{"type": "noun", "defs": ["= ಬಂದಿಕೋಲು."]}], "ಬಂದಿಗ್ರಹಣ": [{"type": "noun", "defs": ["the act or an instance of capturing, arresting or imprisoning."]}], "ಬಂದಿನಿ": [{"type": "noun", "defs": ["a female prisoner."]}], "ಬಂದಿವಡು": [{"type": "verb", "defs": ["to be arresed; to be jailed, imprisoned."]}], "ಬಂದಿವನೆ": [{"type": "noun", "defs": ["= ಬಂದೀಖಾನೆ."]}], "ಬಂದಿವರ್": [{"type": "verb", "defs": ["= ಬಂದಿವಡು."]}], "ಬಂದಿವಾನ": [{"type": "noun", "defs": ["= ಬಂದೀವಾನ."]}], "ಬಂದಿವಾೞ್": [{"type": "verb", "defs": ["to be in a prison."]}], "ಬಂದಿವಾೞ್ಗೆ": [{"type": "noun", "defs": ["the life of a prisoner or the fact of being in a jail."]}], "ಬಂದಿವಿಡಿ": [{"type": "verb", "defs": ["= ಬಂದಿಸು2.", "to loot; to plunder."]}], "ಬಂದಿವಿಡಿಹ": [{"type": "noun", "defs": ["the act or an instance of capturing, imprisoning."]}], "ಬಂದಿಶಾಲೆ": [{"type": "noun", "defs": ["= ಬಂದೀಖಾನೆ."]}], "ಬಂದಿಸು": [{"type": "verb", "defs": ["to express one's deep respect to; to pay obeisance."]}, {"type": "verb", "defs": ["to arrest and take into one's custody; to confine (another) in a jail."]}], "ಬಂದಿಹಿಡಿ": [{"type": "verb", "defs": ["= ಬಂದಿವಿಡಿ."]}], "ಬಂದಿಹೊಗು": [{"type": "verb", "defs": ["to be arrested; to be imprisoned."]}], "ಬಂದೀಕರಣ": [{"type": "noun", "defs": ["the act of capturing or imprisoning."]}], "ಬಂದೀಕರಿಸು": [{"type": "verb", "defs": ["= ಬಂದಿಸು2."]}], "ಬಂದೀಖಾನೆ": [{"type": "noun", "defs": ["a building for the confinement of persons held while awaiting trial, persons sentenced after conviction, etc.; a jail; a prison."]}], "ಬಂದೀವಾನ": [{"type": "noun", "defs": ["a man imprisoned."]}], "ಬಂದೀವಾಸ": [{"type": "noun", "defs": ["a being in a jail; the condition of being a prisoner."]}], "ಬಂದು": [{"type": "noun", "defs": ["the condition of being a prisoner; imprisonment.", "a ring-shaped metal device that can be locked around a person's wrist, usu. one of a pair connected by a short chain or linked bar; shackles; handcuffs.", "the act of closing or being closed; closure.", "suspension of work until an employer, industry or government meets certain demands; strike.", "the condition of being attached (as by interest, relation, family or other emotional ties, etc.); attachment.", "that which is bound.", "a slightly raised ridge that demarcates the land belonging to one from the one one belonging to another.", "a boundary (of any kind)."]}, {"type": "noun", "defs": ["the shrub Coffea arabica of Rubiaceae family; coffee plant."]}], "ಬಂದುಕ": [{"type": "noun", "defs": ["a man who habitually cheats, deceives others.", "a man who teaches or instructs; a teacher."]}], "ಬಂದುಕಟ್ಟು": [{"type": "noun", "defs": ["the state of being compactly and neatly arranged; compactness; neatness; tidiness.", "any rigid system of social conditions, as casteism.", "an ordered and comprehensive assemblage of principles, doctrines, regulations, etc. made with a view to having a disciplined orderly society."]}], "ಬಂದುಗೆ": [{"type": "noun", "defs": ["the plant Taxillus cuneatus ( =Loranthus cuneatus) of Loranthaceae family.", "the plant Loranthus longiflorus of the same family."]}], "ಬಂದುರೆ": [{"type": "noun", "defs": ["= ಬಂದಾರಿ."]}], "ಬಂದುವೆ": [{"type": "noun", "defs": ["= ಬಂದಾರಿ."]}], "ಬಂದೂಕ": [{"type": "noun", "defs": ["= ಬಂದುಗೆ."]}, {"type": "noun", "defs": ["= ಬಂದೂಕು."]}], "ಬಂದೂಕು": [{"type": "noun", "defs": ["a shoulder firearm with spiral grooves cut in the inner surface of the gun barrel to give the bullet a rotatory motion and thus a more precise trajectory; a rifle."]}], "ಬಂದೂಖು": [{"type": "noun", "defs": ["= ಬಂದೂಕು."]}], "ಬಂದೆ": [{"type": "noun", "defs": ["= ಬಂದುಗೆ - 2."]}], "ಬಂದೋಬಸ್ತ್": [{"type": "noun", "defs": ["= ಬಂದೋಬಸ್ತು."]}], "ಬಂದೋಬಸ್ತಿ": [{"type": "noun", "defs": ["= ಬಂದೋಬಸ್ತು."]}], "ಬಂದೋಬಸ್ತು": [{"type": "noun", "defs": ["a condition in which each thing is properly disposed with reference to other things and to its purpose; methodical or harmonious arrangement; an order; a system.", "mainenance of the defence system (at individuaḷs level or in the society as a whole); a guarding."]}], "ಬಂಧ": [{"type": "noun", "defs": ["the state of being bound, tied or fastened.", "a rope or cord (used to to bind something).", "handcuffs or shackles.", "a strip of cloth or other material used to bind up a wound, sore, sprain, etc.; bandage.", "a depositing of an article for the payment of debt or fulfilment of a promise; pledging.", "the act of arresting or imprisoning.", "the act of joining two or more things together.", "an instance of this.", "that which is united.", "that which is solid (as distinguished from being loose and liquid).", "a composing of a literary work (as an essay, poetry, etc.).", "the district or region that lies along the border.", "the plant Breynia rhamonoides of Euphorbiaceae family.", "another tree Bridelia hamiltoniana of the same family.", "another tree Bridelia montana of the same family.", "the tree Diospyros peregrina of Ebenaceae family.", "the mundane, worldly attachments."]}], "ಬಂಧಕ": [{"type": "adjective", "defs": ["seizing; grasping; holding; catching.", "obstructing; impeding; hindering."]}, {"type": "noun", "defs": ["the act of catching, imprisoning, etc.", "the condition of being tied, fastened.", "he who seizes, captures or imprisons.", "a raised mound along a water body, checking the flow of water; a bank.", "a water tank.", "a depositing of an article as a security for the payment of debt or fulfilment of a promise; pledging."]}], "ಬಂಧಕಿ": [{"type": "noun", "defs": ["a prostitute; a whore; a harlot.", "a barren woman.", "a female elephant."]}], "ಬಂಧತಂತ್ರ": [{"type": "noun", "defs": ["a military force consisting of chariots, elephants, cavalry and infantry."]}], "ಬಂಧನ": [{"type": "adjective", "defs": ["binding; restrictive.", "opposing; resisting."]}, {"type": "noun", "defs": ["a tying or being tied.", "a building for confining undertrials and criminals sentenced after conviction; a jail; a prison.", "the condition of being confined (in or as in a jail).", "a rope, cord, chair, band or strip as a means for binding.", "the act of capturing, seizing, arresting or imprisoning.", "a control, check or restraint.", "the way in which something is composed, constructed or formed.", "(phil.) the worldly passions or attachments that bind the soul to the mundane life."]}], "ಬಂಧನಕಾರಿ": [{"type": "adjective", "defs": ["binding; seizing; fastening.", "restrictive; checking; restraining."]}, {"type": "noun", "defs": ["that which causes (something) to be bound, seized, confined."]}], "ಬಂಧನಗೊಳಿಸು": [{"type": "verb", "defs": ["to fasten together."]}], "ಬಂಧನಾಗಾರ": [{"type": "noun", "defs": ["a building for the confinement of persons held while awaiting trial, persons sentenced after conviction, etc.; a jail; a prison."]}], "ಬಂಧನಿ": [{"type": "noun", "defs": ["the condition of being bound, tied.", "a means by which something is bound or tied, as a rope, cord, chain, fetters, etc."]}], "ಬಂಧಮೋಚನ": [{"type": "noun", "defs": ["a being freed from confinement, imprisonment, attachments, etc.", "(jain.) a mystic art of getting oneself freed from confinement, imprisonment etc."]}], "ಬಂಧಮೋಚನಿ": [{"type": "noun", "defs": ["= ಬಂಧಮೋಚನ - 2."]}], "ಬಂಧವಿದ": [{"type": "noun", "defs": ["a man who designs or manufactures ornaments."]}], "ಬಂಧವಿಮೋಚಿನಿ": [{"type": "noun", "defs": ["= ಬಂಧಮೋಚನ - 2."]}], "ಬಂಧಸ್ತಂಭ": [{"type": "noun", "defs": ["a pillar to which an elephant is tied."]}], "ಬಂಧಾಬಂಧಿ": [{"type": "noun", "defs": ["a particular mode in wrestling."]}], "ಬಂಧಿತ": [{"type": "adjective", "defs": ["bound; tied.", "arrested; jailed; imprisoned."]}, {"type": "noun", "defs": ["that which is bound, tied or bundled.", "a man who is arrested or imprisoned."]}], "ಬಂಧಿತೆ": [{"type": "noun", "defs": ["a woman who is arrested or imprisoned."]}], "ಬಂಧಿಸು": [{"type": "verb", "defs": ["to bind, fasten or attach with a cord, string or the like, drawn together and knotted; to tie.", "to put handcuffs on; to shackle.", "to fasten together.", "to construct; to build.", "to close (a door, window panel, etc.)."]}], "ಬಂಧಿಸ್ತ": [{"type": "noun", "defs": ["= ಬಂದೋಬಸ್ತು - 2."]}], "ಬಂಧು": [{"type": "noun", "defs": ["the relation that exists between two persons connected by blood or marriage.", "a person as related to another by blood or marriage.", "a friend.", "another tree Bridelia montana of the same family.", "(astrol.) the fourth house from one's birth house, in the zodiac chart."]}], "ಬಂಧುಕೃತ್ಯ": [{"type": "noun", "defs": ["the obligation one owes towards his or her relations."]}], "ಬಂಧುಜನ": [{"type": "noun", "defs": ["collectively, one's relations."]}], "ಬಂಧುಜೀವ": [{"type": "noun", "defs": ["= ಬಂಧುಜೀವಕ."]}], "ಬಂಧುಜೀವಕ": [{"type": "noun", "defs": ["the plant Pentapetes phoenicia of Sterculiaceae family."]}], "ಬಂಧುತನ": [{"type": "noun", "defs": ["= ಬಂಧು - 1."]}], "ಬಂಧುತೆ": [{"type": "noun", "defs": ["= ಬಂಧು - 1.", "collectively, one's relations."]}], "ಬಂಧುತ್ವ": [{"type": "noun", "defs": ["= ಬಂಧು - 1."]}], "ಬಂಧುರ": [{"type": "adjective", "defs": ["undulating; uneven.", "bent; curved; crooked.", "pleasant, beautiful; charming.", "causing pain or injury; injurious; painful."]}, {"type": "noun", "defs": ["the quality or condition of being crooked, curved; curvedness; crookedness.", "the quality of being charming.", "the heron Ardea nivea of Ardeidae family.", "the place where the charioteer sits while driving a chariot.", "the plant Pentapetes phoenicia of Sterculiaceae family."]}], "ಬಂಧುರತೆ": [{"type": "noun", "defs": ["the quality of being beautiful, lovely; charmingness; beautifulness; loveliness."]}], "ಬಂಧುರವಡೆ": [{"type": "verb", "defs": ["to become beautiful, charming."]}], "ಬಂಧುರವಿಡಿ": [{"type": "verb", "defs": ["= ಬಂಧುರವಡೆ."]}], "ಬಂಧುರಿತ": [{"type": "adjective", "defs": ["bent; bowed.", "curved; crooked."]}], "ಬಂಧುರೆ": [{"type": "noun", "defs": ["a beautiful, charming woman."]}], "ಬಂಧುಲ": [{"type": "adjective", "defs": ["= ಬಂಧುರ1 - 2 & 3"]}, {"type": "noun", "defs": ["a man born of illicit sexual relation between a man and a woman.", "an attendant of a prostitute.", "the plant Tolypanthus lagenifer ( = Loranthus langeniferus) of Loranthaceae family."]}], "ಬಂಧುವರ್ಗ": [{"type": "noun", "defs": ["collectively, one's relations."]}], "ಬಂಧುಸ್ಥಾನ": [{"type": "noun", "defs": ["(astrol.) the fourth house from one's birth house, in the zodiac chart."]}], "ಬಂಧುಹನನ": [{"type": "noun", "defs": ["the killing of one's own relations."]}], "ಬಂಧುಳ": [{"type": "adjective", "defs": ["= ಬಂಧುರ1 - 2 & 3"]}, {"type": "noun", "defs": ["= ಬಂಧುಲ2."]}], "ಬಂಧುಳು": [{"type": "noun", "defs": ["= ಬಂಧೂಕ."]}], "ಬಂಧೂಕ": [{"type": "noun", "defs": ["the plant Taxillus cuneatus ( =Loranthus cuneatus) of Loranthaceae family.", "the plant Loranthus longiflorus of the same family."]}], "ಬಂಪು": [{"type": "noun", "defs": ["a slimy and sticky vegetable substance used as soap.", "anything that which is viscous."]}, {"type": "noun", "defs": ["a species of fish."]}], "ಬಂಬಣ": [{"type": "adverb", "defs": ["excessively; in a very high degree or to a great exent."]}], "ಬಂಬಲ್": [{"type": "noun", "defs": ["= ಬಂಬಲು1."]}, {"type": "adverb", "defs": ["= ಬಂಬಲ."]}], "ಬಂಬಲ": [{"type": "adverb", "defs": ["excessively; in a very high degree or to a great exent."]}], "ಬಂಬಲಿಸು": [{"type": "verb", "defs": ["to come together in a large number; to crowd; to throng.", "to spread oneself over (a wide area); to become stretched or exvÀended."]}], "ಬಂಬಲು": [{"type": "noun", "defs": ["a large number of people, animals or things being together; a group; a multitude; a crowd.", "a heap of things; a pile.", "a bunch of flowers, leaves, etc.", "rapidity in moving, going, traveling, proceeding or performing; swiftness; speed."]}, {"type": "noun", "defs": ["a thin, sweet meat that lines the inside of a tender coconut."]}], "ಬಂಬಲ್ಗೊಳ್": [{"type": "verb", "defs": ["to come together in a large number; to throng; to crowd."]}], "ಬಂಬಲ್ದಗುಳ್": [{"type": "verb", "defs": ["to become dense, thick."]}], "ಬಂಬಲ್ವರಿ": [{"type": "verb", "defs": ["to run, flow forcefully, vehemently."]}], "ಬಂಬಲ್ವರಿಗೊಳ್": [{"type": "verb", "defs": ["= ಬಂಬಲ್ವರಿ."]}], "ಬಂಬಲ್ವರಿಯಿಸು": [{"type": "verb", "defs": ["to cause to run, flow forcefully or vehemently."]}], "ಬಂಬಳ": [{"type": "adverb", "defs": ["= ಬಂಬಲ."]}], "ಬಂಬಳಿಸು": [{"type": "verb", "defs": ["= ಬಂಬಲಿಸು."]}], "ಬಂಬಾಳ": [{"type": "noun", "defs": ["intense light that overpowers or dims the vision; dazzling light.", "a source of such a light."]}], "ಬಂಬು": [{"type": "noun", "defs": ["a tall, hollow stem of the grasses of the genus Bambusa; a bamboo."]}, {"type": "noun", "defs": ["a tube or pipe.", "a device used to produce a long whistle-like sound, by blowing compressed air, steam, etc., through a narrow nozzle; a siren.", "a large kettle or boiler; a cauldron."]}], "ಬಂಬುಚ್ಚು": [{"type": "noun", "defs": ["= ಬಂಬೂಚು."]}], "ಬಂಬೂಚು": [{"type": "noun", "defs": ["an insect that infects paddy and vegetable plants."]}], "ಬಂಬೂಲ": [{"type": "noun", "defs": ["the medium-sized, evergreen tree of Australian origin, Acaciaa auriculiformnis of Mimoseae family."]}], "ಬಂಭರ": [{"type": "noun", "defs": ["any bee that collects and stores honey, esp. Apis mellifera; a honey bee."]}], "ಬಂಭ್ರಮಿಸು": [{"type": "verb", "defs": ["to turn around, spin or rotate rapidly; to whirl."]}], "ಬಂಹಿಮ": [{"type": "noun", "defs": ["muchness; abundance; multitude."]}], "ಬಕ": [{"type": "noun", "defs": ["any of several white herons of Ardeidae family, that have long, slender legs, graceful plumes, etc.; an egret.", "a deceitful person.", "the plant Agati grandiflora of Leguminosae family.", "a vessel, commonly a glass bulb with a long neck bent downward, used for distilling or decomposing substances by heat; a retort.", "an airtight, usu. cylindrical vessel of fire clay or iron, used in the destructive distillation chiefly of coal and wood in the manufacture of illuminating gas; a retort."]}], "ಬಕಗ್ರೀವ": [{"type": "noun", "defs": ["one of the marks used to indicate the beginning and end of a quotation, as “at the beginning and” at the end; a quotation mark; inverted comma."]}], "ಬಕತರ": [{"type": "noun", "defs": ["armour of iron netting."]}], "ಬಕಧ್ಯಾನ": [{"type": "noun", "defs": ["pretentious or ostentatious saintliness or piety (assumed with an intent of cheating others)."]}], "ಬಕಬಂಧನ": [{"type": "noun", "defs": ["a useless, unfruitful effort."]}]}