{"ಗೌಡುಂಕೆ": [{"type": "noun", "defs": ["= ಗೌಡುಂಬಳಿ."]}], "ಗೌಡುಂಬಳಿ": [{"type": "noun", "defs": ["a grant of land given to the chief of a village for his livelihood."]}], "ಗೌಡುಮಾನ್ಯ": [{"type": "noun", "defs": ["= ಗೌಡುಂಬಳಿ."]}], "ಗೌಣ": [{"type": "adjective", "defs": ["of less importance; not essential; secondary, subordinate.", "(rhet.) not in its original, usual, literal or exact sense; representing one concept in terms of another that may be thought of as analogous with it; metaphorical; figurative."]}, {"type": "noun", "defs": ["that which is of no or less importance; a secondary thing of subject; that which does not require or deserve serious consideration.", "lack of something necessary for completeness; deficiency; shortcoming; a defect."]}], "ಗೌಣತ್ವ": [{"type": "noun", "defs": ["the quality of being less or not important or being subordinate or minor."]}], "ಗೌತಮ": [{"type": "noun", "defs": ["name of a celebrated sage, the propounder of the Nyāya philosophy.", "Siddhartha Gautama, religious philosopher and teacher who lived in India c. 563c. 483 B.C. and was the founder of Buddhism; Buddha."]}], "ಗೌತಮಿ": [{"type": "noun", "defs": ["the river Gōdāvari in central India, flowing from the Western Ghats into the Bay of Bengal (1,440 km)."]}], "ಗೌತಳಿ": [{"type": "noun", "defs": ["an association of traders or other commerce vocations."]}], "ಗೌದಾನಿಕ": [{"type": "noun", "defs": ["a religious rite performed on a boy, at the age of sixteen, by shaving the front portion of his head in elliptical shape."]}], "ಗೌದಾಳಿಕ": [{"type": "noun", "defs": ["a man engaged in or whose occupation is, agriculture."]}], "ಗೌಧಾರ": [{"type": "noun", "defs": ["a harmless, moderate-sized, tropical lizard, Iguana tuberculata of Iguanidae family, having a row of spines from neck to tail, which is known for its grip and used in scaling forts, and which feeds on insects or vegetation; the common iguana."]}], "ಗೌಧೂಮ": [{"type": "noun", "defs": ["the floor of the grain of the grass Triticum dicoccum ( = T. aestivum, = T. Vulgare) of Poaceae family, used most widely in making cereals, pastries, cakes etc.; wheat-flour."]}], "ಗೌಧೇಯ": [{"type": "noun", "defs": ["= ಗೌಧಾರ."]}], "ಗೌಧೇರ": [{"type": "noun", "defs": ["= ಗೌಧಾರ.", "2) a young of this animal."]}], "ಗೌನು": [{"type": "noun", "defs": ["a long, loose outer garment; esp. a) a loose robe for wear when one is not fully clothed; b) a nightgown, nightshirt, etc.; c) a loose, cotton smock worn by a surgeon; d) a long, flowing robe worn as a symbol of office or status by certain officials, clergymen, scholars, etc.; a gown."]}], "ಗೌಪ್ಯ": [{"type": "noun", "defs": ["something known only to a certain person or persons and purposely or meant to be a thing kept or meant to be kept secret."]}], "ಗೌರ": [{"type": "adjective", "defs": ["of white, light yellow colour; of fair complexion."]}, {"type": "noun", "defs": ["the white colour.", "the reddish or light red colour.", "the golden yellow colour.", "the moon.", "the filament of a lotus.", "the seed of the plant Brassica alba; white mustard.", "a wild buffalo; gaur."]}], "ಗೌರವ": [{"type": "adjective", "defs": ["of, from, relating to one's teacher.", "honorary - a) given as an honour only, without the usual requirements or privileges; b) designating an office or position held as an honour only, without service or pay; c) holding such a position or office; d) recognising academic distinction or accomplishment."]}, {"type": "noun", "defs": ["weight; heaviness.", "importance; high value or estimation; esteem.", "respect; regard; consideration.", "respectability; venerableness.", "a respectable man.", "egoism; self-conceit."]}], "ಗೌರವಗ್ರಂಥ": [{"type": "noun", "defs": ["a book brought in honour of a person."]}], "ಗೌರವತ್ರಯ": [{"type": "noun", "defs": ["(Jain.) pride that a person gets from one's voice (or speech), wealth and soundness of the body."]}], "ಗೌರವದೋಷ": [{"type": "noun", "defs": ["(pros.) a literary fault of placing the long syllable where the short one should have been."]}], "ಗೌರವಧನ": [{"type": "noun", "defs": ["a payment as to a professional person for services on which no fee is set or legally obtainable; honorarium.", "(loosely) royalty - a) a share of the proceeds or product paid to the owner of a right, as a patent, for permission to use it or operate under it; b) such a share paid to one from whom lands rich in oil or minerals are leased; c) a share of proceeds, usu. a specified percentage, paid for the work of an author, composer, etc. by the publisher."]}], "ಗೌರವರಕ್ಷೆ": [{"type": "noun", "defs": ["a state honour, usu. by military or police personnel, given to a dignitary."]}], "ಗೌರವರ್ಣ": [{"type": "noun", "defs": ["= ಗೌರ2 - 1, 2, & 3."]}], "ಗೌರವರ್ಣಿನಿ": [{"type": "noun", "defs": ["= ಗೌರಾಂಗಿ."]}], "ಗೌರವವಾಚಕ": [{"type": "noun", "defs": ["the respectful form of a word addressed to a person."]}], "ಗೌರವಸಂಭಾವನೆ": [{"type": "noun", "defs": ["a payment, esp. a voluntary one for professional services rendered without the normal fee; honorarium."]}], "ಗೌರವಸ್ಥ": [{"type": "noun", "defs": ["a man who is worthy of being respected; a respectable man."]}], "ಗೌರವಸ್ಥೆ": [{"type": "noun", "defs": ["a woman whois worthy of being respected; a respectable woman."]}], "ಗೌರವಾನ್ವಿತ": [{"type": "adjective", "defs": ["worthy of respect or esteem; estimable; respectable."]}, {"type": "noun", "defs": ["= ಗೌರವಸ್ಥ."]}], "ಗೌರವಾನ್ವಿತೆ": [{"type": "noun", "defs": ["= ಗೌರವಸ್ಥೆ."]}], "ಗೌರವಾರ್ಹ": [{"type": "adjective", "defs": ["worthy of respect or esteem; estimable; respectable."]}, {"type": "noun", "defs": ["a man worthy of respect; a respectable man."]}], "ಗೌರವಾರ್ಹೆ": [{"type": "noun", "defs": ["a woman worthy of respect; a respectable woman."]}], "ಗೌರವಿಸು": [{"type": "verb", "defs": ["to respect - a) to feel or show honour or esteem for; to hold in high regard; b) to consider or treat with deference or dutiful regard; c) to show consideration for; to avoid intruding upon or interfering with."]}], "ಗೌರಾಂಗ": [{"type": "noun", "defs": ["a man of white or fair complexion."]}], "ಗೌರಾಂಗಿ": [{"type": "noun", "defs": ["a woman of white or fair complexion."]}], "ಗೌರಿ": [{"type": "noun", "defs": ["a girl in the stage prior to menstruation.", "Pārvati, wife of Śiva.", "a woman of white or fair complexion.", "a bright yellow pigment prepared from the urine or bile of a cow or vomited by a cow in the form of scybala.", "the plant Rubia cordifolia ( = R. munjista) of Rubiaceae family; Indian madder.", "the plant Ocimum sanctum of Lamiaceae family; basil.", "a kind of jasmine plant."]}], "ಗೌರಿಕುಲ": [{"type": "noun", "defs": ["a kind of maize."]}], "ಗೌರಿಗೆ": [{"type": "noun", "defs": ["the tree Bridelia retusa of Euphorbiaceae family."]}], "ಗೌರಿಜಡೆ": [{"type": "noun", "defs": ["a kind of plant ."]}], "ಗೌರಿಣಿ": [{"type": "noun", "defs": ["= ಗೌರಾಂಗಿ."]}], "ಗೌರಿತದಿಗೆ": [{"type": "noun", "defs": ["the third day in Bhādrapada, the 6th month in Hindu Calendar.", "a festival observed on that day."]}], "ಗೌರಿನೋಂಪಿ": [{"type": "noun", "defs": ["= ಗೌರಿತದಿಗೆ - 2."]}], "ಗೌರಿಬಳ್ಳಿ": [{"type": "noun", "defs": ["the creeper Ichnocarpus frutescens of Apocynceae family; black creeper."]}], "ಗೌರಿಬೀಜ": [{"type": "noun", "defs": ["the plant Ipomoea nil ( = I. hederaceae) of Convolvulaceae family."]}], "ಗೌರಿಮ": [{"type": "noun", "defs": ["the colour of pure ice; white colour."]}], "ಗೌರಿಮರ": [{"type": "noun", "defs": ["the tall tree Polylthia fragrans of Annonaceae family."]}], "ಗೌರಿಮುಡಿ": [{"type": "noun", "defs": ["a kind of plant.", "its flower."]}], "ಗೌರಿಹಬ್ಬ": [{"type": "noun", "defs": ["a festival observed on the third day in Bhādrapada, the 6th month in Hindu lunar calendar."]}], "ಗೌರಿಹುಣ್ಣಿಮೆ": [{"type": "noun", "defs": ["the full moon-day in Kārthika the eighth month of Hindu lunar calendar.", "the festival observed on that day."]}], "ಗೌರಿಹುಣ್ಣಿವೆ": [{"type": "noun", "defs": ["= ಗೌರಿಹುಣ್ಣಿಮೆ."]}], "ಗೌರಿಹೂ": [{"type": "noun", "defs": ["the plant Impatiens balsamina of Balsaminaceae family.", "its flower."]}], "ಗೌರೀತೃತೀಯೆ": [{"type": "noun", "defs": ["= ಗೌರಿತದಿಗೆ."]}], "ಗೌರೀಧವ": [{"type": "noun", "defs": ["Śiva, the consort of Gauri."]}], "ಗೌರೀಪಾಷಾಣ": [{"type": "noun", "defs": ["a silvery-white, brittle, very poisonous chemical element, compounds of which are used in making insecticides, glass, medicines, semiconductors, etc. (symbol, As); arsenic."]}], "ಗೌರೀಪ್ರವರ": [{"type": "noun", "defs": ["= ಗೌರೀಧವ."]}], "ಗೌರೀಮನೋಹರಿ": [{"type": "noun", "defs": ["(mus.) twenty-third of the seventy-two main rāgas (modes)."]}], "ಗೌರೀವೀಣೆ": [{"type": "noun", "defs": ["a variety in vīṇe, the Indian lute."]}], "ಗೌರೀಶ": [{"type": "noun", "defs": ["= ಗೌರೀಧವ."]}], "ಗೌರೀಶಂಕರ": [{"type": "noun", "defs": ["Mount peak of the Himalayas, on the border of Nepal & Tibet, highest known mountain in the world (29,028 ft., 8,848 m).", "(fig.) a person who is incomparable or unparalleled in his or her field of activity; ಗೌರೀಶಂಕರವನ್ನು ಮುಟ್ಟು gaurīsankaravannu muṭṭu to achieve great heights (in one's field of activity)."]}], "ಗೌರೀಹರರಸ": [{"type": "noun", "defs": ["(med.) a medicinal substance made from mercury, sulphur etc."]}], "ಗೌರು": [{"type": "noun", "defs": ["a shrill, high-pitched, harsh sound; screech."]}], "ಗೌರುಗಹಳೆ": [{"type": "noun", "defs": ["a kind high-pitched war-trumpet."]}], "ಗೌಲಿ": [{"type": "noun", "defs": ["= ಗೌವಲೆ."]}], "ಗೌಲು": [{"type": "noun", "defs": ["odour - a) that characteristic of a substance which makes it perceptible to the sense of smell; b) a smell, whether pleasant or unpleasant; fragrance, stench, etc."]}], "ಗೌಲೆ": [{"type": "noun", "defs": ["= ಗೌವಲೆ."]}], "ಗೌವಲೆ": [{"type": "noun", "defs": ["(dial.) bits of wheaten flour rolled between the fingers into the size and shape of grains of wheat.", "pāyasa, a kind of liquid sweet dish made of this."]}], "ಗೌವುಂಡ": [{"type": "noun", "defs": ["the chief of a village.", "a caste the main occupation of the members of which is agriculture and farming.", "a member of that caste."]}], "ಗೌವುಂಡಿ": [{"type": "noun", "defs": ["the wife of the chief of a village.", "a female servant."]}], "ಗೌವುಂಡಿಕೆ": [{"type": "noun", "defs": ["the office, status, duty etc. of the chief of a village."]}], "ಗೌಸಣಿಕೆ": [{"type": "noun", "defs": ["= ಗೌಸಣಿಗೆ."]}], "ಗೌಸಣಿಗೆ": [{"type": "noun", "defs": ["anything that covers as a cover, wrapper, case, veil, etc.", "a case for the blade of a knife, sword, etc.; a sheath."]}], "ಗೌಸು": [{"type": "noun", "defs": ["= ಗೌಸಣಿಗೆ -1."]}], "ಗೌಳ": [{"type": "noun", "defs": ["name of a region including the present Bengal and northern part of Orissa in Eastern India.", "that which is connected to or made from sugarcane.", "(mus.) a musical mode, in Karnāṭaka system, derived from the main mode Māyām āḷava gauḷa."]}, {"type": "noun", "defs": ["a kind of necklace having round beads."]}, {"type": "adjective", "defs": ["(said of sound, voice) unpleasantly sharp; grating to the ear."]}, {"type": "noun", "defs": ["a kind of plant."]}], "ಗೌಳಪಂತು": [{"type": "noun", "defs": ["= ಗೌಳಿಪಂತು."]}], "ಗೌಳಶಾರೀರ": [{"type": "noun", "defs": ["rough voice."]}], "ಗೌಳಸರ": [{"type": "noun", "defs": ["a kind of necklace having round beads.", "a kind of ornament for the forearms."]}], "ಗೌಳಿ": [{"type": "noun", "defs": ["the house lizard."]}, {"type": "noun", "defs": ["a musical mode."]}, {"type": "noun", "defs": ["a man who tends grazing cattle and sells milk and curds; a cowherd.", "a caste, the members of which are mainly cowherds and live on selling milk, curds, butter, etc."]}, {"type": "noun", "defs": ["the wife of the chief of a village.", "a female servant."]}], "ಗೌಳಿಗ": [{"type": "noun", "defs": ["= ಗೌಳಿ3."]}], "ಗೌಳಿಗಿತ್ತಿ": [{"type": "noun", "defs": ["a female of cowherd caste."]}], "ಗೌಳಿಗೆ": [{"type": "noun", "defs": ["a kind of tree."]}], "ಗೌಳಿನುಡಿತ": [{"type": "noun", "defs": ["the characteristic sound of the house lizard, supposed to foretell symbolically about the coming events."]}], "ಗೌಳಿಪಂತು": [{"type": "noun", "defs": ["(mus.) a musical mode, in Karnāṭaka system, derived from the main mode Māyām āḷava gauḷa."]}], "ಗೌಳಿಶಕುನ": [{"type": "noun", "defs": ["a foretelling about the coming events the house lizards supposed to indicate by their characteristic sound."]}], "ಗೌಱಗಹಳೆ": [{"type": "noun", "defs": ["= ಗೌರುಗಹಳೆ."]}], "ಗೌಱಗಿ": [{"type": "verb", "defs": ["to emit harsh, shrill sound; to screech."]}], "ಗೌಱಿಡು": [{"type": "verb", "defs": ["= ಗೌಱಗಿ."]}], "ಗೌಱು": [{"type": "noun", "defs": ["the quality of being stiff and brittle, easily broken, snapped or crumbled; crispness.", "ಗೌಱುಬದನೆಯ ಕಾಯಿ gauru badaneya kāyi a dish made of brinjal by burning it and making it crisp."]}, {"type": "noun", "defs": ["= ಗೌರು."]}], "ಗೌಱುಕಾಳೆ": [{"type": "noun", "defs": ["= ಗೌರುಗಹಳೆ."]}], "ಗೌಱುಗಹಳೆ": [{"type": "noun", "defs": ["= ಗೌರುಗಹಳೆ."]}], "ಗೌಱುಗಾಳೆ": [{"type": "noun", "defs": ["= ಗೌರುಗಹಳೆ."]}], "ಗೌಱೊಡೆ": [{"type": "noun", "defs": ["a small, crisp, spicy cake, fried in oil."]}], "ಗ್ಯಾಂಗು": [{"type": "noun", "defs": ["a group of people associated together in some way, esp. a) a group of workers directed by a foreman; b) an organised group of criminals; c) a squad of convicts at work; a gang."]}], "ಗ್ಯಾದಾರಿ": [{"type": "noun", "defs": ["the plant Erythroxylon monogynum of Erythroxylaceae family, grows s a small tree or bush, the bark and leaves of which are used for preparing certain medicinal substances; bastard sandal."]}], "ಗ್ಯಾರಂಟಿ": [{"type": "noun", "defs": ["the state of being assured; sureness; certainty; guarantee."]}], "ಗ್ಯಾಲನ್ನು": [{"type": "noun", "defs": ["a unit of liquid measure equal to 4 quarts (3.7854 American litres or 4.546 British or Canadian litres); a gallon."]}], "ಗ್ಯಾಲರಿ": [{"type": "noun", "defs": ["a raised area, having a stepped or sloping floor, in a theatre, stadium or other public building to accommodate spectators; gallery."]}], "ಗ್ಯಾಲಿ": [{"type": "noun", "defs": ["a shallow, oblong tray for holding composed type before it is put into a form; a galley."]}], "ಗ್ಯಾಸು": [{"type": "noun", "defs": ["the fluid form of a substance in which it can expand indefinitely and completely fill its container; form that is neither liquid nor solid; a gas.", "any mixture of flammable gases used for lighting, heating or cooking; the cooking gas.", "various gaseous substances formed by living or decaying matter, esp. if formed in the stomach, bowels, etc.", "volatile, highly flammable, colourless liquid mixture of hydrocarbons produced by the fractional distillation of petroleum and used chiefly as a fuel in internal-combustion engines; gasoline.", "a lamp that uses the kerosene vaporised by pressure; a gas-lamp.", "(fig.) a false statement made with or without intent to deceive."]}], "ಗ್ಯಾಸೊಲೆ": [{"type": "noun", "defs": ["a stove that uses gas as fuel; a gas-stove."]}], "ಗ್ರಂತ": [{"type": "noun", "defs": ["(rightly) = ಗ್ರಂಥ."]}], "ಗ್ರಂಥ": [{"type": "noun", "defs": ["the act of tying, binding together.", "a literary, philosophical, scientific work, anthology, etc. so prepared, distinguished by length and form from a magazine, tract, etc.; a treatise, a book.", "a formal, systematic written article or book on some subject, esp. a discussion of facts, evidence or principles and the conclusions based on these; a treatise.", "the holy scriptures of any religion.", "any of the four Vēdās, sacred books of Hindus.", "a verse in the meter anuṣṭuppu, in which each foot has eight letters.", "a set of thirty-two syllables.", "the Tamiḷ alphabet system adapted as to be able to write Samskřta words as per their original pronunciations.", "knowledge of excellent or worthy subject or subjects.", "(math.) the number which is divided or to be divided by another."]}], "ಗ್ರಂಥ ಋಣ": [{"type": "noun", "defs": ["indebtedness of an author for other authors whose works had been referred, and opinions, quotations etc. are reproduced."]}], "ಗ್ರಂಥಕರ್ತ": [{"type": "noun", "defs": ["a writer of a book, treatise, scripture, etc.; an author."]}], "ಗ್ರಂಥಕರ್ತೃ": [{"type": "noun", "defs": ["= ಗ್ರಂಥಕರ್ತ."]}], "ಗ್ರಂಥಕಾರ": [{"type": "noun", "defs": ["= ಗ್ರಂಥಕರ್ತ."]}], "ಗ್ರಂಥಕೀಟಕ": [{"type": "noun", "defs": ["any of various families of primitive, wingless thysanuran insects with silvery scales, long feelers, and a bristly tail, which thrive in dampness and darkness and are injurious to books.", "(fig.) a person whose knowledge is limited to what he or she has read and not backed by practical experience."]}], "ಗ್ರಂಥನ": [{"type": "noun", "defs": ["the act of tying, binding together.", "the act, process or fact of writing a book."]}], "ಗ್ರಂಥಪರ್ಣಿ": [{"type": "noun", "defs": ["the plant Grangea maderaspatana ( = Artemisia maderaspatana) of Asteraceae family."]}], "ಗ್ರಂಥಪಾತ": [{"type": "noun", "defs": ["the fact of a part of an old manuscript that is lost (as eaten by insects, the palmyra leaves being broken, etc.)."]}], "ಗ್ರಂಥಪಾಲ": [{"type": "noun", "defs": ["a man in charge of a library (usu. one trained in library science); a librarian."]}], "ಗ್ರಂಥಭಂಡಾರ": [{"type": "noun", "defs": ["= ಗ್ರಂಥಾಲಯ."]}], "ಗ್ರಂಥಭಂಡಾರಿ": [{"type": "noun", "defs": ["= ಗ್ರಂಥಪಾಲ."]}], "ಗ್ರಂಥರಚನೆ": [{"type": "noun", "defs": ["the act of authoring a book."]}], "ಗ್ರಂಥಲಿಪಿ": [{"type": "noun", "defs": ["= ಗ್ರಂಥ - 8."]}], "ಗ್ರಂಥಲೇಖಕ": [{"type": "noun", "defs": ["= ಗ್ರಂಥಕರ್ತ.", "a man who copies for the author, a book; a copier."]}], "ಗ್ರಂಥಸಂಪಾದನೆ": [{"type": "noun", "defs": ["the act, process of making a manuscript of another author ready for publication, often consulting different manuscripts of the same work, and considering other aspects such as authoṛs time, other works, subject dealt with, etc., language, style, etc."]}], "ಗ್ರಂಥಸೂಚಿ": [{"type": "noun", "defs": ["a list , in a library, of available books, its authors, subjects, publishers, date of publication, title of the books, etc. are arranged alphabetically, subject-wise, etc., and also where they may be found.", "a list of books referred by an author in producing his or work, usu. appended at the end of the book; bibliography."]}], "ಗ್ರಂಥಸ್ವಾಮ್ಯ": [{"type": "noun", "defs": ["the exclusive right to the publication, production or sale of the rights to a literary, dramatic work, granted by law for a specified period of time to the author or publisher, etc.; copyright."]}], "ಗ್ರಂಥಾಕ್ಷರ": [{"type": "noun", "defs": ["= ಗ್ರಂಥ - 8."]}], "ಗ್ರಂಥಾಲಯ": [{"type": "noun", "defs": ["a room or building where a collection of books, periodicals, musical scores, films, phonograph records, etc., is systematically arranged for reading or reference; a library."]}], "ಗ್ರಂಥಿ": [{"type": "noun", "defs": ["something that is binding, tying, joining together, etc.; a tie; a knot; a bond.", "the hard joint of the stem of a plant (as of jowar, sugarcane, bamboo, etc.).", "a short, thickened, fleshy part of an underground stem, as a potato; a tuber.", "(anat.) a place or part where two bones or corresponding structures are joined, usu. so that they can move; a joint.", "a tumour - a) a swelling on some part of the body; b) a mass of new tissue growth independent of its surrounding structures, having no physiological function either benign or malignant; a neoplasm.", "any organ or specialised group of cells that produces secretions, as insulin or bile or excretions, as urine: a gland.", "a particular type of stomach ache."]}, {"type": "noun", "defs": ["= ಗ್ರಂಥಪರ್ಣಿ.", "the grass Cyperus bulbosus of Cyperaceae family."]}], "ಗ್ರಂಥಿಕ": [{"type": "noun", "defs": ["the root of the plant Piper chaba ( = P. officinarum) used for medicinal purpose.", "a man who explains succinctly a passage of or whole of a book; a commentator."]}], "ಗ್ರಂಥಿಕತಗರ": [{"type": "noun", "defs": ["a kind of plant ( = Tabernaemontana divaricata of Apocynaceae family, the roots of which are used for medicinal purpose ?)."]}], "ಗ್ರಂಥಿಕೆ": [{"type": "noun", "defs": ["a drug or other substance (chiefly, herbal extraction) used in treating disease, healing or relieving pain."]}], "ಗ್ರಂಥಿತ": [{"type": "adjective", "defs": ["tied, bound together; joined.", "systematically written; properly dealt with the subject, evidence or principles."]}], "ಗ್ರಂಥಿದಳ": [{"type": "noun", "defs": ["= ಗ್ರಂಥಪರ್ಣಿ."]}], "ಗ್ರಂಥಿಪರ್ಣ": [{"type": "noun", "defs": ["= ಗ್ರಂಥಪರ್ಣಿ."]}], "ಗ್ರಂಥಿಲ": [{"type": "adjective", "defs": ["having or full of knots; knotty."]}, {"type": "noun", "defs": ["the plant Flacourtia indica ( = F. sapida, = F. sepiaria) of Flacourtiaceae family.", "its plum.", "the plant Capparis decidua ( = C. aphylla) of Capparaceae family; common caper."]}], "ಗ್ರಂಥಿಶೂಲೆ": [{"type": "noun", "defs": ["inflammation of a joint or joints, esp. as in rheumatoid arthritis; arthritis."]}], "ಗ್ರಂಥಿಶೂಲೆಚೂರ್ಣ": [{"type": "noun", "defs": ["a kind of medicinal substance used in curing arthritis."]}], "ಗ್ರಂದಿಗ": [{"type": "noun", "defs": ["a man who sells perfumes.", "a man who sells medicinal herbs, and other medicinal drugs.", "an eye-doctor."]}], "ಗ್ರಂದಿಗೆ": [{"type": "noun", "defs": ["perfumes, aromatic substances collectively.", "the business or profession of selling perfumes, etc.", "medicinal herbs or drugs collectively.", "a shop for selling perfumes or medicinal herbs, medicinal drugs, etc."]}], "ಗ್ರಥನ": [{"type": "noun", "defs": ["the act of tying, binding or stringing together.", "the act of causing (a liquid) to become coagulated; coagulation.", "a writing, composing (of a literary work)."]}], "ಗ್ರಥಿತ": [{"type": "adjective", "defs": ["tied, bound together; joined, in a particular order or manner."]}], "ಗ್ರಥಿಯಿಸು": [{"type": "verb", "defs": ["= ಗ್ರಥಿಸು."]}], "ಗ್ರಥಿಸು": [{"type": "verb", "defs": ["to bring together (different ideas as in writing a book, etc.); to write a book; to author.", "to come together; to assemble together."]}], "ಗ್ರಸನ": [{"type": "noun", "defs": ["the act of swallowing something (as food).", "a partial eclipse of the sun or moon (mythologically eclipse is caused by a demon-snake swallowing the sun or moon)."]}], "ಗ್ರಸಿಸು": [{"type": "verb", "defs": ["to pass (food, drink, etc.) from the mouth through the gullet or oesophagus into the stomach, usu. by a series of muscular actions in the throat; to swallow."]}], "ಗ್ರಸ್ತ": [{"type": "adjective", "defs": ["seized with the mouth.", "swallowed; devoured; eaten."]}, {"type": "noun", "defs": ["the act of pronouncing a word omitting a letter or syllable.", "he who has been eaten by (another).", "a man possessed (by an evil spirit,); he who is overwhelmed (by fear)."]}], "ಗ್ರಸ್ತಾಸ್ತ": [{"type": "noun", "defs": ["the setting of the sun or moon while being eclipsed."]}], "ಗ್ರಹ": [{"type": "noun", "defs": ["seizure - a) the act of one who seizes or an instance of this; b) the state or an instance of being seized.", "the act of receiving (something from another).", "(myth.) Rāhu or Kētu, either of the two demons who are supposed to eclipse the sun or moon by swallowing them.", "a large, opaque, non-luminous mass, usu. with its own moons, that revolves about a star; esp. any of the sun's nine major planets - Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, Neptune, and Pluto; a planet.", "(astrol.) any of the nine celestial bodies, as the Sun, Moon, Mars, Mercury, Jupiter, Venus, Saturn, Rāhu and Kētu, thought of as influencing human lives.", "any of the evil spirits that are supposed to possess human.", "the condition of being possessed by an evil spirit.", "a Brahmaṇa.", "the earth.", "the living beings collectively.", "the symbol for the number nine.", "a dwelling place; a house.", "(mus.) a note with which a rāga (musical mode) is begun or must be begun with."]}], "ಗ್ರಹಕಲ್ಪ": [{"type": "noun", "defs": ["any of the thousands of small planets ranging from 1,000 km (621 mi.) to less than one km (0.62 mi.) in diameter, revolving around a main planet; an asteroid."]}], "ಗ್ರಹಕೂಟ": [{"type": "noun", "defs": ["(astrol.) the condition of two or more planets being in the same zodiac house or in a few particular zodiac houses; conjunction of planets."]}], "ಗ್ರಹಗತಿ": [{"type": "noun", "defs": ["the actual or imaginary movement of a planet or planets.", "(astrol.) the positions or movements of different planets that influence human lives differently."]}], "ಗ್ರಹಗತಿದರ್ಶಕ": [{"type": "noun", "defs": ["a mechanical apparatus which illustrates with balls of various sizes the relative motions and positions of the earth, moon, sun, etc.; an orrery."]}], "ಗ್ರಹಗ್ರಸ್ತ": [{"type": "noun", "defs": ["a man who is possessed by an evil spirit."]}], "ಗ್ರಹಗ್ರಸ್ತೆ": [{"type": "noun", "defs": ["a woman whois possessed by an evil spirit."]}], "ಗ್ರಹಗ್ರಾಮ": [{"type": "noun", "defs": ["(astrol.) a cluster, conjunction of two or more planets."]}], "ಗ್ರಹಚಾರ": [{"type": "noun", "defs": ["= ಗ್ರಹಗತಿ.", "the condition (esp. miserable one) supposed to be caused by the positions or movements of planets.", "(gen.) the miserable condition of a person.", "ಗ್ರಹಚಾರ ಬಿಡಿಸು grahacāra biḍisu (fig.) to scold severely; ಗ್ರಹಚಾರ ವಕ್ರಿಸು grahacāra vakrisu (a miserable plight) to befall; (something) to eclipse; to bring ill-fame to; ಗ್ರಹಚಾರ ಹಿಡಿ grahacāra hiḍi = ಗ್ರಹಚಾರ ವಕ್ರಿಸು."]}], "ಗ್ರಹಣ": [{"type": "noun", "defs": ["seizure - a) the act of one who seizes or an instance of this; b) the state or an instance of being seized.", "the act of receiving (something from another).", "the partial or total obscuring of one celestial body by another, as of the sun when the moon comes between it and the earth or of the moon when the earth's shadow is cast upon it; an eclipse.", "(myth.) the condition of or duration of time in which the sun or moon is swallowed by Rāhu or Kētu, the two demons.", "the act of taking hold of mentally; understanding; comprehension.", "a throwing into the shade; loss of brilliancy.", "a dimming or extinction, as of flame, glory, wellbeing, etc.", "(dance.) a posture in which the dancer stands biting his or her nails."]}], "ಗ್ರಹಣಶಕ್ತಿ": [{"type": "noun", "defs": ["one's ability to take hold of mentally; grasping capacity."]}], "ಗ್ರಹಣಿ": [{"type": "noun", "defs": ["any of various intestinal inflammations characterised by excessive frequency and looseness of bowel movements; dysentery.", "a disease, affecting children, characterised by the bones becoming soft and distorted."]}], "ಗ್ರಹಪತಿ": [{"type": "noun", "defs": ["the sun, considered as the chief of planets."]}], "ಗ್ರಹಪಥ": [{"type": "noun", "defs": ["the actual or imaginary path taken by a celestial body during its periodic revolution around another body; the orbit of a planet."]}], "ಗ್ರಹಪೀಡೆ": [{"type": "noun", "defs": ["misery, distress supposed to be or have been caused by the positions or movements of planets."]}], "ಗ್ರಹಬಲ": [{"type": "noun", "defs": ["(astrol.) the grace, favour etc. supposed to be endowed on a person by a planet or planets."]}], "ಗ್ರಹಬಾಧೆ": [{"type": "noun", "defs": ["= ಗ್ರಹಪೀಡೆ."]}], "ಗ್ರಹಭೀತ": [{"type": "adjective", "defs": ["frightened, unnerved by the distress, torture supposed to have been caused by an evil spirit."]}, {"type": "noun", "defs": ["a man who is frightened by the distress supposed to have been inflicted by an evil spirit."]}], "ಗ್ರಹಭೀತೆ": [{"type": "noun", "defs": ["a woman whois frightened by the distress supposed to have been inflicted by an evil spirit."]}], "ಗ್ರಹಮೈತ್ರ": [{"type": "noun", "defs": ["= ಗ್ರಹಮೈತ್ರಿ."]}], "ಗ್ರಹಮೈತ್ರಿ": [{"type": "noun", "defs": ["(astrol.) a favourable matching of planets in the zodiacs of a man and a woman proposed to get married to each other."]}], "ಗ್ರಹಯೋಗ": [{"type": "noun", "defs": ["(astrol.) a conjunction of two or more planets that influence human beings."]}], "ಗ್ರಹಶಂಕೆ": [{"type": "noun", "defs": ["diseases, distress etc. supposed to be or have been caused by the positions or movements of planets."]}], "ಗ್ರಹಶಾಂತಿ": [{"type": "noun", "defs": ["propitiation of the planets by offerings, to avoid, mitigate the distress believed to be or to have been, caused by them."]}], "ಗ್ರಹಸ್ವರ": [{"type": "noun", "defs": ["(mus.) a note with which a rāga (musical mode) is begun or must be begun with."]}], "ಗ್ರಹಿಕೆ": [{"type": "noun", "defs": ["understanding, comprehension - a) the act of grasping with the mind; b) understanding or knowledge that results from this.", "ಗ್ರಹಿಕೆಯಾಗು grahikeyāgu to be comprehended, understood."]}], "ಗ್ರಹಿತ": [{"type": "adjective", "defs": ["seized; grasped; held."]}, {"type": "noun", "defs": ["he who comprehends, understands."]}], "ಗ್ರಹಿಸು": [{"type": "verb", "defs": ["to hold, grasp, seize (as with the hand).", "to receive; to accept (something from another).", "to grasp mentally; to understand; to comprehend."]}], "ಗ್ರಹೋನ್ನತಿಮಾಪಕ": [{"type": "noun", "defs": ["an instrument formerly used to find the altitude of a star, etc. (which was replaced by the sextant); an astrolabe."]}], "ಗ್ರಾಂ": [{"type": "noun", "defs": ["the basic unit of mass in the metric system, officially equal to the weight of one cubic centimetre of distilled water at 4ºC:."]}], "ಗ್ರಾಂಥಿಕ": [{"type": "adjective", "defs": ["of or having to do with books or writing.", "characterised by the more formal, balanced, and polished language of literature rather than the informal language of speech."]}], "ಗ್ರಾಣ": [{"type": "noun", "defs": ["= ಗ್ರಹಣ."]}], "ಗ್ರಾಮ": [{"type": "noun", "defs": ["a more or less concentrated group of houses and private and public buildings, larger than a village but smaller than a city; a town.", "a number of things gathered or placed closely together, forming a recognisable unit; a group.", "a complete musical scale having all the seven notes, i.e. any of the major scales; a gamut."]}], "ಗ್ರಾಮಕೂಟ": [{"type": "noun", "defs": ["the chief of a village or town."]}], "ಗ್ರಾಮಕೂಟಕ": [{"type": "noun", "defs": ["= ಗ್ರಾಮಕೂಟ."]}], "ಗ್ರಾಮಕೈಗಾರಿಕೆ": [{"type": "noun", "defs": ["an industry, esp. manufacturing activity, wholly carried on, in a small scale, in a town or village; village-industry."]}], "ಗ್ರಾಮಚಾರ": [{"type": "noun", "defs": ["a village servant."]}], "ಗ್ರಾಮಠಾಣೆ": [{"type": "noun", "defs": ["the area in and around a town that comes under the jurisdiction of that town administration."]}], "ಗ್ರಾಮಣಿ": [{"type": "noun", "defs": ["the chief of a village or town.", "a man of (usu. social) prominence.", "a person who cuts hair and shaves or trims beards of as an occupation; a barber."]}], "ಗ್ರಾಮತಕ್ಕ": [{"type": "noun", "defs": ["the chief of a village or town."]}], "ಗ್ರಾಮತಕ್ಕಾಮೆ": [{"type": "noun", "defs": ["the office, status, duty etc. of the chief of a village."]}], "ಗ್ರಾಮತಕ್ಷ": [{"type": "noun", "defs": ["a carpenter working for the village."]}], "ಗ್ರಾಮತೆ": [{"type": "noun", "defs": ["a cluster of villagers or towns."]}], "ಗ್ರಾಮತೆರಿಗೆ": [{"type": "noun", "defs": ["any general tax levied by the village or town authorities.", "an erstwhile tax levied on a person or family that has migrated to another village."]}], "ಗ್ರಾಮದಾನ": [{"type": "noun", "defs": ["a giving of a town as a gift."]}], "ಗ್ರಾಮದೆರೆ": [{"type": "noun", "defs": ["a tax or taxes levied or collected by the town or village authority."]}], "ಗ್ರಾಮದೇವತೆ": [{"type": "noun", "defs": ["the presiding deity of a town or village."]}], "ಗ್ರಾಮಪಂಚಾಯತಿ": [{"type": "noun", "defs": ["the village or town council that acts as the local government."]}], "ಗ್ರಾಮಪ್ರತಿಷ್ಠೆ": [{"type": "noun", "defs": ["the act of formally and religiously inaugurating a new town for inhabitation."]}], "ಗ್ರಾಮಬ್ರಯ": [{"type": "noun", "defs": ["the expenditure incurred or to be incurred for a village or by the town council (as for welfare, development, sanitary, etc. purposes)."]}], "ಗ್ರಾಮಭೃತಕ": [{"type": "noun", "defs": ["(masc.) the unskilled village labourer."]}], "ಗ್ರಾಮಭೋಜಕ": [{"type": "noun", "defs": ["the chief of a village or town."]}], "ಗ್ರಾಮಮರ್ಯಾದೆ": [{"type": "noun", "defs": ["the limits, boundary of a town or village.", "a set of rules or regulations to be observed by the people of a particular town or village, made by the elders or the council of that town or village."]}], "ಗ್ರಾಮಮೃಗ": [{"type": "noun", "defs": ["= ಗ್ರಾಮಸಿಂಹ."]}], "ಗ್ರಾಮರಾಗ": [{"type": "noun", "defs": ["a complete musical scale having all the seven notes, i.e. any of the major scales; a gamut."]}], "ಗ್ರಾಮರುಹ": [{"type": "noun", "defs": ["the castor plant (Ricinus communis of Euphorbiaceae family) (that commonly grows in most of the villages)."]}], "ಗ್ರಾಮವಳಿ": [{"type": "noun", "defs": ["the affairs or management of a town or village."]}], "ಗ್ರಾಮವಾಸಿ": [{"type": "noun", "defs": ["a person living in a village or town."]}], "ಗ್ರಾಮಶಾಂತಿ": [{"type": "noun", "defs": ["propitiation of the village-god or goddess, planets etc. by offerings, to avoid, mitigate the distress believed to be or to have been, caused by them to the village.", "ಗ್ರಾಮಶಾಂತಿಗಾಗಿ ತಳವಾರ ತಲೆಬೋಳಿಸಿಕೊಂಡ grāma śantigāgi taḷavāra tale bōḷisikoṇḍa (prov.) a proverb meaning that one sacrificed something for the welfare of others (often used sarc)."]}], "ಗ್ರಾಮಶಾರ್ದೂಲ": [{"type": "noun", "defs": ["= ಗ್ರಾಮಸಿಂಹ."]}], "ಗ್ರಾಮಸಾರ": [{"type": "noun", "defs": ["the filth of a village or town."]}], "ಗ್ರಾಮಸಿಂಹ": [{"type": "noun", "defs": ["(fig.) a dog, as the lion of the village.", "(fig.) an imitative thing that is not worth as the imitated one."]}], "ಗ್ರಾಮಸೂಕರ": [{"type": "noun", "defs": ["a village hog (as opp. the wild one)."]}], "ಗ್ರಾಮಸ್ತ": [{"type": "noun", "defs": ["= ಗ್ರಾಮವಾಸಿ.", "(dia.) a village officer (as the chief of the village, accountant, etc.)."]}], "ಗ್ರಾಮಸ್ಥ": [{"type": "noun", "defs": ["= ಗ್ರಾಮವಾಸಿ."]}], "ಗ್ರಾಮಾಂತ": [{"type": "noun", "defs": ["the land, region inside and adjoining the boundary line of a village."]}], "ಗ್ರಾಮಾಂತರ": [{"type": "noun", "defs": ["a rural region, as distinguished from a city; countryside."]}], "ಗ್ರಾಮಾಂತಿಕ": [{"type": "noun", "defs": ["a region in the outskirts of a town or village."]}], "ಗ್ರಾಮಾದಾಯ": [{"type": "noun", "defs": ["the income (as from tax etc.) of a village or town."]}], "ಗ್ರಾಮಾಧಿಪ": [{"type": "noun", "defs": ["the chief of a village or town."]}], "ಗ್ರಾಮಾಧಿಪತಿ": [{"type": "noun", "defs": ["= ಗ್ರಾಮಾಧಿಪ."]}], "ಗ್ರಾಮಾಫೋನು": [{"type": "noun", "defs": ["a device for reproducing, using a stylus, sound that has been mechanically transcribed in a spiral groove on a circular disk; a gramophone; a phonograph."]}], "ಗ್ರಾಮಾಹಾರ": [{"type": "noun", "defs": ["a division of a country."]}], "ಗ್ರಾಮಿಣಿ": [{"type": "noun", "defs": ["the chief of a town or village.", "a village servant.", "a man lacking refinement, elegance, polish or sophistication; a rustic."]}], "ಗ್ರಾಮೀಣ": [{"type": "adjective", "defs": ["of or characteristic of the country, country life or country people; rustic; rural."]}, {"type": "noun", "defs": ["a man living in countryside.", "that which lacks refinement, elegance, polish, sophistication, etc."]}], "ಗ್ರಾಮೇಯಕ": [{"type": "noun", "defs": ["a man living in countryside."]}], "ಗ್ರಾಮೇಶ್ವರ": [{"type": "noun", "defs": ["= ಗ್ರಾಮಾಧಿಪ."]}], "ಗ್ರಾಮೋದ್ಯೋಗ": [{"type": "noun", "defs": ["an industry, esp. manufacturing activity, wholly carried on, in a small scale, in a town or village; village-industry."]}], "ಗ್ರಾಮ್ಯ": [{"type": "adjective", "defs": ["in, of or suggesting the country (opp. to that of city); rural.", "unsophisticated, simple, unrefined, rude; (said of language, behaviour etc.)."]}, {"type": "noun", "defs": ["a man who lacks sophistication, refinement etc.; a stupid, uncouth, uncultured man.", "sexual union; copulation.", "(rhet.) a rude word or language not following the rules of grammar, usage of which in a literary work is considered as a fault."]}], "ಗ್ರಾಮ್ಯಕ": [{"type": "noun", "defs": ["a village watchman; a village servant."]}], "ಗ್ರಾಮ್ಯತೆ": [{"type": "noun", "defs": ["the quality or fact of belonging, made in to countryside.", "the quality of being rustic, uncouth.", "(rhet.) usage of vulgar or rustic speech (in a literary work, considered as a fault)."]}], "ಗ್ರಾಮ್ಯಧರ್ಮ": [{"type": "noun", "defs": ["sexual union; copulation."]}], "ಗ್ರಾಮ್ಯಪಶು": [{"type": "noun", "defs": ["any of the domesticated animals."]}], "ಗ್ರಾಮ್ಯವಿಷಯ": [{"type": "noun", "defs": ["= ಗ್ರಾಮ್ಯಧರ್ಮ."]}], "ಗ್ರಾಮ್ಯಾಳಾಪ": [{"type": "noun", "defs": ["= ಗ್ರಾಮ್ಯೋಕ್ತಿ."]}], "ಗ್ರಾಮ್ಯೆ": [{"type": "noun", "defs": ["a woman wholacks sophistication, refinement etc.; a stupid, uncouth, uncultured woman.", "(rhet.) a literary style in which words are simple, sounding sweet and smooth; mellifluous style."]}], "ಗ್ರಾಮ್ಯೋಕ್ತಿ": [{"type": "noun", "defs": ["vulgar, indecent or obscene speech."]}], "ಗ್ರಾವ": [{"type": "noun", "defs": ["a stone or rock.", "a hillock or hill.", "that which is hard or harsh as a rock.", "courage; brave attitude.", "cloud."]}], "ಗ್ರಾವಣ್ಯ": [{"type": "noun", "defs": ["any piece of certain kinds of material, as iron, that has the property of attracting like material; a magnet."]}], "ಗ್ರಾವಲು": [{"type": "noun", "defs": ["a loose mixture of pebbles and rock fragments coarser than sand, often mixed with clay, etc.; gravel."]}], "ಗ್ರಾಸ": [{"type": "noun", "defs": ["the act of swallowing something (as food).", "that much quantity of food which can be held in the palm (for eating).", "food (in gen.).", "(collectively) food articles as grain, spices, corn, oil, etc.", "the eclipsed portion of the sun or moon."]}], "ಗ್ರಾಸಗೊಳ್": [{"type": "verb", "defs": ["= ಗ್ರಾಸಗೊಳು."]}], "ಗ್ರಾಸಗೊಳು": [{"type": "verb", "defs": ["to take into the stomach by drawing through the throat and oesophagus with a voluntary muscular action, as food or other substances; to swallow.", "to get food."]}], "ಗ್ರಾಸವಾಸಿ": [{"type": "noun", "defs": ["a man who is interested or engaged in getting food and clothes and not having any zeal or interest for other things."]}], "ಗ್ರಾಸಿ": [{"type": "noun", "defs": ["a person or animal that takes food.", "a person who eats and drinks excessively or voraciously; a glutton."]}], "ಗ್ರಾಸಿಸು": [{"type": "verb", "defs": ["to take (something as food) into the stomach through the throat; to swallow.", "(fig.) to serve entirely; to envelop."]}], "ಗ್ರಾಹ": [{"type": "noun", "defs": ["the act of one who seizes or an instance of this; seizure; holding.", "the act of receiving (something from another).", "any rapacious animal, chiefly living in water, as crocodile, shark, hippopotamus, etc.", "(myth.) name of a hell."]}], "ಗ್ರಾಹಕ": [{"type": "adjective", "defs": ["holding; catching, seizing.", "receiving; taking.", "including within or enveloping."]}, {"type": "noun", "defs": ["a man who receives or can receive; a receiver.", "he who seizes, as a police officer.", "a man who comprehends, understands.", "a thing that receives, as an apparatus or device that converts incoming electromagnetic waves or electrical signals into audible or visual signals, such as a radio or television receiving set or that part of a telephone which is held to the ear; a receiver.", "a man who buys goods or services from a shop or business; a customer."]}], "ಗ್ರಾಹಕತ್ವ": [{"type": "noun", "defs": ["the ability to contain, absorb or receive and hold."]}], "ಗ್ರಾಹಕಶಕ್ತಿ": [{"type": "noun", "defs": ["= ಗ್ರಾಹಕತ್ವ."]}], "ಗ್ರಾಹಮರ": [{"type": "noun", "defs": ["the medium sized, deciduous tree Feronia limonia ( = F. elephantum) of Rutaceae family; wood-apple tree."]}], "ಗ್ರಾಹಿ": [{"type": "adjective", "defs": ["holding; catching, seizing.", "receiving; taking.", "understanding or capable of understanding.", "including within or enveloping."]}, {"type": null, "defs": []}, {"type": "noun", "defs": ["a female demon.", "the state of being temporarily deprived of consciousness; unconsciousness."]}], "ಗ್ರಾಹ್ಯ": [{"type": "adjective", "defs": ["that can be caught, seized.", "that can be or fit to be received; worth accepting.", "that can be mentally grasped, understood.", "good enough to fulfil a need, wish, requirement, etc.; satisfactory.", "ಗ್ರಾಹ್ಯವಾಗು grāhyavāgu to become understood; to be comprehended; 2. to be or become acceptable."]}], "ಗ್ರಾಹ್ಯಾರ್ಥ": [{"type": "noun", "defs": ["that which can be grasped by any of the senses."]}], "ಗ್ರೀಕ್": [{"type": "noun", "defs": ["= ಗ್ರೀಕು."]}], "ಗ್ರೀಕ": [{"type": "noun", "defs": ["a native or inhabitant of ancient or modern Greece."]}], "ಗ್ರೀಕು": [{"type": "noun", "defs": ["the language of the Greeks, constituting a separate branch of the Indo-European language family; Greek."]}], "ಗ್ರೀವ": [{"type": "noun", "defs": ["= ಗ್ರೀವೆ."]}], "ಗ್ರೀವಾರೇಚಕ": [{"type": "noun", "defs": ["(dance.) a moving of the neck from one side to the another."]}], "ಗ್ರೀವಾರೇಚಿತ": [{"type": "noun", "defs": ["= ಗ್ರೀವಾರೇಚಕ."]}], "ಗ್ರೀವೆ": [{"type": "noun", "defs": ["that part of a human or animal joining the head to the body, including the part of the backbone between the skull and the shoulders; the neck."]}], "ಗ್ರೀಷ್ಮ": [{"type": "noun", "defs": ["second of the six seasons (consisting of Jyēṣṭha and Āṣāḍha, the third and fourth months of the year); the summer season.", "much hotness; great warmth."]}], "ಗ್ರೀಷ್ಮಋತು": [{"type": "noun", "defs": ["= ಗ್ರೀಷ್ಮ - 1."]}], "ಗ್ರೀಷ್ಮಕಾಲ": [{"type": "noun", "defs": ["= ಗ್ರೀಷ್ಮ - 1."]}], "ಗ್ರೀಷ್ಮಾವಾಸ": [{"type": "noun", "defs": ["a house specially built of wood for living in summer season."]}], "ಗ್ರೈವೇಯ": [{"type": "noun", "defs": ["the part of a garment that encircles the neck; the collar.", "a string or a chain of gold, silver, etc., worn around the neck as an ornament; a necklace."]}], "ಗ್ರೈವೇಯಕ": [{"type": "noun", "defs": ["= ಗ್ರೈವೇಯ - 2.", "a chain worn round the neck of an elephant.", "(Jain.) one of the heavens."]}], "ಗ್ರೈಷ್ಮ": [{"type": "adjective", "defs": ["relating, belonging to, produced by or during, sown in summer season."]}], "ಗ್ರೈಷ್ಮಾತಪ": [{"type": "noun", "defs": ["the sunlight that is of much hotness (i.e. of summer)."]}], "ಗ್ಲಪನ": [{"type": "noun", "defs": ["the act of becoming or fact of being a) faded, withered (as a flower).", "tired, exhausted."]}], "ಗ್ಲಪಿತ": [{"type": "adjective", "defs": ["faded; withered.", "tired; exhausted."]}], "ಗ್ಲಸ್ತ": [{"type": "adjective", "defs": ["swallowed; eaten; consumed."]}], "ಗ್ಲಹ": [{"type": "noun", "defs": ["a game of chance for money or some other stake.", "something, esp. money, bet, as in gambling; stakes."]}], "ಗ್ಲಾನ": [{"type": "adjective", "defs": ["tired; exhausted; weary; worn out."]}, {"type": "noun", "defs": ["(dance) an expression of fatigue, weariness, by covering the eye balls under the sunken eyelids; an expression of languidness."]}], "ಗ್ಲಾನಿ": [{"type": "noun", "defs": ["the state of being tired, worn out; physical or mental exhaustion; weariness; fatigue.", "the state of being idle or indolent.", "the condition of being sick or diseased; illness; sickness.", "depression of mind as from disappointment, dissatisfaction, etc.", "a decline; deterioration; decay.", "(rhet.) fatigue, lassitude as one of the minor sentiment."]}], "ಗ್ಲಾಸು": [{"type": "noun", "defs": ["a glass container used for drinking liquids."]}], "ಗ್ಲೌ": [{"type": "noun", "defs": ["the moon (from its round shape)."]}], "ಘ": [{"type": "noun", "defs": ["(gen. pronounced with the vowel 'a') the eighteenth letter of Kannaḍa alphabet and the fourth consonant."]}], "ಘಂ": [{"type": "noun", "defs": ["an imitative sound expressing something that is grave, serious, frightening, etc."]}, {"type": "noun", "defs": ["a sweet smell; pleasant odour; fragrance."]}], "ಘಂಟಾ": [{"type": "noun", "defs": ["(mus.) a musical mode in Karnāṭaka system derived from the major mode Naṭhabhairavi."]}], "ಘಂಟಾಗೋಪುರ": [{"type": "noun", "defs": ["a belfry - a) a tower with a bell b) the part of a tower or steeple that holds a bell or bells."]}], "ಘಂಟಾಘೋಷ": [{"type": "noun", "defs": ["the sound of a bell.", "(fig.) a voice that is as clear and loud as the sound of a bell.", "ಘಂಟಾಘೋಷವಾಗಿ ಹೇಳು ghaṇṭā ghōṣavāgi hēḷu to say, state, declate (something) in a loud and clear voice (esp. with confidence)."]}], "ಘಂಟಾನಾದ": [{"type": "noun", "defs": ["= ಘಂಟಾಘೋಷ."]}], "ಘಂಟಾಪಥ": [{"type": "noun", "defs": ["(in erstwhile days) a highway mainly used for the movement of elephants, chariots, etc."]}], "ಘಂಟಾಪಾಟಲಿ": [{"type": "noun", "defs": ["the tree Stereospermum suaveolens ( = Bignonia suaveolens) of Bignoniaceae family.", "its trumpet like flower."]}], "ಘಂಟಾಮಣಿ": [{"type": "noun", "defs": ["the creeper Coccina cordifolia ( = C. indica, = Bryonia grandis, = Momordica monadelpha) of Cucurbitaceae family.", "its fruit."]}], "ಘಂಟಾರವ": [{"type": "noun", "defs": ["= ಘಂಟಾಘೋಷ."]}], "ಘಂಟಾರವೆ": [{"type": "noun", "defs": ["the plant Crotalaria rubiginosa of Papilionaceae family."]}], "ಘಂಟಾರುತಿ": [{"type": "noun", "defs": ["= ಘಂಟಾಘೋಷ."]}], "ಘಂಟಿಕಾಜಾಲ": [{"type": "noun", "defs": ["a chain of small chiming bells."]}], "ಘಂಟಿಕಾರವ": [{"type": "noun", "defs": ["the sound produced by chiming bells."]}], "ಘಂಟಿಕೆ": [{"type": "noun", "defs": ["a set of chiming bells attached to an ornament, as anklet, girdle, etc.", "a small bell."]}], "ಘಂಟೆ": [{"type": "noun", "defs": ["a hollow object, usu. inverted cone or cuplike, made of metal or other hard material, with a clapper inside, which rings when struck; a bell.", "an object rung to mark the hours or the beginning and end of a period of time, as in schools, etc.", "duration of sixty minutes; one of the twenty-four equal parts of a normal day; an hour.", "one of the twelve points on a clock, watch, etc. marking the beginning or end of such a division.", "anything shaped like a bell, as a flower, etc.", "a set of chiming bells attached to a string."]}], "ಘಕಾರ": [{"type": "noun", "defs": ["the letter 'ಘ'."]}], "ಘಕ್ಕನೆ": [{"type": "adverb", "defs": ["immediately; suddenly; at once."]}], "ಘಟ": [{"type": "noun", "defs": ["a large earthen jar, pitcher or pot.", "a specially made earthen pot, used as a percussion instrument in Karnāṭaka music.", "the physical body (usu. ref. to that of human).", "a number of persons organised to join or come together for a common cause; an organised group.", "the act or fact of being organised (said of persons).", "the act of heaping, accumulating something; a piling.", "a group assembled for drinking liquors for amusement or recreation.", "any tangible object, as distinguished from a concept, quality, etc; a thing.", "an old measure of quantity (equal to four koḷagas of eight or ten seers).", "the border on a garment or piece of cloth; the hem.", "the upper part of a column.", "(fig.) a socially noted person; a big shot.", "(astron.) a large southern constellation, near the celestial equator between Cetus and Capricornus; Water Bearer.", "(astrol.) the eleventh sign of the zodiac, entered by the sun about January 21; Aquarius.", "ಘಟ ಒಪ್ಪಿಸು ghaṭa oppisu (the soul) to leave the body; to die; ಘಟ ಬೀಳು ghaṭa bīḷu to die."]}], "ಘಟಕ": [{"type": "adjective", "defs": ["tending to achieve; exerting oneself; striving for; bringing about.", "forming a constituent part; constituent."]}, {"type": "noun", "defs": ["a match-making agent whose profession is ascertaining genealogies of two families, negotiating matrimonial alliances, etc.", "a person who organises or manages; an organiser.", "a unit - a) a single person or group, esp. as distinguished from others or as part of a whole; b) a single, distinct part or object, esp. one used for a specific purpose.", "an organisation, administration etc. functioning independently without control by others; an autonomous body.", "a man who undertakes, tends to undertake adventures; an adventurer."]}], "ಘಟಕಾವಯವ": [{"type": "noun", "defs": ["a necessary part or element; a constituent part."]}], "ಘಟಕ್ಷುಧೆ": [{"type": "noun", "defs": ["a need for food."]}], "ಘಟಗೃಹ": [{"type": "noun", "defs": ["(astrol.) the eleventh sign of the zodiac, entered by the sun about January 21."]}], "ಘಟಚಕ್ರ": [{"type": "noun", "defs": ["a device with a number of pitchers attached and which operates with the help of a pulley."]}], "ಘಟಚೇಟಿ": [{"type": "noun", "defs": ["a house maid for bringing water from a well, canal, etc.", "a woman whoobtains men or women for the purpose of prostitution; a procuress."]}], "ಘಟಚೇಟಿಕೆ": [{"type": "noun", "defs": ["= ಘಟಚೇಟಿ - 1."]}], "ಘಟಜೀವಿ": [{"type": "noun", "defs": ["a person whose main concern is material and sensual living (as opp. to spiritual one)."]}], "ಘಟಣೆ": [{"type": "noun", "defs": ["the fact of becoming, happening."]}], "ಘಟನ": [{"type": "noun", "defs": ["a bringing or joining together.", "a bringing about; the act of making (something) happen or becoming.", "an effort - a) a using of energy to get something done; exertion of strength or mental power; b) a try, esp. a hard try; an attempt; an endeavour.", "an accomplishing or being accomplished; completion; accomplishment."]}], "ಘಟನಾವಳಿ": [{"type": "noun", "defs": ["a number of things happening, one following another immediately; a series of happenings."]}], "ಘಟನಾಸಭೆ": [{"type": "noun", "defs": ["(hist.) a meeting of several members whose responsibility was to frame the Constitution that would be acceptable to conditions of the Republic of India; the Constituent Assembly."]}], "ಘಟನಾಸ್ರೋತ": [{"type": "noun", "defs": ["= ಘಟನಾವಳಿ."]}]}