{"ಕಾವ್ಯಾಂಗ": [{"type": "noun", "defs": ["any of the structural part or subordinate division, of poetical body of a literary work.", "any of several means, as knowledge, practice, required for accomplishing of a poetical work."]}], "ಕಾವ್ಯಾಂತರಾಳ": [{"type": "noun", "defs": ["the main theme, essence of poetry in general or of a poetical work."]}], "ಕಾವ್ಯಾನಂದ": [{"type": "noun", "defs": ["the unique joy or happiness derived from literary works."]}], "ಕಾವ್ಯಾನುಭವ": [{"type": "noun", "defs": ["the experience of delicate and sensitive feelings got from poetical works or the appeal to the emotions that literature has on the reader."]}], "ಕಾವ್ಯಾಭಾಸ": [{"type": "noun", "defs": ["a literary work imitating the characteristic style of some other work, but lacking the poetical qualities."]}], "ಕಾವ್ಯಾರ್ಥಾಪತ್ತಿ": [{"type": "noun", "defs": ["(rhet.) a figure of speech in which a relevant assertion suggests an inference not actually connected with the subject in hand or vice versa."]}], "ಕಾವ್ಯಾಲಂಕಾರ": [{"type": "noun", "defs": ["an expression, as a metaphor or simile, using words in a nonliteral sense or unusual manner to add vividness, beauty, etc. to what is said or written; a figure of speech."]}], "ಕಾವ್ಯಾಲಂಕೃತಿ": [{"type": "noun", "defs": ["= ಕಾವ್ಯಾಲಂಕಾರ."]}], "ಕಾವ್ಯಾವಲೋಕ": [{"type": "noun", "defs": ["= ಕಾವ್ಯಾವಲೋಕನ."]}], "ಕಾವ್ಯಾವಲೋಕನ": [{"type": "noun", "defs": ["the critical consideration, judgement, and evaluation of literary work; a comment, review, article, etc. expressing such analysis and judgement."]}], "ಕಾವ್ವರಿ": [{"type": "noun", "defs": ["the act or an instance of moving rapidly in a circular manner; a whirling.", "the state of being carried away by joy, love, etc.; excited state of the mind; rapture; ecstasy.", "confusion; agitation of the mind."]}], "ಕಾಶ": [{"type": "noun", "defs": ["brightness; radiance; brilliance; lustre.", "the grass Saccharum spontaneum of Poaceae family.", "the grass Sorghum nitidum (= Andropogon serratus) of Poaceae family.", "a flower of this grass."]}], "ಕಾಶಕಬ್ಬು": [{"type": "noun", "defs": ["= ಕಾಶ -3."]}], "ಕಾಶಗಬ್ಬು": [{"type": "noun", "defs": ["= ಕಾಶ -3."]}], "ಕಾಶಳ": [{"type": "noun", "defs": ["a pair of concave bronze plates that produce a brilliant clashing tone and that is struck together; bronze cymbals."]}], "ಕಾಶಾಂಬರ": [{"type": "noun", "defs": ["a red or reddish brown cloth used by ascetics and mendicants."]}], "ಕಾಶಾರ್ಪಟ": [{"type": "noun", "defs": ["= ಕಾಶಾಂಬರ."]}], "ಕಾಶಿ": [{"type": "adjective", "defs": ["shining with light that is radiated or reflected; bright; brilliant.", "clearly seen."]}, {"type": "noun", "defs": ["a holy city in Uttar Pradesh, in North India, on the Gangā river.", "(fig.) a place that is very important, sacred to a particularsect or group of people."]}, {"type": "noun", "defs": ["a unsewn, oblong cloth worn by men around the waist to cover the lower parts and one end of which is taken between the legs and tucked behind at the waist band; a dhōti.", "an oblong, unsewn cloth, as a towel, used to tie around the waist."]}, {"type": "noun", "defs": ["brightness; radiance; brilliance; lustre.", "the clenched hand; fist.", "the sun."]}], "ಕಾಶಿಕಾಗದ": [{"type": "noun", "defs": ["a kind of good white paper."]}], "ಕಾಶಿಕುಪ್ಪೆ": [{"type": "noun", "defs": ["a small vial for carrying holy water from Gangā river."]}], "ಕಾಶಿಕೆ": [{"type": "noun", "defs": ["a kind of jasmine plant.", "its flower."]}], "ಕಾಶಿತಾಲಿ": [{"type": "noun", "defs": ["a very small concave, metal plate, usu. of gold, attached to the necklace and worn by married women."]}, {"type": "noun", "defs": ["= ಕಾಶಿಕುಪ್ಪೆ."]}], "ಕಾಶಿತುಂಬೆ": [{"type": "noun", "defs": ["a small plant of Lamiaceae family, with small, white flowers, akin to Leucas aspera."]}], "ಕಾಶಿನಾಥ": [{"type": "noun", "defs": ["Śiva, the presiding deity of the city ಕಾಶಿ."]}], "ಕಾಶಿಪಟ್ಟೆ": [{"type": "noun", "defs": ["silk cloth made in the city ಕಾಶಿ, known for its fineness and beauty."]}], "ಕಾಶಿಬಿಂದು": [{"type": "noun", "defs": ["the nearly circular light-coloured area at the back of the retina where the optic nerve enters the eyeball and which is not sensitive to light; optic disk."]}], "ಕಾಶಿಹುಲ್ಲು": [{"type": "noun", "defs": ["the grass Cymbopogon caesius of Poaceae family; ginger grass."]}], "ಕಾಶೀಯಾತ್ರೆ": [{"type": "noun", "defs": ["a journey made by a pilgrim to the holy city ಕಾಶಿ in Uttar Pradesh, North India.", "an imitation of this by the bridegroom, as a marriage convention.", "ಕಾಶೀಯಾತ್ರೆಗೆ ಹೋಗು kāśīyātrege hōgu (fig.) to go to a distant place, leaving behind one's family."]}], "ಕಾಶೀರಾಮಕ್ರಿಯೆ": [{"type": "noun", "defs": ["(mus.) in Karnāṭaka system, fiftieth of the seventy two main modes."]}], "ಕಾಶೆ": [{"type": "noun", "defs": ["= ಕಾಶಿ3."]}, {"type": "noun", "defs": ["= ಕಾಶ -3."]}], "ಕಾಶ್ಮರಿ": [{"type": "noun", "defs": ["= ಕಾಶ್ಮೀರಿ3."]}], "ಕಾಶ್ಮರಿಯ": [{"type": "noun", "defs": ["= ಕಾಶ್ಮೀರಿ3."]}], "ಕಾಶ್ಮರ್ಯ": [{"type": "noun", "defs": ["= ಕಾಶ್ಮೀರಿ3."]}], "ಕಾಶ್ಮೀರ": [{"type": "noun", "defs": ["the northern most state of Indian Republic, now termed as \"Jammu and Kāśmira'."]}], "ಕಾಶ್ಮೀರಜ": [{"type": "adjective", "defs": ["born in the state of ಕಾಶ್ಮೀರ."]}, {"type": "noun", "defs": ["the perennial plant Crocus sativus of Iridaceae family with funnel-shaped, purplish flowers having orange stigmas; saffron plant.", "the dried, aromatic stigmas of this plant, used in flavouring and colouring foods; saffron.", "a red pigment , applied by women on their forehead, as a sign of auspiciousness; vermilion."]}], "ಕಾಶ್ಮೀರಜಳ": [{"type": "noun", "defs": ["water mixed with vermilion."]}], "ಕಾಶ್ಮೀರಭೂಮಿ": [{"type": "noun", "defs": ["red or dull-red earth."]}], "ಕಾಶ್ಮೀರರಾಗ": [{"type": "noun", "defs": ["the colour of vermilion; red colour.", "an application of vermilion on the body."]}], "ಕಾಶ್ಮೀರಶೈವ": [{"type": "noun", "defs": ["one of the eight Śaiva sects."]}], "ಕಾಶ್ಮೀರಿ": [{"type": "adjective", "defs": ["of or belonging, particular to the state of ಕಾಶ್ಮೀರ, its people or language."]}, {"type": "noun", "defs": ["the Indo-Aryan language of the state of ಕಾಶ್ಮೀರ.", "a man from, inhabitant of, that state."]}, {"type": "noun", "defs": ["the large-sized, deciduous tree Gmelina arborea (= Premna arborea) of Verbenaceae family; Cashmere tree.", "its wood."]}], "ಕಾಶ್ಮೀರಿಶಾಲು": [{"type": "noun", "defs": ["an oblong cloth, earlier made in Kā śmīra state, used as a covering for the head or shoulders."]}], "ಕಾಶ್ಯ": [{"type": "noun", "defs": ["brightness; splendour."]}, {"type": "noun", "defs": ["a liquid substance distilled or fermented alcoholic beverage."]}], "ಕಾಶ್ಯಪ": [{"type": "adjective", "defs": ["belonging to the sage Kaśyapa, his school or lineage."]}, {"type": "noun", "defs": ["any sage belonging to the lineage of a Vedic sage Kaśyapa.", "Kaṇāda, the founder of Vaiśeṣika school of philosophy."]}], "ಕಾಶ್ಯಪಗೋತ್ರ": [{"type": "noun", "defs": ["the lineage of a Vedic sage Kaśyapa."]}], "ಕಾಶ್ಯಪಿ": [{"type": "noun", "defs": ["a son of the sage Kaśyapa.", "Aruṇa, the mythological charioteer of the Sun-God.", "Garuḍa, the king of birds and vehicle of Viṣṇu."]}, {"type": "noun", "defs": ["the earth."]}], "ಕಾಷಾಯ": [{"type": "adjective", "defs": ["of the colour of ochre; esp., dark yellow or reddish brown."]}, {"type": "noun", "defs": ["= ಕಾಷಾಯವಸ್ತ್ರ.", "that which is causal or causative for producing joy and sorrow as its effect."]}], "ಕಾಷಾಯಧಾರಿ": [{"type": "noun", "defs": ["a person, usu. an ascetic or mendicant, wearing red or reddish cloth."]}], "ಕಾಷಾಯವಸನ": [{"type": "noun", "defs": ["= ಕಾಷಾಯವಸ್ತ್ರ."]}], "ಕಾಷಾಯವಸ್ತ್ರ": [{"type": "noun", "defs": ["red or reddish brown cloth, usu. worn by ascetics and mendicants."]}], "ಕಾಷ್ಟ": [{"type": "noun", "defs": ["= ಕಾಷ್ಠೆ."]}], "ಕಾಷ್ಠ": [{"type": "noun", "defs": ["= ಕಾಷ್ಠೆ."]}, {"type": "noun", "defs": ["a dry piece of wood or a stick.", "a peg of wood, metal, etc., used esp. for fastening or holding things together; a bolt; a pin.", "a stupid man.", "(fig.) the state of being very lean."]}], "ಕಾಷ್ಠಕದಳಿ": [{"type": "noun", "defs": ["= ಕಾಷ್ಠಬಾೞೆ."]}], "ಕಾಷ್ಠಕರ್ಮ": [{"type": "noun", "defs": ["a working on wood; the work or trade of a carpenter."]}], "ಕಾಷ್ಠಕುದ್ದಾಲ": [{"type": "noun", "defs": ["a tool with long handle, broad wooden blade for scraping, raking or draging withered leaves, frond, and other rubbish; a wooden shovel."]}], "ಕಾಷ್ಠಜ್ಯೋತಿ": [{"type": "noun", "defs": ["a plant."]}], "ಕಾಷ್ಠತಕ್ಷಕ": [{"type": "noun", "defs": ["a worker, craftsman who works in wood, builds and repairs wooden things; a carpenter."]}], "ಕಾಷ್ಠತರಂಗ": [{"type": "noun", "defs": ["a musical percussion instrument consisting of a series of wooden bars graduated in length that produce the notes of the scale when struck with mallets; a xylophone."]}], "ಕಾಷ್ಠತೆ": [{"type": "noun", "defs": ["the state of being or the quality of having the charecteristics of, a wooden piece, stick, etc."]}], "ಕಾಷ್ಠನಲ್ಲಿ": [{"type": "noun", "defs": ["the tree Garuga pinnata of Burseraceae family.", "its plum."]}], "ಕಾಷ್ಠಬಾೞೆ": [{"type": "noun", "defs": ["the tree Musa paradisiaca of Musaceae family.", "its fruit."]}], "ಕಾಷ್ಠಭಾರ": [{"type": "noun", "defs": ["a bundle of firewood pieces."]}], "ಕಾಷ್ಠವ್ಯಸನ": [{"type": "noun", "defs": ["(fig.) a worrying or becoming anxious about minor necessities, circumstances of relatively low worth.", "worldly. as distinguished from spiritual, worry or concern."]}], "ಕಾಷ್ಠಾಂಬರ": [{"type": "noun", "defs": ["a naked man."]}], "ಕಾಷ್ಠಾಂಬುವಾಹಿನಿ": [{"type": "noun", "defs": ["a wooden vessel or bucket for taking out the water from a boat or ship."]}], "ಕಾಷ್ಠಾಗುರು": [{"type": "noun", "defs": ["the plant Erycibe paniculata of Convolvulaceae family."]}], "ಕಾಷ್ಠಾಘಾತ": [{"type": "noun", "defs": ["a striking with a stick or with a piece of wood; impact of such a blow."]}], "ಕಾಷ್ಠಾವ್ಯಸನ": [{"type": "noun", "defs": ["ಕಾಷ್ಠವ್ಯಸನ."]}], "ಕಾಷ್ಠಾಹರಣ": [{"type": "noun", "defs": ["the act of getting or procuring firewood."]}], "ಕಾಷ್ಠಿಕೆ": [{"type": "noun", "defs": ["a piece of (dried) wood; firewood."]}], "ಕಾಷ್ಠೀಲೆ": [{"type": "noun", "defs": ["the plantain tree Musa sapientum (var. martabanica) of Musaceae family.", "its fruit.", "the plant Calotropis gigantea (= C. procera) of Asclepiadaceae family; the sun-plant."]}], "ಕಾಷ್ಠೆ": [{"type": "noun", "defs": ["an object or end that one strives to attain; an aim; a goal.", "the final, culminating element or event in a series; highest point, the last limit; extremity; climax.", "a quarter or region of the world; direction.", "a limit; boundary; border.", "a measure of time; (a duration, varying differently according to different systems - of eighteen, fifteen minutes or equal to eighteen winks).", "the quality of excelling; excellence.", "a favourable, comfortable situation or condition.", "the quality or fact of being clear, obvious, apparent."]}], "ಕಾಸ": [{"type": "noun", "defs": ["the act of blowing, blooming, developing (as a flower).", "brightness; illumination; lustre."]}, {"type": "noun", "defs": ["the act or sound of coughing; cough.", "a gen. chronic disorder characterised by wheezing, coughing, difficulty in breathing, and a suffocating feeling, caused by an allergy to inhaled substances, stress, etc.; asthma."]}, {"type": "noun", "defs": ["of, belonging to or concerning a particular person.", "important."]}], "ಕಾಸಂಟ": [{"type": "noun", "defs": ["= ಕಾಸಟ."]}], "ಕಾಸಗಾರ": [{"type": "noun", "defs": ["= ಕಾಸದಾರ."]}], "ಕಾಸಗಿ": [{"type": "adjective", "defs": ["of, belonging or peculiar to a certain person; concerning to oneself; not common or general; private; individual.", "belonging to, run or owned by an individual or group of individuals without help or intervention by the state."]}, {"type": "noun", "defs": ["the short stumps of grain, corn, etc., collectively, left standing after harvesting; stubble."]}], "ಕಾಸಘ್ನಿ": [{"type": "noun", "defs": ["the prickly nightshade Solanum jacquini of Solanaceae family.", "its fruit."]}], "ಕಾಸಜಿತ್ತು": [{"type": "adjective", "defs": ["that is curing asthma."]}, {"type": "noun", "defs": ["= ಕಾಸಘ್ನಿ."]}], "ಕಾಸಟ": [{"type": "noun", "defs": ["a kind of inferior, coarse cloth."]}], "ಕಾಸಡೆ": [{"type": "noun", "defs": ["a worthless thing."]}], "ಕಾಸದಾರ": [{"type": "noun", "defs": ["= ಕಾಸುದಾರ."]}], "ಕಾಸಮರ್ದ": [{"type": "noun", "defs": ["the plant Cassia sophera of Caesalpiniaceae family."]}], "ಕಾಸರ": [{"type": "noun", "defs": ["= ಕಾಸರ್ಕ."]}, {"type": "noun", "defs": ["the male water buffalo Bubalus bubalis, either domesticated or wild."]}, {"type": "noun", "defs": ["a large tract of uncultivated land covered with trees and undergrowth; a forest."]}], "ಕಾಸರದೇವಿ": [{"type": "noun", "defs": ["the goddess of forest."]}], "ಕಾಸರಿ": [{"type": "noun", "defs": ["the tree Gmelina arborea (= Premna arborea) of Verbenaceae family; Cashmere tree.", "its wood."]}, {"type": "noun", "defs": ["the female water-buffalo Bubalus bubalis, either domesticated or wild."]}], "ಕಾಸರಿಕೆ": [{"type": "noun", "defs": ["the potherb Cissus quadrangularis (= Vitis quadrangularis) of Vitaceae family."]}], "ಕಾಸರಿಗ": [{"type": "noun", "defs": ["= ಕಾಸರ್ಕ."]}], "ಕಾಸರು": [{"type": "noun", "defs": ["= ಕಾಸರ್ಕ."]}], "ಕಾಸರ್ಕ": [{"type": "noun", "defs": ["the medium-sized tree Strychnos nux-vomica of Loganiaceae family.", "its poisonous nut containing strychnine, brucine and other alkaloids; nux-vomica."]}], "ಕಾಸರ್ಕಣ": [{"type": "noun", "defs": ["= ಕಾಸರ್ಕ."]}], "ಕಾಸಲಿಕೆ": [{"type": "noun", "defs": ["= ಕಾಸರಿಕೆ."]}], "ಕಾಸವಿಸಿಬಡು": [{"type": "verb", "defs": ["to become uncomfortable; to have agitation in the mind; to be upset; to become restless; to be embarrassed."]}], "ಕಾಸಾ": [{"type": "noun", "defs": ["of, belonging to or concerning a particular person.", "important."]}], "ಕಾಸಾದಂಡ": [{"type": "noun", "defs": ["the rod or stick of a whip."]}], "ಕಾಸಾಯ": [{"type": "noun", "defs": ["red or reddish brown cloth, usu. worn by ascetics and mendicants."]}], "ಕಾಸಾರ": [{"type": "noun", "defs": ["a smith who works in brass, bronze or copper, making and repairing vessels and other articles."]}, {"type": "noun", "defs": ["a body of water, smaller than a lake; a pond."]}], "ಕಾಸಾರಗೊಳಿಸು": [{"type": "verb", "defs": ["to build a pond.", "(fig.) to overwhelm as with a flood."]}], "ಕಾಸಾರಜೀವಿಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["the science that deals with the physical, chemical, and biological properties and features of lakes and ponds; limnology."]}], "ಕಾಸಾವೀಶಿ": [{"type": "noun", "defs": ["= ಕಾಸಾವೀಸಿ."]}], "ಕಾಸಾವೀಸಿ": [{"type": "noun", "defs": ["an uncomfortable feeling; agitation of the mind; the state of being upset; restlessness; embarrassment."]}], "ಕಾಸಿ": [{"type": "noun", "defs": ["= ಕಾಸೆ1."]}, {"type": "noun", "defs": ["= ಕಾಸೆ2."]}, {"type": "noun", "defs": ["= ಕಾಸಿಗ."]}, {"type": "noun", "defs": ["ಕಾಶಿ, a holy city in Uttar Pradesh, in North India, on the Gangā river."]}], "ಕಾಸಿಕಾಗಡಿ": [{"type": "noun", "defs": ["= ಕಾಸಿಕಾವಡಿ."]}], "ಕಾಸಿಕಾವಡಿ": [{"type": "noun", "defs": ["a bamboo, split lengthwise, with slings on both sides for carrying holy water in pitchers from the river Gangā."]}], "ಕಾಸಿಗ": [{"type": "noun", "defs": ["a man working in metal.", "a man who engraves letters on rocks."]}], "ಕಾಸಿಗಪ್ಪಡ": [{"type": "noun", "defs": ["= ಕಾಸಾಯ."]}], "ಕಾಸಿನಗಿಡ": [{"type": "noun", "defs": ["the plant Cichorium endivia of Asteraceae family."]}], "ಕಾಸಿನಸರ": [{"type": "noun", "defs": ["the plant Andrographis serpyllifolia of Acanthaceae family."]}], "ಕಾಸಿನಸೇವಂತಿಕೆ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಕಾಸಿನಿಗಿಡ": [{"type": "noun", "defs": ["= ಕಾಸಿನಗಿಡ."]}], "ಕಾಸಿಸು": [{"type": "verb", "defs": ["to make warm or hot."]}], "ಕಾಸಿಹುಲ್ಲು": [{"type": "noun", "defs": ["the grass Cymbopogon caesius of Poaceae family; ginger grass.", "another grass Cymbopogon martini (= Andropogon jwarancusa) of the same family."]}], "ಕಾಸೀಸ": [{"type": "noun", "defs": ["a green, crystalline compound, FeSO47H2O, used in dyeing, the making of ink, etc.; copperas."]}], "ಕಾಸು": [{"type": "verb", "defs": ["to make hot or warm; to cook."]}, {"type": "noun", "defs": ["an old copper coin.", "(in gen.) money.", "ಕಾಸಿನಸರ2 kāsina sara a necklace which is attached with small round gold plates; ಕಾಸಿಗೂ ಕಡೆ kāsigū kaḍe absolutely worthless; ಕಾಸಿಗೆ ತಕ್ಕ ಕಜ್ಜಾಯ kāsige takka kajjāya something that costs little and is of very bad quality; cheap and nasty; cheapness hardly ensures good quality; ಮೂರು ಕಾಸಿಗೂ ಕೇಳದಿರು mūru kāsigū kēḷadiru to look at (something) as completely worthless; ಕಾಸಿಗೆ ಕಾಸು ಗಂಟುಹಾಕು kāsige kāsu gaṇṭu hāku to accumulate money in a stingy manner, even at the epense of personal comfort; ಕಾಸಿಗೊಂದು ಕೊಸರಿಗೆ ಒಂದು (ಎರಡು) kāsigondu k osarige ondu (eraḍu) very cheap and available in plenty; ಕಾಸಿದ್ದರೆ ಕೈಲಾಸ kāsiddare kailāsa comforts, enjoyments, preference in society, etc. are meant only for rich; ಕಾಸಿದ್ದವರು ಕೈಲಾಸಕ್ಕೆ ಹೋಗುತ್ತಾರೆ kāsiddavaru kailāsakke hōguttāre they who have got good store of butter my lay it thick on their bread; ಕಾಸು ಇಲ್ಲದವ ಕಲ್ಲಿಗೆ ಸಮ kāsu illadava kallige sama he who has no money, has neither friends nor credit."]}, {"type": "noun", "defs": ["a net-work of rope or metal string hung from roof-beam of the house for keeping vessels; a swinging shelf."]}, {"type": "noun", "defs": ["a weapon consisting of a long wooden or metal shaft with a sharp point, usu. of metal, for thrusting or throwing; a spear."]}], "ಕಾಸುದಾರ": [{"type": "noun", "defs": ["a man or boy whose work is tending, feeding, and currying horses; a groom.", "one who subserviently serves another; a slave."]}], "ಕಾಸುವೀಸ": [{"type": "noun", "defs": ["an old coin of very small value."]}], "ಕಾಸುಳಿ": [{"type": "noun", "defs": ["the plant Sida indica of Malvaceae family."]}], "ಕಾಸೆ": [{"type": "noun", "defs": ["a unsewn, oblong cloth worn by men around the waiste to cover the lower parts and one end of which is taken between the legs and tucked behind at the waist band; a dhōti.", "an oblong, unsewn cloth, as a towel, used to tie around the waiste.", "a sewn cloth, tight-fitting underwear, worn as girding for the loins; an underclothing."]}, {"type": "noun", "defs": ["red or reddish brown cloth, usu. worn by ascetics and mendicants.", "the red or reddish brown colour."]}, {"type": "noun", "defs": ["(dial.) a slender, threadlike structure that combines with others to form vegetable tissue; a fibre."]}], "ಕಾಸೆಗಟ್ಟು": [{"type": "verb", "defs": ["to wear a dhōti (an oblong, unsewn cloth) and tuck one end of it at the waist band at the back, taking it between the legs."]}], "ಕಾಸೆಮೊಚ್ಚೆಯ": [{"type": "noun", "defs": ["a brown footwear."]}], "ಕಾಸ್ತಾರ": [{"type": "noun", "defs": ["= ಕಾಸುದಾರ."]}], "ಕಾಸ್ದಾರ": [{"type": "noun", "defs": ["= ಕಾಸುದಾರ."]}], "ಕಾಸ್ಮೀರಭೂಮಿ": [{"type": "noun", "defs": ["red or dull-red earth."]}], "ಕಾಹ": [{"type": "noun", "defs": ["the act or an instance of guarding."]}], "ಕಾಹಕ": [{"type": "noun", "defs": ["a person who guards (another or another's property etc.)."]}], "ಕಾಹಲ": [{"type": "noun", "defs": ["= ಕಾಹಳೆ."]}, {"type": "noun", "defs": ["a cat.", "a cock; a rooster.", "a crow.", "a sound in gen."]}], "ಕಾಹಲೆ": [{"type": "noun", "defs": ["= ಕಾಹಳೆ.", "a big military drum."]}], "ಕಾಹಳ": [{"type": "noun", "defs": ["= ಕಾಹಳೆ."]}], "ಕಾಹಳಿ": [{"type": "noun", "defs": ["a kind of plant."]}, {"type": "noun", "defs": ["= ಕಾಹಳೆ."]}], "ಕಾಹಳೆ": [{"type": "noun", "defs": ["a horn-shaped metal trumpet; a bugle."]}], "ಕಾಹಿ": [{"type": "noun", "defs": ["a man who tends, protects, watches, etc."]}], "ಕಾಹಿಗ": [{"type": "noun", "defs": ["= ಕಾಹಿ."]}], "ಕಾಹಿಲೆ": [{"type": "noun", "defs": ["any departure from health; illness in general; sickness.", "(fig.) any harmful or destructive condition, as of society organisation, etc."]}], "ಕಾಹು": [{"type": "noun", "defs": ["the act, fact or an instance of guarding, protecting; protection.", "a cermony performed on the seventh day from the date of birth of a baby to protect the baby from possible danger, evil spirits, etc.", "a protective wall or hedge around something.", "an armlet worn to protect against danger or harm.", "the state of being under the custody of another; imprisonment.", "a mark made with a lamp black on the chin, cheek or forehead either to protect against evil spirits, bad look, etc or for good luck."]}, {"type": "noun", "defs": ["the quality of being hot; hotness; heat.", "intense anger; rage; fury; anger.", "the quality of being intense; great energy or vehemence of emotion, thought or activity; intensity."]}], "ಕಾಹುರ": [{"type": "noun", "defs": ["strong vengeful anger or indignation; wrath.", "the state of being excited or being anxious.", "a man marked by impulsive vehemence or passion; an impetuous man."]}, {"type": "noun", "defs": ["a stream in a forest."]}], "ಕಾಹುರತೆ": [{"type": "noun", "defs": ["the state of being bewildered; bewilderment."]}], "ಕಾಹೇಱು": [{"type": "verb", "defs": ["(temperature, hotness) to rise.", "(anger) to increase.", "(enthusiasm, zeal, anxiety, tension etc.) to grow."]}], "ಕಾಹೊನಲ್": [{"type": "noun", "defs": ["a stream in a forest."]}], "ಕಾಳ್": [{"type": "noun", "defs": ["a forest (only in comp.).", "that which is low, mean, base or inferior in quality."]}, {"type": "noun", "defs": ["the colour of coal or pitch; black colour."]}], "ಕಾಳ": [{"type": "noun", "defs": ["an evil or wicked man; a man guilty of or likely to commit crimes; a scoundrel; a villain."]}, {"type": "adjective", "defs": ["opposite to white; of the colour of coal or pitch; black.", "inflicting or tending to inflict pain, agony, etc.", "causing a feeling of horror; terrible; dreadful; frightful; terrifying."]}, {"type": "noun", "defs": ["time - a) the system of those sequential relations that any event has to any other, as past, present or future; indefinite and continuous duration regarded as that in which events succeed one another; b) the period between two events or during which something exists, happens or acts; measured or measurable interval; c) any period in the history of man or of the universe, often esp. with reference to a characteristic social structure, set of customs, famous person living then, etc. d) a definite point of time, as indicated by a clock; e) an indefinite period extending into the future; f) a particular period in a day, year; g) an appointed, favourable, proper or convenient time; h) (musc.) relative rapidity of movement; the rate of speed at which a composition or passage is played; tempo.", "a period of 12 months (occasionally, 13 months in some calendars); a year.", "any of the two fortnights of a lunar month.", "cessation of life; death.", "Yama, the Death-God.", "the suposed agency, that determines the course of events; destiny.", "power; strength.", "the ending of the universe; universal dissolution.", "the colour of coal; the black colour.", "Śiva.", "Viṣṇu.", "Brahma.", "Śani, corresponding to Saturn, believed to be one of the nine planets that affect the course of one's life.", "the ruler of a state; a king.", "the edible fruit of the tree Ziziphus jujuba (= Z. mauritiana); Indian cherry; Indian plum.", "(myth.) one of the eight serpents; black cobra.", "(myth.) one of the hells where severe punishment for one's sin is awarded.", "(myth.) one of the seven tongues (or flames) of fire.", "the plant Homalium zeylanicum of Flacourtiaceae family.", "(gram.) the time of the action or state of being, as past, present or future, that a verb expresses in a sentence; tense.", "the Indian cuckoo.", "one who distils and sells spirituous liquor."]}], "ಕಾಳಂಕ": [{"type": "noun", "defs": ["a secret path.", "a path used by thieves.", "an improper, unfit, immoral way or manner."]}, {"type": "noun", "defs": ["a mark that mars the appearance, as a stain, spot, scar, etc. ; a mark left on the skin or other tissue after a wound, burn, ulcer, pustule, lesion, etc. has healed; cicatrix.", "any flaw, defect, stigma or shortcoming; deficiency.", "the black colour."]}], "ಕಾಳಂಕಧರ": [{"type": "noun", "defs": ["Śiva, who has a black mark on his throat."]}], "ಕಾಳಂಗೆಯ್": [{"type": "verb", "defs": ["to cease to live; to suffer death; to die."]}], "ಕಾಳಂಜಿ": [{"type": "noun", "defs": ["a vessel for sprinkling scented water.", "a jarlike container to spit into; a spittoon; a cuspidor."]}], "ಕಾಳಂಜಿಯಗಿಡು": [{"type": "noun", "defs": ["a kind of plant."]}], "ಕಾಳಕಂಠ": [{"type": "noun", "defs": ["Siva, whose throat is black.", "a bird of small size, belonging to Passeridae family; a house sparrow."]}], "ಕಾಳಕಂಧರ": [{"type": "noun", "defs": ["= ಕಾಳಕಂಠ."]}], "ಕಾಳಕತ್ತಲೆ": [{"type": "noun", "defs": ["= ಕಾಳಗತ್ತಲೆ."]}], "ಕಾಳಕೂಟ": [{"type": "noun", "defs": ["a deadly poison.", "(myth.) a deadly poison churned out of the cosmic ocean, drunk by Śiva, to save the world from it."]}], "ಕಾಳಕೃತಾಂತ": [{"type": "noun", "defs": ["= ಕಾಳಯಮ."]}], "ಕಾಳಗ": [{"type": "noun", "defs": ["a fight, esp. a large-scale engagement, between armed forces on land, at sea or in the air; armed fighting; combat or war; a battle."]}], "ಕಾಳಗತ್ತಲು": [{"type": "noun", "defs": ["= ಕಾಳಗತ್ತಲೆ."]}], "ಕಾಳಗತ್ತಲೆ": [{"type": "noun", "defs": ["absolute darkness; complete absence of light; pitch-darkness."]}], "ಕಾಳಗದಾಯ": [{"type": "noun", "defs": ["a tax levied to raise funds for meeting war expenditure; a war-tax."]}], "ಕಾಳಗವಲಗೆ": [{"type": "noun", "defs": ["a flat, usu. broad, piece of metal, wood, etc., carried in the hand or worn on the forearm to ward off blows or missiles; a shield."]}], "ಕಾಳಗವಾಡು": [{"type": "verb", "defs": ["to engage in a large-scale fight; to engage in an armed fighting."]}], "ಕಾಳಗವೆಸಗು": [{"type": "verb", "defs": ["= ಕಾಳಗವಾಡು.", "(a war) to be waged."]}], "ಕಾಳಜಟ್ಟಿಗ": [{"type": "noun", "defs": ["a fierce wrestler."]}], "ಕಾಳಜಿ": [{"type": "noun", "defs": ["interest in or regard for a person or thing; concern.", "care or consideration; attention.", "ಕಾಳಜಿ ತೆಗೆದುಕೊ kāḷaji tegeduko = ಕಾಳಜಿಮಾಡು; ಕಾಳಜಿಮಾಡು kāḷaji māḍu = to feel for the well being, safety, of (another); to show affectionate concern for another person or for a thing, programme, etc."]}], "ಕಾಳಜೀರಿಗೆ": [{"type": "noun", "defs": ["the plant Centrantherum anthelmenticum (= Vernonia anthelmentica) of Asteraceae family; wild cumin."]}], "ಕಾಳತನ": [{"type": "noun", "defs": ["want of civility and culture; unrefinedness; rudeness of manners; barbarism."]}], "ಕಾಳತುಳಸಿ": [{"type": "noun", "defs": ["the plant Ocimum sanctum of Lamiaceae family; sacred basil; holy basil."]}], "ಕಾಳದಂಡ": [{"type": "noun", "defs": ["the staff of death; the emblem of Yama, the god of death.", "anything that is devastating."]}], "ಕಾಳನಿದ್ರೆ": [{"type": "noun", "defs": ["the fact of dying; permanent end of one's life; death."]}], "ಕಾಳಬುದ್ಧಿ": [{"type": "noun", "defs": ["the quality of being morally bad or wrong, acting with evil intent; wickedness."]}], "ಕಾಳಭ": [{"type": "noun", "defs": ["a young elephant."]}], "ಕಾಳಮತ್ರ್ಯ": [{"type": "noun", "defs": ["a wicked person."]}], "ಕಾಳಮಾಳೆ": [{"type": "noun", "defs": ["(dial.) a children's play."]}], "ಕಾಳಮುೂತ್ರ": [{"type": "noun", "defs": ["a severe, often fatal complication of malaria characterised by a rapid heart-beat and the passing of dark urine; black-water fever."]}], "ಕಾಳಮೇಘ": [{"type": "noun", "defs": ["the cloud that causes final dissolution of the universe.", "the plant Andrographis paniculata (= Justicia paniculata) of Acanthaceae family."]}], "ಕಾಳಯಮ": [{"type": "noun", "defs": ["the all-devastating Divine Law-Giver; death as personified in a formidable form.", "Śiva , who controls absolutely Yama, the Death God.", "natural death.", "ಆಳುಕಾಳು ಇದ್ದವನಾದರೆ ಕಾಳಯಮ ಬಿಟ್ಟಾನೆ? āḷukāḷu iddavanādare kāḷayama biṭṭāne? Death is the inevitable end of every one; Death-God has no favour for, nor prejudice against anyone."]}], "ಕಾಳಯುಕ್ತಿ": [{"type": "noun", "defs": ["the fifty second year of sixty-year cycle of Hindu reckoning."]}], "ಕಾಳರಕ್ಕಸ": [{"type": "noun", "defs": ["a black or fierce male demon."]}], "ಕಾಳರಕ್ಕಸಿ": [{"type": "noun", "defs": ["a black or fierce female demon."]}], "ಕಾಳರಸು": [{"type": "noun", "defs": ["a tyrannical, despotic king; a tyrant; a despot.", "the ruling of a tyrannical king."]}], "ಕಾಳರಸುಗೆಯ್": [{"type": "verb", "defs": ["to rule tyranically or despotically."]}], "ಕಾಳರಾಜ": [{"type": "noun", "defs": ["the regent deity of time.", "the Death God, Yama."]}], "ಕಾಳರಾತ್ರಿ": [{"type": "noun", "defs": ["a night that is absolutely dark.", "the night of all-destroying time; the time of dissolution of the universe.", "a formidable form of Goddess Pārvati.", "the new-moon day of Āśvayuja month (last day of the seventh month) of Hindu Lunar calendar."]}], "ಕಾಳವಟ್ಟ": [{"type": "noun", "defs": ["a stance in sword fighting.", "name of the bow of Karṇa, one of the heros in the epic Mahābhārata."]}], "ಕಾಳಸ": [{"type": "noun", "defs": ["= ಕಾಳಸೆ."]}, {"type": "noun", "defs": ["the tanned hide of animals, as of deer, etc., used to sit on."]}], "ಕಾಳಸಂಚು": [{"type": "noun", "defs": ["a wicked plot to overthrow a ruler, government or to cheat in a heinous manner."]}], "ಕಾಳಸಂತೆ": [{"type": "noun", "defs": ["a place or system for selling goods illegally, as in violation of rationing or to avoid paying the prescribed tax, etc. a black market."]}], "ಕಾಳಸಂಬಡೆ": [{"type": "verb", "defs": ["to get fused together; to adhere to; to blend with; to be attached to."]}], "ಕಾಳಸರ್ಪ": [{"type": "noun", "defs": ["the black and most poisonous variety of the cobra.", "(astrol.) a particular occasion in which other seven planets are clustered between Rāhu and Kētu."]}], "ಕಾಳಸಾವಿಗೆ": [{"type": "noun", "defs": ["the tree Sterculia villosa of Sterculiaceae family; elephant rope tree."]}], "ಕಾಳಸೆ": [{"type": "noun", "defs": ["the quality of adhereing, blending with or the fact of being adhered firmly or fused with, another.", "the quality of being intense; intensity.", "the act of joining two things together.", "(musc.) complete agreement; harmony, concord.", "(dance.) a particular movement; elegance in the movement of a dancer.", "the quality which makes a literary work a whole."]}], "ಕಾಳಸೆಗೊಳ್": [{"type": "verb", "defs": ["= ಕಾಳಸಂಬಡೆ."]}], "ಕಾಳಸ್ಕಂಧ": [{"type": "noun", "defs": ["the tree Pongamia glabra (= P. pinnata) of Papilionaceae family; Indian beach.", "the tree Zanthoxylum armatum (= Z. alatum) of Rutaceae family (?)."]}], "ಕಾಳಹಸ್ತ": [{"type": "noun", "defs": ["(fig.) the hand of Death-God.", "a dreadful thing that causes death or destruction."]}], "ಕಾಳಹೊಗೆ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಕಾಳಾಂಚಿ": [{"type": "noun", "defs": ["= ಕಾಳಾಂಜಿ1."]}], "ಕಾಳಾಂಜನ": [{"type": "noun", "defs": ["a black collyrium.", "the plant Helleborus niger of Ranunculaceae family.", "name of a mountain."]}], "ಕಾಳಾಂಜನಿ": [{"type": "noun", "defs": ["= ಕಾಳಾಂಜನ -2."]}], "ಕಾಳಾಂಜಿ": [{"type": "noun", "defs": ["an estate passed down by, inherited by a legal heir from an ancestor; hereditary property.", "hereditary right to lands, fees of office, etc."]}, {"type": "noun", "defs": ["a vessel for sprinkling scented water, 2) a jarlike container to spit into; a spittoon; a cuspidor."]}], "ಕಾಳಾಂಜಿಗೆ": [{"type": "noun", "defs": ["= ಕಾಳಾಂಜಿ2 -1."]}], "ಕಾಳಾಂಜಿಸೊಪ್ಪು": [{"type": "noun", "defs": ["a kind of plant."]}], "ಕಾಳಾಂಧಕಾರ": [{"type": "noun", "defs": ["absolute darkness; complete absence of light; pitch-darkness."]}], "ಕಾಳಾಂಬುವಾಹ": [{"type": "noun", "defs": ["black cloud, that brings rain."]}], "ಕಾಳಾಕಳು": [{"type": "noun", "defs": ["a black cow."]}], "ಕಾಳಾಗರು": [{"type": "noun", "defs": ["the tree Aquilaria agallocha of Thymelaeaceae family.", "its wood."]}], "ಕಾಳಾಗಿಸು": [{"type": "verb", "defs": ["to damage or injure in such a way as to make useless, valueless, etc.; to spoil."]}], "ಕಾಳಾಗು": [{"type": "verb", "defs": ["to become useless, valueless, etc.; to be spoiled.", "to become troublesome; to trouble."]}], "ಕಾಳಾಗುರು": [{"type": "noun", "defs": ["= ಕಾಳಾಗರು."]}], "ಕಾಳಾಗ್ನಿ": [{"type": "noun", "defs": ["the all-devastating fire that ends the existence of the universe."]}], "ಕಾಳಾಗ್ನಿರುದ್ರ": [{"type": "noun", "defs": ["Śiva, in the form of formidable and all-devastating fire, at the time of destruction of the universe."]}], "ಕಾಳಾಡು": [{"type": "noun", "defs": ["a forest goat; a wild goat."]}], "ಕಾಳಾನಲ": [{"type": "noun", "defs": ["the mythological fire that destroys the universe.", "(fig.) a large, destructive fire."]}], "ಕಾಳಾಪಾಣಿ": [{"type": "noun", "defs": ["an enforced living in a small island (formerly in Andaman islands), as a punishment; a sending to an isolate island, in exile."]}], "ಕಾಳಾಮುಖ": [{"type": "noun", "defs": ["a South Indian sect of Pāśupata cult with tāntric connections, members of which wear a black mark on their foreheads."]}], "ಕಾಳಾಯಸ": [{"type": "noun", "defs": ["a malleable, magnetic, readily oxidisable metal which is a chemical element of the transition series (atomic no. 26), occurs abundantly in certain ores and in meteorites, and is widely used, chiefly in alloys such as steel, for tools, implements, structures, machinery, etc.; iron."]}], "ಕಾಳಾಸ": [{"type": "noun", "defs": ["= ಕಾಳಸೆ."]}], "ಕಾಳಾಸಿಸು": [{"type": "verb", "defs": ["to cause to join, adhere or blend with or together."]}], "ಕಾಳಾಹಿ": [{"type": "noun", "defs": ["a poisonous black serpent; a black cobra."]}], "ಕಾಳಾಹಿವೇಣಿ": [{"type": "noun", "defs": ["a long, black braided hair (that resembles a black cobra).", "a woman having such hair."]}], "ಕಾಳಿ": [{"type": "noun", "defs": ["unquietness of the mind from agitation or confusion."]}, {"type": "noun", "defs": ["the most formidable, wrathful form of Mother-Goddess Pārvati, representing the destructive aspect of mother-nature.", "a woman of black complexion.", "a dreadful woman.", "a minor goddess, fond of blood.", "the colour of coal or pitch; black colour.", "the period of actual darkness after sunset and before sunrise; night.", "blame; censure.", "one of the seven tongues of fire.", "a black or darkish kind of coral.", "ಕಾಳಿಯನ್ನು ಬೋಳಿ ಮಾಡು, ಬೋಳಿಯನ್ನು ಕಾಳಿ ಮಾಡು kāḷīyannu bōḷi māḍu, boḷīyannu kāḷī māḍu (informal use) to manage by unfair, dexterous contrivance or influence; to manipulate unfairly."]}], "ಕಾಳಿಂಗ": [{"type": "noun", "defs": ["name of a country.", "people of that country.", "any ruler of that country.", "a large, very poisonous snake (Orthiophagus hannah); hamadryad; a king cobra.", "(in gen.) a kind of poisonous black serpent; a black cobra.", "an elephant.", "a large oblong or roundish fruit with a hard green or white rind often striped or variegated, a sweet watery pink, yellowish or red pulp, and usu. many seeds; a water-melon.", "a kind of poisonous plant."]}], "ಕಾಳಿಂಗದ": [{"type": "noun", "defs": ["the plant Cucumis melo (= C. aromaticus, = C. utilissimus) of Cucurbitaceae family; musk melon plant.", "its round or oblong fruit with thick, ribbed rind, sweet, juicy flesh and musky odour; musk melon."]}], "ಕಾಳಿಂಗನಾಗರ": [{"type": "noun", "defs": ["a poisonous black serpent; a black cobra."]}], "ಕಾಳಿಂಗಮರ್ದನ": [{"type": "noun", "defs": ["Křṣṇa, who subdued the Kālinga serpent."]}], "ಕಾಳಿಂದಿ": [{"type": "noun", "defs": ["Yamuna, one of the important tributaries to the river Gangā, in North India."]}], "ಕಾಳಿಕ": [{"type": "noun", "defs": ["= ಕಾಳಿಕೆ."]}], "ಕಾಳಿಕೆ": [{"type": "noun", "defs": ["absolute darkness; complete absence of light; pitch-darkness.", "any flaw, defect or shortcoming; a blemish.", "a series of clouds.", "a green or greenish-blue poisonous compound, a basic acetate of copper, formed while food is being cooked in copper vessels.", "the most formidable, wrathful form of Mother-Goddess Pārvati, representing the destructive aspect of mother-nature.", "the black collyrium."]}], "ಕಾಳಿಗ": [{"type": "noun", "defs": ["= ಕಾಳಿಂಗ."]}], "ಕಾಳಿಗನಾಗ": [{"type": "noun", "defs": ["= ಕಾಳಿಂಗ."]}], "ಕಾಳಿಜ": [{"type": "noun", "defs": ["a large lobed glandular organ in the abdomen of vertebrates, functioning in many metabolic processes including the regulation of toxic materials in the blood, secreting bile, etc.; the liver.", "either of a pair of glandular organs in the upper abdominal cavity of vertebrates, which separate water and waste products of metabolism from the blood and excrete them as urine through the bladder; the kidney."]}], "ಕಾಳಿಜಿ": [{"type": "noun", "defs": ["= ಕಾಳಿಜ."]}], "ಕಾಳಿಡಿ": [{"type": "verb", "defs": ["(a cereal plant) to bear grains."]}], "ಕಾಳಿನಾಥ": [{"type": "noun", "defs": ["Śiva, the consort of K āḷi, the Mother-Goddess."]}], "ಕಾಳಿಮ": [{"type": "noun", "defs": ["= ಕಾಳಿಮೆ."]}], "ಕಾಳಿಮೆ": [{"type": "noun", "defs": ["blackness.", "a mark, sign, etc. that mars the beauty, natural appearance."]}], "ಕಾಳಿಯ": [{"type": "noun", "defs": ["= ಕಾಳಿಂಗ - 5.", "a mythological snake subdued by Křṣṇa."]}], "ಕಾಳಿಯಮಡು": [{"type": "noun", "defs": ["(myth.) a deep waters in the river Yamunā, in north India, where Křṣṇa subdued the Kālinga serpent."]}], "ಕಾಳಿಯಮಥನ": [{"type": "noun", "defs": ["(myth.) Křṣṇa, who subdued the Kālinga serpent."]}], "ಕಾಳಿಸೊಪ್ಪು": [{"type": "noun", "defs": ["a plant."]}], "ಕಾಳು": [{"type": "noun", "defs": ["a forest (only in comp.).", "that which is low, mean, base or inferior in quality."]}, {"type": "noun", "defs": ["the part of a most of the plants that typically contains the embryo with its protective coat and stored food and which can develop into a new plant under the proper conditions; a seed; a grain.", "a tiny, solid particle, as of salt or sand; a grain."]}, {"type": "noun", "defs": ["the colour of coal or pitch; black colour."]}], "ಕಾಳುಕಡಿ": [{"type": "noun", "defs": ["= ಕಾಳುಕಡ್ಡಿ."]}], "ಕಾಳುಕಡ್ಡಿ": [{"type": "noun", "defs": ["(pl.) grains and fodder as hay."]}], "ಕಾಳುಕಾಳು": [{"type": "noun", "defs": ["the sound imitating the cry of a baby."]}], "ಕಾಳುಕಿಚ್ಚು": [{"type": "noun", "defs": ["a great forest fire; conflagration.", "(fig.) anything (as rumor) which spreads very fast."]}], "ಕಾಳುಗ": [{"type": "noun", "defs": ["an evil or wicked man; a man guilty of or likely to commit crimes; a scoundrel; a villain."]}], "ಕಾಳುಗಟ್ಟು": [{"type": "verb", "defs": ["to become solidified into grains; to become crystallised."]}], "ಕಾಳುಗಿಚ್ಚು": [{"type": "noun", "defs": ["= ಕಾಳುಕಿಚ್ಚು."]}], "ಕಾಳುಗುಱಿಕೆ": [{"type": "noun", "defs": ["a small, remote village lacking basic amenities."]}], "ಕಾಳುಗೆಡು": [{"type": "verb", "defs": ["to be damaged or injured in such a way and become useless, valueless, etc.; to be spoiled."]}], "ಕಾಳುಗೆಡೆ": [{"type": "verb", "defs": ["to speak bad words; to use foul language; to abuse."]}], "ಕಾಳುಗೆಲಸ": [{"type": "noun", "defs": ["an abominable, wicked or evil act."]}], "ಕಾಳುಗೊಡವಿ": [{"type": "noun", "defs": ["the plant Crotalaria fulva of Leguminaseae family."]}], "ಕಾಳುತನ": [{"type": "noun", "defs": ["want of civility and culture; unrefinedness; rudeness of manners; barbarism."]}], "ಕಾಳುದೇಹ": [{"type": "noun", "defs": ["death-bound, gross human body (considering it as abominable)."]}], "ಕಾಳುದೊತ್ತು": [{"type": "noun", "defs": ["a wicked maid-servant."]}], "ಕಾಳುನುಡಿ": [{"type": "verb", "defs": ["to use uncivil and ill-mannered language; to address discourteously."]}, {"type": "noun", "defs": ["useless talk; discourteous language."]}], "ಕಾಳುಮತಿ": [{"type": "noun", "defs": ["want of civility, culture or broadmindedness; wickedness.", "a mean or wicked person."]}], "ಕಾಳುಮಾಡಿಸು": [{"type": "verb", "defs": ["to cause to damage or injure in such a way as to make useless, valueless, etc.; to cause to spoil."]}], "ಕಾಳುಮಾಡು": [{"type": "verb", "defs": ["to damage or injure in such a way as to make useless, valueless, etc.; to spoil."]}], "ಕಾಳುಮಾತು": [{"type": "noun", "defs": ["= ಕಾಳುನುಡಿ2."]}], "ಕಾಳುಮಾರ್ಗ": [{"type": "noun", "defs": ["a bad road.", "an improper, unfit, immoral way or manner."]}], "ಕಾಳುಮುಂಡೆ": [{"type": "noun", "defs": ["a wicked, abject woman."]}], "ಕಾಳುಮೂಳ": [{"type": "noun", "defs": ["a wretched, degraded man."]}], "ಕಾಳುಯತ್ಲೆ": [{"type": "noun", "defs": ["a kind of tree, white wood of which is used in building construction."]}], "ಕಾಳುರಿ": [{"type": "noun", "defs": ["= ಕಾಳುಕಿಚ್ಚು."]}], "ಕಾಳುರಿಗೊಳ್": [{"type": "verb", "defs": ["(a forest) to catch fire."]}], "ಕಾಳುವಿಷಯ": [{"type": "noun", "defs": ["a matter or subject unworthy of one's attention or interest.", "sensual interest considered as inferior in contrast with the spiritual interest."]}], "ಕಾಳುಶಾಪ": [{"type": "noun", "defs": ["a bitter curse."]}], "ಕಾಳೆ": [{"type": "noun", "defs": ["a horn-shaped metal trumpet; a bugle."]}], "ಕಾಳೆಗ": [{"type": "noun", "defs": ["a fight, esp. a large-scale engagement, between armed forces on land, at sea or in the air; armed fighting; combat or war; a battle."]}], "ಕಾಳೆಗಂಗೆಯ್": [{"type": "verb", "defs": ["to engage in a large-scale fight; to engage in an armed fighting."]}], "ಕಾಳೆಗಂಗೊಡು": [{"type": "verb", "defs": ["to fight; to give a fight to."]}], "ಕಾಳೆಗವಲಗೆ": [{"type": "noun", "defs": ["a flat, usu. broad, piece of metal, wood, etc., carried in the hand or worn on the forearm to ward off blows or missiles; a shield."]}], "ಕಾಳೆಗವಱೆ": [{"type": "noun", "defs": ["a big war-drum."]}], "ಕಾಳೆದೆ": [{"type": "noun", "defs": ["wicked or corrupt mind."]}], "ಕಾಳೆಮಾಳೆ": [{"type": "noun", "defs": ["a difficult situation; a series of troubles escaping from which is difficult; entanglement."]}], "ಕಾಳೆಯಯುಗ": [{"type": "noun", "defs": ["= ಕಾಳೇಯ."]}], "ಕಾಳೆಮ್ಮೆ": [{"type": "noun", "defs": ["a black she-buffalo."]}], "ಕಾಳೆವಾಳೆ": [{"type": "noun", "defs": ["a plantain tree bearing small fruit of dark colour (from 200 to 400 in a bunch)."]}], "ಕಾಳೆವಿಡಿಸು": [{"type": "verb", "defs": ["to cause to order to blow a trumpet."]}], "ಕಾಳೆಹೂಗಿಡ": [{"type": "noun", "defs": ["the flowering plant Canna indica of Cannaceae family; Indian shot."]}], "ಕಾಳೇಯ": [{"type": "noun", "defs": ["the perennial plant Crocus sativus of Iridaceae family with funnel-shaped, purplish flowers having orange stigmas; saffron plant.", "the dried, aromatic stigmas of this plant, used in flavouring and colouring foods; saffron.", "a red pigment , applied by women on their forehead, as a sign of auspiciousness; vermilion.", "that which is related to Kaliyuga, fourth of the four mythological ages, which is current now, having a duration of 4,32,000 years."]}], "ಕಾಳೋದಕವಾರ್ಧಿ": [{"type": "noun", "defs": ["(Jain.) the flood that engulfs the entire universe at the time its dissolution."]}], "ಕಾಳೋದಕಸಮುದ್ರ": [{"type": "noun", "defs": ["= ಕಾಳೋದಕವಾರ್ಧಿ."]}], "ಕಾಳೋರಗ": [{"type": "noun", "defs": ["a poisonous black serpent; a black cobra."]}], "ಕಾಳ್ಕತ್ತಲೆ": [{"type": "noun", "defs": ["absolute darkness; complete absence of light; pitch-darkness."]}], "ಕಾಳ್ಕರಡಿ": [{"type": "noun", "defs": ["a fierce black bear."]}], "ಕಾಳ್ಕಾಳ್": [{"type": "independent clause", "defs": ["the sound imitating the cry of a baby."]}], "ಕಾಳ್ಕಿಚ್ಚು": [{"type": "noun", "defs": ["= ಕಾಳ್ಗಿಚ್ಚು."]}], "ಕಾಳ್ಕುಱಿ": [{"type": "noun", "defs": ["an undomesticated sheep.", "the forest deer Muntiacus muntjak; barking deer; muntjac."]}], "ಕಾಳ್ಕೆಯ್": [{"type": "noun", "defs": ["a cultivated piece of land in a forest."]}], "ಕಾಳ್ಕೋಣ": [{"type": "noun", "defs": ["a wild bison (Bibos gaurus)."]}], "ಕಾಳ್ಕೋಳಿ": [{"type": "noun", "defs": ["a bird of the duck tribe, gallus sonnerati; wild-fowl; wood-cock."]}], "ಕಾಳ್ಗಬ್ಬ": [{"type": "noun", "defs": ["a literary work of no merit."]}], "ಕಾಳ್ಗಳಪ": [{"type": "noun", "defs": ["useless talk; idle gossip; tittle-tattle."]}], "ಕಾಳ್ಗಿಚ್ಚು": [{"type": "noun", "defs": ["a great forest fire; conflagration.", "(fig.) anything (as rumor) which spreads very fast."]}], "ಕಾಳ್ಗೆಡಹು": [{"type": "verb", "defs": ["to talk uselessly; to engage in idle gossip."]}, {"type": "noun", "defs": ["= ಕಾಳ್ಗಳಪ."]}], "ಕಾಳ್ಗೆಡೆ": [{"type": "verb", "defs": ["to speak bad words; to use foul language; to abuse."]}], "ಕಾಳ್ಗೆಯ್ತ": [{"type": "noun", "defs": ["= ಕಾಳ್ಗೆಲಸ."]}], "ಕಾಳ್ಗೆಲಸ": [{"type": "noun", "defs": ["an abominable, wicked or evil act."]}], "ಕಾಳ್ಗೈತ": [{"type": "noun", "defs": ["= ಕಾಳ್ಗೆಲಸ."]}], "ಕಾಳ್ತನ": [{"type": "noun", "defs": ["want of civility and culture; unrefinedness; rudeness of manners; barbarism."]}], "ಕಾಳ್ತುಱು": [{"type": "noun", "defs": ["an undomesticated, wild cow."]}], "ಕಾಳ್ನಾಯಿ": [{"type": "noun", "defs": ["an undomesticated dog; a wild dog."]}], "ಕಾಳ್ನುಡಿ": [{"type": "noun", "defs": ["useless talk.", "discourteous language or speech."]}], "ಕಾಳ್ಪಂದಿ": [{"type": "noun", "defs": ["a wild boar or swine (Sus scrofa)."]}], "ಕಾಳ್ಪತ್ತಿ": [{"type": "noun", "defs": ["the shrubby plant Gossypium arboreum (G. nanking, = G.purpurascence) of Malvaceae family.", "the soft seed hairs filling the seedpods of this plat."]}]}