{"ಕೊಂಗಮಂಗ": [{"type": "noun", "defs": ["a person regarded as somehow like a monkey, as a mischievous or imitative child."]}], "ಕೊಂಗಮಂಗತನ": [{"type": "noun", "defs": ["the behaviour of a monkey-like person; mischievousness; apishness."]}], "ಕೊಂಗರಿ": [{"type": "noun", "defs": ["that which is not straight; the quality of condition of being curved or crooked; curvedness; crookedness."]}], "ಕೊಂಗರಿಗೀಟು": [{"type": "noun", "defs": ["a line that is not straight; a crooked or curved line."]}], "ಕೊಂಗರಿಬಿಂಗರಿ": [{"type": "noun", "defs": ["something having a twisting, curving form; twist and swirl."]}], "ಕೊಂಗರಿಮಂಗರಿ": [{"type": "noun", "defs": ["= ಕೊಂಗರಿಬಿಂಗರಿ."]}], "ಕೊಂಗಲ್ನಾಡು": [{"type": "noun", "defs": ["= ಕೊಂಗನಾಡು."]}], "ಕೊಂಗಳ್ನಾಡು": [{"type": "noun", "defs": ["= ಕೊಂಗನಾಡು."]}], "ಕೊಂಗಾಟ": [{"type": "noun", "defs": ["a behaving like a monkey; apish behaviour."]}], "ಕೊಂಗಾಣಿ": [{"type": "noun", "defs": ["a bent, metal or wooden piece used in tightening the knot of a rope."]}], "ಕೊಂಗಿ": [{"type": "noun", "defs": ["a person who has deviated from what is considered right, good or true; a person of crooked nature; a perverted person."]}], "ಕೊಂಗಿತನ": [{"type": "noun", "defs": ["= ಕೊಂಗಾಟ.", "a crooked, perverse behaviour; perversion."]}], "ಕೊಂಗಿತಿ": [{"type": "noun", "defs": ["= ಕೊಂಗಿತ್ತಿ."]}], "ಕೊಂಗಿತ್ತಿ": [{"type": "noun", "defs": ["a woman from Konga region, in the western region of Tamil Nadu in South India corresponding to the present Coimbatore region."]}], "ಕೊಂಗಿಸು": [{"type": "verb", "defs": ["to bend back at an angle or with a round bend; to form a curve by bending.", "to inflict bodily or mental suffering on."]}], "ಕೊಂಗು": [{"type": "noun", "defs": ["= ಕೊಂಗ1 - 1."]}, {"type": "noun", "defs": ["the quality or condition of being crooked; crookedness.", "the indirectly suggested meaning of a word, which is different from its literal meaning; an innuendo.", "a remark characterised by sarcasm; a caustic remark."]}, {"type": "noun", "defs": ["the palm tree Areca catechu of Arecaceae family with a smooth, slender trunk and feathery compound leaves; betel nut tree; areca nut palm.", "its nut; betel nut; areca nut."]}, {"type": "noun", "defs": ["the deciduous tree Mitragyna parvifolia ( = Stephegyne parvifolia) of Rubiaceae family; water cadamba tree."]}, {"type": "noun", "defs": ["the grass Setaria italica ( = Panicum italicum) of Poaceae family.", "its millet used for food; Indian millet."]}], "ಕೊಂಗುಧರೆ": [{"type": "noun", "defs": ["= ಕೊಂಗನಾಡು."]}], "ಕೊಂಗುಮನ": [{"type": "noun", "defs": ["the behaviour of a monkey like person; mischievousness; apishness."]}], "ಕೊಂಗೆ": [{"type": "noun", "defs": ["a limb of a tree or shrub springing from the trunk or stem; a branch."]}, {"type": "noun", "defs": ["a yellow waxy secretion produced by the ear; earwax; cerumen."]}], "ಕೊಂಚ": [{"type": "adjective", "defs": ["a little; small in quantity, amount, number, degree, size, etc.; not much; bit; wee; slight."]}, {"type": "adverb", "defs": ["in small quantity, amount, number, degree etc.; to slight extent; only slightly."]}], "ಕೊಂಚಗಾತಿ": [{"type": "noun", "defs": ["a woman of very little importance; a very common woman."]}], "ಕೊಂಚಗಾಱ": [{"type": "noun", "defs": ["a man of slight consequence; a very common man."]}], "ಕೊಂಚರು": [{"type": "noun", "defs": ["a hole or cavity in the ground."]}], "ಕೊಂಚಲು": [{"type": "noun", "defs": ["= ಕೊಂಚರು."]}], "ಕೊಂಚಿ": [{"type": "noun", "defs": ["the climber Caesalpinia mimiosoides of Caesalpiniaceae family."]}], "ಕೊಂಚಿಸು": [{"type": "verb", "defs": ["to cut up or chop up into very small pieces; to hash; to mince."]}], "ಕೊಂಚೆ": [{"type": "noun", "defs": ["= ಕೊಂಚ1."]}, {"type": "noun", "defs": ["a wall (as of a fort) on a mound or elevated earth."]}, {"type": "noun", "defs": ["either of the two fleshy, rounded parts at the back of the hips; the buttock; the posterior; the rump."]}, {"type": "noun", "defs": ["a kind of wading bird with a long neck, long legs, and a long, tapered bill, living along marshes and river banks; a kind of heron."]}], "ಕೊಂಚೆಗಟ್ಟು": [{"type": "noun", "defs": ["an arrangement of troops in the shape of the heron bird; the heron-like array."]}], "ಕೊಂಚೆಯ": [{"type": "noun", "defs": ["a place shaded by vines on a latticework; a bower; an arbour."]}], "ಕೊಂಚೆವಕ್ಕಿ": [{"type": "noun", "defs": ["= ಕೊಂಚೆ4."]}], "ಕೊಂಚೆವೆಟ್ಟು": [{"type": "noun", "defs": ["a mythological mountain in the Himalayas."]}], "ಕೊಂಜ": [{"type": "noun", "defs": ["a mean, base man; a man of slight consequence in the society.", "a man who lacks courage; a coward.", "a man who is unable to engage in sexual intercourse, esp. because of an inability to have an erection; an impotent man."]}], "ಕೊಂಜು": [{"type": "verb", "defs": ["to speak imperfectly or like a child; to lisp."]}], "ಕೊಂಟಿ": [{"type": "adjective", "defs": ["untamed; unrefined; crude."]}, {"type": "noun", "defs": ["Osteochilus, a fresh water fish."]}], "ಕೊಂಟಿಸುದ್ದಿ": [{"type": "noun", "defs": ["the utterance in the presence of another person of a false statement or statements, damaging to a third person's character or reputation."]}], "ಕೊಂಟು": [{"type": "noun", "defs": ["a piece of thick wood (in its natural shape)."]}], "ಕೊಂಡ": [{"type": "noun", "defs": ["a natural raised part of the earth's surface, often rounded; a hill or hillock."]}, {"type": "noun", "defs": ["a round hole dug in the ground for receiving and preserving water.", "a small round or square pin in the ground for the sacrificial fire.", "a pool, well, esp. one consecrated to a deity or holy purpose.", "an earthen pot."]}, {"type": "noun", "defs": ["a Dravidian language akin to Kuī spoken in some parts of Orissa in eastern India."]}], "ಕೊಂಡಕೋತಿ": [{"type": "noun", "defs": ["= ಕೊಂಡಮುಸು."]}], "ಕೊಂಡಗುರಿ": [{"type": "noun", "defs": ["the four-horned antelope Tetraceros quadricornes.", "an undomesticated sheep.", "the forest deer Muntiacus muntjak; barking deer; muntjac."]}], "ಕೊಂಡಗುಱಿ": [{"type": "noun", "defs": ["= ಕೊಂಡಗುರಿ."]}], "ಕೊಂಡಗೊಱಿ": [{"type": "noun", "defs": ["= ಕೊಂಡಗುಱಿ."]}], "ಕೊಂಡಬಂಡಿ": [{"type": "noun", "defs": ["a cart used at the festival in which devotees run on live coal carrying the idol of Vīrabhadra."]}], "ಕೊಂಡಮಲ್ಲೆ": [{"type": "noun", "defs": ["= ಕೊಂಡೆಮಲ್ಲೆ."]}], "ಕೊಂಡಮಾಮ": [{"type": "noun", "defs": ["a tribe in Andhra Pradesh, who make their living by foretelling the future events."]}], "ಕೊಂಡಮಾವು": [{"type": "noun", "defs": ["the small-sized tree Commiphora mukul ( = Balsamodendron mukul) of Burseraceae family usu. grown as a support for climbers such as jasmine.", "another small-sized tree of the same family Commiphora caudata."]}], "ಕೊಂಡಮುಸು": [{"type": "noun", "defs": ["a small, slender-bodied, leaf-eating monkey (Presbytis entellus) with a long tail and black face; hanuman monkey."]}], "ಕೊಂಡಮುಸುಕು": [{"type": "noun", "defs": ["= ಕೊಂಡಮುಸು."]}], "ಕೊಂಡಮುಸುಡಿ": [{"type": "noun", "defs": ["= ಕೊಂಡಮುಸು."]}], "ಕೊಂಡಮುಸುವ": [{"type": "noun", "defs": ["= ಕೊಂಡಮುಸು."]}], "ಕೊಂಡಮುಸುವು": [{"type": "noun", "defs": ["= ಕೊಂಡಮುಸು."]}], "ಕೊಂಡಲು": [{"type": "noun", "defs": ["a ring or other small ornament for the lobe of the ear, either passed through a hole pierced in the lobe or fastened with a screw or clip; an ear-ring."]}], "ಕೊಂಡವಾಡ": [{"type": "noun", "defs": ["an enclosure, maintained as by a town, for confining stray animals until claimed; a pound."]}], "ಕೊಂಡವಾಡೆ": [{"type": "noun", "defs": ["= ಕೊಂಡವಾಡ."]}], "ಕೊಂಡಸು": [{"type": "noun", "defs": ["a kind of tree."]}], "ಕೊಂಡಹಬ್ಬ": [{"type": "noun", "defs": ["a festival in which devotees run on live coal carrying the idol of Vīrabhadra."]}], "ಕೊಂಡಾಟ": [{"type": "noun", "defs": ["the act or an instance of praising; commendation; praise; extolment.", "the act, practice or an instance of fondling; an affectionate touch or gesture, as a kiss, embrace, etc; caress."]}], "ಕೊಂಡಾಡಿಸು": [{"type": "verb", "defs": ["to cause to praise highly, eulogise."]}], "ಕೊಂಡಾಡು": [{"type": "verb", "defs": ["to praise highly; to eulogise; to laud; to extol.", "to touch or stroke lovingly or gently; to embrace or kiss; to fondle; to caress.", "to express; to show in figures, pictures or put into words.", "ಕೊಂಡಾಡಿದರೆ ಕೊರಡೂ ಕೊನರುತ್ತದೆ koṇdāḍidare koraḍū konaruttade (prov.) a commending or praising goes a long way in stimulating a person (esp. a child) into action in right direction."]}], "ಕೊಂಡಾಡುಹಣ": [{"type": "noun", "defs": ["a being praised, extolled."]}], "ಕೊಂಡಿ": [{"type": "noun", "defs": ["a piece of metal or other material bent back at an angle or with a round bend, for catching hold or for hanging things on; a hook.", "a sharp-pointed organ in insects (as a scorpion) and certain other animals, used to prick, wound or inject poison; a sting.", "the place where a change in direction occurs; a bend; a curve."]}, {"type": "noun", "defs": ["= ಕೊಂಡೆ2."]}, {"type": "noun", "defs": ["= ಕೊಂಡೆಯ - 1."]}], "ಕೊಂಡಿಗ": [{"type": "noun", "defs": ["= ಕೊಂಡೆಗ - 1."]}], "ಕೊಂಡಿಗಾರ": [{"type": "noun", "defs": ["= ಕೊಂಡೆಗ - 1."]}], "ಕೊಂಡಿಗೆ": [{"type": "noun", "defs": ["a thick wooden piece tied to the neck of cattle as to swing between the forelegs, to prevent running fast."]}], "ಕೊಂಡಿತನ": [{"type": "noun", "defs": ["the quality of being injurious, harmful to others."]}], "ಕೊಂಡಿಮೀನು": [{"type": "noun", "defs": ["a species of fish of Dasyatidae family with spine that can inflict painful wounds; a sting-ray."]}], "ಕೊಂಡಿಲು": [{"type": "noun", "defs": ["= ಕೊಂಡಿ1 - 1 & 2.", "a kind of insect with a hooked snout that infects castor bean plant."]}], "ಕೊಂಡಿಸು": [{"type": "verb", "defs": ["utter slander about; defame falsely; to slander."]}], "ಕೊಂಡುಗುಱಿ": [{"type": "noun", "defs": ["= ಕೊಂಡಗುಱಿ."]}], "ಕೊಂಡೆ": [{"type": "noun", "defs": ["= ಕೊಂಡೆಯ."]}, {"type": "noun", "defs": ["the medium sized deciduous tree Cassia fistula ( = Cathartocarpus fistula) of Caesalpiniaceae family; Indian laburnum.", "the plant Gomphrena globosa of Amaranthaceae family."]}, {"type": "noun", "defs": ["ಕೊಂಡಿ1 - 1 & 2."]}, {"type": "noun", "defs": ["a small, circular plastic band used to tie hair around it as to give the hair a ring-shape.", "an ornamental tuft of threads, natural hairs, etc. of equal length, hanging loosely from a knob or from the knot by which they are tied together; a tassel.", "a bunch of flowers or fruits."]}], "ಕೊಂಡೆಗ": [{"type": "noun", "defs": ["a man who attempts to damage a third person's character, reputation, success, progress, etc. by making false statement about that person with another person; a slanderer.", "the action of such a man."]}], "ಕೊಂಡೆಗಾರ": [{"type": "noun", "defs": ["= ಕೊಂಡೆಗ - 1."]}], "ಕೊಂಡೆಗಾರತಿ": [{"type": "noun", "defs": ["a female slanderer."]}], "ಕೊಂಡೆಗಿತ್ತಿ": [{"type": "noun", "defs": ["= ಕೊಂಡೆಗಾರತಿ."]}], "ಕೊಂಡೆತನ": [{"type": "noun", "defs": ["= ಕೊಂಡೆಯತನ1."]}], "ಕೊಂಡೆನಾಲಗೆ": [{"type": "noun", "defs": ["the nature, quality of a person who slanders."]}], "ಕೊಂಡೆಮಲ್ಲಿ": [{"type": "noun", "defs": ["= ಕೊಂಡೆಮಲ್ಲೆ."]}], "ಕೊಂಡೆಮಲ್ಲೆ": [{"type": "noun", "defs": ["the plant Polygonum barbatum of Polygonaceae family."]}], "ಕೊಂಡೆಮಾತು": [{"type": "noun", "defs": ["= ಕೊಂಡೆಯ -1."]}], "ಕೊಂಡೆಯ": [{"type": "noun", "defs": ["a slandering remark; slander.", "a man indulges himself in slandering."]}], "ಕೊಂಡೆಯತನ": [{"type": "noun", "defs": ["the tendency, inclination or the quality of a slanderer."]}, {"type": "noun", "defs": ["the quality of being disrespectful; insolence; arrogance; overbearingness."]}], "ಕೊಂತ": [{"type": "noun", "defs": ["a thrusting weapon consisting of a long wooden shaft with a sharp metal spearhead; a lance; a spear."]}, {"type": "noun", "defs": ["the piston in a small hand-operated vermicelli making mortar, to press the dough or batter through the perforated plate below.", "the snug-fitting engine part that is forced back and forth within a cylinder by the pressure of combustion, steam, etc. and a reciprocating connecting rod; a piston.", "a thick iron screw in a sluice, by turning of which the gate or valve is operated.", "the quantity of vermicelli or similar thing extruded through the hand-operated vermicelli at one time."]}], "ಕೊಂತಂಗೊಳ್": [{"type": "verb", "defs": ["to take or use a spear, lance.", "to get wounded by a lance."]}], "ಕೊಂತಕಾಱ": [{"type": "noun", "defs": ["= ಕೊಂತಗಾಱ."]}], "ಕೊಂತಗಾಱ": [{"type": "noun", "defs": ["a soldier armed with a lance or a member of a regiment armed with lances; a lancer."]}], "ಕೊಂತಗೆಯ್ಯ": [{"type": "noun", "defs": ["a man holding a spear.", "Niřuti, the regent of south-west quarter."]}], "ಕೊಂತಗೈಯ": [{"type": "noun", "defs": ["= ಕೊಂತಗೆಯ್ಯ."]}], "ಕೊಂತಿ": [{"type": "noun", "defs": ["a kind of fish."]}, {"type": "noun", "defs": ["a small, moulded dark, crude sugar from the sugarcane juice; a small jaggery block."]}, {"type": "noun", "defs": ["the queen-mother of Pāṇḍavas, in the epic Mahābhārata, worshipped as folk-goddess."]}], "ಕೊಂದಿ": [{"type": "noun", "defs": ["a thick cloth used as a bed spread or to wrap oneself against cold."]}], "ಕೊಂದೆ": [{"type": "noun", "defs": ["= ಕೊಂಡೆ2."]}], "ಕೊಂಪೆ": [{"type": "noun", "defs": ["a pile, mound of rubbish things.", "a place having such a pile.", "a small village or hamlet lacking basic civic amenities.", "a little house of crudest kind with thatched roof; a hut."]}], "ಕೊಂಬಚ್ಚೇಳು": [{"type": "noun", "defs": ["(dial.) a kind of scorpion with a pair of shear like stings."]}], "ಕೊಂಬಣಸು": [{"type": "noun", "defs": ["an ornamental metal-cone, used to embellish the horns of cattle."]}], "ಕೊಂಬಾಟ": [{"type": "noun", "defs": ["an action of an animal using its horn or horns or tusk or tusks.", "a folk dance, in Koḍagu district of Karnāṭaka, played holding the horns of an antelope."]}], "ಕೊಂಬು": [{"type": "noun", "defs": ["a permanent hard, hollow, bony or keratinous projection that grows on the head of various hoofed animals, esp. bovid ruminants; a horn.", "the branched, annually shed, bony growth on the head of any animal of the deer family; an antler.", "a hollowed horn, with the tapered end closed, used for carrying oil.", "a serpentine horn or the one in the shape of the horn of a bull, played by blowing air through it.", "any woody extension growing from the trunk or main stem or from a main limb, of a tree; a branch.", "the highest point of a mountain; the peak.", "(fig.) the quality that makes one pride.", "a shelter, protection (against a danger, distress, etc.) 9) (gram.) a sign ' ು' added to a consonant to represent the vowel sound \"U\" (similar to the sound of 'u ' in the English word 'put').", "ಕೊಂಬಿನ ಇಳಿ kombina iḷi (gram.) a sign added to a consonant to represent the vowel sound \"Ū\" (smilar to the sound of 'oo ' in the English word 'poor'); ಕೊಂಬಿನ ಹುಳು kombina huḷu any of several horned caterpillers that infect plants; ಕೊಂಬುಕೊಟ್ಟ ಓಲಗ kombukoṭṭa ōlaga a concert of blow-pipes, cymbals, drum, etc. in a folk dance; ಕೊಂಬು ಇರು kombu iru (fig.) to have a special merit, quality or qualities to be proud of; ಕೊಂಬು ಬರು kombu baru (fig.) to acquire a special, prestigious, esteemable position because of some quality or qualities or merit."]}, {"type": "noun", "defs": ["a pre-fixed, secret place to meet."]}], "ಕೊಂಬುಕಹಳೆ": [{"type": "noun", "defs": ["a big, serpentine horn to play upon by blowing air through it."]}], "ಕೊಂಬುಕಾಳೆ": [{"type": "noun", "defs": ["= ಕೊಂಬುಕಹಳೆ."]}], "ಕೊಂಬುಗತ್ತಿ": [{"type": "noun", "defs": ["."]}], "ಕೊಂಬುಗಲ್ಲು": [{"type": "noun", "defs": ["a hornstone - a) a fine-grained, very hard, siliceous rock, usu. grey, that produces sparks when struck with steel and that breaks into pieces with sharp cutting edges; flint; b) a dense, hard rock composed mainly of silica and occurring commonly in limestone beds; chert."]}], "ಕೊಂಬುಗಹಳೆ": [{"type": "noun", "defs": ["= ಕೊಂಬುಕಹಳೆ."]}], "ಕೊಂಬುಗೊಡು": [{"type": "verb", "defs": ["to provide protection, shelter (against a danger, distress etc.)."]}], "ಕೊಂಬುಗೊಳ್": [{"type": "verb", "defs": ["to get protection, shelter (against a danger, distress etc.)."]}], "ಕೊಂಬುಚೇರು": [{"type": "noun", "defs": ["= ಕೊಂಬಣಸು."]}], "ಕೊಂಬು ತೊರ್ಕೆ ಮೀನು": [{"type": "noun", "defs": ["a big sea-fish, Manto birostris, growing to a length of 8 ft. length and 15 to 16 ft. wide when fins are opened, and has two long, pointed teeth, one each on either side of the corners of the mouth."]}], "ಕೊಂಬುಪಡವಲ": [{"type": "noun", "defs": ["the creeper Trichosanthes nervifolia of Cucurbitaceae family.", "its fruit."]}], "ಕೊಂಬುವಲೆ": [{"type": "noun", "defs": ["a kind of net for catching wild animals."]}], "ಕೊಂಬುವೆರೆ": [{"type": "noun", "defs": ["the crescent moon.", "the crescent shape of the palm with thumb and fingers stretched apart."]}], "ಕೊಂಬುೞಿ": [{"type": "verb", "defs": ["(protection, shelter) to be lost or denied."]}], "ಕೊಂಬೆ": [{"type": "noun", "defs": ["a limb of a tree or shrub springing from the trunk or stem; a branch.", "ಕೊಂಬೆಮೇಲೆ ನಿಂತುಕೊಂಡು ಬುಡಕಡಿ kombemēle nintukoṇḍu buḍakaḍi (prov.) damage one's own interest knowingly; to cause one's own downfall; to dig one's grave."]}, {"type": "noun", "defs": ["the plant Caesalpinia mimosoides of Caesalpiniaceae family."]}], "ಕೊಂಬೆಗಲ್ಲು": [{"type": "noun", "defs": ["= ಕೊಂಬುಗಲ್ಲು."]}], "ಕೊಂಬೆಯಬಳ್ಳಿ": [{"type": "noun", "defs": ["a kind of creeper."]}], "ಕೊಂಬೆಯೊಡೆ": [{"type": "verb", "defs": ["(a new branch or branches) to commence extending from the trunk.", "(as a plant) to extend or start extending a new branch."]}], "ಕೊಂಬೇರಿಕೂಗುವನಗೆಡ್ಡೆ": [{"type": "noun", "defs": ["a kind of plant ."]}], "ಕೊಂಬೇಱು": [{"type": "verb", "defs": ["to climb on to a branch (of a tree)."]}], "ಕೊಂಬೊತ್ತು": [{"type": "verb", "defs": ["to extend a branch (as a tree)."]}], "ಕೊಂಯಿಕ್": [{"type": "noun", "defs": ["the sound uttered by an animal in pain; a sound imitating it."]}], "ಕೊಂಯಿಕಿಡು": [{"type": "verb", "defs": ["to utter a wailing sound similar to the one uttered by an animal in pain."]}], "ಕೊಕ್": [{"type": "noun", "defs": ["the sound uttered by a rooster.", "a sound made by a player in kho-kho, while triggering another player."]}], "ಕೊಕ್ಕ": [{"type": "noun", "defs": ["a domesticated chicken; a hen or rooster."]}], "ಕೊಕ್ಕಟ್ಟೆ": [{"type": "noun", "defs": ["(dial.) a bad, unusable road."]}], "ಕೊಕ್ಕರ": [{"type": "noun", "defs": ["intense dislike or hatred; a loathing; detestation; abhorrence."]}, {"type": "noun", "defs": ["the act of sitting, with the body weight being on the feet, legs folded at the knees.", "a falling down, losing one's strength or control over the body; a collapse."]}], "ಕೊಕ್ಕರಗೆಯ್": [{"type": "verb", "defs": ["to dislike intensely; to abhor; to detest."]}], "ಕೊಕ್ಕರತೆ": [{"type": "noun", "defs": ["the condition or fact of detesting, abhorring; detesting."]}], "ಕೊಕ್ಕರಿ": [{"type": "noun", "defs": ["the fact of being crooked; crookedness."]}], "ಕೊಕ್ಕರಿಕೆ": [{"type": "noun", "defs": ["a disliking, detesting or abhorring; loathsomeness."]}], "ಕೊಕ್ಕರಿಕೆವೆಱು": [{"type": "verb", "defs": ["= ಕೊಕ್ಕರಿಸು1."]}], "ಕೊಕ್ಕರಿಕ್ಕೆ": [{"type": "noun", "defs": ["= ಕೊಕ್ಕರಿಕೆ."]}], "ಕೊಕ್ಕರಿಸು": [{"type": "verb", "defs": ["to feel intense dislike, disgust or hatred for; to abhor; to detest; to loathe.", "to be afraid of; to fear; to dread.", "to stop because of indecision; pause or delay in acting, choosing or deciding because of feeling unsure; to hesitate", "to shrink; to draw back; turn away; cower, as from fear.", "to be displeased with; to get upset.", "to laugh sneeringly at.", "to cause to be afraid of; to fill with fear; to frighten."]}, {"type": "verb", "defs": ["to overpower or dim the vision of with very bright light or moving lights; to dazzle.", "to be overpowered by glare."]}, {"type": "verb", "defs": ["to shout loudly; to roar; to bellow."]}], "ಕೊಕ್ಕರೆ": [{"type": "noun", "defs": ["any of a family (Gruidae) of usu. large gruiform wading birds with very long legs and neck, and a long, straight bill a crane.", "any of various unrelated birds, as herons or storks.", "a plant disease affecting paddy plants.", "(dial.) a kind of fish."]}, {"type": "noun", "defs": ["the tree Scolopia crenata of Flacourtiaceae family with very hard wood, the sour fruits of which are edible."]}], "ಕೊಕ್ಕರೆಕಾಲು": [{"type": "noun", "defs": ["a disease characterised by the legs becoming abnormally emaciated."]}], "ಕೊಕ್ಕರೆರೋಗ": [{"type": "noun", "defs": ["= ಕೊಕ್ಕರೆ1 - 3."]}], "ಕೊಕ್ಕರೆಹೂವಿನಗಿಡ": [{"type": "noun", "defs": ["the plant Agati grandiflora of Leguminosae family."]}], "ಕೊಕ್ಕಲೆ": [{"type": "noun", "defs": ["= ಕೊಕ್ಕರೆ2."]}], "ಕೊಕ್ಕಸ": [{"type": "noun", "defs": ["a strong man."]}], "ಕೊಕ್ಕಳ": [{"type": "noun", "defs": ["a sound imitating that of something bubbling up and boiling."]}], "ಕೊಕ್ಕಳಗೊಳ್": [{"type": "verb", "defs": ["to boil with violent bubbling sound.", "to become greatly agitated, as with rage."]}], "ಕೊಕ್ಕಳಿಕೆ": [{"type": "noun", "defs": ["(dial.) an instance or habit of speaking with involuntary pauses or blocks, often with rapid repetitions of syllables or initial sounds; stammering."]}], "ಕೊಕ್ಕಱ": [{"type": "noun", "defs": ["a small soft-furred four-legged domesticated animal, Felis catus; a cat."]}], "ಕೊಕ್ಕೞ": [{"type": "noun", "defs": ["= ಕೊಕ್ಕಳ."]}], "ಕೊಕ್ಕೞಗುದಿ": [{"type": "verb", "defs": ["= ಕೊಕ್ಕಳಗೊಳ್."]}], "ಕೊಕ್ಕಾಟ": [{"type": "noun", "defs": ["a game played by girls or boys; kho-kho."]}], "ಕೊಕ್ಕಾಡು": [{"type": "verb", "defs": ["to move, play with, the beak."]}], "ಕೊಕ್ಕಿ": [{"type": "noun", "defs": ["a birḍs horny projecting jaws; a bill; a beak.", "a branch of a tree (having leaves and twigs pruned off) which is in shape of the beak of a bird."]}], "ಕೊಕ್ಕಿಸು": [{"type": "verb", "defs": ["to bend back at an angle or with a round bend; to form a curve by bending."]}], "ಕೊಕ್ಕು": [{"type": "verb", "defs": ["to regard with disgust; to detest; to abominate; to loathe."]}, {"type": "noun", "defs": ["a bird's horny projecting jaws; a bill; a beak."]}, {"type": "noun", "defs": ["= ಕೊಕ್ಕರೆ1 - 1."]}, {"type": "adjective", "defs": ["not straight; crooked; serpentine."]}], "ಕೊಕ್ಕುದೆಱೆ": [{"type": "verb", "defs": ["(a bird) to open the beak."]}], "ಕೊಕ್ಕುಳ": [{"type": "noun", "defs": ["= ಕೊಕ್ಕಳ."]}], "ಕೊಕ್ಕುಳಂಗುದಿ": [{"type": "verb", "defs": ["= ಕೊಕ್ಕಳಗೊಳ್."]}], "ಕೊಕ್ಕುಳಮೀನು": [{"type": "noun", "defs": ["a kind of fish."]}], "ಕೊಕ್ಕೆ": [{"type": "noun", "defs": ["= ಕೊಕ್ಕು2.", "the condition or quality of being crooked, bent; crookedness.", "a curved or bent piece of metal, wood, etc. used to catch, hold or pull something; its curved part; a bend; a hook.", "(fig.) an impediment (caused deliberately by another).", "(dial.) a hook or a sickle attached to a long staff, used to pluck flowers, fruits, twigs, etc. from plants above one's reach.", "ಕೊಕ್ಕೆ ಹಾಕು kokke hāku (fig.) to raise an objetion; to hinder the progress of."]}, {"type": "noun", "defs": ["the plant Tabernaemontana divaricata ( = T. coronaria, = Ervatamia coronaria) of Apocynaceae family."]}], "ಕೊಕ್ಕೆಕೋಲು": [{"type": "verb", "defs": ["a long staff with a hook or a sickle attached, used to pluck flowers, fruits, twigs, etc. from plants above one's reach."]}], "ಕೊಕ್ಕೆಚಿಕ್ಕ": [{"type": "noun", "defs": ["a man who jests with a silly role in a drama, cinema, etc. a jester; a joker."]}], "ಕೊಕ್ಕೆತಾತಿ": [{"type": "noun", "defs": ["an ornament in the form or a hook worn round the neck."]}], "ಕೊಕ್ಕೆಮನುಷ್ಯ": [{"type": "noun", "defs": ["a perverted, wicked, malicious man."]}], "ಕೊಕ್ಕೆಮಾತು": [{"type": "noun", "defs": ["a remark characterised by malice, spite, mischief, etc. said with an intention to inflicting pain.", "a remark that impedes another's progress."]}], "ಕೊಕ್ಕೆಮುೂಗು": [{"type": "noun", "defs": ["a nose that is curved like a hook."]}], "ಕೊಕ್ಕೆಮೊಳೆ": [{"type": "noun", "defs": ["a nail, piece of metal, with a hooked end."]}], "ಕೊಕ್ಕೆಯೆತ್ತಿಗೆ": [{"type": "noun", "defs": ["an iron hook for lifting heavy weights; a crampon."]}], "ಕೊಕ್ಕೆಹುಳು": [{"type": "noun", "defs": ["any of a of small, parasitic, intestinal nematode worms of Ancylostomatoidea family, with hooks around the mouth; a hook-worm."]}], "ಕೊಕ್ಕೆಹುಳುರೋಗ": [{"type": "noun", "defs": ["a disease caused by hookworms, characterised by anaemia, weakness, and abdominal pain; hookworm disease."]}], "ಕೊಕ್ಕೊ": [{"type": "noun", "defs": ["a game played by twelve players on each side."]}], "ಕೊಕ್ಕೋಕಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["the science of erotics."]}], "ಕೊಗಳು": [{"type": "noun", "defs": ["a small, crude house with two thatched roofs slanting on either sides.", "(dial.) the summit of a roof."]}], "ಕೊಗಿ": [{"type": "noun", "defs": ["a kind of medicinal plant."]}], "ಕೊಗೆ": [{"type": "verb", "defs": ["to state in detail the characteristics, appearance, etc. of, in spoken or written form; to describe; to delineate."]}], "ಕೊಗ್ಗ": [{"type": "noun", "defs": ["a bent or curving part.", "the quality or condition of being bent.", "a man with harsh and grating voice."]}], "ಕೊಗ್ಗದನಿ": [{"type": "noun", "defs": ["a harsh, grating or rasping sound; a disagreeable voice."]}], "ಕೊಗ್ಗನೆ": [{"type": "adverb", "defs": ["in black colour; darkly."]}], "ಕೊಗ್ಗಲಿ": [{"type": "noun", "defs": ["= ಕೊಗ್ಗಿ1."]}], "ಕೊಗ್ಗಾಲೆ": [{"type": "noun", "defs": ["the medium sized tree Bauhinia malabarica of Caesalpiniaceae family; Malabar mountain ebony."]}], "ಕೊಗ್ಗಿ": [{"type": "noun", "defs": ["the plant Indigofera aspalathoides of Papilionaceae family.", "the plant Tephrosia purpurea of Papilionaceae family; wild indigo."]}, {"type": "noun", "defs": ["the yellowish, waxlike secretion found in the canal of the external ear; cerumen; earwax.", "a hook or pin used to take out this from the ear."]}], "ಕೊಗ್ಗಿಡಿ": [{"type": "noun", "defs": ["= ಕೊಗ್ಗಿ1 - 1."]}], "ಕೊಗ್ಗಿಲ": [{"type": "noun", "defs": ["= ಕೊಗ್ಗಿ1 - 1."]}], "ಕೊಗ್ಗಿಲಿ": [{"type": "noun", "defs": ["= ಕೊಗ್ಗಿ1."]}], "ಕೊಗ್ಗು": [{"type": "noun", "defs": ["= ಕೊಗ್ಗಿ2."]}], "ಕೊಗ್ಗುದಿ": [{"type": "noun", "defs": ["the condition of boiling violently with bubbling sound.", "overwhelming grief.", "a condition or situation causing excessive mental disturbance."]}], "ಕೊಗ್ಗುದಿಗೊಳ್": [{"type": "verb", "defs": ["to boil with violent bubbling sound.", "to be greatly agitated, as with rage."]}], "ಕೊಗ್ಗೆ": [{"type": "noun", "defs": ["= ಕೊಗ್ಗಿ1 - 1."]}], "ಕೊಗ್ಗೆಪುಕ್ಕ": [{"type": "noun", "defs": ["= ಕೊಗ್ಗಾಲೆ."]}], "ಕೊಗ್ಗೆಸರು": [{"type": "noun", "defs": ["a thick, slimy solution of mud and water."]}], "ಕೊಗ್ಗೆಸಱ್": [{"type": "noun", "defs": ["a paste as of an unguent that is cold, used to apply on the body."]}], "ಕೊಗ್ಗೆಸಱು": [{"type": "noun", "defs": ["= ಕೊಗ್ಗೆಸರು."]}], "ಕೊಚವಕ್ಕಿ": [{"type": "noun", "defs": ["a kind of wading bird with a long neck, long legs, and a long, tapered bill, living along marshes and river banks; a kind of heron."]}], "ಕೊಚಿತ": [{"type": "adjective", "defs": ["a little; small in quantity, amount, number, degree, size, etc.; not much; bit; wee; slight."]}, {"type": "adverb", "defs": ["in small quantity, amount, number, degree etc.; to a slight extent; only slightly."]}], "ಕೊಚ್ಚಕ್ಕಿ": [{"type": "noun", "defs": ["rice that is cleaned by blowing the chaff, stone pieces, etc. by winnowing."]}], "ಕೊಚ್ಚರಟೆ": [{"type": "noun", "defs": ["faltering or indistinct speech; stammer; stutter."]}], "ಕೊಚ್ಚಲು": [{"type": "noun", "defs": ["(dial.) a piece taken out from a whole (esp. a piece of a fruit, vegetable, etc.).", "ಹಂಚಿದವನಿಗೆ ಕೊಚ್ಚಲು hancidavanige koccalu (prov.) public service brings no credit."]}], "ಕೊಚ್ಚಿಕೆ": [{"type": "noun", "defs": ["the act of boasting one's deeds, merits, etc."]}, {"type": "noun", "defs": ["the act of cutting, chopping up into small pieces; a mincing."]}], "ಕೊಚ್ಚು": [{"type": "verb", "defs": ["to talk proudly about deeds, abilities, etc., either one's own or those of someone close to one, esp. in a manner showing too much pride and satisfaction; to boast; to brag ಕೊಚ್ಚಿಕೊ k occiko to boast about oneself or one's abilitiy, intelligence, etc."]}, {"type": "verb", "defs": ["to shake (as grain in a winnow) repeatedly, blow the chaff by wind; to so clean; to winnow.", "(a stream) to carry (an object) by drift.", "ಕೊಚ್ಚಿಕೊಂಡು ಹೋಗು koccikoṇḍu hōgu to be carried away by or as by flood."]}, {"type": "verb", "defs": ["to cut into very small pieces; to chop; to mince."]}, {"type": "noun", "defs": ["the offensive smell of urine."]}, {"type": "noun", "defs": ["an instrument (as a pair of scissors, axe, knife, etc.) for cutting, chopping of.", "the state of being minced into small pieces.", "the act of cutting, chopping etc."]}, {"type": "noun", "defs": ["a fixed allowance or allotment of provisions, as daily allowance; ration.", "fixed quantity of food or grain, given regularly to others."]}, {"type": "noun", "defs": ["a bunch of flower, fruits, etc."]}], "ಕೊಚ್ಚುಗೊಲ್ಟಿ": [{"type": "noun", "defs": ["a cutting tool consisting of a heavy blade with a short handle."]}], "ಕೊಚ್ಚುದಱಿ": [{"type": "verb", "defs": ["to cut into very small pieces; to chop; to mince."]}], "ಕೊಚ್ಚುಬಲೆ": [{"type": "noun", "defs": ["a large net for sea-fish, allowed to drift with the tide; a drift-net."]}], "ಕೊಚ್ಚೆ": [{"type": "noun", "defs": ["mud mixed with water; slush; soft mud; mire.", "(fig.) an association with morally bad, depraved, wicked people.", "ಕೊಚ್ಚೆ ಮಾತು kocce mātu speech or language that is offensive to others feelings; indecent, immodest speech; ಕೊಚ್ಚೆಮೇಲೆ ಕಲ್ಲೆಸೆದರೆ ಮೈಮೇಲೆಯೇ ಸಿಡಿಯುತ್ತದೆ koccemēle kallesedare maimēleyē siḍiyuttade (prov.) a doing of something knowing the fact that it would bring bad criticism or infamy to oneself."]}], "ಕೊಜಂಟಿ": [{"type": "noun", "defs": ["(dial.) the refuse of vegetables, fruits, sugar cane etc. from which the juice is extracted; bagasse."]}], "ಕೊಜಕು": [{"type": "noun", "defs": ["(dial.) coarse powder, small pebbles, etc.", "(dial.) that which is rendered into a shapeless mass by pounding."]}], "ಕೊಜಕ್ಕು": [{"type": "noun", "defs": ["= ಕೊಜಕು."]}], "ಕೊಜಳು": [{"type": "verb", "defs": ["(dial.) (said of a worm) to eat away the inner portion of a corn, grain, etc."]}], "ಕೊಜ್ಜೆ": [{"type": "noun", "defs": ["any man or boy lacking normal function of the testes, as through castration or disease; an impotent man.", "a castrated man in charge of a harem or employed as a chamberlain; a eunuch."]}], "ಕೊಜ್ಹೆ": [{"type": "noun", "defs": ["= ಕೊಜ್ಜೆ."]}], "ಕೊಞ್ಞೆ": [{"type": "noun", "defs": ["(dial.) indistinct utterance of a child that is learning speech."]}], "ಕೊಟಕಿಡು": [{"type": "verb", "defs": ["to jump or leap repeatedly as from joy."]}], "ಕೊಟಕೆ": [{"type": "noun", "defs": ["a fruit in its early stage of development; an unripe fruit."]}], "ಕೊಟಗಾಱ": [{"type": "noun", "defs": ["= ಕೊಟ್ಟಗಾಱ."]}], "ಕೊಟಡಿ": [{"type": "noun", "defs": ["a part of a building enclosed by walls or partitions, floor and ceiling; a room."]}], "ಕೊಟಾಯಿಸು": [{"type": "verb", "defs": ["to stir well as to mix evenly."]}], "ಕೊಟಾರ": [{"type": "noun", "defs": ["a storehouse for threshed grain; a granary.", "a tax levied on granaries, warehouse, etc."]}], "ಕೊಟಾರಿಕೆ": [{"type": "noun", "defs": ["the work, duty, office of the superintendent of a granary."]}], "ಕೊಟಿಗೆ": [{"type": "noun", "defs": ["= ಕೊಟ್ಟಗೆ."]}], "ಕೊಟುಂಬ": [{"type": "noun", "defs": ["those people who can trace their descent from a common ancestor; a house, a lineage; a family.", "a social unit consisting of parents, children of a family.", "a woman as related to her husband; a wife."]}], "ಕೊಟೆಗಾರ": [{"type": "noun", "defs": ["name of a caste."]}], "ಕೊಟ್ಟ": [{"type": "noun", "defs": ["a short, hollow bamboo, closed at one end (naturally so, when cut at a knotty joint), used to pour medicine, food, etc. into the throat of cattle."]}, {"type": "noun", "defs": ["the quality or fact of being vain or excessively proud of oneself or one's qualities or possessions; self-conceit; vanity.", "the quality of a man who is mean, immoral or wicked.", "a wild, lawless man, often a member of a gang of criminals; a scoundrel."]}, {"type": "noun", "defs": ["the shrub Ziziphus xylopyrus of Rhamnaceae family.", "its edible fruit."]}, {"type": "noun", "defs": ["a tall, thick wall enclosing a place, building for military defence, usu. equipped as with earthworks, guns, etc."]}, {"type": "noun", "defs": ["absence of heat or lack of normal warmth; a low temperature; coldness."]}, {"type": "noun", "defs": ["the place where one normally resides; a house.", "a division of a state gen. made for the purpose of administrative convenience; a district."]}, {"type": "noun", "defs": ["a shed for sheltering cattle and other livestock; a cattle-shed."]}, {"type": "noun", "defs": ["a progressive infectious disease caused by a bacterium (Mycobacterium leprae) that attacks the skin, flesh, nerves, etc, characterised by nodules, ulcers, white scaly scabs, deformities, and the eventual loss of sensation; leprosy.", "any of various contagious skin diseases caused by related varieties of fungus and characterised by itching and the formation of ring-shaped, discoloured patches covered with scales or vesicles; ringworm.", "the plant Costus speciosus of Zingiberaceae family; mountain sweet flag."]}], "ಕೊಟ್ಟಗಾಱ": [{"type": "noun", "defs": ["a man guarding a fort; a fort-watchman."]}], "ಕೊಟ್ಟಗೆ": [{"type": "noun", "defs": ["a smaller building separate from but located near a main building or dwelling; an outhouse.", "a shed for sheltering livestock; a cattle-shed; a corral; a pen.", "a servant engaged for upkeep of a cattle-shed.", "(derog.) a small house."]}], "ಕೊಟ್ಟಜ": [{"type": "noun", "defs": ["a regular payment of money, etc., made by one ruler or nation to another as acknowledgment of subjugation, for protection from invasion, etc. ; a tribute."]}], "ಕೊಟ್ಟಜಂಗೊಡು": [{"type": "verb", "defs": ["to make a regular payment to one ruler or nation by another acknowledging subjugation; to give tribute."]}], "ಕೊಟ್ಟಡಿ": [{"type": "noun", "defs": ["= ಕೊಟಡಿ."]}], "ಕೊಟ್ಟಣ": [{"type": "noun", "defs": ["the act or profession of husking paddy by beating.", "a very hard bowl in which softer substances are pounded and husked with a pestle; a mortar.", "a thick wooden club used to pound, husk paddy, etc.", "a tax levied on paddy pounding houses."]}, {"type": "noun", "defs": ["a place of protection; a shelter; an asylum."]}], "ಕೊಟ್ಟಣಂಗುಟ್ಟು": [{"type": "verb", "defs": ["to remove the husk from paddy, by pounding in a mortar."]}], "ಕೊಟ್ಟಣಗಿತ್ತಿ": [{"type": "noun", "defs": ["a woman who pounds (esp. as a means for earning her livelihood) paddy and husks it."]}], "ಕೊಟ್ಟಣಗೇರಿ": [{"type": "noun", "defs": ["a lane or street where the people, whose main profession is pounding and husking paddy, live."]}], "ಕೊಟ್ಟತನ": [{"type": "noun", "defs": ["the behaviour of a person who is rough, quarrelsome and lawless; rowdyism; hoodlumism.", "ಮಟ್ಟಿ ಇಟ್ಟರೂ ಕೊಟ್ಟತನ ಹೋಗಲಿಲ್ಲ maṭṭi iṭṭarū koṭṭatana hōgalilla (prov.) even training could never refine a deep rooted bad habit."]}], "ಕೊಟ್ಟಪಾಲಿ": [{"type": "noun", "defs": ["the large, deciduous tree Albizzia stipulata of Mimosae family; stone sirissa tree."]}], "ಕೊಟ್ಟರ": [{"type": "noun", "defs": ["= ಕೊಟ್ಟಾರ."]}], "ಕೊಟ್ಟವಳ": [{"type": "noun", "defs": ["a man guarding a fort; a fort-watchman.", "an officer in charge of guarding a town."]}, {"type": "noun", "defs": ["= ಕೊಟ್ಟಾರಿ."]}], "ಕೊಟ್ಟಸ": [{"type": "noun", "defs": ["flesh of any animal cooked with little or no moisture, as in an oven, over an open fire."]}], "ಕೊಟ್ಟಳಿ": [{"type": "noun", "defs": ["= ಕೊಟ್ಟಣಗಿತ್ತಿ."]}], "ಕೊಟ್ಟಾಂಗಚ್ಚಿ": [{"type": "noun", "defs": ["the hard outer covering of coconut; coconut-shell."]}], "ಕೊಟ್ಟಾಂಪುಳಿ": [{"type": "noun", "defs": ["the middle sized, evergreen tree Inga dulce ( = Pithecolobium dulce, = Mimosa dulcis) of Mimosae family."]}], "ಕೊಟ್ಟಾರ": [{"type": "noun", "defs": ["a storehouse for threshed grain; a granary.", "a tax levied on granaries, warehouse, etc."]}], "ಕೊಟ್ಟಾರಿ": [{"type": "noun", "defs": ["an officer in charge of a warehouse or granary; a ware-house steward."]}], "ಕೊಟ್ಟಾರಿಗ": [{"type": "noun", "defs": ["= ಕೊಟ್ಟಾರಿ."]}], "ಕೊಟ್ಟಿ": [{"type": "noun", "defs": ["a shed for sheltering livestock; a cattle-shed; a corral."]}, {"type": "adjective", "defs": ["not yielding; resisting doggedly or unreasonably; obstinate; stubborn.", "wandering aimlessly or without restraint.", "ಕೊಟ್ಟಿ ದನ koṭṭi dana a cow, ox etc. that is left to wander and graze without restraint."]}, {"type": "noun", "defs": ["a man who is impudent, lustful, not restrained.", "the quality of being fraudulent; not genuine.", "a fake or counterfeit currency note, coin etc."]}, {"type": "noun", "defs": ["the action of annoying; vexing, molestation.", "the state of being annoyed; vexation, trouble."]}], "ಕೊಟ್ಟಿಗ": [{"type": "noun", "defs": ["= ಕೊಟ್ಟುಕ."]}], "ಕೊಟ್ಟಿಗೆ": [{"type": "noun", "defs": ["= ಕೊಟ್ಟಗೆ."]}, {"type": "noun", "defs": ["an ox used for drawing, pulling a vehicle or carrying a burden; a draught ox."]}, {"type": "noun", "defs": ["(dial.) a kind of pudding prepared with black gram or rice and cooked in steam."]}], "ಕೊಟ್ಟಿಗೆಗೊಬ್ಬರ": [{"type": "noun", "defs": ["cattle excrement used to fertilise soil; manure."]}], "ಕೊಟ್ಟಿಗೆಯೆತ್ತು": [{"type": "noun", "defs": ["= ಕೊಟ್ಟಿಗೆ2."]}], "ಕೊಟ್ಟಿಗೆಣಸು": [{"type": "noun", "defs": ["the plant Ottelia alsimoides of Hydrocharitaceae family."]}], "ಕೊಟ್ಟಿಗೆಮನೆ": [{"type": "noun", "defs": ["= ಕೊಟ್ಟಗೆ.", "a room meant for taking bath, washing, etc.; a bathroom.", "a room in a building used as a storehouse for threshed grain; a store-room."]}], "ಕೊಟ್ಟಿತನ": [{"type": "noun", "defs": ["the behaviour of a person who habitually cheats.", "the quality of being fake, counterfeit."]}], "ಕೊಟ್ಟಿಲೆ": [{"type": "noun", "defs": ["the plant Amoora canarana of Meliaceae family."]}], "ಕೊಟ್ಟು": [{"type": "noun", "defs": ["the small protuberance on the breast through which, in a woman, the milk passes in suckling the young; the nipple.", "any growth on the head of an animal, as a comb or feathered tuft on certain birds; a crest.", "the fold of skin near a cobra's head that expands when it is excited; the hood of a snake.", "the sign used to add to Kannaḍa consonants to represent addition of the vowel 'ಅ'."]}, {"type": "noun", "defs": ["a kind of ornament worn by women in their plaited hair."]}, {"type": "noun", "defs": ["the passerine bird, blue jay of Corvidae family."]}, {"type": "noun", "defs": ["a kind of drum, played as a percussion instrument.", "a tool used for digging or cutting the ground etc., with a sharp-edged metal blade and a long handle; a spade."]}], "ಕೊಟ್ಟುಕ": [{"type": "noun", "defs": ["a black-and-white plover, Venellus vanellus with broad, rounded wings, noted for spectacular aerial displays and shrill wailing cry; a lapwing."]}], "ಕೊಟ್ಟುಕೊಡ್ತಲೆ": [{"type": "noun", "defs": ["(dial.) any of a family (Picidae) of piciform birds distinguished by stiff tail feathers used for support, a strong, pointed, chisel-shaped bill used for drilling holes in bark; a woodpecker."]}], "ಕೊಟ್ಟುಗ": [{"type": "noun", "defs": ["= ಕೊಟ್ಟುಕ.", "2) any of a family (Pycnonotidae) of small, dull-coloured passerine birds of Asia; a bulbul."]}], "ಕೊಟ್ಟೆ": [{"type": "noun", "defs": ["the stonelike seed of certain fruits, as of mango; a stone; a seedpod.", "a seed in gen.", "a relatively thin, flat piece of a metal or stone."]}, {"type": "noun", "defs": ["a cup made of the areca sheet.", "the place used by certain insects as dwelling place or for laying their eggs; a nest.", "a sheet used to cover the arecanut bunches on the tree.", "a kind of pudding made in a cup of arecanut sheet and cooked in steam."]}, {"type": "noun", "defs": ["the quality or fact of being vain or excessively proud of oneself or one's qualities or possessions; self-conceit; vanity.", "a wild, lawless person, often a member of a gang of criminals; a scoundrel."]}, {"type": "noun", "defs": ["the perennial vine Citrullus colocynthus ( = Cucumis colocynthis) of Cucurbitaceae family; colocynth.", "its fruit which is dried and used in making a strong cathartic."]}, {"type": "noun", "defs": ["the dried gourd of certain plants, used as a floating aid or dried nut (as coconut, areca nut, etc.)."]}], "ಕೊಟ್ಟೆಕಟ್ಟು": [{"type": "verb", "defs": ["to make a cup from the areca sheet."]}, {"type": "verb", "defs": ["to become motionless or inflexible from cold."]}], "ಕೊಟ್ಟೆಕಡ್ಡಿ": [{"type": "noun", "defs": ["a short, thin splinter of the slender stem of the grass Aristida depressa, used to stitch cups from areca sheets."]}], "ಕೊಟ್ಟೆಗೋಳಿ": [{"type": "noun", "defs": ["the tree Ficus drupacea (var. pubescens) ( = F. mysorensis) of Moraceae family; Mysore fig.", "its fig."]}], "ಕೊಟ್ಟೆದೊನ್ನೆ": [{"type": "noun", "defs": ["= ಕೊಟ್ಟೆ2- 1."]}], "ಕೊಟ್ಟೆಮಣೆ": [{"type": "noun", "defs": ["a stool or a table used in climbing a tree."]}], "ಕೊಟ್ಟೆಮುಳ್ಳು": [{"type": "noun", "defs": ["= ಕೊಡಂಚಿ."]}], "ಕೊಟ್ಠಾರ": [{"type": "noun", "defs": ["= ಕೊಠಾರ."]}], "ಕೊಠಡಿ": [{"type": "noun", "defs": ["a part of a building enclosed by walls or partitions, floor and ceiling; a room."]}], "ಕೊಠಾರ": [{"type": "noun", "defs": ["a storehouse for threshed grain; a granary.", "a tax levied on granaries, warehouse, etc."]}], "ಕೊಠಾರಿಕೆ": [{"type": "noun", "defs": ["the work, duty, office of the superintendent of a granary."]}], "ಕೊಡ": [{"type": "noun", "defs": ["the state or time of being a girl (of age below seven years).", "a very young girl."]}, {"type": "noun", "defs": ["a round vessel made of metal, earthenware, with a narrow neck, for holding or drawing water (from a well).", "a cup like pan of a weighing balance.", "the structure of six-sided wax cells made by bees to hold their honey or eggs; a honey-comb."]}, {"type": "noun", "defs": ["the direction to the left of a person facing north; the direction of the horizon in which the sun sets; west."]}], "ಕೊಡಂಕೆ": [{"type": "noun", "defs": ["the organ of hearing and balance in humans and vertebrates, esp. the external part of this; the ear."]}, {"type": "noun", "defs": ["the act of giving, donating, handing over, passing on etc."]}], "ಕೊಡಂಗಗೆಯಿ": [{"type": "noun", "defs": ["= ಕೊಡಂಗೆಯ್2."]}], "ಕೊಂಡಂಗಿ": [{"type": "noun", "defs": ["= ಕೊಡಂಗೆಯ್2."]}], "ಕೊಡಂಗೆ": [{"type": "noun", "defs": ["= ಕೊಡಂಗೆಯ್2."]}, {"type": "noun", "defs": ["a kind of ear-ornament, usu. an ear-ring worn by men."]}, {"type": "noun", "defs": ["the vine Cissus repens ( = Vitis repens) of Vitaceae family."]}], "ಕೊಡಂಗೆಗೊಡು": [{"type": "verb", "defs": ["to give, bestow or gift."]}], "ಕೊಡಂಗೆಯ್": [{"type": "verb", "defs": ["= ಕೊಡಂಗೆಗೊಡು."]}, {"type": "noun", "defs": ["a land gifted as an endowment to a person, as a mark of recognition, which is exempt from paying tax."]}], "ಕೊಡಂಗೆಯಿ": [{"type": "noun", "defs": ["= ಕೊಡಂಗೆಯ್2."]}], "ಕೊಡಂಚಿ": [{"type": "noun", "defs": ["the shrub Ziziphus xylopyrus of Rhamnaceae family.", "its edible fruit."]}], "ಕೊಡಂತಿ": [{"type": "noun", "defs": ["a tool with a heavy metal or wooden head mounted at right angles to the handle, used for breaking, driving nails, etc.; a hammer."]}], "ಕೊಡಂದೆ": [{"type": "noun", "defs": ["= ಕೊಡಂಗೆಯ್2."]}], "ಕೊಡಂಬೆ": [{"type": "noun", "defs": ["a bamboo or cane basket used to catch fish in flowing water; a fish-trap."]}], "ಕೊಡಕು": [{"type": "noun", "defs": ["the quality, condition of being crooked, serpentine; crookedness."]}], "ಕೊಡಕೆ": [{"type": "noun", "defs": ["= ಕೊಡಂಕೆ1."]}, {"type": "noun", "defs": ["= ಕೊಡಂಕೆ2."]}], "ಕೊಡಕೈ": [{"type": "noun", "defs": ["a kind of military weapon."]}], "ಕೊಡಕೊಳು": [{"type": "noun", "defs": ["the act, practice of giving and taking between two persons or among many; exchange.", "the giving of a girl in marriage to another family and bringing another girl from that family in marriage; mutual marriages.", "and the relation established by such marriages."]}], "ಕೊಡಕೋಲು": [{"type": "noun", "defs": ["the tree Bauhinia diphylla of Caesalpiniaceae family."]}], "ಕೊಡಗ": [{"type": "noun", "defs": ["the common langur, Presbytis entellus.", "a monkey in gen. 3) a mischievous or imitative person regarded as a monkey.", "a mocking or bantering remark; jibe; a taunt ; a joke."]}, {"type": "noun", "defs": ["a community (known as Koḍava) mainly hailing from Koḍagu region of Karnāṭaka.", "a man belonging to this community or from this region.", "a foreigner, esp. one belonging to a foreign religion."]}, {"type": "noun", "defs": ["the direction to the left of a person facing north; it is the point on the horizon at which the centre of the sun sets at the equinox; west."]}], "ಕೊಡಗತ್ತಿ": [{"type": "noun", "defs": ["a short-handled farming tool with a semicircular blade, used for cutting corn, lopping or trimming; a sickle."]}], "ಕೊಡಗಸಾಲೆ": [{"type": "noun", "defs": ["the plant Rungia repens of Acanthaceae family."]}], "ಕೊಡಗಿ": [{"type": "noun", "defs": ["= ಕೊಡಂಗೆಯ್2.", "(dial.) a small tract of rice-field."]}], "ಕೊಡಗಿಗದ್ದೆ": [{"type": "noun", "defs": ["an irrigated land gifted to a person, as a mark of recognition, which is usu. exempt from paying tax."]}], "ಕೊಡಗಿತಿ": [{"type": "noun", "defs": ["a woman belonging to koḍava community or Koḍagu region."]}], "ಕೊಡಗಿದಾರ": [{"type": "noun", "defs": ["a man who is endowed with a land in recognition of his service."]}], "ಕೊಡಗಿಮಾನು": [{"type": "noun", "defs": ["= ಕೊಡಗಿಮಾನ್ಯ."]}], "ಕೊಡಗಿಮಾನ್ಯ": [{"type": "noun", "defs": ["an arable land gifted to a person, as a mark of recognition, which is usu. exempt from paying tax."]}], "ಕೊಡಗಿವಿ": [{"type": "noun", "defs": ["an ear resembling a round vessel or cup."]}], "ಕೊಡಗು": [{"type": "noun", "defs": ["the southernmost district of Karnāṭaka, which formerly was an independent state.", "the language, a dialect of Kannaḍa, spoke by people of this area (popularly known as Koḍava)."]}], "ಕೊಡಗುಕತ್ತಿ": [{"type": "noun", "defs": ["a sword with a broad blade and a hooked point, used by Koḍavas."]}], "ಕೊಡಗುಮಲೆ": [{"type": "noun", "defs": ["the mountain range in Koḍagu district of Southern Karnāṭaka."]}], "ಕೊಡಗೂಸು": [{"type": "noun", "defs": ["a girl of age below seven years."]}], "ಕೊಡಗೂಸುತನ": [{"type": "noun", "defs": ["the state or time of being a girl (of age below seven years).", "the state or fact of being a virgin; maidenhood; sexual chastity; virginity."]}], "ಕೊಡಗೂಸುವೆಣ್": [{"type": "noun", "defs": ["= ಕೊಡಗೂಸು."]}], "ಕೊಡಗೆ": [{"type": "noun", "defs": ["= ಕೊಡಂಗೆಯ್2."]}], "ಕೊಡಗೆಚ್ಚಲ್": [{"type": "noun", "defs": ["a round, big baglike mammary organ containing two or more glands (chiefly of a cow)."]}], "ಕೊಡಗೆಮಾನ್ಯ": [{"type": "noun", "defs": ["= ಕೊಡಗಿಮಾನ್ಯ."]}], "ಕೊಡಗೆಯ್": [{"type": "noun", "defs": ["= ಕೊಡಂಗೆಯ್2."]}], "ಕೊಡಗೆಹೊಲ": [{"type": "noun", "defs": ["= ಕೊಡಂಗೆಯ್2."]}], "ಕೊಡಗೈ": [{"type": "noun", "defs": ["a person who gives, donates liberally.", "the quality of such a person."]}], "ಕೊಡಚಗ": [{"type": "noun", "defs": ["the small-sized deciduous tree Holarrhena antidysenterica of Apocynaceae family."]}], "ಕೊಡಚಿ": [{"type": "noun", "defs": ["= ಕೊಡಂಚಿ."]}], "ಕೊಡಚು": [{"type": "verb", "defs": ["to take out the cerumen, the yellowish, waxlike secretion found in the canal of the external ear.", "to clean a vessel by rubbing its inside with the hand."]}], "ಕೊಡತ": [{"type": "noun", "defs": ["the pain caused by contraction of a muscle or muscles from chill.", "the pain of a sore."]}, {"type": "noun", "defs": ["absence of heat or lack of normal warmth; a low temperature; coldness."]}, {"type": "noun", "defs": ["a thick wooden piece tied to the neck of cattle as to swing between the forelegs, to prevent running fast."]}], "ಕೊಡತಿ": [{"type": "noun", "defs": ["a tool with a heavy metal or wooden head mounted at right angles to the handle, used for breaking, driving nails, etc.; a hammer."]}], "ಕೊಡತಿಕೀಟ": [{"type": "noun", "defs": ["a predatory insect of the order of Odonata, having brilliantly coloured long body; a dragon-fly."]}], "ಕೊಡತಿಬೆಟ್ಟು": [{"type": "noun", "defs": ["a clawlike deformity of a toe, usu. the second; hammer-toe."]}]}