{"ಕಾಕಲಿ": [{"type": "noun", "defs": ["a sweet and low tone."]}], "ಕಾಕಲಿನಿಷಾಧ": [{"type": "noun", "defs": ["(mus.) the sharpest of the variations of the seventh note ನಿ (Niṣādha) in Karnāṭaka system."]}], "ಕಾಕಲಿಪಿ": [{"type": "noun", "defs": ["a bad, undecipherable hand-writing; cocography.", "a kind of old script."]}], "ಕಾಕವಿ": [{"type": "noun", "defs": ["the drainings of jaggery or crude sugar; treacle; molasses."]}], "ಕಾಕವೃದ್ಧಿ": [{"type": "noun", "defs": ["a plant ."]}], "ಕಾಕಸತ್ವೆ": [{"type": "noun", "defs": ["a woman of ill-nature and harsh voice."]}], "ಕಾಕಸರಳಿ": [{"type": "noun", "defs": ["the plant Diospyros sylvatica of Ebenaceae family."]}], "ಕಾಕಸ್ನಾನ": [{"type": "noun", "defs": ["a bathing by dipping only the head in to water (as crows do).", "a bath taken hurriedly."]}], "ಕಾಕಳಿ": [{"type": "noun", "defs": ["= ಕಾಕಲಿ."]}], "ಕಾಕಾ": [{"type": "noun", "defs": ["the younger brother of one's father; paternal uncle."]}, {"type": "noun", "defs": ["one's liking; inclination.", "a resting on the integrity, trust, faith.", "close familiarity; intimate feeling; intimacy.", "ಕಾಕಾಪುಡಿ kākāpuḍi =(correctly) ಕಾಕಾಹಿಡಿ; ಕಾಕಾಹಿಡಿ kākāhiḍi (fig.) to propitiate; to render favourable; to work or to offer submissively just to please another; to try too hard to please some one in important position; ಕಾಕಾಹೊಡೆ kākāhoḍe = (correctly) ಕಾಕಾಹಿಡಿ."]}], "ಕಾಕಾಹೊಡೆ": [{"type": "verb", "defs": ["= ಕಾಕಾಹಿಡಿ (see under ಕಾಕಾ2)."]}], "ಕಾಕಾಂಗಿ": [{"type": "noun", "defs": ["the plant Leea hirta."]}], "ಕಾಕಾಕ್ಷಿ": [{"type": "noun", "defs": ["the corw's eye."]}], "ಕಾಕಾಕ್ಷಿಗೋಳಕನ್ಯಾಯ": [{"type": "noun", "defs": ["= ಕಾಕಾಕ್ಷಿನ್ಯಾಯ."]}], "ಕಾಕಾಕ್ಷಿನ್ಯಾಯ": [{"type": "noun", "defs": ["a maxim originating from the supposition that crows see with only one eye, by turning the eye ball on either side and used to denote a condition where two benefits are got with one effort only."]}], "ಕಾಕಾರಿ": [{"type": "noun", "defs": ["= ಕಾಕರಿಪು."]}], "ಕಾಕಾಳಿ": [{"type": "noun", "defs": ["a multitude of crows."]}], "ಕಾಕಿ": [{"type": "noun", "defs": ["the plant Plectronia parviflora (= Canthium parviflorum) of Rubiaceae family, a thorny shrub.", "the plant Solanum nigrum of Solanaceae family, with black, yellow or red berries.", "the plant Cassia fistula of Caesalpiniaceae family."]}, {"type": "noun", "defs": ["a female crow.", "the quality of singing in shrill voice, considered as a fault.", "a person singing in a shrill voice."]}, {"type": "noun", "defs": ["strong, twilled cloth of dull yellowish brown colour, used esp. for military and police uniforms; khaki."]}, {"type": "noun", "defs": ["the wife of an younger brother of one's father."]}], "ಕಾಕಿಣಿ": [{"type": "noun", "defs": ["a cowrie used among premitives as money.", "a denomination of money equal to the value of twenty cowries; a quarter of a paṇa.", "a measure of weight equal to a quarter of a m āṣa."]}], "ಕಾಕಿಣೀರತ್ನ": [{"type": "noun", "defs": ["(Jain.) one of the mythological live gems supposed to give out light when rubbed."]}], "ಕಾಕಿನಿ": [{"type": "noun", "defs": ["= ಕಾಕಿಣಿ - 2."]}], "ಕಾಕಿಮಂಡಲಿ": [{"type": "noun", "defs": ["the plant Trichosanthes bractoata (= T. Palmata) of Cucurbitaceae family."]}], "ಕಾಕಿವೆ": [{"type": "noun", "defs": ["= ಕಾಕವಿ."]}], "ಕಾಕಿಸೊಪ್ಪು": [{"type": "noun", "defs": ["the plant Anamirta paniculata (= Anamirta cocculus, = Cocculus indicus) of Menispermaceae family."]}], "ಕಾಕಿಸೊಪ್ಪುಗಡ್ಡೆ": [{"type": "noun", "defs": ["= ಕಾಕಿಸೊಪ್ಪು."]}], "ಕಾಕಿಹಣ್ಣು": [{"type": "noun", "defs": ["the berry of the plant Solanum nigrum."]}], "ಕಾಕೀ": [{"type": "noun", "defs": ["= ಕಾಕಿ4."]}], "ಕಾಕೀಮುಖ": [{"type": "noun", "defs": ["the tip of the mystical vessel in the human body, situated at the crown of the head."]}], "ಕಾಕು": [{"type": "noun", "defs": ["the state of having lost one's strength and patience from continuous irritation or trouble."]}, {"type": "noun", "defs": ["the pungent smothering, smell of onion, garlic etc."]}, {"type": "noun", "defs": ["a change in the voice, indicative of the emotion like fear, grief, anger, etc. under which it was produced.", "embelishment of a mode in music emphasising certain phrases and gamakas (subtle movements) particular to that mode.", "a voice or word used to mean different form or contrary to the literary meaning of what is said or written; a sarcasm.", "the nativity in a word or passage, particular to a region.", "uttering of words in a low indistrinct voice in grumbling, hostility or dislike.", "an imprecation expressing hatred, anger, vexation, etc.; a curse.", "loss, waste, uselessness; wastage.", "that which is of low quality or which is of low worth.", "a man of mean or base mentality.", "that which causes loss, distruction; evil.", "a false statement made with the intention of deceiving or misleading; a lie; falsehood; untruth.", "ಕಾಕಬಳಸು kāka baḷasu to swerve from the right path or rectitude; 2. to miscalculate (in avoiding a danger); to judge wrongly; 3. to utter bad words; to speak ill; to remark sarcastically; ಕಾಕನಾಡು kākanāḍu to make a false statement; to lie; to talk pervasively; ಕಾಕಾಗು kākāgu to be spoiled; to become useless or worthless; ಕಾಕುಮಾಡಿಸು kākumāḍisu to cause to injure the form or beauty; to cause to disfigure, deform or currupt; ಕಾಕುಮಾಡು kākumāḍu to spoil; to destroy; to corrupt."]}, {"type": "noun", "defs": ["a loud cry.", "a shrill, sudden cry as in fear or pain; an outcry; shriek.", "a mode in blowing the flute; ಕಾಕುಹಾಕು kākuhāku to cry out in a loud shrill voice to make a whistling sound."]}, {"type": "verb", "defs": ["to lose one's strength from or as from heat; (?)."]}], "ಕಾಕುಗೀತ": [{"type": "noun", "defs": ["a mean song; a song of low standard."]}], "ಕಾಕುಟ": [{"type": "noun", "defs": ["the tree Schleichera oleosa (=S.trijuga) of Sapindaceae family; Indian squill."]}], "ಕಾಕುತನ": [{"type": "noun", "defs": ["the quality of being deviated from rectitude; crookedness; wickedness."]}], "ಕಾಕುತುಂಪರೆ": [{"type": "noun", "defs": ["the medium sized , evergreen tree Diospyros peregrina (= D. embryopteris, = D. glutenifera) of Ebenaceae family, the fruits of which contain tannin."]}], "ಕಾಕುತ್ಸ್ಥ": [{"type": "noun", "defs": ["one belonging to the lineage of king Kakutstha, more often applied to Rāma."]}], "ಕಾಕುದ": [{"type": "noun", "defs": ["the roof of the mouth; the palate."]}], "ಕಾಕುದೈವ": [{"type": "noun", "defs": ["a minor or petty diety."]}], "ಕಾಕುನುಡಿ": [{"type": "noun", "defs": ["a word uttered in contempt or with a bad intenion."]}], "ಕಾಕುಪುಷ್ಟಿ": [{"type": "noun", "defs": ["imperfect, inadequate, faulty or absence of, nutrition; poor nourishment; malnutrition."]}], "ಕಾಕುಪೋಕು": [{"type": "adjective", "defs": ["of low standard or quality; mean; low in place, value or principle; worthless."]}], "ಕಾಕುಬಲ": [{"type": "noun", "defs": ["power of low standard; weakness.", "a man lacking in strength of body or muscle; he who is not physically strong; a feeble man."]}], "ಕಾಕುಬುದ್ಧಿ": [{"type": "noun", "defs": ["a mind that thinks in a wrong, improper or wicked way; a perverse mind; crookedness or wickedness of the mind."]}], "ಕಾಕುಭಟ": [{"type": "noun", "defs": ["a soldier who cannot fight bravely; a coward soldier."]}], "ಕಾಕುಮತಿ": [{"type": "noun", "defs": ["= ಕಾಕುಬುದ್ಧಿ.", "a crooked, wicked, depraved person."]}], "ಕಾಕುಮದ್ದು": [{"type": "noun", "defs": ["an adulterated, impure and hence ineffective medicine."]}], "ಕಾಕುಮನ": [{"type": "noun", "defs": ["= ಕಾಕುಮತಿ."]}], "ಕಾಕುಮನುಜ": [{"type": "noun", "defs": ["= ಕಾಕುಮತಿ -2."]}], "ಕಾಕುಮಾತು": [{"type": "noun", "defs": ["= ಕಾಕುನುಡಿ."]}], "ಕಾಕುಮಾನವ": [{"type": "noun", "defs": ["= ಕಾಕುಮತಿ -2."]}], "ಕಾಕುಮೂಳ": [{"type": "noun", "defs": ["a low, wretched fellow."]}], "ಕಾಕುಮೂಳಿ": [{"type": "noun", "defs": ["a woman of wicked quality or of no merit; a contemptible woman."]}], "ಕಾಕುರ": [{"type": "noun", "defs": ["the plant Curcuma zeodarina (= C. zerumbet, = Amonum zerumbet) of zingiberaceae family."]}], "ಕಾಕುರುಳು": [{"type": "noun", "defs": ["the dried cow-dung lying in the forest."]}], "ಕಾಕುಲತೆ": [{"type": "noun", "defs": ["a state of being uneasy, apprehensive or worried about what may happen; anxiety; worry.", "fond or tender feeling; warm liking; affectionate regard or attachment.", "sorrow felt for another's suffering or misfortune; pity; compassion; sympathy.", "the quality of a miser; miserliness; stinginess.", "a wish; a desire.", "a condition of uncertainty; a doubt.", "the quality of acting or moving with great force, violence; vehemence; impetuosity."]}], "ಕಾಕುಲಾತಿ": [{"type": "noun", "defs": ["= ಕಾಕುಲತೆ."]}], "ಕಾಕುವಗರಣ": [{"type": "noun", "defs": ["a trifle, paltry scandal; an attempted discredit upon a person or organisation, on a false ground.", "one who attempts a petty scandal."]}], "ಕಾಕುವೆಸರ್": [{"type": "noun", "defs": ["a derogatory term, name or appellation by which a person is addressed.", "spoilt name; ill-fame; infamy."]}], "ಕಾಕುವ್ಯಂಜನೆ": [{"type": "noun", "defs": ["expression of different sentiments or shades of meaning by varying the voice."]}], "ಕಾಕುಸೇವೆ": [{"type": "noun", "defs": ["service rendered to an undeserved, ignoble, small-minded person."]}], "ಕಾಕುಳ್ಳು": [{"type": "noun", "defs": ["= ಕಾಕುರುಳು."]}], "ಕಾಕೂ": [{"type": "noun", "defs": ["one's father's younger brotheṛs wife."]}], "ಕಾಕೂಳು": [{"type": "noun", "defs": ["the food unfit for consumption."]}], "ಕಾಕೆ": [{"type": "noun", "defs": ["the plant Solanum nigrum of Solanaceae family.", "its black, yellow or red berry."]}, {"type": "noun", "defs": ["a woman of bad quality or no merit; an arrogant and haughty woman."]}, {"type": "noun", "defs": ["a moderately large, black bird of the genus Corvus; a crow."]}], "ಕಾಕೆಹಣ್ಣು": [{"type": "noun", "defs": ["the berry of the plant Solanum nigrum."]}], "ಕಾಕೇಂದು": [{"type": "noun", "defs": ["the tree Diospyras kanjilali of Ebenaceae family; black ebony."]}], "ಕಾಕೋಡುಂಬರಿಕೆ": [{"type": "noun", "defs": ["= ಕಾಕೋದುಂಬರ."]}], "ಕಾಕೋದರ": [{"type": "noun", "defs": ["a snake; a serpent."]}], "ಕಾಕೋದರಶಾಯಿ": [{"type": "noun", "defs": ["Viṣṇu, whose couch is a seprent."]}], "ಕಾಕೋದರಾಭರಣ": [{"type": "noun", "defs": ["Śiva, who has serpents for ornaments."]}], "ಕಾಕೋದುಂಬರ": [{"type": "noun", "defs": ["the tree Ficus tomentosa of Moraceae family and its fruit.", "the tree Ficus hispida (= F. oppositifolia) of the same family and its fuit."]}], "ಕಾಕೋಲ": [{"type": "noun", "defs": ["a black bird of the genus Corvus; a crow.", "a large glossy black species of crow; raven.", "the quality or condition of not being friendly; unfriendliness; hostility.", "a kind of poison.", "a great forest fire; conflagration.", "a division of the infernal region or hell.", "one who makes articles of baked clay; a potter.", "a snake.", "a mature uncastrated male pig; a boar."]}], "ಕಾಕೋಲಧರ": [{"type": "noun", "defs": ["Śiva, who drank a poison (which stayed at his throat)."]}], "ಕಾಕೋಲಿ": [{"type": "noun", "defs": ["the plant Solanum indicum of Solanaceae family; wild Indian brinjal.", "its fruit.", "the plant Anamirta paniculata (= Anamirta cocculus, = Cocculus indicus) of Menispermaceae family.", "its berry."]}], "ಕಾಕೋಳಿ": [{"type": "noun", "defs": ["= ಕಾಕೋಲಿ."]}, {"type": "noun", "defs": ["a person causing mischief; a mischiefmaker.", "one who is disinclined to exertion; a lazy person."]}, {"type": "noun", "defs": ["a bird of the duck tribe, gallus sonnerati; wild-fowl; wood-cock."]}], "ಕಾಕ್ಷಿ": [{"type": "noun", "defs": ["a fragrant kind of earth."]}], "ಕಾಕ್ಷೀವ": [{"type": "noun", "defs": ["the tree Moringa oleifera (= M. pterygosperma, = Hyperanthera moringa) of Moringaceae family.", "its stick-like fruit; drum stick."]}], "ಕಾಗಜ": [{"type": "noun", "defs": ["= ಕಾಗದ."]}], "ಕಾಗಡಿ": [{"type": "noun", "defs": ["a bamboo lath having slings on both sides to carry burden on the shoulder or on the back of the neck.", "a device, as a seat hanging from ropes or chains, on which one can sit and swing backward and forward as a form of amusement; a swing."]}], "ಕಾಗದ": [{"type": "noun", "defs": ["a thin, flexible material made usu. in sheets from a pulp prepared from rags, wood or other fibrous material, and used for writing or printing on, for packaging, as wrapping material, structural material, etc.; a paper.", "a single sheet or piece of paper.", "a written or printed message; a letter.", "a card, folded and gummed or not, for writing or printing a message; a letter-card.", "anything printed, written, etc. that contains information or is relied upon to record or prove something; a paper affording written information as evidence of a contract; a written document.", "ಕಾಗದ ಪತ್ರ kāgada patra (used in pl.) written documents evidencing a contract or any transaction.", "(used in pl.) communication by letters; letters of correspondence; ಕಾಗದದ ಹುಂಡಿ kāgadada huṇḍi a document used in lieu of hard cash e.g. a cheque, a bill of exchange etc."]}], "ಕಾಗದಉಪ್ಪುನೇರಳೆ": [{"type": "noun", "defs": ["the tree Broussonetia papyrifera of Moraceae family; paper mulberry tree."]}], "ಕಾಗದಹಾಳ": [{"type": "noun", "defs": ["a man who wastes paper; a man who writes illegibly or carelessly.", "(fig.) an author having little worth in his writing."]}], "ಕಾಗದಹೂ": [{"type": "noun", "defs": ["the woody tropical vine Bougainvillea spectabilis of Nyctaginaceae family; bougainvillaea plant.", "its flower which has inconspicuous flowers surrounded by large, showy purple or red bracts; bougainvillaea flower."]}], "ಕಾಗದಳಿ": [{"type": "noun", "defs": ["(dial.) the red earth.", "a red soil region."]}], "ಕಾಗದಾಳಿ": [{"type": "noun", "defs": ["= ಕಾಗದಳಿ."]}], "ಕಾಗಬ್ಬು": [{"type": "noun", "defs": ["the grass Saccharum spontaneum of Poaceae family; thatch grass, used for mats, roofs, etc."]}], "ಕಾಗರ": [{"type": "noun", "defs": ["the tree Strychnos nux-vomica of Loganiaceae family.", "its poisonous nut containing strychnine, brucine and other alkaloids; nux-vomica."]}], "ಕಾಗಲು": [{"type": "noun", "defs": ["the act or fact of boiling (as water); a boiling or bubbling up; ebullition."]}], "ಕಾಗಾರ": [{"type": "noun", "defs": ["a person hired to guard a building or other property against thieves, vandals or trespassers; a watchman."]}], "ಕಾಗಾರದನ": [{"type": "noun", "defs": ["(pl.) cattle that is under the watch or guard of a person."]}], "ಕಾಗಿ": [{"type": "noun", "defs": ["a female crow (genus Corvus, family Corvidae)."]}], "ಕಾಗಿಣಿ": [{"type": "noun", "defs": ["a shell or cowrie used as currency by primitive people.", "a denomination of money equal to twenty cowries; a quarter of a paṇa.", "a weight equal to a quarter of a m āṣa."]}], "ಕಾಗು": [{"type": "adjective", "defs": ["of dark blue or black colour."]}, {"type": "noun", "defs": ["the dark blue or black colour.", "a piece of dark blue or black colour."]}, {"type": "noun", "defs": ["the state of being complete destroyed; ruin."]}], "ಕಾಗುಡು": [{"type": "adjective", "defs": ["to be dressed in dark-blue or black clothes."]}], "ಕಾಗುಣಿತ": [{"type": "noun", "defs": ["formation and graphic representation of a consonant combined with a vowel or another consonant and a vowel, as a single unit."]}], "ಕಾಗುದುರೆ": [{"type": "noun", "defs": ["a wild, untamed horse."]}], "ಕಾಗುರುಳು": [{"type": "noun", "defs": ["the dark hair."]}], "ಕಾಗುಳ": [{"type": "noun", "defs": ["the quality of causing fear; the state of being overcome with fear."]}], "ಕಾಗೆ": [{"type": "noun", "defs": ["a moderately large, black bird of the genus Corvus; a crow.", "the plant Solanum nigrum of Solanaceae family.", "ಕಾಗೆ ಎಂಜಲು kāge enjalu a cutting with teeth an eatable covered with a piece of cloth (as children do, to avoid the saliva touching it); ಕಾಗೆಕಣ್ಣೀರು kage kaṇṇīru (said of milk) the state of being adulterated with too much of water; ಕಾಗೆಬಳಗ kāge baḷaga (fig.) relatives being great plenty in number; ಕಾಗೆಯ ಪಟ್ಟೆ kāgeya paṭṭe a piece of black cloth(?); ಕಾಗೆಯಾಗು kāgeyāgu to turn black like a crow (as from hot sun); ಕಾಗೆಕಾರುಬಾರು kāge kārubāru the act of managing the affairs (of a company organisation, state, etc.) badly or dishonestly; mismanagement; ಕಾಗಕ್ಕ ಗುಬ್ಬಕ್ಕನ ಕಥೆ kāgakka gubbakkana kathe = ಕಾಗೆ ಗುಬ್ಬಿಯ ಕಥೆ; ಕಾಗೆ ಗುಬ್ಬಿಯ ಕಥೆ kāge gubbiya kathe a feigned story or statement of facts, supposed to be true, which either certainly not so or at least is as probably false as true; an old wife's story; ಕಾಗೆಕಾವಲು kāge kāvalu a guard by a person who himself is a threat to the those being guarded or looked after; ಕಡಲೆ ಕಾಯೋಕೆ ಕಾಗೆಕಾವಲು kaḍale kāyōke kāge kāvalu to make a goat one's gardener."]}, {"type": "noun", "defs": ["= ನಿಯತ ಕೃತ್ಯ; (?)."]}, {"type": "noun", "defs": ["a vessel with a snout for serving liquid foods."]}], "ಕಾಗೆಂಡೆ": [{"type": "noun", "defs": ["a kind of fish; (= black geṇḍe mīnu?)."]}], "ಕಾಗೆಕೂಟ": [{"type": "noun", "defs": ["an assemblage of crows.", "the sexual intercourse of crows."]}], "ಕಾಗೆಗಣ್ಣು": [{"type": "noun", "defs": ["a small eye as that of a crow.", "a single eye.", "inability to use both the eyes, simultaneously."]}], "ಕಾಗೆಗಬ್ಬು": [{"type": "noun", "defs": ["the grass Saccharum spontaneum of Poaceae family; thatch grass, used for mats, roofs, etc."]}], "ಕಾಗೆಗೊಳ್ಳಿ": [{"type": "noun", "defs": ["a kind of fish."]}], "ಕಾಗೆಜೋಳ": [{"type": "noun", "defs": ["a kind of millet; (= the grass Sorghum halpense of Poaceae family; kāḍujōḷa ?)."]}], "ಕಾಗೆತೂಬರೆ": [{"type": "noun", "defs": ["the tree Diospyros kanjilali of Ebenaceae family."]}], "ಕಾಗೆದಬ್ಬೆ": [{"type": "noun", "defs": ["the grass Saccharum spontaneum of Poaceae family; thatch grass, used for mats, roofs, etc."]}], "ಕಾಗೆದರ್ಭೆ": [{"type": "noun", "defs": ["= ಕಾಗೆದಬ್ಬೆ."]}], "ಕಾಗೆದೊಂಡೆ": [{"type": "noun", "defs": ["the shrub Leea hirta.", "the plant Xanthochymus pictorius.", "the creeper Coccina cordifolia (= C. indica, = Bryonia indica, = Momordica monadelpha) of Cucurbitaceae family."]}], "ಕಾಗೆನೇರಳೆ": [{"type": "noun", "defs": ["the tree Syzygium hemisphaericum (= Eugenia hemisphaerica) of Myrtaceaefamily.", "its fruit.", "the tree Syzygium operculatum of the same family."]}], "ಕಾಗೆಪಿಂಡ": [{"type": "noun", "defs": ["the offerings of food to crows (manes are believed to eat this offering, coming in the form of crows)."]}], "ಕಾಗೆಪುರಳೆÀ": [{"type": "noun", "defs": ["the plant Mollugo cerviana of Aizoaceae family."]}], "ಕಾಗೆಬಂಗಾರ": [{"type": "noun", "defs": ["any of a group of minerals (complex silicates) that crystallise in thin, somewhat flexible, translucent or coloured, easily separated layers, resistant to heat and electricity; mica.", "(fig.) an imitative thing that is not worth as the imitated one."]}], "ಕಾಗೆಬಂಜೆ": [{"type": "noun", "defs": ["a woman who cannot conceive a child after bearing the first."]}], "ಕಾಗೆಬಿದಿರು": [{"type": "noun", "defs": ["= ಕಾಗೆದಬ್ಬೆ."]}], "ಕಾಗೆಭಂಗಾರ": [{"type": "noun", "defs": ["= ಕಾಗೆಬಂಗಾರ."]}], "ಕಾಗೆಮಾಂಬಳ್ಳಿ": [{"type": "noun", "defs": ["the plant Anamirta cocculus (= A. paniculata, = Cocculus indicus) of Menispermaceae family, the seeds of which contain picrotoxin (used as a stimulant in cases of barbiturate poisoning)."]}], "ಕಾಗೆಮಾಯಿ": [{"type": "noun", "defs": ["a kind of bird."]}], "ಕಾಗೆಮಾರಿ": [{"type": "noun", "defs": ["the plant Anamirta paniculata (= A. cocculus, = Cocculus indicus) of Menispermaceae family.", "the plant Cocculus suberosus of the same family.", "the plant Cocculus hirstus of Menispermaceae family.", "its berry.", "the vine Trichosanthes bracteata (= T. palmata) of Cucurbitaceae family.", "its fruit; bitter apple."]}], "ಕಾಗೆಮೋರೆ": [{"type": "noun", "defs": ["= ಕಾಗೆಮಾರಿ -1 & 3."]}], "ಕಾಗೆರೋಗ": [{"type": "noun", "defs": ["a disease characterised by the body turning black."]}], "ಕಾಗೆಸೊಪ್ಪು": [{"type": "noun", "defs": ["= ಕಾಗೆಮಾಂಬಳ್ಳಿ."]}], "ಕಾಗೆಸ್ನಾನ": [{"type": "noun", "defs": ["a (mere) dipping in water for bathing, without washing the body properly; a bath taken hurriedly."]}], "ಕಾಗೆಹಣ್ಣು": [{"type": "noun", "defs": ["the berry of the plant Solanum nigrum."]}], "ಕಾಗೆಹುಲ್ಲು": [{"type": "noun", "defs": ["a kind of grass; ( = the grass Saccharum spontaneum of Poaceae family; thatch grass, used for mats, roofs, etc.?)."]}], "ಕಾಗೆಹೊಡಕ": [{"type": "noun", "defs": ["a kind of crow-striking bird; (= an owl ?)."]}], "ಕಾಚ": [{"type": "noun", "defs": ["a hard, amorphous, brittle, usu. transparent, substance, a bad conductor of electricity, made of the oxides of silicon; glass.", "a net-work of rope or metal string hung from roof-beam of the house for keeping vessels; a swinging shelf.", "an eye-diseae."]}, {"type": "noun", "defs": ["a sewn cloth, tight-fitting underwear, worn as girding for the loins; an underclothing."]}], "ಕಾಚಕೆ": [{"type": "noun", "defs": ["(dial.) a kind of fish."]}], "ಕಾಚಕ್ಕಿ": [{"type": "noun", "defs": ["the green ear of corn (esp. of rāgi).", "a green ear of corn( esp. rāgi) burnt (for eating).", "the brownish red colour of the parched rice."]}], "ಕಾಚಗ": [{"type": "noun", "defs": ["an eye with affected optic nerve."]}], "ಕಾಚಗಣ್ಣು": [{"type": "noun", "defs": ["an eye affected by the disease ಕಾಚ."]}], "ಕಾಚತೊಂಡೆ": [{"type": "noun", "defs": ["the shrub Leea hirta.", "the plant Xanthochymus pictorius."]}], "ಕಾಚದೃಗ್ಯಂತ್ರ": [{"type": "noun", "defs": ["an instrument consisting essentially of a lens or combination of lenses, for making very small objects, as microorganisms, look larger so that they can be seen and studied; a microscope."]}], "ಕಾಚದ್ರವ": [{"type": "noun", "defs": ["= ಕಾಚದ್ರವ್ಯ."]}], "ಕಾಚದ್ರವ್ಯ": [{"type": "noun", "defs": ["the mix of ingredients for making glass; the partly fused mixture of sand and fluxes of which glass is made; frit.", "the jelly-like, transparent, colourless substance filling the posterior chamber of the eye, between the lens and the retina; vitreous humour."]}], "ಕಾಚಭೂಷಣ": [{"type": "noun", "defs": ["an ornament of glass (as a bangle)."]}], "ಕಾಚಮಣಿ": [{"type": "noun", "defs": ["a bead of glass."]}], "ಕಾಚರಿಕೆ": [{"type": "noun", "defs": ["the creeper Cissus quadrungulata (= Vitis quadrangulata) of Vitaceae family."]}], "ಕಾಚಲು": [{"type": "noun", "defs": ["the state or condition of being dry; dryness."]}], "ಕಾಚವಲಯ": [{"type": "noun", "defs": ["an ornamental glass ring worn about the wrist; a glass-bangle."]}], "ಕಾಚವಳಯ": [{"type": "noun", "defs": ["= ಕಾಚವಲಯ."]}], "ಕಾಚವಿಭೂಷಣ": [{"type": "noun", "defs": ["= ಕಾಚಭೂಷಣ."]}], "ಕಾಚವಿಭೂಷಣಂದುಡು": [{"type": "verb", "defs": ["to wear a glass ornament."]}], "ಕಾಚಶಿಲೆ": [{"type": "noun", "defs": ["a dark glassy volcanic rock formed from hardened lava; obsidian."]}], "ಕಾಚಸ್ಥಾಲಿ": [{"type": "noun", "defs": ["a glass vessel.", "the plant Bignonia Suaveolens of Bignoniaceae family; the trumpet flower plant.", "its flower."]}], "ಕಾಚಿ": [{"type": "noun", "defs": ["= ಕಾಚಿಹುಲ್ಲು.", "(a contemptuous term) a despicable woman; a wretch."]}, {"type": "noun", "defs": ["the plant Solanum indicum of Solanaceae family; wild Indian brinjal.", "its fruit.", "the plant Solanum melongena of Solanaceae family."]}], "ಕಾಚಿತ": [{"type": "adjective", "defs": ["hung in a sling, net work of a rope or wire, which is suspended from the roof-beam of a house."]}, {"type": "noun", "defs": ["a service to a god; a worshipping."]}], "ಕಾಚಿಮಾಚಿ": [{"type": "noun", "defs": ["= ಕಾಚಿಹುಲ್ಲು - 1."]}], "ಕಾಚಿಲು": [{"type": "noun", "defs": ["= ಕಾಚಲು."]}], "ಕಾಚಿಹುಲ್ಲು": [{"type": "noun", "defs": ["the grass Sorghum nitidum (= Andropogon serratus) of Poaceae family.", "the grass Cymbopogon schoenanthus (= Andropogon schoenanthus) of the same family; lemon grass."]}], "ಕಾಚು": [{"type": "noun", "defs": ["the tree Acacia catechu (= Mimosa catechu) of Mimosae family; catechu.", "a dark, astringent, resin-like substance, rich in tanin, extracted from that tree which is used with betel leaves and areca nut, and also in medicine, and for dyeing, tanning, etc."]}, {"type": "noun", "defs": ["= ಕಾಜು."]}, {"type": "noun", "defs": ["an obs. copper currency coin."]}], "ಕಾಚುಗಾವಿ": [{"type": "noun", "defs": ["the color of ocher, esp., dark yellow or yellowish-brown colour."]}], "ಕಾಚುಲವಣ": [{"type": "noun", "defs": ["a kind of factitious, black medicinal salt."]}], "ಕಾಜ": [{"type": "noun", "defs": ["effort directed to an end; a work, deed done or intended to be done."]}, {"type": "noun", "defs": ["a slit or loop, in a clothing, apparel, etc. through which a button can be fastened; a button-hole.", "ಕಾಜದ ಹೊಲಿಗೆ kājada holige a closely worked loop stitch making a reinforced edge, around a buttonhole; buttonhole-stitch."]}], "ಕಾಜಕತ್ತರಿ": [{"type": "noun", "defs": ["a pair of small scissors used to make button-holes; a button-hole scissor."]}], "ಕಾಜಗಾಱ": [{"type": "noun", "defs": ["a man who works; a workman; a worker.", "one who supervises the work being done by another or others; a supervisor."]}], "ಕಾಜಪುಟೆ ಎಣ್ಣೆಮರ": [{"type": "noun", "defs": ["the tree Melaleuca leucadendron of Myrtaceae family with whitish flowers and thick bark, whose aromatic oil is used in medicine; cajuput."]}], "ಕಾಜಲು": [{"type": "noun", "defs": ["the grass Chionachne barbata (= Coix barbatum) of Poaceae family."]}], "ಕಾಜವಾರ": [{"type": "noun", "defs": ["the tree Strychnos nux-vomica of Loganiaceae family.", "its poisonous nut containing strychnine, brucine and other alkaloids; nux-vomica."]}], "ಕಾಜಾಣ": [{"type": "noun", "defs": ["a glossy-black, fork-tailed, humming bird of Dicruridae family; a drongo."]}], "ಕಾಜಿ": [{"type": "noun", "defs": ["a Muhammadan priest.", "a Muhammadan judge or a law officer; a cadi."]}], "ಕಾಜಿನ್ಯಾಯ": [{"type": "noun", "defs": ["arbitration by settling the differences by concession from both the parties involved, the process of which need not be bound by or as per the rules."]}], "ಕಾಜಿವಾರ": [{"type": "noun", "defs": ["= ಕಾಜವಾರ."]}], "ಕಾಜಿವಾಳ": [{"type": "noun", "defs": ["= ಕಾಜವಾರ."]}], "ಕಾಜು": [{"type": "noun", "defs": ["a hard, amorphous, brittle, usu. transparent, substance, a bad conductor of electricity, made of the oxides of silicon; glass.", "a pair of framed lenses with side pieces to grip the temple, used for better vision; a spectacle.", "the refracting structure between the crystalline and vitreous humours of the eye; the lense.", "(dial.) a glass bangle."]}, {"type": "noun", "defs": ["the tree Anacardium occidentale of Anacardiaceae family; cashew nut tree."]}], "ಕಾಜುವೀೞ್": [{"type": "verb", "defs": ["to flow out as melted frit."]}], "ಕಾಟ": [{"type": "noun", "defs": ["the act or an instance of annoying; annoyance; a troubling or trouble; vexation.", "ಕಾಟಕೊಡು kāṭa koḍu to annoy; to trouble; to pester; to vex; ಕಾಟ ಹಾಕು kāṭa hāku to force or constrain, to do or restrain from from doing something; to compel."]}, {"type": "noun", "defs": ["an inhabitant of a forest; a forester.", "a man who lives by hunting; a hunter.", "a minor deity."]}, {"type": "noun", "defs": ["strong, pungent and stifling smell as of red chilly, tobacco, etc."]}, {"type": "adverb", "defs": ["immediately; without delay."]}, {"type": "noun", "defs": ["the garden lizard,with an angular head, prehensile tail, eyes that move independently of each other, and a long, agile tongue for catching prey, known for its changing colour; a chameleon."]}], "ಕಾಟಕ": [{"type": "noun", "defs": ["= ಕಾಟ1 (?)."]}, {"type": "noun", "defs": ["a man who annoys, inflicts troubles; a harasser."]}, {"type": "noun", "defs": ["= ಕಾಟ2 - 2."]}], "ಕಾಟಕತನ": [{"type": "noun", "defs": ["the inclinaion of mind to harm or harass others; the act of troubling another or others."]}], "ಕಾಟಕಸರು": [{"type": "noun", "defs": ["the act of preventing or avoiding of spending; a cut in expenditure."]}], "ಕಾಟಕಾಯ": [{"type": "noun", "defs": ["= ಕಾಟಕಾಯಿ."]}], "ಕಾಟಕಾಯಿ": [{"type": "noun", "defs": ["a carrying off the goods, valuables by force; plundering; looting; pillage."]}], "ಕಾಟಕಿ": [{"type": "noun", "defs": ["a woman who annoys; a female harasser."]}], "ಕಾಟಕುಳಿ": [{"type": "noun", "defs": ["one whose disposition is to vex others; a harasser."]}], "ಕಾಟಕೋಣ": [{"type": "noun", "defs": ["= ಕಾಟಕೋನ."]}], "ಕಾಟಕೋನ": [{"type": "noun", "defs": ["an angle of 90 degrees; angle made by the meeting of two straight lines perpendicular to each other; a right angle.", "an 'L\"-shaped metal angle used by masons."]}], "ಕಾಟಗಾಯಿ": [{"type": "noun", "defs": ["= ಕಾಟಕಾಯಿ."]}], "ಕಾಟಣ್ಣ": [{"type": "noun", "defs": ["a deity worshipped by the hunters in the forest."]}], "ಕಾಟನಾಯಕ": [{"type": "noun", "defs": ["the chief of hunters."]}], "ಕಾಟಮ": [{"type": "noun", "defs": ["a deity worshipped by tribal herdsman."]}], "ಕಾಟರ": [{"type": "noun", "defs": ["a seat for a rider on a horse, usu. padded and of leather, and generally straddled in riding; a saddle."]}], "ಕಾಟಾ": [{"type": "noun", "defs": ["(dial.) an instrument for weighing; a balance."]}], "ಕಾಟಾಚಾರ": [{"type": "noun", "defs": ["perfunctoriness - a. a work, observance done for the sake of complying with a regulation or rule, but not sincerely; b) careless manner of performance."]}], "ಕಾಟಿ": [{"type": "noun", "defs": ["a thin food made by cooking the flour of jowar, rāgi, etc.in water; gruel."]}, {"type": "noun", "defs": ["an old coin of small denomination."]}, {"type": "noun", "defs": ["a wild buffalo, Bos gaurus; a bison."]}, {"type": "noun", "defs": ["name of a minor deity."]}, {"type": "noun", "defs": ["the decorative line running parallel to the hem of a cloth (as of a sārī, dhōti, etc.).", "(dial.) the structure, constitution, strength, form or appearance of the body; physique."]}], "ಕಾಟಿಕೆ": [{"type": "noun", "defs": ["any medicated black preparation for the eyes; a black-eyewash; collyrium."]}], "ಕಾಟಿಗ": [{"type": "noun", "defs": ["= ಕಾಟಿ2."]}], "ಕಾಟಿಗದ್ಯಾಣ": [{"type": "noun", "defs": ["= ಕಾಟಿ2."]}], "ಕಾಟಿಮ": [{"type": "noun", "defs": ["a minor deity."]}], "ಕಾಟಿಮೆ": [{"type": "noun", "defs": ["= ಕಾಟಿಮ."]}], "ಕಾಟು": [{"type": "noun", "defs": ["a large tract of land covered with trees and underbush; a forest; woodland."]}, {"type": "adjective", "defs": ["roaming with no fixed purpose or special plan.", "inclined to trouble, disturb another or others."]}, {"type": "noun", "defs": ["a grasp or cut by the teeth.", "a mark, wound, bruise or sting from biting; a bite; a puncture by an insect.", "a dent made with a sharp weapon (as an axe, sickle, etc.).", "that part of a scorpion which pierces and injects poison; the sting."]}, {"type": "noun", "defs": ["a 'X' mark used to denote that a particular word, sentence or portion of a written passage is deleted, cancelled or disapproved.", "ಕಾಟು ಹಾಕು kāṭu hāku to delete or cancel (written or printed matter) with or as with an 'X' mark; ಕಾಟುಗೀಟು kāṭugīṭu = ಕಾಟು4."]}], "ಕಾಟುಗ": [{"type": "noun", "defs": ["he who annoys, troubles, agitates or pesters another or others; an annoyer; a trouble-maker."]}], "ಕಾಟುದನ": [{"type": "noun", "defs": ["domestic cattle wandering freely in farms eating away the crops stealthily; stray cattle."]}], "ಕಾಟುನಾಯಿ": [{"type": "noun", "defs": ["a dog, usu. having no master, wandering freely in the town; a street dog."]}], "ಕಾಟೆ": [{"type": "noun", "defs": ["= ಕಾಟಿ1; 2) any fermented liquor."]}], "ಕಾಟ್ಟೇರಿ": [{"type": "noun", "defs": ["name of a secondary divinity ranking between the gods and men believed to create and guard against annoyance."]}], "ಕಾಠಾರಿ": [{"type": "noun", "defs": ["a weapon with a short, pointed blade, used for stabbing; a dagger."]}], "ಕಾಠಿ": [{"type": "noun", "defs": ["a long, slender piece of wood for walking with or beating; a stick.", "an informal unit for measuring the area of a bounded region or a plane.", "a stick, graduated or not, used in measuring the land-area."]}], "ಕಾಠಿಣ್ಯ": [{"type": "noun", "defs": ["= ಕಾಠಿನ್ಯ."]}], "ಕಾಠಿನ್ಯ": [{"type": "noun", "defs": ["the quality of being hard, rough or coarse; harshness; roughness.", "the quality or fact of being unpleasantly crude, offensive to the mind or feelings of excessively severe; crudeness; severity.", "the quality or state of being void of pity; cruelness.", "the quality of being not easy to understand, perform or deal with; the condition or fact of being difficult; difficulty.", "the power of, and resistance to hardships in life.", "(min./geol.) power of, and resistance to scratching; hardness."]}], "ಕಾಡ": [{"type": "noun", "defs": ["a man dwelling in a forest; a forest-dweller.", "an unrefined, uncultured or uncivilised man."]}, {"type": "noun", "defs": ["the colour of charcoal; black colour."]}], "ಕಾಡಅಶ್ವತ್ಥ": [{"type": "noun", "defs": ["the tree Urostigma arnothianum.", "the tree Fiucus rumphii of moraceae family.", "the tree Ficus Arnottiana of Moraceae family.", "the tree Rejoua dichotoma of Apocynaceae family."]}], "ಕಾಡಂಚೆ": [{"type": "noun", "defs": ["the climber Wagatea spicata of Caesalpiniaceae family."]}], "ಕಾಡಕಕ್ಕೊರಲೆ": [{"type": "noun", "defs": ["the wild black basil akin to Ocimum sanctum."]}], "ಕಾಡಕಗ್ಗೊರಲೆ": [{"type": "noun", "defs": ["= ಕಾಡಕಕ್ಕೊರಲೆ."]}], "ಕಾಡಕಚೋರ": [{"type": "noun", "defs": ["the wild plant of Zingiberaceae family akin to Curcuma zeodarina."]}], "ಕಾಡಕಠಾರಿ": [{"type": "noun", "defs": ["the shrub Capparis sepiaria (= C. grandiflora) of Capparaceae family; caper shrub."]}], "ಕಾಡಕಡನೆÀ": [{"type": "noun", "defs": ["the plant Solanum stramoniaefolium of Solanaceae family.", "its fruit."]}], "ಕಾಡಕತ್ತರಿ": [{"type": "noun", "defs": ["= ಕಾಡಕಠಾರಿ."]}], "ಕಾಡಕದಳಿ": [{"type": "noun", "defs": ["the plant Musa superba of Musceae family; wild plantain.", "its fruit.", "the tree Anthocephalus indicus (= A. Cadamba) of Rubiaceae family."]}], "ಕಾಡಕಬ್ಬು": [{"type": "noun", "defs": ["The grass Saccharum spontaneum of Poaceae family; thatch grass, used for mats, roofs, etc."]}], "ಕಾಡಕಲ್ನಾರು": [{"type": "noun", "defs": ["the shrub or small sized tree Helicteres isora of Sterculiaceae family; East Indian screw pine."]}], "ಕಾಡಕಲ್ಲಟ್ಟಿ": [{"type": "noun", "defs": ["the plant Solanum torvum of Solanaceae family.", "its fruit."]}], "ಕಾಡಕವಟೆ": [{"type": "noun", "defs": ["= ಕಾಡಕವಡೆ."]}], "ಕಾಡಕವಡೆ": [{"type": "noun", "defs": ["the perennial vine Citrullus colocynthus (= Cucumis colocynthis) of Cucurbitaceae family; colocynth."]}], "ಕಾಡಕವಿಲೆ": [{"type": "noun", "defs": ["a wild, undomesticated cow."]}], "ಕಾಡಕಹಿನುಗ್ಗೆ": [{"type": "noun", "defs": ["the plant 100."]}], "ಕಾಡಕಳ್ಳ": [{"type": "noun", "defs": ["(masc.) an individual or one of a gang of robbers in forest or deserted places."]}], "ಕಾಡಕಳ್ಳಿ": [{"type": "noun", "defs": ["a variety in Euphorbia plants with milky juice and minute, simplified flowers borne in cuplike inflorescences, growing in forests and semi-forests."]}], "ಕಾಡಕಾಗೆ": [{"type": "noun", "defs": ["any of various large crows; esp., the largest crow (Corvus corax), with a straight, sharp beak; a raven."]}], "ಕಾಡಕಾಸಿ ಕಣಿಗಲು": [{"type": "noun", "defs": ["the plant Thevetia peruviana (= T.neriifolia) of Apocynaceae family; exile oleander."]}], "ಕಾಡಕಿರಿಯಹುರುಳಿ": [{"type": "noun", "defs": ["the annual plant Dolichos falcatus of Papilionaceae family; wild-horsegram.", "the annual plant Desmodium motorium (= D. gyrans) of the same family.", "the plant Mundulia sericea (= M suberosa) of the same family."]}], "ಕಾಡಕುಸುಬಿ": [{"type": "noun", "defs": ["= ಕಾಡಕುಸುಬೆ."]}], "ಕಾಡಕುಸುಬೆ": [{"type": "noun", "defs": ["the plant Tricholepis amplexicaulis of Asteraceae family."]}], "ಕಾಡಕೆಸು": [{"type": "noun", "defs": ["the large, tropical, wild plant Colocasia nymphaefolia, of Araceae family."]}], "ಕಾಡಕೊಂಡೆಮರ": [{"type": "noun", "defs": ["the tree, small in size, Pithecellobium bigeminum of Mimosaceae family."]}], "ಕಾಡಕೊಂದೆಮರ": [{"type": "noun", "defs": ["= ಕಾಡಕೊಂಡೆಮರ."]}], "ಕಾಡಖಚೋರ": [{"type": "noun", "defs": ["= ಕಾಡಕಚೋರ."]}], "ಕಾಡಗರ್ಗರಿ": [{"type": "noun", "defs": ["the tree Cluytia collina."]}], "ಕಾಡಗಸೆ": [{"type": "noun", "defs": ["the main entrance of a forest."]}, {"type": "noun", "defs": ["the plant Linum mysorense of Linaceae family."]}], "ಕಾಡಗುರಿಯೆಳ್ಳು": [{"type": "noun", "defs": ["a comon weed, Blainvillia latifolia."]}], "ಕಾಡಗೆ": [{"type": "noun", "defs": ["fine soot produced by the incomplete combustion of oils and other forms of carbon; lampblack.", "a medicated eye-wash; collyrium.", "anything that is black.", "the black earth; a black soil region."]}], "ಕಾಡಗೊರವಿ": [{"type": "noun", "defs": ["the tree Ixora arborea (= I. Parviflora) of Rubiaceae family; jungle geranium."]}], "ಕಾಡಗೋಳಿ": [{"type": "noun", "defs": ["the plant Gloriosa superba of Liliaceae family."]}], "ಕಾಡಗೌಟೆ": [{"type": "noun", "defs": ["= ಕಾಡಕವಡೆ."]}], "ಕಾಡಚಕ್ಕವತ್ತ": [{"type": "noun", "defs": ["a variety of the Atriplex genus of plants; wild orache."]}], "ಕಾಡಚೆಂಬೆ": [{"type": "noun", "defs": ["a kind of plant ."]}], "ಕಾಡಜರುಚು": [{"type": "noun", "defs": ["vain talk; mere loquaiousness; useless talkativeness; empty and senseless talk."]}], "ಕಾಡಜೀರಿಗೆ": [{"type": "noun", "defs": ["the plant Centrantherum anthelmenticum (= Vernonia anthelmentica) of Asteraceae family; wild cumin."]}], "ಕಾಡಟ್ಟು": [{"type": "verb", "defs": ["to drive out of sight; to cause to run astray; to make one lost oneself."]}], "ಕಾಡಡವಿ": [{"type": "noun", "defs": ["a very thick, dense forest."]}], "ಕಾಡಡಿಕೆ": [{"type": "noun", "defs": ["the palm tree Pinanga dicksonii (= Areca dicksonii) of Arecaceae family; cane betel palm."]}], "ಕಾಡಣಿ": [{"type": "noun", "defs": ["a rope for tying the legs of a horse.", "a rope in gen."]}], "ಕಾಡಣೆ": [{"type": "noun", "defs": ["= ಕಾಡಣಿ."]}], "ಕಾಡತುಂಬೆ": [{"type": "noun", "defs": ["the plant Leonotis nepetaefolia of Lamiaceae family.", "the plant Ipomoea coccinea of Convolvulaceae family."]}], "ಕಾಡತುರುವೆ": [{"type": "noun", "defs": ["the plant Azanza lampas (= Thespesia lampas) of Malvaceae family; (?)."]}], "ಕಾಡತುಸ": [{"type": "noun", "defs": ["= ಕಾಡತೂಸು."]}], "ಕಾಡತುಳಸಿ": [{"type": "noun", "defs": ["a variety in basil of Laminaceae family; wild basil."]}], "ಕಾಡತೂಸು": [{"type": "noun", "defs": ["a case containing the charge for a gun; a cartridge."]}], "ಕಾಡತೆ": [{"type": "noun", "defs": ["the vine Cardiospermum halicacabum of Sapindaceaefamily; baloon vine."]}], "ಕಾಡತೊಳಸಿ": [{"type": "noun", "defs": ["= ಕಾಡತುಳಸಿ."]}], "ಕಾಡತ್ತಿ": [{"type": "noun", "defs": ["the tree Ficus hispida(= F. oppositifolia) of Moraceae family; crow fig.", "a shrub Bauhinia tomentosa of Caesalpiniaceae family."]}], "ಕಾಡದಟು": [{"type": "noun", "defs": ["impetuous valour or bravery; crude intrepidity."]}], "ಕಾಡದೇವದಾರು": [{"type": "noun", "defs": ["a tree of Coniferae family; wild Deodar."]}], "ಕಾಡದೊಂಡೆ": [{"type": "noun", "defs": ["a creeper of Solanaceae family."]}], "ಕಾಡನರವಲು": [{"type": "noun", "defs": ["a garden weed, Turneraulmifolia."]}], "ಕಾಡನಿಂಬೆ": [{"type": "noun", "defs": ["the plant Atalantia monophylla (= Limonia monophylle) of Rutaceae family.", "its fruit; wild lime."]}], "ಕಾಡನೊಣ": [{"type": "noun", "defs": ["a blood-sucking fly that distresses cattle; gadfly."]}], "ಕಾಡನೊಳ": [{"type": "noun", "defs": ["= ಕಾಡನೊಣ."]}], "ಕಾಡಪಾಪ": [{"type": "noun", "defs": ["various small, slow-moving, large-eyed Asiatic prosimian primates, Loris tardigradus (= L. lydekkeriana) of Lorisidae family, that live in trees and are active at night; loris."]}], "ಕಾಡಪಾಪಟೆ": [{"type": "noun", "defs": ["the perennial vine Citrullus colocynthus (= Cucumis colocynthis) of Cucurbitaceae family; colocynth."]}], "ಕಾಡಪಾಪರೆ": [{"type": "noun", "defs": ["= ಕಾಡಪಾಪಟೆ."]}], "ಕಾಡಪಾವಟೆ": [{"type": "noun", "defs": ["the creeper Mukia scabrella (= Bryonia scabrella) of Cucurbitaceqe family.", "the creeper Mukia maderaspatana (= Melothria maderaspatana) of Cucurbitaceae family."]}], "ಕಾಡಪೆಸಱು": [{"type": "noun", "defs": ["the creeper Phaseolus adenanthus of Papilionaceae family."]}], "ಕಾಡಬಗಲೆ": [{"type": "noun", "defs": ["a plant of Combretaceae family, akin to Calycopteris floribunda."]}], "ಕಾಡಬಗುಲಿ": [{"type": "noun", "defs": ["= ಕಾಡಬಗಲೆ."]}], "ಕಾಡಬಜ": [{"type": "noun", "defs": ["the nettle tree Sponia andaresa."]}], "ಕಾಡಬಜೆ": [{"type": "noun", "defs": ["the tree Trema orientalis (= Celtis orientalis) of Ulmaceae family."]}], "ಕಾಡಬಸಲೆ": [{"type": "noun", "defs": ["the plant Kalanchoe pinnata (= Bryophyllum calycinum, = B. pinnatum) of Crassulaceae family."]}], "ಕಾಡಬಾಳೆ": [{"type": "noun", "defs": ["the plant Musa superba of Musceae family; wild plantain.", "the tree Anthocephalus indicus (= A. Cadamba) of Rubiaceae family."]}], "ಕಾಡಬೆಳಸು": [{"type": "noun", "defs": ["a kind of plant."]}], "ಕಾಡಬೇಲ": [{"type": "noun", "defs": ["the tree Feronia limonia (= F. elephantum) of Rutaceae family.", "its fruit."]}], "ಕಾಡಮಟೆ": [{"type": "noun", "defs": ["the tree Schinus molle of Anacardiaceae family; bastard pepper.", "the tree Spondias pinnata (= S. mongifera) of Anacardiaceae family.", "its plum; wild hog plum.", "the plant Garuga pinnata of Burseraceae family."]}], "ಕಾಡಮರ": [{"type": "noun", "defs": ["any forest tree."]}], "ಕಾಡಮಲ್ಲಿಗೆ": [{"type": "noun", "defs": ["the creeper Jasminum angustifolia of Oleaceae family; wild jasmine.", "the creeper Jasminum rigidum of Oleaceae family.", "the tree Murraya paniculata (= Chalcas paniculata) of Rutaceae family.", "(fig.) a person whose merit is not noticed or recognised."]}], "ಕಾಡಮಾಗಳಿ": [{"type": "noun", "defs": ["a plant of Lamiaceae family, akin to Coleus forskohlii; wild pickle root."]}], "ಕಾಡಮಾದಲ": [{"type": "noun", "defs": ["a tree of Rutaceae family; wild citron tree."]}], "ಕಾಡಮಿಕ": [{"type": "noun", "defs": ["a wild swine, Sus scrofa; a wild boar; a wild hog."]}], "ಕಾಡರಸ": [{"type": "noun", "defs": ["the tree Ficus arnottiana of Moraceae family; wild peepul."]}], "ಕಾಡರಸಿನ": [{"type": "noun", "defs": ["the plant Curcuma aromatica of Zingiberaceae family.", "its fragrant root; wild ginger."]}], "ಕಾಡರಳಿ": [{"type": "noun", "defs": ["the tree Urostigma arnothianum.", "the tree Fiucus rumphii of Moraceae family.", "the tree Ficus Arnottiana of the same family family.", "the tree Rejoua dichotoma of Apocynaceae family."]}], "ಕಾಡರಳೆ": [{"type": "noun", "defs": ["the wild cotton shrub.", "its coton."]}], "ಕಾಡರುಮಲ್ಲಿಗೆ": [{"type": "noun", "defs": ["the plant Jasminum auriculatum of Oleaceae family.", "its flower."]}], "ಕಾಡಲಿಂಬೆ": [{"type": "noun", "defs": ["the plant Atlantia monophylla (= Limonia monophylla) of Rutaceae family.", "its fruit; wild lime."]}], "ಕಾಡಲಿಟ್ಟಿ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಕಾಡಲ್ಲ": [{"type": "noun", "defs": ["the plant Zingibe zerumbet of Zingiberaceae family.", "its rhizome; wild ginger."]}], "ಕಾಡವದವರ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಕಾಡವರೆ": [{"type": "noun", "defs": ["the plant Mucuna prurita (=M. puriens) of Papilionaceae family.", "its bean; cat bean; flea plant.", "the vine Glycine javanica of Papilionaceae family.", "its bean."]}], "ಕಾಡವಿಟ್ಟಿ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಕಾಡವೆ": [{"type": "noun", "defs": ["(dial.) a large deer (Cervus unicolor) with coarse hair, a short, erectile mane, and three-pointed antlers; an Indian sambar."]}], "ಕಾಡವೋಮ": [{"type": "noun", "defs": ["the plant Chenopodium ambrosioides of Chenopodiaceae family.", "its seed.", "the plant Pimpinella monoica of Apiaceae family."]}], "ಕಾಡಶಹ": [{"type": "noun", "defs": ["(a term at chess) a check by withdrawing one's pawn.", "(fig.) a counter attack."]}], "ಕಾಡಸಂಪಗೆ": [{"type": "noun", "defs": ["the tree Plumeria rubra (= P. acuminata, = P. acutifolia) of Apocynaceae family.", "its large, fragrant flowers."]}], "ಕಾಡಸಬ್ಬಸಿಗೆ": [{"type": "noun", "defs": ["the plant Fumaria indica (= F. parviflora) of Fumariaceae family, with watery juice and spurred flowers, formerly used in medicine; fumitory."]}], "ಕಾಡಸಬ್ಬಸೀಗೆ": [{"type": "noun", "defs": ["= ಕಾಡಸಬ್ಬಸಿಗೆ."]}], "ಕಾಡಸಾವೆ": [{"type": "noun", "defs": ["the grass Panicum trypheron of Poaceae family."]}], "ಕಾಡಸಿಂಬೆ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಕಾಡಸಿವಕಳ್ಳಿ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಕಾಡಸೂರಣ": [{"type": "noun", "defs": ["the plant Tacca pinnatifida of Taccaceae family.", "its rhizome; East Indian arrow root.", "the plant Amorphophallus dubius of araceae family.", "its large tuberous root."]}], "ಕಾಡಸೌತೆ": [{"type": "noun", "defs": ["a variety of cucumber plant.", "its fruit; wild cucumber."]}], "ಕಾಡಹರಳು": [{"type": "noun", "defs": ["the plant Baliospermum montanum (= Croton polyandrus) of Euphorbiaceae family.", "its seed; wild castor.", "a hedge-shrub Jatropha curcas of Euphorbiaceae family."]}], "ಕಾಡಹಾಕುಕಾರೆ": [{"type": "noun", "defs": ["the plant Toddalia asiatica (= T. aculeata) of Rutaceae family; wild orange."]}], "ಕಾಡಹಾಗಲ": [{"type": "noun", "defs": ["a vine of Cucurbitaceae family, akin to bitter gourd.", "its gourd; wild bitter gourd."]}]}