{"ಸಾರಥಿ": [{"type": "noun", "defs": ["the driver of a chariot; a charioteer.", "(fig.) one who controls or leads an organisation, government, etc.; a helmsman."]}], "ಸಾರಥಿತನ": [{"type": "noun", "defs": ["= ಸಾರಥ್ಯ."]}], "ಸಾರಥ್ಯ": [{"type": "noun", "defs": ["the act, duty, quality of a charioteer.", "(fig.) the office, quality of a person who leads or controlsan organisation, government, etc."]}], "ಸಾರದ": [{"type": "noun", "defs": ["the quality of being bashful, shy or reserved.", "the quality of being pure, holy or sacred; sacredness; holiness."]}], "ಸಾರದಾರು": [{"type": "noun", "defs": ["a strong, robust length of wood (as the one used in building); a beam."]}], "ಸಾರದೆ": [{"type": "noun", "defs": ["(correctly, ಸಾರದೆ) Sarasvati, the Goddess of Learning, Knowledge and Speech."]}], "ಸಾರಧಾತುಜ್ಞ": [{"type": "noun", "defs": ["an expert in testing of valuable metals as gold, silver, etc."]}], "ಸಾರಭೂತ": [{"type": "noun", "defs": ["of or constituting the intrinsic, fundamental nature of something; basic; essential.", "absolutely necessary; indispensable; requisite; essential."]}, {"type": "noun", "defs": ["an excellent man; a man outstandingly good in any field."]}], "ಸಾರಮತಿ": [{"type": "noun", "defs": ["(mus.) in Karnāṭaka system, a rāga (a musical mode) derived from the main mode Naṭhabhairavi."]}], "ಸಾರಮಾರಿ": [{"type": "noun", "defs": ["(hist.) a kind of missile used to destroy sāra, a ladder-like device used by enemies in climbing up the forts."]}], "ಸಾರಮೇಯ": [{"type": "noun", "defs": ["a dog.", "the encountering of danger; marked bravery; adventure."]}], "ಸಾರರಸ": [{"type": "noun", "defs": ["any of the liquids considered as sacred, as milk, ghee, honey, curd, etc."]}], "ಸಾರಲ": [{"type": "noun", "defs": ["the tree Bauhinia variegata of Caesalpiniaceae family."]}], "ಸಾರವಣೆ": [{"type": "noun", "defs": ["a washing of the floor with this or with cow-dung.", "a plastering of a wall."]}], "ಸಾರವತಿ": [{"type": "noun", "defs": ["the plant Cordia macleodii of Boraginaceae family; (?)."]}], "ಸಾರವತ್ತು": [{"type": "adjective", "defs": ["substantial; nourishing (as food).", "valuable; precious.", "having pith or sap."]}], "ಸಾರವಸ್ತು": [{"type": "noun", "defs": ["a valuable, precious thing."]}], "ಸಾರವಾನ": [{"type": "noun", "defs": ["a man who rides a camel."]}], "ಸಾರವೆ": [{"type": "noun", "defs": ["a wooden structure built over a strean, small river, etc. for crossing over from one side to another; a wooden bridge.", "a flight of stairs made of wood (for temporary purpose as in building construction)."]}], "ಸಾರಸ": [{"type": "adjective", "defs": ["relating, belonging to, living in or coming from a pond or lake."]}, {"type": "noun", "defs": ["a pond or lake.", "the Indian crane Ardea sibirica.", "any of several large, stately aquatic birds of the subfamily Anserinae, having a long, graceful, slender neck and pure-white plumage and known as graceful swimmers and high-altitude fliers; a swan.", "any of several lotus plants.", "its flower.", "the plant Pterospermum acerifolium ( = P. aceroides) of Sterculiaceae family.", "a kind of tree.", "a hill or mountain.", "nearness; proximity.", "a man having a bad disposition; an ill-natured man.", "the moon."]}], "ಸಾರಸಂಗ್ರಹ": [{"type": "noun", "defs": ["the main or essential part of a literary work, speech, etc.; gist."]}], "ಸಾರಸಂಗ್ರಹಿ": [{"type": "noun", "defs": ["a man who takes out the main or essential part from a book, speech, etc."]}], "ಸಾರಸತ್ವ": [{"type": "noun", "defs": ["the quality such as extraordinary strength, mettle or fortitude.", "a man having any of these qualities."]}], "ಸಾರಸನ": [{"type": "noun", "defs": ["an encircling band of metal, esp. of gold or silver, for a woman's waist; a girdle."]}], "ಸಾರಸರ್ವಸ್ವ": [{"type": "noun", "defs": ["the gist of anything.", "(fig.) the essential part of something."]}], "ಸಾರಸವಕ್ಕಿ": [{"type": "noun", "defs": ["= ಸಾರಸ2 - 2 & 3."]}], "ಸಾರಸಿ": [{"type": "noun", "defs": ["a female of Indian crane (Ardea sibirica).", "a female any of several kinds of swan."]}], "ಸಾರಸೆ": [{"type": "noun", "defs": ["= ಸಾರಸಿ.", "Sarasvati, the Goddess of Learning, Knowledge and Speech, whose vehicle is a swan."]}], "ಸಾರಸೋದ್ಭವ": [{"type": "noun", "defs": ["Brahma, the lotus-born deity."]}], "ಸಾರಸ್ವತ": [{"type": "adjective", "defs": ["of, relating to, endowed by Sarasvati, the Goddess of Learning, Knowledge and Speech.", "concerned with knowledge, learning or speech."]}, {"type": "noun", "defs": ["the systematised knowledge of a learned person, exhibiting accuracy, critical ability, and thoroughness; erudition; scholarship.", "the celebrated river in the Punjab region of North-West India, (now dried completely, but believed to be flowing underground) on the bank of which the Vedic culture of Sanātana Dharma developed; the region on the banks of this river.", "a clan of brāhmaṇa originally belonged to this region, now settled in the coastal districts of Karnāṭaka.", "a scholarly work (as of a scholar, researcher, etc.).", "a learned person; a scholar.", "any vernacular dialect cognate with Samskřta (any of the four main dialects viz. Śaurasēni, Mahāraṣṭri, Apabhramśa and Paiśaci).", "(jain.) a class of jaina gods.", "a god of this class."]}], "ಸಾರಸ್ವತಗುಣ": [{"type": "noun", "defs": ["= ಸಾರಸ್ವತ2 - 1."]}], "ಸಾರಸ್ವತಲೋಕ": [{"type": "noun", "defs": ["the scholars or the knowledge attained by scholars, collectively."]}], "ಸಾರಸ್ವತಸ್ಫುರಿತ": [{"type": "adjective", "defs": ["developed on one's own; attained scholarship with one's own inherent knowledge-abilities."]}], "ಸಾರಹೃದಯ": [{"type": "adjective", "defs": ["feeling or showing compassion; sympathising deeply; compassionate; humane; sympathetic."]}, {"type": "noun", "defs": ["a man inclined to pity or mercy; a compassionate, sympathetic man."]}], "ಸಾರಹೃದಯೆ": [{"type": "noun", "defs": ["a woman inclined to pity or mercy; a compassionate, sympathetic woman."]}], "ಸಾರಳಿ": [{"type": "noun", "defs": ["= ಸಾರವಣೆ."]}], "ಸಾರಳ್ಯ": [{"type": "noun", "defs": ["the quality or condition of being straight; straightness.", "absence of crookedness or deceiving nature; straightforwardness; sincerity; uprightness.", "the quality or fact of being not ornate, unornamented.", "the quality of being not luxurious; plainness; simplicity.", "the quality of not spending extravagantly; simple life style; simplicity.", "the fact of being not showy, flashy; simpleness.", "the quality of being easy to do, understand, manage or solve."]}], "ಸಾರಾ": [{"type": "noun", "defs": ["whole; entire; complete."]}], "ಸಾರಾಂಶ": [{"type": "noun", "defs": ["the important or essential part; essence; core; heart.", "a condensed account, esp. of a literary work, containing only the essential idea or substance."]}], "ಸಾರಾಯ": [{"type": "noun", "defs": ["= ಸಾರಾಯಿ."]}, {"type": "adjective", "defs": ["substantial; nourishing (as food).", "valuable; precious.", "having pith or sap; pithy."]}, {"type": "noun", "defs": ["the true strength, 2) being; existence; entity.", "the essence or pith of things.", "the true essence, nature or disposition of a thing or person.", "spiritual knowledge.", "a man having true spiritual knwledge."]}], "ಸಾರಾಯಗುಡುಹಿ": [{"type": "noun", "defs": ["a man who drinks alcoholic liquor as a matter of habit or to excess; a habitual drunkard."]}], "ಸಾರಾಯಪದ": [{"type": "noun", "defs": ["the final stage for a being, which the individual soul becomes one withthe Supreme soul; Final Emancipation; Beautitude."]}], "ಸಾರಾಯಮತಿ": [{"type": "noun", "defs": ["= ಸಾರಾಯ3 - 5 & 6."]}], "ಸಾರಾಯಿ": [{"type": "noun", "defs": ["a strong alcoholic drink distilled from rice, molasses, coconut milk or made from the sap of certain palm trees."]}], "ಸಾರಾಯಿಬೇಲ": [{"type": "noun", "defs": ["the medium sized, acacia tree Acacia leucophloea of Mimosae family the bark of which is used in preparing certain alcoholic drinks."]}], "ಸಾರಾಯ್ಗೆ": [{"type": "noun", "defs": ["the quality of being excellent; excellence."]}], "ಸಾರಾಲಂಕಾರ": [{"type": "noun", "defs": ["(rhet.) a kind of figure of speach in which, by comparison one thing, person is placed superior to another."]}], "ಸಾರಾಸಾರ": [{"type": "noun", "defs": ["(pl.) essential and unnecessary or irrelevant things.", "(pl.) strength and weakness.", "(pl.) favourable and unfavourable effects (of something)."]}], "ಸಾರಿ": [{"type": "noun", "defs": ["a time or opportunity for action which comes in due rotation or order to each of a number of persons, animals, etc.; a time; a turn."]}, {"type": "noun", "defs": ["a garment worn by Indian women, consisting of a long piece of cotton or silk wrapped around the body with one end draped over the head or over one shoulder; sari."]}, {"type": "noun", "defs": ["(dance.) any of several movements on the floor ( as with the feet) or in air (as of hands) in dancing."]}, {"type": "noun", "defs": ["a pavilion or seat fixed on an elephant's back; a howdah."]}, {"type": "noun", "defs": ["a pawn used in the game of dice.", "a pawn used in the game of chess."]}, {"type": "noun", "defs": ["the act of riding an animal.", "a wandering or touring; a trip.", "a respectful mode of addressing.", "a respectful mode of addressing a person's coming.", "a number of persons or things moving forward in an orderly, formal way; a procession.", "an arch-shaped shelter fitted on to bullock carts."]}], "ಸಾರಿಕೆ": [{"type": "noun", "defs": ["a female parrot."]}], "ಸಾರಿಗೆ": [{"type": "noun", "defs": ["nearness; proximity; closeness; vicinity.", "a transacting or being transacted; transaction.", "income; earnings.", "the act of conveying, transporting; transportation; conveyance.", "a system of conveying; the transport system.", "a means of conveying; a vehicle.", "the act of riding an animal.", "a kind of tax."]}, {"type": "noun", "defs": ["= ಸಾರಿ1."]}, {"type": "noun", "defs": ["a kind of bird.", "a female parrot."]}], "ಸಾರಿಗೆದೇರ": [{"type": "noun", "defs": ["Manmatha, the Love-God, whose vehicle is a parrot."]}], "ಸಾರಿಗೆಸಂಸ್ಥೆ": [{"type": "noun", "defs": ["a company organisation, esp. a corporation of the state, that is in charge of general surface-conveyance; a transportation company."]}], "ಸಾರಿಗೊಳಿಸು": [{"type": "verb", "defs": ["to keep ready a vehicle for transportation purpose."]}], "ಸಾರಿಡು": [{"type": "verb", "defs": ["to mix, cause to mingle two or more things together; to blend."]}], "ಸಾರಿಣಿ": [{"type": "noun", "defs": ["a water passage.", "a stream or river."]}, {"type": "noun", "defs": ["the one-humped camel, Camelus dromedarius."]}], "ಸಾರಿಣಿಸವಾರ": [{"type": "noun", "defs": ["a man who rides a camel."]}], "ಸಾರಿತ": [{"type": "noun", "defs": ["a particular posture in coition, in which the woman puts her legs on the shoulders of the man."]}], "ಸಾರಿರ": [{"type": "adjective", "defs": ["= ಸಾರೀರ1."]}, {"type": "noun", "defs": ["= ಸಾರೀರ2."]}], "ಸಾರಿವೆ": [{"type": "noun", "defs": ["the creeper Ichnocarpus frutescens of Apocynaceae family."]}], "ಸಾರಿಸು": [{"type": "verb", "defs": ["to cause to announce something in public."]}, {"type": "verb", "defs": ["to wash the floor with the perfume 'ಸಾರಣೆ' or with cow-dung.", "to annoint perfume, oil, ointment, etc. to another's body.", "to get one's body anointed with any of these.", "to unfold (a roll) and spread over a flat area.", "to clear off an area completely for purpose of cleaning.", "to destroy, demolish or eradicate."]}], "ಸಾರೀರ": [{"type": "adjective", "defs": ["(correctly, ಶಾರೀರ) 1. of, in, by or to the body; bodily.", "having a body; corporeal."]}, {"type": "noun", "defs": ["(correctly, ಶಾರೀರ) 1. anything concerning, relating to, produced by, the body.", "the musical quality of one's voice (esp. of a singer)."]}], "ಸಾರು": [{"type": "verb", "defs": ["to come or go near; to approach.", "to be near.", "to go as far as; to reach.", "to move slowly towards or from.", "to go forward or away.", "to mix, mingle or join oneself with another or others.", "to be got, received, occured.", "to get, receive.", "to depend on or take refuge under.", "to go out of sight; to disappear."]}, {"type": "verb", "defs": ["to announce, proclaim something as to make it known widely.", "to specially emphasise something while telling or talking."]}, {"type": "noun", "defs": ["a kind of liquid food made using dhal, spices, etc. for mixing it with rice."]}, {"type": "noun", "defs": ["a wooden structure built over a stream, small river, etc. for crossing over from one side to another; a wooden bridge.", "a flight of stairs.", "a ladder-like implement used to climb the forts of enemies, while attempting to seize."]}], "ಸಾರುವಭೌಮ": [{"type": "noun", "defs": ["supreme rule; absolute power or authority; dominion.", "the male sovereign or supreme ruler of an empire; an emperor."]}], "ಸಾರುವೆ": [{"type": "noun", "defs": ["= ಸಾರ್ವೆ."]}], "ಸಾರೂಪ್ಯ": [{"type": "noun", "defs": ["the state of being similar; likeness; resemblance; similarity.", "(phil.) one of the four types of salvation of the soul, in which the being gets the same form, state etc. as of the deity he or she worshipped or meditated upon during his or her life."]}], "ಸಾರೂಪ್ಯಪದ": [{"type": "noun", "defs": ["= ಸಾರೂಪ್ಯ - 2."]}], "ಸಾರೆ": [{"type": "noun", "defs": ["vicinity; closeness; proximity; nearness."]}, {"type": "noun", "defs": ["= ಸಾರಿ1."]}, {"type": "noun", "defs": ["the cavity formed by open hands joined together and folded slightly; the hollow of the palms.", "that much quantity which can be held in such a cavity.", "the width, breadth of the palms so joined."]}, {"type": "adverb", "defs": ["at or to a relatively short distance in space or time; near.", "with; along with; together with."]}], "ಸಾರೈಸು": [{"type": "verb", "defs": ["= ಸಾರಿಸು2."]}], "ಸಾರೋಕ್ತಿ": [{"type": "noun", "defs": ["a speech, sentence or word that has the gist of what one's real intention was."]}], "ಸಾರೋಟು": [{"type": "noun", "defs": ["a carriage drawn by a pair of either horses or oxen."]}], "ಸಾರೋದ್ಧಾರ": [{"type": "noun", "defs": ["the most excellent, superior thing, act, course, etc.", "a making something new or fresh again; the act of restoring to a former state; rejuvenation.", "that which runs uninterruptedly."]}], "ಸಾರ್ಕೆ": [{"type": "noun", "defs": ["closeness; nearness; vicinity; proximity.", "the act of coming or going close to; an approaching.", "the state of being associated; companionship; association.", "that which is got, received."]}], "ಸಾರ್ಕೆಗುಡು": [{"type": "verb", "defs": ["to allow to come or go near."]}], "ಸಾರ್ಕೆವರ್": [{"type": "verb", "defs": ["to come near; to approach."]}], "ಸಾರ್ಚು": [{"type": "verb", "defs": ["to come or go near; to approach.", "to go away (from); to leave; to depart.", "to reach; to arrive at.", "to come into physical contact with; to touch.", "to carry as far as; to reach.", "to cause to touch.", "to hold out or reach out; to extend; to stretch.", "to put on, wear on the body (as a dress ornament, etc.).", "to cause to wear (a dress ornament, etc.).", "to cause to lean (on).", "to bring something to.", "to give, handover.", "to push aside.", "to correct; to remove errors; to set right.", "to cover, conceal with.", "to prepare; to make ready.", "to set an arrow on the bow.", "to subject to; to cause to undergo.", "to cause to join.", "to come in front.", "to happen; to take place; to occur.", "to cause to happen, occur.", "to unroll as to spread (as a mat, mattress, etc. on the floor).", "to spread oneself over a wide area.", "to cause to spread so.", "to make known; to express.", "to pull towards."]}], "ಸಾರ್ಚುದೊಲೆ": [{"type": "noun", "defs": ["a heavy, long log of wood kept leaning on the fortwalls to climb over it."]}], "ಸಾರ್ತರ್": [{"type": "verb", "defs": ["to come near; to approach.", "to happen to take place; to occur."]}], "ಸಾರ್ಥ": [{"type": "adjective", "defs": ["full of meaning; having significance; significant; meaningful.", "having a definite purpose, goal, airm.", "having the same or similar meaning.", "useful; of use; serving a purpose.", "well-supplied (with); abounding (in); rich."]}, {"type": "noun", "defs": ["the quality or fact of having meaning or being meaningful; meaningfulness.", "a group of merchants moving together, from one place to another, in pursuit of their trade.", "(gen.) a group of people; a multitude.", "a number of animals of the same species or class being, feeding, living, driven together; a herd; a flock.", "a group of pilgrims travelling together.", "a pile of things; a heap."]}], "ಸಾರ್ಥಕ": [{"type": "adjective", "defs": ["= ಸಾರ್ಥ2 - 1, 2 & 4."]}, {"type": "noun", "defs": ["= ಸಾರ್ಥ2 - 1 & 3.", "the quality of being effective or capable of bringing about.", "use; benefit; advantage."]}], "ಸಾರ್ಥಕತೆ": [{"type": "noun", "defs": ["= ಸಾರ್ಥ2 - 1.", "the act or state of fulfilling; fulfilment; success.", "the state of being fulfilled."]}], "ಸಾರ್ಥಕ್ಯ": [{"type": "noun", "defs": ["= ಸಾರ್ಥಕತೆ."]}], "ಸಾರ್ಥತೆ": [{"type": "noun", "defs": ["the quality of being meaningful.", "the quality or state of being well-supplied(with), abounding (in); richness; abundance."]}], "ಸಾರ್ಥನಾಥ": [{"type": "noun", "defs": ["the leader of a group of merchants moving together, from one place to another, for purpose of buying and selling goods."]}], "ಸಾರ್ಥನಾಮ": [{"type": "noun", "defs": ["a proper name that suits the quality of the holder of the name."]}], "ಸಾರ್ಥಪತಿ": [{"type": "noun", "defs": ["= ಸಾರ್ಥನಾಥ."]}], "ಸಾರ್ಥವಾಹ": [{"type": "noun", "defs": ["= ಸಾರ್ಥನಾಥ.", "a merchant."]}], "ಸಾರ್ಥವಾಹಕ": [{"type": "noun", "defs": ["= ಸಾರ್ಥನಾಥ."]}], "ಸಾರ್ಥಾಧಿಪತಿ": [{"type": "noun", "defs": ["= ಸಾರ್ಥನಾಥ."]}], "ಸಾದ್ರ್ರ": [{"type": "adjective", "defs": ["moist; wet; damp; soaked (in water).", "kindly; sympathetic; compassionate."]}], "ಸಾದ್ರ್ರತೆ": [{"type": "noun", "defs": ["the quality of being moist, wet, damp; dampness.", "the quality of being sympathetic, compassionate; compassion; sympathy."]}], "ಸಾದ್ರ್ರವಿಲೋಕನ": [{"type": "noun", "defs": ["a sympathetic, compassionate look or gesture."]}], "ಸಾದ್ರ್ರಹೃದಯ": [{"type": "noun", "defs": ["compassion; sympathy; kindness.", "a compassionate, kind man."]}], "ಸಾದ್ರ್ರಹೃದಯೆ": [{"type": "noun", "defs": ["a compassionate, kind woman."]}], "ಸಾದ್ರ್ರಾಂತರಂಗ": [{"type": "noun", "defs": ["= ಸಾದ್ರ್ರಹೃದಯ."]}], "ಸಾರ್ಧ": [{"type": "adjective", "defs": ["that is having half portion of."]}], "ಸಾರ್ಪಿಷ್ಕ": [{"type": "noun", "defs": ["that is having half portion of."]}], "ಸಾರ್ಬಭೌಮ": [{"type": "noun", "defs": ["(correctly, ಸಾರ್ವಭೌಮ) the male sovereign or supreme ruler of an empire; an emperor."]}], "ಸಾರ್ಬರಿ": [{"type": "noun", "defs": ["(correctly, ಶಾರ್ವರಿ) name of the thirty fourth year in the Hindu cycle of sixty years."]}], "ಸಾರ್ವ": [{"type": "adjective", "defs": ["= ಸಾರ್ವತ್ರಿಕ1."]}], "ಸಾರ್ವಕಾಲ": [{"type": "noun", "defs": ["all times (that includes, past, present and future)."]}], "ಸಾರ್ವಕಾಲಂಗೆಯ್": [{"type": "verb", "defs": ["to conduct, observe, follow, perform etc. at all times."]}], "ಸಾರ್ವಕಾಲಿಕ": [{"type": "adjective", "defs": ["applicable to all the times (past, present and future)."]}], "ಸಾರ್ವಜನಿಕ": [{"type": "adjective", "defs": ["of, for, from, applying to, concerned with all the people in general.", "in a state which permits freedom of view to all; without concealment; open.", "ಸಾರ್ವಜನಿಕ ಜೀವನ sārvajanika jīvana that part of the affairs in one's life that is concerned with the society; the social or public life; ಸಾರ್ವಜನಿಕ ಸೇವೆ sārvajanika sēve any service for the welfare of society, as providing health, education, recreation, aid for the poor, under-privileged, physically handicapped persons, etc.; social work; social service."]}, {"type": "noun", "defs": ["all the persons of a nation; people.", "that which is public, open to all."]}], "ಸಾರ್ವತ್ರಿಕ": [{"type": "adjective", "defs": ["present, occurring, used, regarded everywhere, at all times.", "applicable to, used, regarded, etc. by, all the people in general."]}], "ಸಾರ್ವತ್ರಿಕಚುನಾವಣೆ": [{"type": "noun", "defs": ["the general election conducted for electing the representatives for the Lōkasabhe (lower house of the Indian Parliament)(as dif. from by-election)."]}], "ಸಾರ್ವತ್ರಿಕತೆ": [{"type": "noun", "defs": ["the quality or fact of being applicable to, present or occuring in, used by all the people, at all times."]}], "ಸಾರ್ವದೇಶಿಕ": [{"type": "adjective", "defs": ["of, belonging to, available or used in all or most of the countries or places."]}], "ಸಾರ್ವದೇಶಿಕತೆ": [{"type": "noun", "defs": ["the state of being, used, available in all or most of the countries or places."]}], "ಸಾರ್ವಭೌಮ": [{"type": "noun", "defs": ["that which is related to, present in, covering or concerning the entire earth.", "the male sovereign or supreme ruler of an empire; an emperor.", "name of the mythological elephant bearing the earth on the north-west direction.", "(fig.) that which or he who is the chief, prominent or excellent in its or his class."]}], "ಸಾರ್ವಭೌಮಕ": [{"type": "noun", "defs": ["= ಸಾರ್ವಭೌಮ - 2."]}], "ಸಾರ್ವಭೌಮತೆ": [{"type": "noun", "defs": ["the state, office or dignity of an emperor; emperorship."]}], "ಸಾರ್ವಭೌಮಿಕ": [{"type": "adjective", "defs": ["of, relating to an emperor, his authority or office.", "(fig.) the most excellent, prominent.", "greatest; highest."]}], "ಸಾರ್ವಭೌಮಿಕೆ": [{"type": "noun", "defs": ["= ಸಾರ್ವಭೌಮತೆ."]}], "ಸಾರ್ವರ್ತುಕ": [{"type": "adjective", "defs": ["adapted to every season.", "habitable in every season.", "existing in every season."]}], "ಸಾರ್ವರ್ತುಕಂ": [{"type": "adverb", "defs": ["(to happen, should be happening) during all the seasons."]}], "ಸಾರ್ವಲೌಕಿಕ": [{"type": "adjective", "defs": ["belonging to, happening in, concerned with all the worlds."]}], "ಸಾರ್ವೆ": [{"type": "noun", "defs": ["a wooden structure built over a stream, small river, etc. for crossing over from one side to another; a wooden bridge.", "a flight of stairs made of wood (for temporary purpose as in building construction)."]}], "ಸಾಲ್": [{"type": "verb", "defs": ["to take something (esp. money) on loan.", "to be or become sufficient.", "to be apt, proper, appropriate.", "to be able to."]}, {"type": "verb", "defs": ["to get; to have; to receive.", "to go (to)."]}, {"type": "noun", "defs": ["= ಸಾಲು2."]}, {"type": "noun", "defs": ["= ಸಾಲು3."]}], "ಸಾಲ್‍ಜಾಡ": [{"type": "noun", "defs": ["= ಸಾಲ್‍ಝಾಡ."]}], "ಸಾಲ್‍ಜಾಡೆ": [{"type": "noun", "defs": ["= ಸಾಲ್‍ಝಾಡ."]}], "ಸಾಲ್‍ಝಾಡ": [{"type": "noun", "defs": ["the accounts, details of transactions, income, expenditure, etc. of one year; annual accounts."]}], "ಸಾಲ್‍ಬಸಾಲ್": [{"type": "adverb", "defs": ["every year."]}], "ಸಾಲ": [{"type": "noun", "defs": ["something lent, a sum of money, repayable with or without interest; a loan.", "ಸಾಲತೀರು sāla tīru (a loan) to be returned, repayed fully; ಸಾಲಸೋಲ sāla sōla = ಸಾಲ1; ಸಾಲವೋ ಶೂಲವೋ sālavō śulavō (prov.) he that goes a borrowing, goes a sorrowing; ಸಾಲ ತಿದ್ದು sāla tiddu = ಸಾಲತೀರಿಸು; 2. to lend money; to give a loan; ಸಾಲತೀರಿಸು sāla tīrisu to return the money taken on a loan; to repay a loan; ಸಾಲಕೇಳು sāla kēḷu to request for lending an amount; 2. to demand to return the amount lent."]}, {"type": "noun", "defs": ["the tree Shorea talura ( = S. robusta, = Vatica robusta) of Dipterocarpaceae family.", "a tree (in gen.).", "a wall enclosing a space, a building or buildings; an enclosure; a compound."]}], "ಸಾಲಂಕಾರ": [{"type": "adjective", "defs": ["decorated; ornamented; embellished."]}], "ಸಾಲಂಕೃತ": [{"type": "adjective", "defs": ["= ಸಾಲಂಕಾರ."]}], "ಸಾಲಂಗುಳಿ": [{"type": "noun", "defs": ["= ಸಾಲಗುಳಿ."]}], "ಸಾಲಂಗೊಡು": [{"type": "verb", "defs": ["= ಸಾಲಕೊಡು."]}], "ಸಾಲಂಗೊಳು": [{"type": "verb", "defs": ["to take money on loan."]}], "ಸಾಲಂಬಡು": [{"type": "verb", "defs": ["= ಸಾಲಬಡು."]}], "ಸಾಲಂಮಿಶ್ರಿ": [{"type": "noun", "defs": ["= ಸಾಲಾಮಿಸ್ರಿ."]}], "ಸಾಲಕ": [{"type": "noun", "defs": ["one's younger sister's husband."]}], "ಸಾಲಕೊಡು": [{"type": "verb", "defs": ["to lend money (with or without money)."]}], "ಸಾಲಗ": [{"type": "noun", "defs": ["he who lends money; a lender."]}, {"type": "noun", "defs": ["(mus.) harmonious agreement (of sounds); harmony.", "a particular mode of playing maddaḷe, a percussion instrument.", "(mus.) in Karnāṭaka system, the thirty seventh of the seventy two rāgas (musical modes)."]}], "ಸಾಲಗಾತಿ": [{"type": "noun", "defs": ["she who owes money to another or others; a woman in debt; a debtor.", "a woman who has lent money to another or others; a lender; a creditor."]}], "ಸಾಲಗಾರ": [{"type": "noun", "defs": ["he who owes money to another or others; a man in debt; a debtor.", "a man who has lent money to another or others; a lender; a creditor."]}], "ಸಾಲಗಾರಿಕೆ": [{"type": "noun", "defs": ["the act or habit of taking loans."]}], "ಸಾಲಗಾರ್ತಿ": [{"type": "noun", "defs": ["= ಸಾಲಗಾತಿ."]}], "ಸಾಲಗುಳಿ": [{"type": "noun", "defs": ["a man who habitually takes money on loan from others."]}], "ಸಾಲಗುಳಿಕ": [{"type": "noun", "defs": ["= ಸಾಲಗುಳಿ."]}], "ಸಾಲಗ್ರಾಮ": [{"type": "noun", "defs": ["= ಸಾಲಿಗ್ರಾಮ."]}], "ಸಾಲಜೇಡು": [{"type": "noun", "defs": ["= ಸಾಲ್‍ಝಾಡ."]}], "ಸಾಲಣ": [{"type": "noun", "defs": ["the resin of the tree Shorea talura."]}], "ಸಾಲಪತ್ರ": [{"type": "noun", "defs": ["a document executed by a loaner mentioning the details of loan amount and other terms of the loan, as rate of interest, duration of the loan, mode of repayment etc.; a loan document."]}], "ಸಾಲಪರ್ಣಿ": [{"type": "noun", "defs": ["the plant Desmodium gangeticum of Papilionaceae family."]}], "ಸಾಲಬಂದಿಕೆ": [{"type": "noun", "defs": ["= ಸಾಲಭಂಜಿಕೆ."]}], "ಸಾಲಬಡಕ": [{"type": "noun", "defs": ["= ಸಾಲಗುಳಿ."]}], "ಸಾಲಬಡು": [{"type": "verb", "defs": ["to be under the obligation of another for having taken a loan from the latter."]}], "ಸಾಲಬಾಗೆ": [{"type": "noun", "defs": ["= ಸಾಲುಬಾಗೆ."]}], "ಸಾಲಭಂಜಿಕೆ": [{"type": "noun", "defs": ["a doll, puppet made to resemble a human being."]}], "ಸಾಲವಣಿಗ": [{"type": "noun", "defs": ["= ಸಾಲಗುಳಿ."]}], "ಸಾಲವಿದ್ಯೆ": [{"type": "noun", "defs": ["the architectural skill required for building a fort."]}], "ಸಾಲಾಂಬಾಲ": [{"type": "adjective", "defs": ["harsh, strict, severe (as in treatment)."]}], "ಸಾಲಾಖೈರು": [{"type": "noun", "defs": ["the end of an year."]}], "ಸಾಲಾಮಿಸಿರಿ": [{"type": "noun", "defs": ["= ಸಾಲಾಮಿಸ್ರಿ."]}], "ಸಾಲಾಮಿಸ್ರಿ": [{"type": "noun", "defs": ["the plant Eulophia dabia ( = E. campestris) of Orchidaceae family.", "the powder of the dried roots of this plant, used for medicinal purpose.", "the plant Orchis latifolia of Orchidaceae family."]}], "ಸಾಲಾವಳಿ": [{"type": "noun", "defs": ["(astrol.) the matching of the horoscopes of a man and woman for purpose of marrying them to each other."]}], "ಸಾಲಾವೃಕ": [{"type": "noun", "defs": ["a dog.", "a monkey.", "a jackal."]}], "ಸಾಲಿ": [{"type": "noun", "defs": ["= ಸಾಲೆ2."]}, {"type": "noun", "defs": ["= ಸಾಲೆ3."]}], "ಸಾಲಿಕ್ಕು": [{"type": "verb", "defs": ["to form a line by standing, moving one behind the other."]}], "ಸಾಲಿಗ": [{"type": "noun", "defs": ["= ಸಾಲಗಾರ."]}, {"type": "noun", "defs": ["a man who weaves fabrics on a loom; a weaver.", "a man belonging to the caste of weavers."]}], "ಸಾಲಿಗಸಮಯ": [{"type": "noun", "defs": ["an association of or federation of the associations of, weavers."]}], "ಸಾಲಿಗ್ರಾಮ": [{"type": "noun", "defs": ["a kind of ammonite or fossil of an extinct species of molluscs, found mainly along the river Gandaki, which represents Viṣṇu."]}], "ಸಾಲಿಗ್ರಾವ": [{"type": "noun", "defs": ["= ಸಾಲಿಗ್ರಾಮ."]}], "ಸಾಲಿಡು": [{"type": "verb", "defs": ["to form a line, row (by making a number of persons, animals, things, etc. standing one behind the other).", "to form a line by standing with others, one behind the other.", "to move one behind the another; to move in a row.", "to send forth; to give forth; to discharge.", "to scatter all over or in a disorderly manner.", "to make; to cause to happen."]}], "ಸಾಲಿಪೈಠಣೆ": [{"type": "noun", "defs": ["a kind of cloth."]}], "ಸಾಲಿಮೆ": [{"type": "noun", "defs": ["a deficiency in the quantity; shortage; deficit."]}], "ಸಾಲಿಯಾನ": [{"type": "adjective", "defs": ["= ಸಾಲಿಯಾನಾ."]}], "ಸಾಲಿಯಾನಾ": [{"type": "adjective", "defs": ["of or measured by a year; for a yeaṛs time, work, etc."]}], "ಸಾಲಿಸು": [{"type": "verb", "defs": ["to lend money; to loan.", "to stop; to put an end to."]}], "ಸಾಲಿಱಿ": [{"type": "verb", "defs": ["= ಸಾಲಿಕ್ಕು."]}], "ಸಾಲು": [{"type": "verb", "defs": ["to take something (esp. money) on loan.", "to be or become sufficient.", "to be apt, proper, appropriate.", "to be able to."]}, {"type": "noun", "defs": ["a number of things, people arranged to form a line; a row.", "a narrow groove made in the ground by a plough; a furrow.", "a number of things, animals, persons being or gathered at a place; a group, multitude.", "a row of written or printed characters extending across or part way across a page; a line.", "a pouring or being poured continuously."]}, {"type": "noun", "defs": ["a period of twelve months (starting from a particular day); a year."]}], "ಸಾಲುಗಂಬ": [{"type": "noun", "defs": ["any of several pillars forming a line."]}], "ಸಾಲುಗಂಭ": [{"type": "noun", "defs": ["= ಸಾಲುಗಂಬ."]}], "ಸಾಲುಗಟ್ಟು": [{"type": "verb", "defs": ["to make a line by standing one behind the other."]}], "ಸಾಲುಗುಜಸ್ತಾ": [{"type": "noun", "defs": ["the year previous to the current one; the previous year."]}], "ಸಾಲುಗುದಸ್ತಾ": [{"type": "noun", "defs": ["= ಸಾಲುಗುಜಸ್ತಾ."]}], "ಸಾಲುಗುದಸ್ತಾಬಾಕಿ": [{"type": "noun", "defs": ["that which was to be paid or received last year; arrears of the previous year."]}], "ಸಾಲುಗೊಳ್": [{"type": "verb", "defs": ["= ಸಾಲುಗೊಳ್ಳು."]}], "ಸಾಲುಗೊಳಿಸು": [{"type": "verb", "defs": ["to cause to form a line, by making stand one behind the other or placing a number of things, animals, etc. so.", "to gather number of things, animals, people, etc. to form a group.", "to cause to come one after the other; to regulate so."]}], "ಸಾಲುಗೊಳ್ಳು": [{"type": "verb", "defs": ["to be in a line or form a line by being one behind the other.", "to be piled up."]}], "ಸಾಲುತೋಪು": [{"type": "noun", "defs": ["collectively, the trees planted on either side of a road."]}], "ಸಾಲುಧೂಪ": [{"type": "noun", "defs": ["the large, evergreen tree Vateria indica ( = V. malabarica) of Dipterocarpaceae family; white dammar.", "its resin used in making varnish, lacquers, etc.; dammar."]}], "ಸಾಲುಬಾಗೆ": [{"type": "noun", "defs": ["the large, deciduous tree Albizzia procera of Mimosae family, the wood of which is used in building construction."]}], "ಸಾಲುಮಂಟಿಗೆ": [{"type": "noun", "defs": ["a kind of ornament worn by women on their toes."]}], "ಸಾಲುಮಣೆ": [{"type": "noun", "defs": ["an agricultural implement used to make shallow, parellel furrows for planting seedlings in."]}], "ಸಾಲುಮರ": [{"type": "noun", "defs": ["collectively, the trees planted on either side of a road."]}], "ಸಾಲುವಲೆ": [{"type": "noun", "defs": ["a kind of net used by hunters or catchers of birds and other animals."]}], "ಸಾಲುವಳಿ": [{"type": "noun", "defs": ["= ಸಾಲಾವಳಿ."]}], "ಸಾಲುವಿಡಿ": [{"type": "verb", "defs": ["= ಸಾಲುಗೊಳ್ಳು."]}], "ಸಾಲುಳು": [{"type": "verb", "defs": ["to make a straight furrow using a plough."]}], "ಸಾಲೆ": [{"type": "noun", "defs": ["a narrow groove made in the ground by a plough; a furrow."]}, {"type": "noun", "defs": ["a cloth in gen.", "sari, a garment worn by Indian women, consisting of a long piece of cotton or silk wrapped around the body with one end draped over the head or over one shoulder.", "a sub-caste among weavers.", "a kind of lose-textured cloth."]}, {"type": "noun", "defs": ["the aquatic grass Oryza sativa, grown wide for its grain, which forms a staple food in most of the countries; rice.", "the rice grain.", "a kind of superior quality rice."]}, {"type": "noun", "defs": ["(correctly, ಶಾಲೆ) 1. a dwelling place; a house.", "a room or building in which work, as manufacturing, repairing work, is carried on; a workshop.", "an institution where instruction is given, persons are educated; a school, college, etc.", "a building where horse, elephants are sheltered and fed; a stable.", "ಸಾಲೆಗೆ ಹಾಕು sālege hāku to admit a child into school; ಸಾಲೆಬರೆ sāle bare to join a school and be educated; ಸಾಲೆಮಠ sāle maṭha = ಸಾಲೆ4 - 3."]}, {"type": "noun", "defs": ["the tree Shorea talura ( = S. robusta, = Vatica robusta) of Dipterocarpaceae family."]}], "ಸಾಲೆಹುಳು": [{"type": "noun", "defs": ["the spider that weaves webs."]}], "ಸಾಲೆಯ": [{"type": "noun", "defs": ["a man who weaves fabrics on a loom; a weaver.", "a man belonging to the caste of weavers."]}], "ಸಾಲೇಱು": [{"type": "verb", "defs": ["to come together in large number; to form a group.", "to attack or assult a group of persons."]}], "ಸಾಲೋಕ್ಯ": [{"type": "noun", "defs": ["the fact of being the same world (as another).", "(phil.) one of the four types of salvation from this world, in which the emancipated person will be in the world of the deity he or she worshipped while being in this world."]}], "ಸಾಲೋಕ್ಯಪದ": [{"type": "noun", "defs": ["= ಸಾಲೋಕ್ಯ - 2."]}], "ಸಾಲ್ಕುಳಿ": [{"type": "noun", "defs": ["= ಸಾಲಗುಳಿ."]}], "ಸಾಲ್ಗಟ್ಟು": [{"type": "verb", "defs": ["= ಸಾಲುಗಟ್ಟು."]}], "ಸಾಲ್ಗೊಳ್": [{"type": "verb", "defs": ["= ಸಾಲುಗೊಳ್ಳು."]}], "ಸಾಲ್ಗೊಳಿಸು": [{"type": "verb", "defs": ["= ಸಾಲುಗೊಳಿಸು."]}], "ಸಾಲ್ದಳೆ": [{"type": "verb", "defs": ["to make a line by standing one behind the other."]}], "ಸಾಲ್ದೆಗೆ": [{"type": "verb", "defs": ["= ಸಾಲ್ದಳೆ."]}], "ಸಾಲ್ಮರ": [{"type": "noun", "defs": ["= ಸಾಲುಮರ."]}], "ಸಾಲ್ಲೀಯಾನಾ": [{"type": "adjective", "defs": ["= ಸಾಲಿಯಾನಾ."]}], "ಸಾಲ್ವಲೆ": [{"type": "noun", "defs": ["= ಸಾಲುವಲೆ."]}], "ಸಾಲ್ವಿಡಿ": [{"type": "verb", "defs": ["= ಸಾಲುಗೊಳ್ಳು."]}], "ಸಾಲ್ಸರಿ": [{"type": "noun", "defs": ["an incessant rain."]}], "ಸಾವಂತ": [{"type": "noun", "defs": ["a ruler who is a tributary to another ruler; a tributary.", "a king of the neighbouring state or nation.", "a chief or head of a group of persons.", "a family name affixed in north Karnāṭaka."]}], "ಸಾವಂತಿಕೆ": [{"type": "noun", "defs": ["the fact of (a king) being a tributary to another ruler."]}], "ಸಾವಕಾತಿ": [{"type": "noun", "defs": ["a wealthy woman."]}], "ಸಾವಕಾರ": [{"type": "noun", "defs": ["a wealthy man.", "a man who lends money for interest.", "a business man; a merchant."]}], "ಸಾವಕಾರಿ": [{"type": "adjective", "defs": ["owned by private persons (as diff. from owned by government, public)."]}, {"type": "noun", "defs": ["private ownership (as diff. from government, public ownership)."]}], "ಸಾವಕಾರಿಕೆ": [{"type": "noun", "defs": ["the state or fact of being rich; wealthiness.", "the business of lending money."]}], "ಸಾವಕಾಶ": [{"type": "adjective", "defs": ["characterised by or having leisure; without haste; deliberate; leisurely."]}, {"type": "noun", "defs": ["free, unoccupied time during which a person may indulge in rest, recreation, etc.", "slowness; tardiness.", "ಸಾವಕಾಶಮಾಡು sāvakāśa māḍu to put off action; to slow down the process, action, etc.; to delay."]}], "ಸಾವಗ": [{"type": "noun", "defs": ["name of a particular caste.", "a man belonging to this."]}], "ಸಾವಗಿಸು": [{"type": "verb", "defs": ["to put in order; to correct the order.", "to form into a system; to arrange according to a system; to make systematic; to systemise.", "to make less hard to bear; lighten or relieve (pain, suffering, etc.); to alleviate; to mollify; to soothe; to pacify.", "to keep quiet; to refrain from talking.", "to make something stationary, motionless."]}], "ಸಾವಡರ್": [{"type": "verb", "defs": ["to cease to live; to stop living; to die.", "(death) to befall."]}], "ಸಾವಡಸು": [{"type": "verb", "defs": ["(death) to occur, happen."]}], "ಸಾವಣ": [{"type": "noun", "defs": ["(correctly, ಶ್ರಾವಣ) 1. Śrāvaṇa, the fifth month in the Hindu lunar calendar.", "a kind of plant that grows during this month in rice-fields.", "its flower."]}], "ಸಾವದ್ಯ": [{"type": "adjective", "defs": ["that deserves blame; culpable; blamable; blameworthy."]}, {"type": "noun", "defs": ["a fault; a defect; a flaw.", "anything blamable or objectionable."]}], "ಸಾವದ್ಯದೂರತ್ವ": [{"type": "noun", "defs": ["the quality or state of being free from any fault, defect or flaw; flawlessness; immaculateness."]}], "ಸಾವದ್ಯಭೀರು": [{"type": "noun", "defs": ["a person who deliberately avoids comitting a sin; a sinless, immaculate person."]}], "ಸಾವಧ": [{"type": "noun", "defs": ["the state or fact of being conscious, aware of, etc."]}], "ಸಾವಧಗಿರಿ": [{"type": "noun", "defs": ["the state or quality of being calm or tranquil; freedom from excitement, mental agitation, anxiety, fear, etc.; mental calmness; serenity; tranquility."]}], "ಸಾವಧಾನ": [{"type": "noun", "defs": ["the quality, state of being careful, cautious; cautiousness; carefulness.", "a warning against danger or evil; anything serving as a warning.", "absence of mental agitation or excitement; cool-mindedness; the state of being patient, tranquil.", "slowness; tardiness."]}], "ಸಾವಧಾನಿ": [{"type": "noun", "defs": ["a calm, quiet minded person.", "a person who is careful, cautious."]}], "ಸಾವಧಿ": [{"type": "adjective", "defs": ["limited by time; having a date for completing, repaying, etc.", "having a boundary; circumscribed."]}], "ಸಾವನ": [{"type": "noun", "defs": ["a particular system of reckoning time, and dividing it into years, months, days, etc.", "the concluding part of a religious sacrifice.", "a solar month.", "that part of the day from the sunrise to the sunset."]}], "ಸಾವಭೃತ": [{"type": "adjective", "defs": ["unexceptional; average; common; ordinary."]}], "ಸಾವಯ": [{"type": "adjective", "defs": ["= ಸಾವಯವ1."]}, {"type": "noun", "defs": ["the tree Sterculia villosa of Sterculiaceae family."]}], "ಸಾವಯವ": [{"type": "adjective", "defs": ["having or composed of, parts, limbs; organic.", "designating or of any chemical compound containing carbon.", "designating or of the branch of chemistry dealing with carbon compounds; organic.", "of, having the characteristics of or derived from living organisms; organic.", "grown with only animal or vegetable fertilisers, as manure, bone meal, compost, etc.; organic.", "fundamental; essential; important."]}, {"type": "noun", "defs": ["that which has limbs or is made of parts."]}], "ಸಾವಯವರೂಪಕ": [{"type": "noun", "defs": ["(rhet.) a kind of simile in which different parts or limbs of a person or thing or compared with different things."]}], "ಸಾವರಣೆ": [{"type": "noun", "defs": ["the act of collecting. accumulating; accumulation; collection.", "that which is accumulated, gathered together.", "the act of preparing; preparation.", "the state of being prepared.", "something that is made or kept ready, well-equipped for the purpose, etc.", "a crowd; a multitude; a throng.", "the act or duty of guarding; careful watch; wariness; defence; protection.", "a condition or state of affairs; plight.", "that which completes, complements or brings to perfection.", "the quality of acting or working in a thoughtful, cautious way; carefulness.", "spectacular, pompous display; ostentation."]}], "ಸಾವರಿಸು": [{"type": "verb", "defs": ["to gather; to collect; to accumulate.", "to come together in a large number; to crowd.", "to make ready; to make something suitable (for specific purpose).", "to become ready; to be ready for; to be equipped suitably for.", "to guard (something) against danger, harm; to watch over and protect.", "to guard oneself against.", "to alleviate or lessen the grief, sorrow or disappointment of; to give solace or comfort.", "to make something free from defects, faults; to remove deficiencies, shortcomings.", "to adjust oneself to a condition, situation, place, etc.", "to keep, place (something on, above, at or in such and such a manner, etc.).", "to arrange in proper or tidy manner.", "to be excited from joy.", "to plan a strategy or strategies; to strategise.", "to bring about or succeed in accomplishing, despite difficulty or hardship; to manage.", "to recover one's balance, consciousness, etc.", "to watch over; to be careful in handling."]}], "ಸಾವರ್ಣಿಕ": [{"type": "noun", "defs": ["a man belonging, relating to or descending from the same family or ancestor, as another."]}], "ಸಾವಱೆ": [{"type": "noun", "defs": ["a particular kind of hand-held drum, consisting of a shallow, circular cylinder with a membrane stretched tightly over its mouth, played with sticks while taking a dead body to the crematorium or burial ground."]}], "ಸಾವಾಸ": [{"type": "noun", "defs": ["the fact of living together; co-dwelling or co-habitation.", "the fact of being associated with another; association.", "sexual union."]}], "ಸಾವಾಸಿ": [{"type": "noun", "defs": ["a man who is co-habiting with another.", "(masc.) an associate; a companion.", "a man (usu. an old man) who supervises the female quarters in a palace.", "a watchman or guard.", "an elderly man.", "a clan among brāhmaṇas.", "a man belonging to this clan."]}], "ಸಾವಿ": [{"type": "noun", "defs": ["a master; a lord; an employer.", "a king; a ruler.", "a man appointed to a position or office of authority in government, business, institution, etc.; an officer.", "a man as he is related to his wife; a husband.", "the Supreme Being.", "a suffix added to the names of men as a mark of respect.", "a respectful mode of addressing eleders, gods, officers, etc."]}], "ಸಾವಿತ್ರ": [{"type": "adjective", "defs": ["relating to the sun or the Sun-God.", "belonging or related to the solar family or dynasty."]}, {"type": "noun", "defs": ["the Sun-God.", "Śiva."]}], "ಸಾವಿತ್ರಿ": [{"type": "noun", "defs": ["a ray or rays of the sun.", "a particular sacred verse repeated by every brāhmaṇa three times everyday for expiation of sins.", "the daughter of the Sun-God, personified as light.", "name of one of the wives of Brahma.", "Pārvati, the goddess of power.", "the plant Blumea lacera of Glandulosa of family.", "a married woman."]}], "ಸಾವಿತ್ರೀವ್ರತ": [{"type": "noun", "defs": ["a worshipping of Sāvitri, the Goddess of Light, during Jyēṣṭha, the third month in the Hindu lunar calendar."]}], "ಸಾವಿತ್ರೀಸೂತ್ರ": [{"type": "noun", "defs": ["a thread worn over the left shoulder crossing under the right arm, as a symbol of religious initiation; the sacrificial thread."]}], "ಸಾವಿರ": [{"type": "adjective", "defs": ["amounting to one thousand in number.", "too numerous to be counted; very many.", "ಸಾವಿರಕಾಲಿನ ಹುಳು sāvira kālina huḷu any of a class (Chilopoda) of elongated, many-segmented, insect-eating arthropods with a pair of legs to each segment; a centipede."]}, {"type": "noun", "defs": ["the cardinal number one thousand; 1,000."]}], "ಸಾವಿರಸಂಬಾರ": [{"type": "noun", "defs": ["the plant Anisochilus carnosus of Lamiaceae family; thick leaved lavender."]}], "ಸಾವು": [{"type": "noun", "defs": ["the act of dying; the end of life; the total and permanent cessation of all the vital functions of an organism; death.", "the dead body of a person."]}], "ಸಾವುಕಾರ": [{"type": "noun", "defs": ["= ಸಾವಕಾರ."]}], "ಸಾವುಕಾರಿ": [{"type": "adjective", "defs": ["= ಸಾವಕಾರಿ1."]}, {"type": "noun", "defs": ["= ಸಾವಕಾರಿ2."]}], "ಸಾವುಗಾಣ್": [{"type": "verb", "defs": ["to cease to live; to die."]}], "ಸಾವೆ": [{"type": "noun", "defs": ["the grass Echinochloa frumentacea ( = Panicum frumentaceum) of Poacea family.", "its grain.", "another grass Panicum miliare of the same family."]}, {"type": "noun", "defs": ["the large, tropical plant Colocasia esculenta ( = C. antiquorum, = Arum colocasia) of Araceae family, with shield-shaped leaves; taro."]}], "ಸಾವೆಗೆಡ್ಡೆ": [{"type": "noun", "defs": ["= ಸಾವೆ2.", "its edible, tuberous root."]}], "ಸಾವೆಬಿದಿರು": [{"type": "noun", "defs": ["the bamboo Oxytenanthera monostigma of Graminae family."]}], "ಸಾವೆಯಕ್ಕಿ": [{"type": "noun", "defs": ["= ಸಾವೆ1 - 2 & 4."]}], "ಸಾವೇರಿ": [{"type": "noun", "defs": ["(mus.) in Karnāṭaka system, a rāga (musical mode) derived from the main mode Māyāmāḷavagauḷa."]}, {"type": "noun", "defs": ["a kind of tree."]}], "ಸಾಶಂಕ": [{"type": "adjective", "defs": ["hesitating; undecided, doubtful or disinclined; hesitant."]}, {"type": "noun", "defs": ["the quality or fact of being hesitant, doubtful.", "a man who is hesitant, doubting or disinclined."]}], "ಸಾಶನ": [{"type": "adjective", "defs": ["taking, consuming food."]}, {"type": "noun", "defs": ["he who is taking or has taken, food."]}], "ಸಾಶ್ರುಪಾತ": [{"type": "noun", "defs": ["shedding tears; weeping."]}], "ಸಾಷ್ಟಾಂಗ": [{"type": "adjective", "defs": ["performed with eight limbs or members (as a reverential prostration of the body so as to touch the ground with the hands, breast, forehead, knees, and feet)."]}, {"type": "noun", "defs": ["a reverential prostration of the body so as to touch the ground with the hands, breast, forehead, knees, and feet.", "ಸಾಷ್ಟಾಂಗ ಬೀಳು sāṣṭānga bīḷu = ಸಾಷ್ಟಾಂಗಮಾಡು; ಸಾಷ್ಟಾಂಗಮಾಡು sāṣṭānga māḍu to prostrate the body reverentially so as to touch the ground with the hands, breast, forehead, knees, and feet."]}], "ಸಾಷ್ಟಾಂಗತ": [{"type": "noun", "defs": ["= ಸಾಷ್ಟಾಂಗ2."]}], "ಸಾಷ್ಟಾಂಗನಮಸ್ಕಾರ": [{"type": "noun", "defs": ["= ಸಾಷ್ಟಾಂಗ2."]}], "ಸಾಷ್ಟಾಂಗಪ್ರಣಾಮ": [{"type": "noun", "defs": ["= ಸಾಷ್ಟಾಂಗ2."]}], "ಸಾಷ್ಟಾಂಗಮೆಱಗು": [{"type": "verb", "defs": ["= ಸಾಷ್ಟಾಂಗಮಾಡು."]}], "ಸಾಷ್ಟಾಂಗವೆರಗು": [{"type": "verb", "defs": ["= ಸಾಷ್ಟಾಂಗಮಾಡು."]}], "ಸಾಷ್ಟಾಂಗವೆಱಗು": [{"type": "verb", "defs": ["= ಸಾಷ್ಟಾಂಗಮಾಡು."]}], "ಸಾಸ": [{"type": "noun", "defs": ["a bold, usu. risky undertaking; a hazardous action; an adventure.", "the quality of being bold, brave, valorous."]}, {"type": "noun", "defs": ["the air taken in to the lungs and let out; breath.", "the act of exhaling."]}], "ಸಾಸತ": [{"type": "adjective", "defs": ["(correctly, ಶಾಶ್ವತ) lasting for ever; ceaseless; ever continuing."]}, {"type": "noun", "defs": ["(correctly, ಶಾಶ್ವತ) 1. that which is eternal.", "the quality of being eternal."]}], "ಸಾಸದ": [{"type": "adjective", "defs": ["= ಸಾಸತ1."]}, {"type": "noun", "defs": ["= ಸಾಸತ2."]}], "ಸಾಸನ": [{"type": "noun", "defs": ["(correctly, ಶಾಸನ) 1. the act of ruling a state or nation; rule.", "an order; a direction; a mandate; a command.", "an authoritative regulation, rule.", "the right, virtuous manner of conducting; righteousness.", "anything that is written down and preserved as evidence; anything that serves as evidence of an event; a record.", "a punishing or being punished.", "a penalty imposed on an offender for a crime or wrongdoing; punishment; chastisement.", "a controlling or being controlled; control; restraint.", "the process of training and developing the knowledge, skill and character; education.", "the act of inscribing; inscription.", "something inscribed or engraved (as on metal plates, stones, etc.); an inscription.", "a written contract or agreement (as entered between two or more parties)."]}], "ಸಾಸನಂಗೊಡು": [{"type": "verb", "defs": ["to give an order; to order."]}], "ಸಾಸನಿಗ": [{"type": "noun", "defs": ["he who is ordered, commanded."]}], "ಸಾಸವಾಸಿ": [{"type": "noun", "defs": ["a man renowned for his courage, bravery, adventure."]}], "ಸಾಸವೆ": [{"type": "noun", "defs": ["= ಸಾಸಿವೆ."]}], "ಸಾಸಿ": [{"type": "noun", "defs": ["= ಸಾಸಿಗ2 - 1 & 2."]}], "ಸಾಸಿಗ": [{"type": "adjective", "defs": ["willing to take chances; daring; adventurous.", "brave, valorous."]}, {"type": "noun", "defs": ["a daring and adventurous man.", "a valorous man.", "a man who acts, respondsng rashly, impetuously.", "a fool; a stupid fellow."]}], "ಸಾಸಿಮೆ": [{"type": "noun", "defs": ["= ಸಾಸಿವೆ."]}], "ಸಾಸಿರ": [{"type": "adjective", "defs": ["= ಸಾವಿರ1."]}, {"type": "noun", "defs": ["= ಸಾವಿರ2."]}], "ಸಾಸಿರಕಣ್ಣ": [{"type": "noun", "defs": ["an epithet of Indra, the chief of gods."]}], "ಸಾಸಿರಗಣ್ಣ": [{"type": "noun", "defs": ["= ಸಾಸಿರಕಣ್ಣ."]}], "ಸಾಸಿರಗದಿರ": [{"type": "noun", "defs": ["the sun, from whom emanates innumerable rays.", "Viṣṇu who has innumerable hands."]}], "ಸಾಸಿರ್ಗಣ್ಣ": [{"type": "noun", "defs": ["= ಸಾಸಿರಕಣ್ಣ."]}], "ಸಾಸಿರಗೆಯ್ಯ": [{"type": "noun", "defs": ["= ಸಾಸಿರಗದಿರ."]}], "ಸಾಸಿರದಲೆಯ": [{"type": "noun", "defs": ["Ādiśeṣa, who has one thousand (or innumerable) hoods."]}], "ಸಾಸಿರ್ಗೈಯ": [{"type": "noun", "defs": ["= ಸಾಸಿರಗದಿರ."]}], "ಸಾಸಿರ್ದಲೆಯ": [{"type": "noun", "defs": ["= ಸಾಸಿರದಲೆಯ."]}], "ಸಾಸಿರ್ಮಡಿ": [{"type": "adjective", "defs": ["(more by) one thousand times."]}, {"type": "noun", "defs": ["the quantity, extent, number that is one thousand times more than the given quantity, extent, number, etc."]}], "ಸಾಸಿರ್ಮಡಿಸು": [{"type": "verb", "defs": ["to increase or to become more by one thousand times."]}], "ಸಾಸಿರ್ಮೆ": [{"type": "adverb", "defs": ["one thousand times."]}], "ಸಾಸಿವೆ": [{"type": "noun", "defs": ["the plant Brassica juncea of Brassicaceae family; mustard plant.", "its small, black seed used as a spice; mustard.", "oil extracted from mustard seeds.", "a kind of vegetable curry made using this oil.", "a very minute unit of weight, equal to the weight of one mustard seed.", "a very small unit of linear measure equal to the diametre of a mustard seed."]}], "ಸಾಸಿವೆಗದಡು": [{"type": "noun", "defs": ["a mixture of ground mustard seed and water, that gives offensive smell, used to throw on enemies."]}], "ಸಾಸಿವೆಹಾಲು": [{"type": "noun", "defs": ["= ಸಾಸಿವೆಗದಡು."]}], "ಸಾಸಿಸು": [{"type": "verb", "defs": ["to end another's life; to kill; to murder."]}], "ಸಾಸುವೆ": [{"type": "noun", "defs": ["= ಸಾಸಿವೆ."]}], "ಸಾಸುವೆಬದನೆಗಾಯಿ": [{"type": "noun", "defs": ["a kind of curry made using brinjal, mustard, etc."]}], "ಸಾಸ್ನ": [{"type": "noun", "defs": ["a loose fold of skin hanging from the throat of cattle and certain other animals; the dewlap."]}], "ಸಾಹಚರ್ಯ": [{"type": "noun", "defs": ["companionship; association; intercourse."]}], "ಸಾಹಣ": [{"type": "noun", "defs": ["the act, process of taming, rearing and training of horses.", "a building where elephants, horses are sheltered and fed; a stable."]}], "ಸಾಹಣಿ": [{"type": "noun", "defs": ["a man or boy whose job is tend, feed, and curry horses; a groom.", "a keeper of an elephant.", "a horse-rider.", "the chief or commander of a cavalry."]}], "ಸಾಹಣಿಗ": [{"type": "noun", "defs": ["= ಸಾಹಣಿ - 1 & 2."]}], "ಸಾಹಣಿತಿ": [{"type": "noun", "defs": ["the wife of a horse-keeper or elephant-keeper."]}]}