{"ಗುಟ್ಟರಿಕೆ": [{"type": "noun", "defs": ["= ಗುಟುರು2."]}], "ಗುಟ್ಟರು": [{"type": "noun", "defs": ["= ಗುಟುರು2."]}], "ಗುಟ್ಟಳಿ": [{"type": "verb", "defs": ["(a secret) to be divulged, made known to others; to disclose; to reveal.", "(fig.) (one's potential, innate capacity, weak points) to be known by his rivals, resulting in one becoming weak."]}], "ಗುಟ್ಟಿ": [{"type": "noun", "defs": ["a mixture of medicine of such a quantity as can be easily swallowed even by children; a tablet."]}, {"type": "noun", "defs": ["a wild boar or swine (Sus scrofa) (esp. female).", "the plant Tacca integrifolia of Taccaceae family.", "its bulbous root."]}], "ಗುಟ್ಟಿಗಟ್ಟು": [{"type": "verb", "defs": ["to form ( a medicine etc.) into pills."]}], "ಗುಟ್ಟಿಗೆ": [{"type": "noun", "defs": ["= ಗುಟಿಕೆ.", "anything that is round or globular.", "an archaic coin.", "a false statement; a lie."]}], "ಗುಟ್ಟು": [{"type": "noun", "defs": ["a secret - a) something kept hidden or unexplained; b) something kept from the knowledge of others or shared only confidentially with a few; c) a method, formula, process or technique used in an art or a manufacturing operation and divulged only to those of one's own company or craft.", "(fig.) innate strength or capacity; something potential; a potentiality.", "ಗುಟ್ಟು ಬಿಟ್ಟುಕೊಡು guṭṭu biṭṭu koḍu to expose one's secret (esp. in breach of trust); ಗುಟ್ಟು ರಟ್ಟಾಗು guṭṭu raṭṭā gu (a secret) to be divulged; to become known to others; ಗುಟ್ಟು ರಟ್ಟುಮಾಡು guṭṭu raṭṭu māḍu = ಗುಟ್ಟು ಬಿಟ್ಟುಕೊಡು."]}], "ಗುಟ್ಟುಗಟ್ಟು": [{"type": "verb", "defs": ["= ಗುಟ್ಟುಮಾಡು."]}], "ಗುಟ್ಟುಗಾಣಿಸು": [{"type": "verb", "defs": ["to divulge a secret."]}], "ಗುಟ್ಟುಗಾರ": [{"type": "noun", "defs": ["a man who does not leak out secrets."]}], "ಗುಟ್ಟುಗೊಲೆ": [{"type": "noun", "defs": ["a killing the cause or the doeṛs identification of which remains unknown."]}], "ಗುಟ್ಟುನೆರೆ": [{"type": "verb", "defs": ["to meet or assemble in secret."]}], "ಗುಟ್ಟುಮಾಡು": [{"type": "verb", "defs": ["to keep (something) from otherś knowledge; to maintain a secret or secrets."]}], "ಗುಟ್ಟುಮಾತು": [{"type": "noun", "defs": ["something said, conveyed which is to be kept as a secret."]}], "ಗುಟ್ಟೆ": [{"type": "noun", "defs": ["= ಗುಟ್ಟ."]}, {"type": "noun", "defs": ["the plant Cissampelos pareira ( = C. convolvulaceae family) of Menispermaceae family."]}], "ಗುಡ": [{"type": "noun", "defs": ["a dark, crude sugar from the sap of sugarcane; jaggery.", "anything that is round or globular in shape, as a ball.", "an armour that covers the back and the sides of a horse or elephant."]}], "ಗುಡಗುಡಿ": [{"type": "noun", "defs": ["a kind of water pipe with a long flexible tube for drawing the smoke through water in a vase or bowl and cooling it; a narghile; a hookah."]}], "ಗುಡಜೀರಿಗೆ": [{"type": "noun", "defs": ["a mixture of jaggery and cumin seeds poured on the heads of each other by the bride and groom during their marriage."]}], "ಗುಡಪಾಕ": [{"type": "noun", "defs": ["a thick, viscous, adhesive solution of jaggery and water, boiled together, used in making many sweet dishes."]}], "ಗುಡಪಾನ": [{"type": "noun", "defs": ["a drink made of jaggery (and with lime, elephant apple, etc.)."]}], "ಗುಡಪಾಲ": [{"type": "noun", "defs": ["= ಗುಡಹಾಲೆ."]}], "ಗುಡಪುಷ್ಪ": [{"type": "noun", "defs": ["the tree Madhuca indica ( = Bassia latifolia) of Sapotaceae family; Indian butter tree."]}], "ಗುಡಫಲ": [{"type": "noun", "defs": ["the tree Careya arborea of Myrtaceae family.", "the tree Cordia latifolia of Boraginaceae family."]}], "ಗುಡಮೇಟಕೆ": [{"type": "noun", "defs": ["the plant Cissus adnata of Vitaceae family; woolly heart vine."]}], "ಗುಡಲು": [{"type": "noun", "defs": ["a little, crude house with a thatched roof."]}], "ಗುಡವಾಣ": [{"type": "noun", "defs": ["= ಗುಡಾಣ."]}], "ಗುಡವಿಕಾರ": [{"type": "noun", "defs": ["a kind of jaggery."]}], "ಗುಡಸು": [{"type": "noun", "defs": ["that which is round, globular or curved.", "(gram.) a sign affixed to a consonant to indicate the vowel sound 'i' (as in bit, kit, etc. of English)."]}], "ಗುಡಹಾಲೆ": [{"type": "noun", "defs": ["the plant Securinega virosa ( = Flueggea microcarpa) of Euphorbiaceae family."]}], "ಗುಡಾಕು": [{"type": "noun", "defs": ["a kind of tobacco preparation made using jaggery, scent, and an intoxicant."]}], "ಗುಡಾಕೆ": [{"type": "noun", "defs": ["= ಗುಡಾಕು."]}], "ಗುಡಾಕೇಶ": [{"type": "noun", "defs": ["he who has a thick growth of hair.", "Křṣṇa.", "Arjuna, the hero in the epic Mahābhārata.", "Śiva."]}], "ಗುಡಾಖು": [{"type": "noun", "defs": ["= ಗುಡಾಕು."]}], "ಗುಡಾಣ": [{"type": "noun", "defs": ["a big earthen container for storing grain.", "(satr.) a protruding belly; a potbelly."]}], "ಗುಡಾರ": [{"type": "noun", "defs": ["a portable shelter consisting of canvas, skins, etc. stretched over poles and attached to stakes; a tent.", "a thick cloth or canvas."]}], "ಗುಡಾರಗಟ್ಟು": [{"type": "noun", "defs": ["a tent-like structure, either permanent or temporary, on the top of a building; a tent-like roof."]}], "ಗುಡಾರು": [{"type": "noun", "defs": ["= ಗುಡಾರ."]}], "ಗುಡಾರೆ": [{"type": "noun", "defs": ["= ಗುಡಾರ."]}], "ಗುಡಾಳಕ": [{"type": "noun", "defs": ["= ಗುಡಾಕೇಶ."]}], "ಗುಡಿ": [{"type": "noun", "defs": ["an apparent ring of light encircling the sun, moon or other luminous body, caused by refraction of light through ice crystals in our atmosphere; a halo.", "a large number of things being or collected together; a mass; a collection."]}, {"type": "noun", "defs": ["the peak of a mountain.", "a flag, banner.", "a pole planted in front of the house on the new yeaṛs day.", "the festival observed on that day."]}, {"type": "noun", "defs": ["a house, residence.", "a building for the worship of a god, where an idol of that god is installed; a temple.", "a drapery, awning or other roof-like covering, often a decorative one, fastened above a roof, pandal, etc. or held on poles.", "the work of engraving on or making dolls and other handicraft works from, wood.", "the act or profession of paining, colouring."]}, {"type": "noun", "defs": ["a covering for the face or part of the face; a mask."]}], "ಗುಡಿಕ": [{"type": "noun", "defs": ["the annual herb Coriandrum sativum of Apiaceae family; the coriander plant.", "its strong-smelling, seedlike fruit, used in flavouring food and liquors, and, formerly, in medicines; coriander."]}], "ಗುಡಿಕಟ್ಟಿಸು": [{"type": "verb", "defs": ["= ಗುಡಿಗಟ್ಟಿಸು."]}], "ಗುಡಿಕಟ್ಟು": [{"type": "verb", "defs": ["= ಗುಡಿಗಟ್ಟು1."]}, {"type": "verb", "defs": ["= ಗುಡಿಗಟ್ಟು2."]}, {"type": "verb", "defs": ["= ಗುಡಿಗಟ್ಟು3."]}], "ಗುಡಿಕಾರ": [{"type": "noun", "defs": ["= ಗುಡಿಗಾರ."]}], "ಗುಡಿಕೈಗಾರಿಕೆ": [{"type": "noun", "defs": ["the occupation or work of wood carving and making dolls and other handicraft items from wood.", "a manufacturing activity, on a small scale, carried on by a person or the family members in his or her house; a cottage industry."]}], "ಗುಡಿಗಟ್ಟಿಸು": [{"type": "verb", "defs": ["to cause to raise aloft a banner on a long pole (on a joyous or festival occasion); to make (a person) hoist a flag.", "to celebrate a joyous occasion.", "to cause or produce horripilation."]}], "ಗುಡಿಗಟ್ಟು": [{"type": "verb", "defs": ["to form a circle around; to form a halo.", "to move around, as in a circle.", "to cover from all sides (as in an attack).", "to make into a bundle; to tie or wrap together."]}, {"type": "verb", "defs": ["to raise aloft a banner on a long pole (on a joyous or festival occasion); to hoist a flag.", "(the hair on the body) to be erect (as from excessive joy).", "to get up; to stand or assume a vertical position; to rise.", "to feel pleasure or joy; to be gladdened."]}, {"type": "verb", "defs": ["to construct a building for public worship; to build a temple.", "to become firm and strong.", "to cover or decorate with paint; to colour; to paint."]}, {"type": "noun", "defs": ["the structure of a temple building."]}], "ಗುಡಿಗಾರ": [{"type": "noun", "defs": ["a man whose profession is making of dolls and other handicraft items out of wood; a carver or turner.", "an artist who paints pictures or a man whose work is covering surfaces, as walls, with paint; a painter."]}], "ಗುಡಿಗಾರಿಕೆ": [{"type": "noun", "defs": ["the art or profession of making dolls and other handicraft items out of wood."]}], "ಗುಡಿಗಿ": [{"type": "noun", "defs": ["= ಗುಡಿಗಿಚಲ್ಲಣ."]}], "ಗುಡಿಗಿಚಣ್ಣ": [{"type": "noun", "defs": ["= ಗುಡಿಗಿಚಲ್ಲಣ."]}], "ಗುಡಿಗಿಚಲ್ಲಣ": [{"type": "noun", "defs": ["trousers reaching to or just below the knees and often tapered to fit closely; breeches."]}], "ಗುಡಿಗುಂಡಾರ": [{"type": "noun", "defs": ["(in pl.) buildings, as houses and temples."]}], "ಗುಡಿಗುಡಿ": [{"type": "noun", "defs": ["a kind of water pipe with a long flexible tube for drawing the smoke through water in a vase or bowl and cooling it; a narghile; a hookah."]}], "ಗುಡಿಗುಮ್ಮ": [{"type": "noun", "defs": ["(dial.) a ghost which is believed to come covering its face."]}, {"type": "noun", "defs": ["a kind of animal."]}], "ಗುಡಿಗೂಡಾರ": [{"type": "noun", "defs": ["= ಗುಡಿಗುಂಡಾರ."]}], "ಗುಡಿಗೂಱು": [{"type": "verb", "defs": ["to sag, bend, curve or shrink (oneself) from the weight."]}], "ಗುಡಿಗೊಳ್": [{"type": "verb", "defs": ["(fig.) to become renowned, famous."]}], "ಗುಡಿಗೊಳಿಸು": [{"type": "verb", "defs": ["to make a temple; to convert a building into a temple."]}], "ಗುಡಿಗೋಪುರ": [{"type": "noun", "defs": ["the tower of a temple.", "(used in pl.) temples and shrines."]}], "ಗುಡಿಚಾಪೆ": [{"type": "noun", "defs": ["the household belongings of a person.", "ಗುಡಿಚಾಪೆ ಕಟ್ಟಿಸು guḍi cāpe kaṭṭisu to drive away a person, with household belongings, from one's place of dwelling; to cause to flee; ಗುಡಿಚಾಪೆ ಕಟ್ಟು guḍi cāpe kaṭṭu = ಗುಡಿಚಾಪೆ ಕಿತ್ತು; ಗುಡಿಚಾಪೆ ಕಿತ್ತು guḍi cāpe kittu to run away, with household belongings, from one's place of dwelling; to flee."]}], "ಗುಡಿದುಂಬಿಸು": [{"type": "verb", "defs": ["to ceremonially bring back the idol of a deity into a temple."]}], "ಗುಡಿದೇವ": [{"type": "noun", "defs": ["the idol installed in a temple; the main one among several idols of a temple."]}], "ಗುಡಿಪಾಡವ": [{"type": "noun", "defs": ["= ಗುಡಿಪಾಡಿವ."]}], "ಗುಡಿಪಾಡಿವ": [{"type": "noun", "defs": ["the first day of a year, on which a pole is planted in front of the house.", "the festival observed on that day."]}], "ಗುಡಿಬಳಸು": [{"type": "noun", "defs": ["the area in between the main building of a temple and the wall encircling it."]}], "ಗುಡಿಬಿಡು": [{"type": "verb", "defs": ["to set up a camp; to live somewhere temporarily, esp. while travelling."]}], "ಗುಡಿಮೊನೆ": [{"type": "noun", "defs": ["the hemispherical or conical structure, with or without covered by a metal plate, on the top of the sanctum sanctorum of a temple."]}], "ಗುಡಿಯಿಸು": [{"type": "verb", "defs": ["= ಗುಡಿಸು1."]}], "ಗುಡಿಯಿಱಿ": [{"type": "verb", "defs": ["to come together or gather in large numbers.", "to be piled up, heaped up."]}, {"type": "verb", "defs": ["to stand erect or set up oneself in an upright position (as hairs of the head or body)."]}], "ಗುಡಿರಿ": [{"type": "verb", "defs": ["(dial.) to exceed the normal limits; to become excess."]}], "ಗುಡಿಲ್": [{"type": "noun", "defs": ["= ಗುಡಿಸಲು."]}], "ಗುಡಿಲು": [{"type": "noun", "defs": ["= ಗುಡಿಸಲು."]}], "ಗುಡಿವಣ": [{"type": "noun", "defs": ["a contribution of money made or to be made to a temple."]}], "ಗುಡಿವಿಡಿ": [{"type": "verb", "defs": ["to uphold a banner; to hold a flag aloft."]}], "ಗುಡಿವಿಡಿಸು": [{"type": "verb", "defs": ["to cause to hold a banner aloft."]}], "ಗುಡಿವ್ರಜ": [{"type": "noun", "defs": ["a number of tents put up closely; a cluster of tents."]}], "ಗುಡಿಸಲ್": [{"type": "noun", "defs": ["= ಗುಡಿಸಲು."]}], "ಗುಡಿಸಲು": [{"type": "noun", "defs": ["a little, crude house with a thatched roof."]}], "ಗುಡಿಸಿಲ್": [{"type": "noun", "defs": ["= ಗುಡಿಸಲು."]}], "ಗುಡಿಸಿಲು": [{"type": "noun", "defs": ["= ಗುಡಿಸಲು."]}], "ಗುಡಿಸು": [{"type": "verb", "defs": ["to gather and pile up (at one place).", "to clear or clean (a surface, room, etc.) as by brushing with a broom; to sweep; to broom.", "to destroy complete; to erase; to obliterate.", "ಗುಡಿಸಿ ಗುಂಡಾಂತರ ಮಾಡು guḍisi guṇḍāntara māḍu (fig.) to obliterate, destroy with a trace; 2. (fig.) to impoverish or make bankrupt; to cause to incur heavy loss."]}, {"type": "noun", "defs": ["= ಗುಡಿಸಲು."]}, {"type": "noun", "defs": ["that which is round, globular or curved.", "(gram.) a sign affixed to a consonant to indicate the vowel sound ಇ (similar to the sound of vowel in English words as bit, kit, etc.); ಗುಡಿಸಿನ ದೀರ್ಘ guḍisina dīrgha (gram.) a sign affixed to a consonant to indicate the long vowel sound ಈ (similar to the sound of vowel in English words as beat, meet, etc.)."]}], "ಗುಡಿಸೆಟ್ಟಿ": [{"type": "noun", "defs": ["a woman or girl who engages in sexual activity for payment; a whore; a harlot; a prostitute."]}], "ಗುಡಿಹುಲ್ಲು": [{"type": "noun", "defs": ["the grass Chloris virgata of Poaceae family."]}], "ಗುಡುಂಬ": [{"type": "noun", "defs": ["sliced mango, Indian goose berry (of Phyllanthus emblica), etc. kept in the sugar or jaggery syrup."]}], "ಗುಡುಗಾಟ": [{"type": "noun", "defs": ["= ಗುಡುಗು2."]}], "ಗುಡುಗಾಡಿಸು": [{"type": "verb", "defs": ["= ಗುಡುಗಾಡು."]}], "ಗುಡುಗಾಡು": [{"type": "verb", "defs": ["to utter a loud, deep, rumbling sound, in anger; to roar.", "to shout at; to reprimand; to rebuke severely.", "to shout (as to frighten)."]}], "ಗುಡುಗಿಸು": [{"type": "verb", "defs": ["to cause to roar (in pain or anger).", "to carry out, conduct an occasion in a pompous, magnificent manner."]}], "ಗುಡುಗು": [{"type": "verb", "defs": ["(clouds) to produce thunder.", "(in kabaḍḍi) to play in the opponentś court repeating the word 'kabaḍḍi' in quick succession and in a single breath, while trying to touch one or more members of that team.", "to shout at the top of one's voice or in a rumbling voice (to snub, frighten another or others)."]}, {"type": "noun", "defs": ["a loud rumbling or crashing noise heard after a lightning flash that is due to the expansion of rapidly heated air; thunder.", "a team pursuit game popular in the north of the Indian subcontinent in which the two teams alternately send a player into the opposing team's court to try to touch one of the opponents while repeating the word 'kabaddi' (to show that the breath is being held as the rules require); kabaddi.", "(fig.) the roaring sound made in anger; a loud and sharp reprimand; a shouting at."]}], "ಗುಡುಗುಟ್ಟು": [{"type": "verb", "defs": ["= ಗುಡುಗು1."]}], "ಗುಡುಗುಡನೆ": [{"type": "adverb", "defs": ["with a deep, rumbling sound.", "(used to modify the verb 'ruṇ) quickly; swiftly."]}], "ಗುಡುಗುಡಿ": [{"type": "noun", "defs": ["a kind of water pipe with a long flexible tube for drawing the smoke through water in a vase or bowl and cooling it; a narghile; a hookah."]}], "ಗುಡುಗುಡಿಸು": [{"type": "verb", "defs": ["= ಗುಡುಗು1.", "(the flowing water) to make a bubbling or rippling sound, while running."]}], "ಗುಡುಗುಡು": [{"type": "noun", "defs": ["the thundering sound that follows a lightning flash.", "a sound imitating it."]}], "ಗುಡುಗುಹಾಕು": [{"type": "verb", "defs": ["= ಗುಡುಗು1 - 3."]}], "ಗುಡುಗೂರಿಸು": [{"type": "verb", "defs": ["to cause to bend, sag or shrink."]}], "ಗುಡುಗೂರು": [{"type": "verb", "defs": ["to sag, bend, curve or shrink (oneself) as from the weight."]}], "ಗುಡುಗೂಱು": [{"type": "noun", "defs": ["= ಗುಡುಗೂರು."]}], "ಗುಡುಮಿ": [{"type": "noun", "defs": ["= ಗುಡುವಣ."]}], "ಗುಡುಲು": [{"type": "noun", "defs": ["= ಗುಡಿಸಲು."]}], "ಗುಡುವಣ": [{"type": "noun", "defs": ["a big earthen container for storing grain."]}], "ಗುಡುವನ": [{"type": "noun", "defs": ["= ಗುಡುವಣ."]}], "ಗುಡುಸಲು": [{"type": "noun", "defs": ["= ಗುಡಿಸಲು."]}], "ಗುಡುಸು": [{"type": "noun", "defs": ["that which is round, globular or curved.", "(gram.) a sign affixed to a consonant to indicate the vowel sound i (as in words bit, kit, etc. of English)."]}], "ಗುಡುಸೆಟ್ಟಿ": [{"type": "noun", "defs": ["= ಗುಡಿಸೆಟ್ಟಿ."]}], "ಗುಡುಹ": [{"type": "noun", "defs": ["a dark, crude sugar from the sap of sugarcane; jaggery."]}], "ಗುಡೂಚಿ": [{"type": "noun", "defs": ["the creeper Tinosporia cordifolia ( = Menispermum cordifolium, = Cocculus cordifolius) of Menispermaceae family; moon creeper.", "the plant Cissampelos pareira ( = C. convolvulaceae) of Menispermaceae family; false pareira root."]}], "ಗುಡೆ": [{"type": "noun", "defs": ["a small rounded mass of medicine to be swallowed whole; a pill.", "anything that is round, as a vessel, water-mug, etc.", "the plant Euphorbia antiquorum of Euphorbiaceae family, with milk juice and minute, simplified flowers borne in cuplike inflorescences; a kind of spurge.", "the cotton plant (Gossypium herbaceum of Malvaceae family).", "ಗುಡೆ ಹೊಡೆ guḍe hoḍe to lift water with a mug."]}], "ಗುಡೋದಕ": [{"type": "noun", "defs": ["a drink made of jaggery (and with lime, elephant apple, etc.)."]}], "ಗುಡ್ಡ": [{"type": "noun", "defs": ["a man of abnormally small stature; a dwarf.", "a young man; a boy.", "(masc.) a person, esp. a young person, who is being taught under the supervision of a teacher; a pupil.", "(dial.) a male calf; a young bull."]}, {"type": "noun", "defs": ["a small hill; a hillock; a mound.", "a collection of things lying haphazardly one on another; a pile; a heap.", "ಗುಡ್ಡ ಕಡಿ guḍḍa kaḍi (sarc.) to do something that is great or extraordinary; ಗುಡ್ಡಕ್ಕೆ ಕಲ್ಲು ಹೊರು guḍḍakke kallu horu (prov.) it is no use carrying coal to New Castle; ಗುಡ್ಡದಇಪ್ಪೆ guḍḍada ippe the medium-sized, deciduous tree Careya arborea of Myrtaceae family; ಗುಡ್ಡದಗೋಣಿ guḍḍada gōṇi the tree Alangium Lamarckii of Alangiaceae family; 2. another tree Alangium salviifolium (var. hexapetalum) of the same family; ಗುಡ್ಡದನೆಲ್ಲಿ guḍḍada nelli the tree Rhodomyrtus tomentosa of Myrtaceae family; 2. its berry; hill goose berry."]}], "ಗುಡ್ಡಕಾಡು": [{"type": "noun", "defs": ["= ಗುಡ್ಡಗಾಡು."]}], "ಗುಡ್ಡಗಾಡು": [{"type": "noun", "defs": ["a region full of hills or rugged, uneven surface; a mountainous region."]}], "ಗುಡ್ಡಗೆಣಸು": [{"type": "noun", "defs": ["the plant Ipomoea digitata of Convolvulaceae family.", "its yam; milky yam; red sweet potato."]}], "ಗುಡ್ಡಗೊಂಬು": [{"type": "noun", "defs": ["a small or short branch of a tree.", "a short horn (as of a cattle)."]}], "ಗುಡ್ಡದುಂಬೆ": [{"type": "noun", "defs": ["the plant Leucas helianthemifolia of Lamiaceae family; white dead-nettle."]}], "ಗುಡ್ಡನೇರಳೆ": [{"type": "noun", "defs": ["the tree Elaeocarpus lancaefolius of Elaeocarpaceae family."]}], "ಗುಡ್ಡಪನ್ನೇರಲು": [{"type": "noun", "defs": ["= ಗುಡ್ಡಪನ್ನೇರಳೆ."]}], "ಗುಡ್ಡಪನ್ನೇರಳು": [{"type": "noun", "defs": ["= ಗುಡ್ಡಪನ್ನೇರಳೆ."]}], "ಗುಡ್ಡಪನ್ನೇರಳೆ": [{"type": "noun", "defs": ["the tree Syzygium zeylanicum ( = Eugenia zeylanica) of Myrtaceae family; Ceylon black plum tree.", "its plum."]}], "ಗುಡ್ಡರೆಂಜೆ": [{"type": "noun", "defs": ["the tree Elaeocarpus oblongus of Elaeocarpaceae family."]}], "ಗುಡ್ಡವೋಮ": [{"type": "noun", "defs": ["the plant Chenopodium ambrosioides of Chenopodiaceae family, whose seeds are used in medicine as a remedy for worms; American wormseed."]}], "ಗುಡ್ಡಸೋಂಪು": [{"type": "noun", "defs": ["the biennial plant Apium graveolens of Apiaceae family, whose long, crisp leafstalks are eaten as vegetable; garden celery."]}], "ಗುಡ್ಡಿ": [{"type": "noun", "defs": ["that which is short in height.", "a woman of abnormally small stature; a dwarfish woman.", "a girl or a woman whois being taught under the supervision of a teacher; a female pupil."]}], "ಗುಡ್ಡಿಸು": [{"type": "verb", "defs": ["to bend (oneself) down or shrink; to reduce one's size."]}], "ಗುಡ್ಡು": [{"type": "noun", "defs": ["= ಗುಡ್ಡ1; 5) a young of any animal."]}, {"type": "noun", "defs": ["= ಗುಡ್ಡೆ3."]}, {"type": "noun", "defs": ["that which cannot produce offspring; a barren female (as a sterile woman, animal or plant).", "that which is ineffectual, not producing the desired effect."]}, {"type": "noun", "defs": ["= ಗುಡ್ಡುಬಿಳಿದು."]}, {"type": "adjective", "defs": ["that cannot produce offspring; sterile; barren.", "not bearing or pregnant at the regular time (said of animals or plants).", "not producing crops or fruit; having little or no vegetation.", "not bringing useful results; unproductive; unprofitable.", "lacking in vitality; sapless.", "lacking appeal, interest or meaning; dull; boring.", "superstitious - a) of, characterised by or resulting from superstition; b) having superstitions."]}], "ಗುಡ್ಡುಬಿಳಿದು": [{"type": "noun", "defs": ["a kind of rice."]}], "ಗುಡ್ಡೆ": [{"type": "noun", "defs": ["= ಗುಡ್ಡ2."]}, {"type": "noun", "defs": ["an oblong piece of cloth used to cover the lower part of the body or as a head-dress."]}, {"type": "noun", "defs": ["the ball-shaped part of the eye, enclosed by the socket and eyelids; the eye-ball.", "an egg (of a bird or any oviparous animal)."]}], "ಗುಡ್ಡೆಗಣ್ಣು": [{"type": "noun", "defs": ["an eye which is protruding or projecting out."]}], "ಗುಡ್ಡೆಣಿಕೆ": [{"type": "noun", "defs": ["an unrealised expectation, desire etc."]}], "ಗುಡ್ಡೆಣಿಸು": [{"type": "verb", "defs": ["to think, bother or worry about (something) in vain."]}], "ಗುಡ್ಡೇಟು": [{"type": "noun", "defs": ["a hit, stroke, shot etc. which hits the target perfectly.", "a successful effort.", "ಅಡ್ಡೇಟಿನ ಮೇಲೆ ಒಂದು ಗುಡ್ಡೇಟು aḍḍēṭina mēla ondu guḍḍēṭu (prov.) an aimless or doubtful try that brings benefit by chance."]}], "ಗುಣ": [{"type": "noun", "defs": ["any of the features that make something what it is; a distinctive attribute or faculty; a characteristic trait.", "basic nature; character; kind.", "the degree of excellence which a thing possesses.", "any of the qualities as excellence, superiority, magnanimity, wisdom, etc.", "any of the three classes of fundamental qualities (that are characterised as - a) virtue, merit, excellence, b) dynamism, vigour, and c) ignorance, wickedness, excessive selfishness).", "a single thread or string.", "the string of a bow.", "the string of a musical instrument.", "the subject of the five sense organs of the body (ear, skin, eye, tongue and nose).", "the intrinsic value.", "the fact of being healing or being healed; restoration to health or a sound condition.", "any of the spicy dishes used as a side dish along with the main one.", "the quality that makes an eatable acceptable or rejective.", "the quantity obtained by multiplying two quantities together; (so many fold, times, etc.).", "a numerical or alphabetical award denoting excellence, conduct, proficiency, etc.; a mark.", "a symbol for the number three.", "17 (Math.) the process of finding the number or quantity (product) obtained by repeated additions of a specified number or quantity (multiplicand) a specified number of times (multiplier); multiplication.", "(gram.) any of the three vowels, ಅ,ಏ, ಓ that is of secondary or subordinate gradation.", "(gram) a kind of euphonic combination(as ಇ or ಈ following ಅ or ಆ resulting in the vowel sound ಏ).", "(rhet.) the quality that inspires, sublimates the sentiment or sentiments of a literary work or adds elegance to it.", "any of the eight types of mystical or yogic accomplishments.", "proper course of action in politics; political wisdom.", "(astrol.) a point allotted to each of the aspects in the horoscopes of the bride and groom, based on the total or tally of which the future of their marriage is predicted.", "a man who prepares food; a cook.", "ಗುಣಕಱುಗೊೞ್ guṇakaṛugoḷ to be loved."]}], "ಗುಣಂಗೆಡು": [{"type": "verb", "defs": ["(normal or good qualities) to be lost; to (morally) decline.", "to lose normal or higher qualities; to become debased morally, culturally, etc."]}], "ಗುಣಂಗೊಳ್": [{"type": "verb", "defs": ["to praise, applaud (another's) good quality or qualities.", "to acquire good quality or qualities."]}], "ಗುಣಂಗೊಳಿಸು": [{"type": "verb", "defs": ["to please (another) with one's good qualities, nature."]}], "ಗುಣಕ": [{"type": "noun", "defs": ["= ಗುಣಕು."]}, {"type": "noun", "defs": ["one who calculates or keeps accounts.", "(math.) the number by which another number is or is to be, multiplied; a multiplier."]}], "ಗುಣಕಥನ": [{"type": "noun", "defs": ["= ಗುಣಗಾನ."]}], "ಗುಣಕರ": [{"type": "noun", "defs": ["= ಗುಣಕಾರ."]}], "ಗುಣಕಾರ": [{"type": "noun", "defs": ["that which causes or helps (one) to acquire good qualities.", "(math.) the arithmetical process of obtaining from (a number) another that is a specified number of times its value; multiplication."]}], "ಗುಣಕಾರಿ": [{"type": "adjective", "defs": ["healing or capable of healing; efficacious; effective (as a drug)."]}], "ಗುಣಕು": [{"type": "noun", "defs": ["a heavy, thick stick used as a weapon; a club.", "the snug-fitting engine part that is forced back and forth within a cylinder by the pressure of combustion, steam, etc. and a reciprocating connecting rod; a piston.", "a slender stick strung along its length with horsehairs, drawn across the strings of a violin, cello, etc. to play it; a bow.", "a short stick to play drums by beating it; a drumstick.", "(dial.) a short, thick pestle used to knead the dough for making various dishes."]}], "ಗುಣಗಣನೆ": [{"type": "noun", "defs": ["a recognising and appreciating of the qualities, character, nature or distinctive features (of another person, work, thing, etc.).", "a woman whorecognises others merit."]}], "ಗುಣಗರ್ಭ": [{"type": "noun", "defs": ["a spider that weaves a network of fine threads from the fluid secreted from its spinnerets."]}], "ಗುಣಗಾನ": [{"type": "noun", "defs": ["a praising, often exaggeratedly, of another's quality, nature, character or distinctive features; eulogy."]}], "ಗುಣಗು": [{"type": "verb", "defs": ["(rightly ಗೊಣಗು) to talk in a low, indistinct voice.", "to express one's dissent, dissatisfaction, disappointment, defiance, etc. in a low voice (often not being able to do so openly of loudly)."]}], "ಗುಣಗುಟ್ಟು": [{"type": "verb", "defs": ["= ಗುಣಗು."]}, {"type": "verb", "defs": ["(an insect) to make a hissing or buzzing sound (while flying).", "to imitate that sound."]}], "ಗುಣಗುಣಿಸು": [{"type": "verb", "defs": ["to talk in a low, indistinct voice.", "to sing with the lips closed, not producing words or in a very low tone.", "to make prolonged echoing sound."]}], "ಗುಣಗೆಡಿಸು": [{"type": "verb", "defs": ["to spoil, corrupt another's nature, quality, character, etc."]}], "ಗುಣಗೇಡಿ": [{"type": "noun", "defs": ["a person whose moral standards are deteriorated."]}], "ಗುಣಗ್ರಹಣ": [{"type": "noun", "defs": ["a recognising and appreciating of the qualities, virtues, character, nature or distinctive features (of another person, work, thing, etc.)."]}], "ಗುಣಗ್ರಾಹಿ": [{"type": "noun", "defs": ["a man who recognises others merit or virtues."]}], "ಗುಣಚ್ಛೇದಕ": [{"type": "noun", "defs": ["(masc.) one who spoils or corrupts another's character, quality or nature."]}], "ಗುಣಜ್ಞ": [{"type": "noun", "defs": ["a man who can recognise, appreciate others merit or has the discriminatory knowledge in the field of quality."]}], "ಗುಣಜ್ಞೆ": [{"type": "noun", "defs": ["a woman whocan recognise, appreciate others merit or has the discriminatory knowledge in the field of quality."]}], "ಗುಣಣೆ": [{"type": "noun", "defs": ["a hall where dance performances are or are meant to be, presented; a dancing hall.", "a hall where music concerts are or are meant to be, conducted."]}], "ಗುಣತ್ರಯ": [{"type": "noun", "defs": ["(collectively) the three classes of fundamental qualities, they being, a) virtue, merit, excellence, b) dynamism, vigour, and c) ignorance, wickedness, excessive selfishness."]}], "ಗುಣಧರ್ಮ": [{"type": "noun", "defs": ["the essential character of a thing; quality or qualities that make something what it is (including its physical, chemical, biological properties)."]}], "ಗುಣಧಾಮ": [{"type": "noun", "defs": ["a man of virtue and merit."]}], "ಗುಣಧಾಮೆ": [{"type": "noun", "defs": ["a virtuous woman; a woman of merit."]}], "ಗುಣನ": [{"type": "noun", "defs": ["(math.) the arithmetical process of obtaining from (a number) another that is a specified number of times its value; multiplication."]}], "ಗುಣನಾಮ": [{"type": "noun", "defs": ["a name or title that correctly and clearly describes or identifies or is corresponding to, the nature, quality, etc. of a person or thing."]}], "ಗುಣನಿಧಾನ": [{"type": "noun", "defs": ["= ಗುಣನಿಲಯ."]}], "ಗುಣನಿಧಿ": [{"type": "noun", "defs": ["a person of many great virtue or merits."]}], "ಗುಣನಿಯಂತ್ರಣ": [{"type": "noun", "defs": ["a system for maintaining desired standards in a product or process, esp. by inspecting samples of the product against the predetermined specifications."]}], "ಗುಣನಿಲಯ": [{"type": "noun", "defs": ["a man of many great qualities or merits."]}], "ಗುಣನಿಲಯೆ": [{"type": "noun", "defs": ["a woman of many great qualities, virtues or merits."]}], "ಗುಣನಿಳಯ": [{"type": "noun", "defs": ["= ಗುಣನಿಲಯ."]}], "ಗುಣನಿಳಯೆ": [{"type": "noun", "defs": ["= ಗುಣನಿಲಯೆ."]}], "ಗುಣನೆ": [{"type": "noun", "defs": ["= ಗುಣಣೆ."]}], "ಗುಣಪಡಿಸು": [{"type": "verb", "defs": ["to cure or get rid of a disease; to restore to health or a sound condition; to make healthy or well again; to heal."]}], "ಗುಣಪಡು": [{"type": "verb", "defs": ["(a disease) to be got rid of; to be cured."]}], "ಗುಣಪೃಷ್ಠ": [{"type": "noun", "defs": ["= ಗುಣಗರ್ಭ."]}], "ಗುಣಪ್ರಕೃತಿ": [{"type": "noun", "defs": ["(gram.) the root form of an adjective."]}], "ಗುಣಪ್ರಭ": [{"type": "noun", "defs": ["a man renowned for his virtue."]}], "ಗುಣಬ್ರಾಹ್ಮಣ": [{"type": "noun", "defs": ["a man who is, though not by birth a brāhmaṇa, regarded so because of his virtues."]}], "ಗುಣಭಾಜ": [{"type": "noun", "defs": ["a man possessing good qualities; a virtuous man."]}], "ಗುಣಮಣಿ": [{"type": "noun", "defs": ["an excellent or precious jewel.", "a most excellent person amongst virtuous persons."]}], "ಗುಣಮುಖ": [{"type": "adjective", "defs": ["regaining health, soundness of the body; being cured."]}, {"type": "noun", "defs": ["the condition of (the health, soundness of the body) being improved."]}], "ಗುಣಮೂಲಿ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಗುಣಯುತ": [{"type": "adjective", "defs": ["having qualities; not absolute.", "having good or desirable quality or qualities.", "having a string; stringed (said of a bow)."]}, {"type": "noun", "defs": ["a man having good or desirable quality or qualities.", "a bow, that has a string."]}], "ಗುಣಯುತೆ": [{"type": "noun", "defs": ["a woman having good or desirable quality or qualities."]}], "ಗುಣರತ್ನ": [{"type": "noun", "defs": ["= ಗುಣಮಣಿ."]}], "ಗುಣರಹಿತ": [{"type": "adjective", "defs": ["not having qualities; not qualified by attributes; transcending the limits of being qualified by qualities (esp. the three fundamental ones - satva, rajassu, & tamassu), attributes, etc.; absolute.", "that is deprived of the string (said of a bow)."]}, {"type": "noun", "defs": ["he who has no qualities or cannot be qualified by attributes; the Absolute that transcends the limits of being qualified by qualities, attributes, etc.", "a man lacking necessary, desirable or good quality or qualities."]}], "ಗುಣರಹಿತೆ": [{"type": "noun", "defs": ["a woman lacking necessary, desirable or good quality or qualities.", "a bow that is not stringed."]}], "ಗುಣರಾಹಿತ್ಯ": [{"type": "noun", "defs": ["the fact of being not endowed with, not having any, required, desirable or good qualities."]}], "ಗುಣಲಬ್ಛ": [{"type": "noun", "defs": ["(math.) a quantity obtained by multiplying two or more quantities together; the product."]}], "ಗುಣವಂತ": [{"type": "noun", "defs": ["he who is possessing merits, good qualities; a man who is morally sound or excellent; a righteous man."]}], "ಗುಣವಂತಿ": [{"type": "noun", "defs": ["= ಗುಣವಂತೆ."]}], "ಗುಣವಂತೆ": [{"type": "noun", "defs": ["a woman characterised by good qualities, moral virtue; a righteous woman."]}], "ಗುಣವಚನ": [{"type": "noun", "defs": ["= ಗುಣವಾಚಕ."]}], "ಗುಣವಜ್ಜನ": [{"type": "noun", "defs": ["good, virtuous or righteous people."]}], "ಗುಣವತಿ": [{"type": "noun", "defs": ["= ಗುಣವಂತೆ; 2) a spindle - a) a pin in a spinning wheel used for twisting and winding the thread; b) a small bar with tapered ends used for the same purpose in hand-spinning; c) a pin bearing the bobbin of a spinning machine."]}], "ಗುಣವರ್ಮ": [{"type": "noun", "defs": ["a man protected by his own virtue or moral merit; a virtuous, righteous man."]}], "ಗುಣವಾಚಕ": [{"type": "noun", "defs": ["any of a class of words used to modify or describe a noun or other substantive; an adjective."]}], "ಗುಣವಾಚಿ": [{"type": "noun", "defs": ["= ಗುಣವಾಚಕ."]}], "ಗುಣವಾದ": [{"type": "noun", "defs": ["the act of pointing out good qualities, merits, etc.", "an additional explanation given to a word or argument, when its literary meaning or idea seems to be repugnant to the context."]}], "ಗುಣವಿವೇಕ": [{"type": "noun", "defs": ["the knowledge of discriminating or distinguishing or assessing the values of, qualities.", "(rhet.) the examination or discussion or the ten qualities or merits of a poem."]}], "ಗುಣವೃಕ್ಷಕ": [{"type": "noun", "defs": ["a tall spar or, now often, a hollow metal structure, sometimes in sections, rising vertically from the keel or deck of a vessel and used to support the sails, yards, radar and radio equipment, etc.; the mast of a vessel.", "a post to which a ship or boat is fastened."]}], "ಗುಣವೃತ್ತಿ": [{"type": "noun", "defs": ["a secondary or unessential condition or relation.", "the character or style of merits.", "the literal power or sense of a word."]}], "ಗುಣವೃದ್ಧಿ": [{"type": "noun", "defs": ["improvement, enhancement of good qualities, merits.", "(gram) (used in pl.) the two kinds of euphonic combinations - a) the one as ಇ or ಈ following ಅ or ಆ resulting in the vowel sound ಏ), b) the other in which vowels are subject, under certain conditions, to a peculiar increase or lengthening."]}], "ಗುಣವ್ಯಸನ": [{"type": "noun", "defs": ["a concern for the right quality, virtue, merit etc.", "a man who meticulously maintains the required, desirable quality, virtue, etc."]}], "ಗುಣವ್ಯಾಪ್ತಿ": [{"type": "noun", "defs": ["the idea or notion suggested by or associated with a word, phrase, etc. in addition to its explicit meaning; connotation."]}], "ಗುಣಶಾಲಿ": [{"type": "noun", "defs": ["= ಗುಣವಂತ."]}], "ಗುಣಶಾಲಿನಿ": [{"type": "noun", "defs": ["= ಗುಣವಂತೆ."]}], "ಗುಣಶ್ರೇಣಿನಿರ್ಜರೆ": [{"type": "noun", "defs": ["(Jain.) that which destroys the carrying over effect of one's past actions."]}], "ಗುಣಸಂಗಿ": [{"type": "noun", "defs": ["a person bound by the three types of fundamental qualities (that are characterised as a) virtue, merit, excellence, b) dynamism, vigour, c) ignorance, wickedness, excessive selfishness)."]}], "ಗುಣಸಂಧಿ": [{"type": "noun", "defs": ["(gram) a kind of euphonic combination (as ಇorಈ following ಅ or ಆ resulting in the vowel sound ಏ)."]}], "ಗುಣಸಂಪನ್ನ": [{"type": "adjective", "defs": ["= ಗುಣಯುತ1."]}, {"type": "noun", "defs": ["= ಗುಣಯುತ2."]}], "ಗುಣಸಂಪನ್ನತೆ": [{"type": "noun", "defs": ["the fact of being endowed with, having required, desirable or good qualities (said of persons only)."]}], "ಗುಣಸಂಪನ್ನೆ": [{"type": "noun", "defs": ["= ಗುಣಯುತೆ."]}], "ಗುಣಸಾಂದ್ರ": [{"type": "noun", "defs": ["= ಗುಣಯುತ2."]}], "ಗುಣಸಾಗರ": [{"type": "noun", "defs": ["a highly virtuous, righteous man."]}], "ಗುಣಸೌಂದರ": [{"type": "noun", "defs": ["(pros.) a metre that has fourteen syllables in each line."]}], "ಗುಣಸ್ತವ": [{"type": "noun", "defs": ["a praising, often exaggeratedly, of another's quality, nature, character, merit. virtue, distinctive features, etc."]}], "ಗುಣಹೀನ": [{"type": "adjective", "defs": ["not having good, required or desirable quality."]}, {"type": "noun", "defs": ["a man not having good, required or desirable quality."]}], "ಗುಣಹೀನತೆ": [{"type": "noun", "defs": ["the fact of being not endowed with, not having required, desirable or good qualities."]}], "ಗುಣಹೀನೆ": [{"type": "noun", "defs": ["a woman not having good, required or desirable quality."]}], "ಗುಣಾಂಕ": [{"type": "adjective", "defs": ["stringed (said of a bow)."]}, {"type": "noun", "defs": ["a man widely known for his merits, virtues, etc.", "a point or points awarded for a student's achievement; any evaluative rating; a mark or marks."]}], "ಗುಣಾಂತರ": [{"type": "noun", "defs": ["a quality, the merit or virtue that is different from the one that is usual, derived or expected."]}], "ಗುಣಾಕಾರ": [{"type": "noun", "defs": ["the act or process of multiplying.", "a mathematical operation that at its simplest is an abbreviated process of adding an integer to itself a specified number of times and that is extended to other numbers in accordance with laws that are valid for integers.", "the extent or measure of the surface of a solid or bounded region on a plane; area.", "the condition or fact of increasing considerably in number, amount, extent or degree", "ಗುಣಾಕಾರ ಹಾಕು guṇā kāra hāku a planning or forethought, esp. with selfish motives."]}], "ಗುಣಾಕೃತಿ": [{"type": "noun", "defs": ["the thin, linear form (as of a thread)."]}], "ಗುಣಾಢ್ಯ": [{"type": "noun", "defs": ["he who is possessing merits, good qualities; a man who is morally sound or excellent; a righteous man."]}], "ಗುಣಾಢ್ಯೆ": [{"type": "noun", "defs": ["a woman characterised by good qualities, moral virtue; a righteous woman."]}], "ಗುಣಾಣು": [{"type": "noun", "defs": ["any of the units occurring at specific points on the chromosomes, by which hereditary characters are transmitted and determined; a gene."]}], "ಗುಣಾತೀತ": [{"type": "adjective", "defs": ["transcending or not bound by, attributes, fundamental quality or qualities, etc."]}, {"type": "noun", "defs": ["he who is above or not bound by, cannot be described by giving, qualities or is not limited by any particular characteristic.", "want of required, desired or standard qualities, norms of behaviour, etc."]}], "ಗುಣಾತೀತೆ": [{"type": "noun", "defs": ["a woman whois above or not bound by, cannot be described by giving, qualities or is not limited by any particular characteristic."]}], "ಗುಣಾತ್ಮಕ": [{"type": "adjective", "defs": ["having to do with, concerning or having to do with quality or qualities."]}], "ಗುಣಾತ್ಮಕ ವಿಶ್ಲೇಷಣೆ": [{"type": "noun", "defs": ["an analysis of quality or qualities of something or its ingredients; qualitative analysis."]}], "ಗುಣಾಧಿಕ": [{"type": "noun", "defs": ["a man regarded for his merits, virtues, etc."]}], "ಗುಣಾಧೇಯ": [{"type": "noun", "defs": ["a highly virtuous, righteous man."]}], "ಗುಣಾನುರೂಪ": [{"type": "adjective", "defs": ["matching with, corresponding to, in agreement with, the quality, excellence, character, merit, etc."]}, {"type": "noun", "defs": ["(gram.) a name, appellation or title that corresponds to one's character or quality."]}], "ಗುಣಾಭಿರಾಮ": [{"type": "adjective", "defs": ["pleasing by one's character, behaviour, merit, etc."]}, {"type": "noun", "defs": ["a man who pleases others by his character, behaviour, merit, etc."]}], "ಗುಣಾಭಿರಾಮೆ": [{"type": "noun", "defs": ["a woman whopleases others by her character, behaviour, merit, etc."]}], "ಗುಣಾಮರ": [{"type": "noun", "defs": ["(rightly: ನುಣಾಮರ) the shrub or small tree Morinda citrifolia of Rubiaceae family.", "another of the same family Morinda tinctoria.", "another of the same family Morinda umbellata."]}], "ಗುಣಾರಿ": [{"type": "noun", "defs": ["an assistant of the chief or the accountant, of a village."]}], "ಗುಣಾವಲಂಬಿ": [{"type": "adjective", "defs": ["concerned with, depending on or having to do with quality or qualities; qualitative."]}], "ಗುಣಾಷ್ಟಕ": [{"type": "noun", "defs": ["(according to Viśiṣṭādvaita phil.) the eight characteristics attributed to the Supreme.", "(Jain.) the eight characteristics that a liberated soul is supposed to have."]}], "ಗುಣಿ": [{"type": "noun", "defs": ["a hole or cavity in the ground; a pit; a depressed part or place; a hollow.", "a hollow place within something; a cavity", "ಗುಣಿ ಕಾಣು guṇi kāṇu (fig.) to die."]}, {"type": "noun", "defs": ["a short staff (held in the hand, usu. used to play with)."]}, {"type": "noun", "defs": ["a plant."]}, {"type": "noun", "defs": ["a person possessing merits, good qualities or who is morally sound or excellent; a righteous man.", "that which has a string or is stringed; a bow."]}], "ಗುಣಿಕಟ್ಟು": [{"type": "noun", "defs": ["a basin or trench for water round the root of a tree."]}], "ಗುಣಿಕೆ": [{"type": "noun", "defs": ["= ಗುಣುಕು."]}, {"type": "noun", "defs": ["a small ball, tablet, capsule, etc. of medicine to be swallowed whole; a pill.", "anything that is round or globular.", "an archaic coin.", "a false statement; a lie."]}, {"type": "noun", "defs": ["the act or process of calculating; calculation.", "something deduced by calculating; estimate; plan."]}], "ಗುಣಿಗ": [{"type": "noun", "defs": ["a man who measures the land."]}], "ಗುಣಿಗಣ್ಣು": [{"type": "noun", "defs": ["a sunken eye."]}], "ಗುಣಿಗಲ್ಲ": [{"type": "noun", "defs": ["the chin of a person having a small, natural hollow."]}], "ಗುಣಿಗಲ್ಲು": [{"type": "noun", "defs": ["a small stone worn smooth and round as by the action of water; a pebble."]}], "ಗುಣಿತ": [{"type": "adjective", "defs": ["increased in number, amount, extent or degree by multiplying; multiplied."]}, {"type": "noun", "defs": ["= ಗುಣಾಕಾರ.", "(gram.) a joining a vowel as a suffix to a consonant or consonants with a vowel, making it a single, basic unit of pronunciation in a word."]}], "ಗುಣಿಯಿಸು": [{"type": "verb", "defs": ["= ಗುಣಿಸು."]}], "ಗುಣಿಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["a ritual observed to remove the religious defilement caused by the birth of a child in one's family."]}], "ಗುಣಿಸು": [{"type": "verb", "defs": ["to muiltiply a number or quantity from another; to increase a number or quantity by a specified times.", "to reckon or determine by reasoning, evaluating, etc.; to estimate; to calculate.", "to do repeatedly in order to learn or become proficient; to exercise or drill oneself in; to practice.", "to elaborate a musical mode (usu. without any using a composition set to any rhythm bound by time) as a prelude for a song."]}], "ಗುಣಿಹೊಗು": [{"type": "verb", "defs": ["to go into a pit or hollow place."]}], "ಗುಣಿಹೊಡೆ": [{"type": "verb", "defs": ["to dig; to sink (a pit, well, etc.)."]}], "ಗುಣೀಕೃತ": [{"type": "adjective", "defs": ["deprived of the original meaning or importance.", "made secondary or subordinate; subjugated."]}], "ಗುಣೀಭೂತ": [{"type": "adjective", "defs": ["deprived of the original meaning or importance.", "made secondary or subordinate.", "invested with attributes.", "made or having become a merit or ornament.", "having a certain force or application (as a word)."]}], "ಗುಣೀಭೂತವ್ಯಂಗ್ಯ": [{"type": "noun", "defs": ["(rhet.) an expression or manner of expression in which the charm suggested of the suggested sense is not more striking than that of the expressed one."]}], "ಗುಣುಕು": [{"type": "noun", "defs": ["a heavy, thick stick used as a weapon; a club.", "a slender stick strung along its length with horsehairs, drawn across the strings of a violin, cello, etc. to play it; a bow.", "a short stick to play drums by beating with; a drumstick.", "(dial.) a short, thick pestle used to knead the dough for making various dishes."]}], "ಗುಣುಗು": [{"type": "verb", "defs": ["= ಗುಣುಗುಟ್ಟು.", "to sing (a tune, etc.) with the lips closed; to hum."]}], "ಗುಣುಗುಟ್ಟು": [{"type": "verb", "defs": ["to talk in a low, indistinct voice.", "to express one's dissent, dissatisfaction, disappointment, defiance, etc. in a low voice (often not being able to do so openly of loudly).", "(a sound, music, speech, etc.) to be echoing or resounding or perceived to be so (in the ears)."]}], "ಗುಣುಗುಣಿಸು": [{"type": "verb", "defs": ["= ಗುಣುಗುಟ್ಟು."]}], "ಗುಣುಗುಣು": [{"type": "noun", "defs": ["the indistinct murmuring sound.", "a sound imitating it."]}], "ಗುಣುಗುಣುಗುಟ್ಟು": [{"type": "verb", "defs": ["= ಗುಣುಗುಟ್ಟು."]}], "ಗುಣುಪು": [{"type": "noun", "defs": ["= ಗುಣ್ಪು2."]}, {"type": "noun", "defs": ["a short, thick pestle used to knead the dough for making various dishes."]}], "ಗುಣೋಕ್ತಿ": [{"type": "noun", "defs": ["any of a class of words used to modify or describe a noun or other substantive; an adjective."]}], "ಗುಣೋತ್ಕರ": [{"type": "noun", "defs": ["a number of (good) qualities, merits (a person possesses)."]}], "ಗುಣೋದಯ": [{"type": "noun", "defs": ["a being bestowed with (good) qualities or merits.", "a meritorious, virtuous man."]}], "ಗುಣೋದೀರ್ಣ": [{"type": "adjective", "defs": ["having developed good qualities, habits or cultivated merit or virtue."]}], "ಗುಣೋದೀರ್ಣತೆ": [{"type": "noun", "defs": ["the fact of good qualities, habits, merit, virtue etc. having been cultivated, developed.", "the act or fact of a bow being tied at both ends with a string."]}], "ಗುಣೌಘ": [{"type": "noun", "defs": ["= ಗುಣೋತ್ಕರ."]}], "ಗುಣ್ಣಿತು": [{"type": "noun", "defs": ["= ಗುಣ್ಣಿತ್ತು."]}], "ಗುಣ್ಣಿತ್ತು": [{"type": "noun", "defs": ["the quality, condition or fact of being deep; deepness; depth."]}], "ಗುಣ್ಪಳಿ": [{"type": "verb", "defs": ["(the depth) to be reduced; to become shallow."]}], "ಗುಣ್ಪಱಿ": [{"type": "verb", "defs": ["to measure the depth of water in a well, stream, pond, etc.", "to assess, understand or realise the intellectual depth, profundity (of another)."]}], "ಗುಣ್ಪು": [{"type": "noun", "defs": ["a great number of people gathered together; a crowd.", "a number of cattle, sheep or other animals, birds, etc, being together; a herd; a flock."]}, {"type": "noun", "defs": ["a dimension taken through an object or body or material usu. downward or inward; depth.", "the quality of being deep; deepness.", "intensity (as of silence).", "gravity; seriousness.", "intellectual depth; profundity.", "a great quantity, number; abundance; the condition of having in plenty; plentifulness.", "that which cannot be understood easily or is kept secret.", "a question, matter or situation that is or person who is perplexing or difficult."]}], "ಗುಣ್ಪುಗೆಡು": [{"type": "verb", "defs": ["to become shallow; (the depth) to become less."]}], "ಗುಣ್ಪುವಡೆ": [{"type": "verb", "defs": ["to become deep or deeper.", "to become profound.", "to become more intense, grave or serious."]}], "ಗುಣ್ಪುವೆಱು": [{"type": "verb", "defs": ["= ಗುಣ್ಪುವಡೆ."]}], "ಗುಣ್ಮೆ": [{"type": "noun", "defs": ["the ability to contain, absorb, receive, hold, react, retaliate, etc."]}], "ಗುಣ್ಯ": [{"type": "adjective", "defs": ["having or attributed with, quality or qualities.", "that can or fit to be counted."]}, {"type": "noun", "defs": ["(math.) the number that is or is to be, multiplied by the multiplier; a multiplicand."]}], "ಗುತಗೆ": [{"type": "noun", "defs": ["= ಗುತ್ತಿಗೆ."]}], "ಗುತುಗೆ": [{"type": "noun", "defs": ["= ಗುತ್ತಿಗೆ."]}], "ಗುತ್ತ": [{"type": "noun", "defs": ["closeness; proximity.", "the quality or fact of being tight; tightness; close-fitting.", "that which is short.", "the condition of being dense or being crowded with.", "the condition of being thick, viscous (said of liquid food, etc.)."]}, {"type": "adjective", "defs": ["kept from otheṛs knowledge or view; secret.", "working with hidden aims or methods."]}], "ಗುತ್ತಕಾಗದ": [{"type": "noun", "defs": ["a letter, written communication that is meant to be read only by the person intended; a confidential letter."]}], "ಗುತ್ತಗೆ": [{"type": "noun", "defs": ["= ಗುತ್ತಿಗೆ."]}], "ಗುತ್ತನೆ": [{"type": "adverb", "defs": ["fitting closely or tightly.", "being, situated near.", "not or less friendly."]}], "ಗುತ್ತರು": [{"type": "noun", "defs": ["the region situated closely to or surrounding a place."]}], "ಗುತ್ತಾದಾರ": [{"type": "noun", "defs": ["= ಗುತ್ತಿಗೆದಾರ."]}], "ಗುತ್ತಿ": [{"type": "noun", "defs": ["a number of things of the same sort grown together; a bunch; a cluster.", "a shrub or clump of shrubs with stems of moderate length; a bush.", "(dial.) the lower end of a plant remaining in the ground after most of the stem or trunk has been cut off; a stump."]}, {"type": "noun", "defs": ["the soil of the earth; earth; land; ground."]}], "ಗುತ್ತಿಗೆ": [{"type": "noun", "defs": ["a contract by which one party (landlord or lessor) gives to another (tenant or lessee) the use and possession of lands, buildings, property, etc. for a specified time and for fixed payments; a lease.", "the payment specified (esp. a fixed proportion of the crop) to be paid by the tenant or lessee to the lessor.", "exclusive control of a commodity or service in a given market or control that makes possible the fixing of prices and the virtual elimination of free competition; monopoly; an exclusive right got or given to for this purpose."]}], "ಗುತ್ತಿಗೆಕರಾರು": [{"type": "noun", "defs": ["= ಗುತ್ತಿಗೆ - 1."]}], "ಗುತ್ತಿಗೆಕಾಗದ": [{"type": "noun", "defs": ["a document containing the terms of a lease agreement."]}], "ಗುತ್ತಿಗೆಕಾರ": [{"type": "noun", "defs": ["= ಗುತ್ತಿಗೆದಾರ."]}], "ಗುತ್ತಿಗೆಕಾಱ": [{"type": "noun", "defs": ["= ಗುತ್ತಿಗೆದಾರ."]}], "ಗುತ್ತಿಗೆಕಾತಿ": [{"type": "noun", "defs": ["a woman to whom property is leased; tenant.", "a woman whocontracts to supply certain materials or do certain work for a stipulated sum; a contractor."]}], "ಗುತ್ತಿಗೆದಾರ": [{"type": "noun", "defs": ["a man to whom property is leased; a tenant or lessee.", "a man who contracts to supply certain materials or do certain work for a stipulated sum; a contractor."]}], "ಗುತ್ತಿಗೆವಿಡಿ": [{"type": "verb", "defs": ["= ಗುತ್ತಿಗೆಹಿಡಿ."]}], "ಗುತ್ತಿಗೆಹಿಡಿ": [{"type": "verb", "defs": ["to get by a lease; to take a lease.", "to undertake a work of supplying, providing service etc. on contract.", "to get full possession or control of; to dominate completely; to have the right to do so."]}], "ಗುತ್ತು": [{"type": "noun", "defs": ["a mark or symbol having an accepted and specific meaning; an indication; a token; a sign; a mark.", "knowledge (of something) got from personal experience or study of it; the state or relation of being acquainted (with someone); acquaintance."]}, {"type": "noun", "defs": ["= ಗುತ್ತ1."]}, {"type": "noun", "defs": ["= ಗುತ್ತಿಗೆ."]}, {"type": "noun", "defs": ["(dial.) a family that is regarded with esteem; a respectable family."]}, {"type": "noun", "defs": ["a striking of one thing against another; a blow; a stroke.", "the soil of the earth; earth; land; ground; ಗುತ್ತಿನ ಚೆಂಡು guttina ceṇḍu a game played by children, striking with each other with a ball."]}, {"type": "verb", "defs": ["to strike or punch with the fist.", "to pierce (something) with or as with a pointed instrument.", "to pass through (something), penetrate into as a sharp instrument does."]}], "ಗುತ್ತುಬಾಳಿಕೆ": [{"type": "noun", "defs": ["the using of an agricultural land taken on lease from a landlord.", "cultivation so carried on."]}], "ಗುತ್ತುಮಾಲೆ": [{"type": "noun", "defs": ["a garland in which flowers are stringed very closely."]}], "ಗುತ್ತೆ": [{"type": "noun", "defs": ["= ಗುತ್ತಿಗೆ."]}], "ಗುತ್ತೆದಾರ": [{"type": "noun", "defs": ["= ಗುತ್ತಿಗೆದಾರ."]}]}