{"ಕೊಯಿಲಿ": [{"type": "noun", "defs": ["= ಕೊಯ್ಲು."]}], "ಕೊಯಿಲು": [{"type": "noun", "defs": ["= ಕೊಯ್ಲು."]}], "ಕೊಯಿಲೆ": [{"type": "noun", "defs": ["any tool or weapon for cutting."]}, {"type": "noun", "defs": ["= ಕೊಯ್ಲೆ."]}, {"type": "noun", "defs": ["that which eclipses another."]}], "ಕೊಯಿಸು": [{"type": "verb", "defs": ["= ಕೊಯ್ಯಿಸು."]}], "ಕೊಯ್ಕ": [{"type": "noun", "defs": ["a kind of bird."]}, {"type": "noun", "defs": ["a man who cuts, severs; a cutter or reaper."]}, {"type": "noun", "defs": ["= ಕೊಯಕ."]}], "ಕೊಯ್ಕತನ": [{"type": "noun", "defs": ["the act, an instance or habit of cheating."]}], "ಕೊಯ್ಕಿ": [{"type": "noun", "defs": ["a woman with a part of the body being cut off or amputated."]}], "ಕೊಯ್ಕೆ": [{"type": "noun", "defs": ["a woman whocuts, severs; a cutter."]}], "ಕೊಯ್ಗತ್ತಿ": [{"type": "noun", "defs": ["a sharp sword for cutting or slaying.", "a flat wooden or metal plate which is fixed with a sharp blade, used to cut vegetables; kitchen blade."]}], "ಕೊಯ್ಗಾಱ": [{"type": "noun", "defs": ["a man whose profession is to cut or slay; a slaughterer."]}], "ಕೊಯ್ಗುರಿ": [{"type": "noun", "defs": ["= ಕೊಯ್ಗುಱಿ."]}], "ಕೊಯ್ಗುಱಿ": [{"type": "noun", "defs": ["a sheep meant to be slain (esp. as a sacrifice to a god).", "(fig.) a person who falls foolishly or innocently into a trap."]}], "ಕೊಯ್ತ": [{"type": "noun", "defs": ["the act of cutting, reaping, piercing with a sharp weapon.", "a pulling out of (flowers, fruits, etc.) from a plant; a plucking."]}], "ಕೊಯ್ತೆ": [{"type": "noun", "defs": ["= ಕೊಯ್ತ."]}], "ಕೊಯ್ತೆವೋಗು": [{"type": "verb", "defs": ["to be cut, severed, slain."]}], "ಕೊಯ್ಯಮುಂಜಿ": [{"type": "noun", "defs": ["the thorny plant Bridelia roxburghiana of Euphorbiaceae family."]}], "ಕೊಯ್ಯಲ್": [{"type": "noun", "defs": ["= ಕೊಯ್ಲು."]}], "ಕೊಯ್ಯಾ": [{"type": "noun", "defs": ["the tree Psidium guajava ( = P. pyriferum) of Myrtaceae family; guava tree.", "its fruit; guava.", "the tree Salvadora persica of Salvadoraceae family."]}], "ಕೊಯ್ಯಾಳ್": [{"type": "noun", "defs": ["one who cuts or slays (as in a battlefield)."]}], "ಕೊಯ್ಯಿಸು": [{"type": "verb", "defs": ["to cause to cut, amputate or slay.", "to cause to pull out (flowers, fruits, etc.) from a plant."]}], "ಕೊಯ್ಯು": [{"type": "verb", "defs": ["= ಕೊಯ್."]}], "ಕೊಯ್ಯುಕೊರೆ": [{"type": "verb", "defs": ["= ಕೊಯ್."]}], "ಕೊಯ್ಯುರುಳೆ": [{"type": "noun", "defs": ["an instrument that shears; a shearing machine or instrument."]}], "ಕೊಯ್ಲಾಳಿ": [{"type": "noun", "defs": ["a man employed for plucking areca nuts, betal leaves, etc. in a plantation."]}], "ಕೊಯ್ಲು": [{"type": "noun", "defs": ["the reaping of crops; harvest.", "a cut, as caused by the stroke of a sharp-edged instrument.", "a wooden piece that can be fitted into the hole made in another wooden piece.", "a religious observation on the tenth day of child-birth.", "the quality of a murderous, merciless person.", "the lower end of a plant remaining in the ground after most of the stem has been cut off; a stump."]}], "ಕೊಯ್ಲುಗಾರ": [{"type": "noun", "defs": ["a man who cuts or reaps crop; a reaper."]}], "ಕೊಯ್ಲೆ": [{"type": "noun", "defs": ["a play, gesture etc. to arouse sexual feelings or desire; mutual sexual stimulation preceding sexual intercourse."]}], "ಕೊಯ್ಸು": [{"type": "verb", "defs": ["= ಕೊಯ್ಯಿಸು."]}], "ಕೊರ": [{"type": "noun", "defs": ["the indistinct sound in the throat, as caused by cold, grief, etc."]}, {"type": "noun", "defs": ["the plant Walsura Epicedia ( = W. ternata) of Meliaceae family.", "another plant of the same plant Walsura trijuga ( = Heynea trijuga) of Meliaceae family."]}], "ಕೊರಂಗಲ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಕೊರಂಗಿ": [{"type": "noun", "defs": ["any of several families of primates usu. having a flat, hairless face and a long tail; a monkey."]}, {"type": "noun", "defs": ["the tree Pongamia glabra ( = P. pinnata) of Papilionaceae family; Indian beach."]}], "ಕೊರಂಗು": [{"type": "verb", "defs": ["= ಕೊರಗು1."]}], "ಕೊರಂಟು": [{"type": "noun", "defs": ["= ಕೊರಡು1."]}], "ಕೊರಂಟುದಲೆ": [{"type": "noun", "defs": ["= ಕೊರಟುದಲೆ."]}], "ಕೊರಂಬೆ": [{"type": "noun", "defs": ["a hood made of leaves and twigs, for the head and back against rain."]}], "ಕೊರಕ": [{"type": "noun", "defs": ["a man who paints, draws, engraves or applies in small points or dots rather than in lines or solid areas; a stippler.", "a tool or apparatus for boring holes in wood, metal, stone, teeth, etc.; a drill.", "he who or that which bores; an insect that bores plants; a borer."]}, {"type": "noun", "defs": ["that which is rough or coarse."]}], "ಕೊರಕಂಚಿ": [{"type": "noun", "defs": ["the twining plant Pentatropis microphylla of Asclepiadaceae family growing in hedges."]}, {"type": "noun", "defs": ["= ಕೊರಕಂಚೆ."]}], "ಕೊರಕಂಚೆ": [{"type": "noun", "defs": ["any of large, brownish shorebirds of Numenius genus and Scolopacidae family, with long legs and a long, down-curved bill; a curlew."]}], "ಕೊರಕಜೀರುಂಡೆ": [{"type": "noun", "defs": ["a borer beetle, an insect belonging to Lepidoptera order."]}], "ಕೊರಕಲ್": [{"type": "noun", "defs": ["= ಕೊರಕಲು."]}], "ಕೊರಕಲ": [{"type": "noun", "defs": ["= ಕೊರಕಲು."]}], "ಕೊರಕಲು": [{"type": "noun", "defs": ["a deep groove, furrow or track, esp. one made in the ground by the passage of wheeled vehicles.", "a deep excavation made by running water."]}], "ಕೊರಕಲ್ಲು": [{"type": "noun", "defs": ["a sharp, rough, rugged piece of stone."]}], "ಕೊರಕಾಪುಳಿ": [{"type": "noun", "defs": ["the medium-sized, evergreen tree Pithecolobium dulce ( = Mimosa dulcis) of Mimosae family; Manilla tamarind tree."]}], "ಕೊರಕು": [{"type": "verb", "defs": ["to chew slowly steadily (a crisp piece of food), with a crunching sound.", "to peck and pick up with the beak."]}], "ಕೊರಕೆ": [{"type": "noun", "defs": ["a kind of medicinal plant.", "a kind of ray fish of deep sea water."]}], "ಕೊರಕೊಂಚಿ": [{"type": "verb", "defs": ["a kind of bird."]}], "ಕೊರಕೊಳ್ಳಿ": [{"type": "noun", "defs": ["a live brand that is slowly extinguishing."]}], "ಕೊರಗ": [{"type": "noun", "defs": ["a sub-caste among Harijanas.", "a man who plays a kind of hautboy which is high-pitched, single-reed woodwind instrument, used on almost all auspicious occasions.", "a man belonging to a caste, main occupation of the members of which is mat-weaving and bamboo-basket making.", "the caste itself."]}], "ಕೊರಗಣೆ": [{"type": "noun", "defs": ["a troubled state of mind; anxiety; distress; a worry; botheration."]}], "ಕೊರಗತಿ": [{"type": "noun", "defs": ["a woman belonging to the Koraga caste, main occupation of the members of which is mat-weaving."]}], "ಕೊರಗಿಲು": [{"type": "noun", "defs": ["a kind of tree."]}], "ಕೊರಗಿಸು": [{"type": "verb", "defs": ["to cause to become abnormally thin or feeble.", "to cause to feel distress; to trouble.", "to cause to wane or lose freshness.", "to defeat; to overcome."]}], "ಕೊರಗು": [{"type": "verb", "defs": ["to become abnormally thin or feeble; to be emaciated.", "to feel deep, acute sorrow or distress; to give way to anxiety or unease; to allow one's mind to dwell on difficulty or troubles; to grieve within.", "to become less intense, bright, strong, etc.; to lose freshness."]}, {"type": "noun", "defs": ["mental pain, distress; a troubled state of mind; anxiety; worry."]}], "ಕೊರಗುಟ್ಟು": [{"type": "verb", "defs": ["to make a hoarse, indistinct sound in the uncleared throat (as from cold etc.)."]}], "ಕೊರಚ": [{"type": "noun", "defs": ["the caste of a nomadic people who are mainly engaged in making hair-tending combs.", "a man belonging to that caste.", "a man who habitually keeps grumbling, expressing his discontent in peevish manner."]}], "ಕೊರಚತಿ": [{"type": "noun", "defs": ["a woman belonging to the nomadic koraca caste, who pretend to foretell the future events."]}], "ಕೊರಚಲ": [{"type": "noun", "defs": ["= ಕೊರಚ - 3."]}], "ಕೊರಚಾಟ": [{"type": "verb", "defs": ["the act, an instance or speaking sarcastically, jeeringly."]}], "ಕೊರಚಾಡು": [{"type": "verb", "defs": ["to make (irritatingly) fun of (a person or thing) in a rude, sarcastic manner; mock; taunt; scoff (at).", "to annoy; to irritate; to bother.", "to grumble in discontent."]}], "ಕೊರಚಿ": [{"type": "noun", "defs": ["= ಕೊರಚತಿ."]}], "ಕೊರಚು": [{"type": "verb", "defs": ["to scoff derisively; to jeer at; to mock.", "to scream; to shout in a shrill voice."]}, {"type": "noun", "defs": ["a jeering remark; a sarcastic saying."]}], "ಕೊರಜ್ಜು": [{"type": "noun", "defs": ["a family of primates usu. having a flat, hairless face and a long tail, bigger in size than monkeys, living in forest.", "a stupid or dirty person."]}], "ಕೊರಟಿಗೆ": [{"type": "noun", "defs": ["the Barleria prionites of Acanthaceae family; thorny nail dye.", "its flower.", "the plant Ammania vesicatoria of Lythraceae family.", "the tree Lannea coromandelica ( = Odina woodier) of Anacardiaceae family; Indian ash tree."]}], "ಕೊರಟು": [{"type": "noun", "defs": ["= ಕೊರಡು1."]}], "ಕೊರಟುತಲೆ": [{"type": "noun", "defs": ["= ಕೊರಟುದಲೆ."]}], "ಕೊರಟುದಲೆ": [{"type": "noun", "defs": ["the head which has matted hair (hence growth of hair is stunted).", "a person whose intelligence has remained under-developed."]}], "ಕೊರಟೆ": [{"type": "noun", "defs": ["the plant Lawsonia inermis ( = L. alba) of Lythraceae family; a kind of henna plant, the leaves of which are used make a dye for decorating hands and feet."]}], "ಕೊರಡ": [{"type": "noun", "defs": ["= ಕೊರಡೆ1."]}], "ಕೊರಡು": [{"type": "noun", "defs": ["an unhewn piece of a felled tree or a similar rough mass of wood.", "an agricultural implement used for breaking lumps of earth.", "the condition of being deprived of the power of feeling or moving; numbness.", "(fig.) a man who cannot, does not, have the tendency to, enjoy the poetical, musical or aesthetic sentiments.", "a man apathetic to human feelings, as kindness, love, etc."]}, {"type": "noun", "defs": ["a gleam or streak of a rainbow in the clouds."]}], "ಕೊರಡೆ": [{"type": "noun", "defs": ["a lash attached to a stick for urging on animals or punishing etc.; a whip.", "the action of a person or thing that whips; esp., a flogging or beating, as in punishment."]}, {"type": "noun", "defs": ["a woman whois not mild or quiet or gentle; a boisterous, adamant woman."]}], "ಕೊರತೆ": [{"type": "noun", "defs": ["the state or condition of being deficient; a lack or shortage.", "a physical or moral defect; a stain; a flaw; a fault; a blemish.", "the state of being worried; anxiety, care, solicitude, vexation; a worry."]}], "ಕೊರತೆಪಡು": [{"type": "verb", "defs": ["to be anxious; to be vexed; to worry."]}], "ಕೊರನಾರಿ": [{"type": "noun", "defs": ["the grass Cyperus rotundus ( = C. hexastachyus) of Cyperaceae family; sedge.", "another grass of the same family Cyperus haspa."]}], "ಕೊರನಾರಿಗೆಡ್ಡೆ": [{"type": "noun", "defs": ["= ಕೊರನಾರಿ."]}], "ಕೊರನೆಕೆಲರ": [{"type": "noun", "defs": ["the plant Tecoma stans ( = Bignonia stans) of Bignoniaceae family.", "its yellow flower."]}], "ಕೊರಪ": [{"type": "noun", "defs": ["a circular comb with rows of teeth or ridges, for rubbing down, grooming, and cleaning a horse's coat; a curry-comb."]}], "ಕೊರಪಣೆ": [{"type": "noun", "defs": ["the act of cutting, severing.", "the act of carving; a sculpturing.", "the effect of severe cold on the skin.", "(fig.) weariness and dissatisfaction resulting from uninteresting and long talk."]}], "ಕೊರಪುಳ್ಳಿ": [{"type": "noun", "defs": ["a relatively thick fire-wood."]}], "ಕೊರಪೆ": [{"type": "noun", "defs": ["a sharp edged stone piece."]}], "ಕೊರಬ": [{"type": "noun", "defs": ["= ಕೊರವ2."]}], "ಕೊರಬು": [{"type": "noun", "defs": ["= ಕೊರವ2."]}], "ಕೊರಮ": [{"type": "noun", "defs": ["= ಕೊರವ2."]}], "ಕೊರಮತಿ": [{"type": "noun", "defs": ["= ಕೊರಮಿ."]}], "ಕೊರಮತ್ತಿ": [{"type": "noun", "defs": ["the large-sized, evergreen tree Terminalia Arjuna ( = Terminalia glabra) of Combretaceae family."]}], "ಕೊರಮಾವು": [{"type": "noun", "defs": ["the plant Phoebe wightii of Lauraceae family.", "another plant of the same family Phoebe paniculata."]}], "ಕೊರಮಿ": [{"type": "noun", "defs": ["a woman belonging to a nomadic sect Korava among tribal people in Karnāṭaka, who gen. is a fortune-teller on traditional lines."]}], "ಕೊರಮುಟ್ಟು": [{"type": "noun", "defs": ["any of the tools used for trimming, smoothing wood etc. as an adze, chisel, etc."]}], "ಕೊರಲ್": [{"type": "noun", "defs": ["= ಕೊರಳು."]}], "ಕೊರಲಿೞಿವು": [{"type": "noun", "defs": ["the condition of having lost one's natural speaking ability (resulting in stuttering, breaking of voice, faltering etc.) from grief, mental shock, etc."]}], "ಕೊರಲು": [{"type": "noun", "defs": ["= ಕೊರಳು."]}], "ಕೊರಲುದ್ದ": [{"type": "adjective", "defs": ["(said of height, length, etc.) coming upto one's neck."]}], "ಕೊರಲುದ್ದಂ": [{"type": "adverb", "defs": ["upto one's neck; reaching to the neck."]}], "ಕೊರಲುಬ್ಬಸ": [{"type": "noun", "defs": ["= ಕೊರಳುಬ್ಬಸ."]}], "ಕೊರಲುಲಿ": [{"type": "noun", "defs": ["= ಕೊರಳುಲಿ."]}], "ಕೊರಲುಲುಹು": [{"type": "noun", "defs": ["= ಕೊರಳುಲಿ."]}], "ಕೊರಲೆ": [{"type": "noun", "defs": ["the grass Panicum Italicum of Poaceae family.", "its small, round millet.", "a kind ofnt."]}], "ಕೊರಲೆಹುಲ್ಲು": [{"type": "noun", "defs": ["the grass Setaria pallide-fusca of Poaceae family."]}], "ಕೊರಲೌಂಕು": [{"type": "verb", "defs": ["to squeeze (another's) throat with the hands (as to shut off the breath); to strangle; to throttle."]}], "ಕೊರಲ್ಗೊಲೆ": [{"type": "noun", "defs": ["a killing by cutting the throat."]}], "ಕೊರಲ್ಗೊಱೆ": [{"type": "verb", "defs": ["to cut the throat; to murder by cutting another's throat."]}], "ಕೊರಲ್ಚು": [{"type": "verb", "defs": ["to utter or shout loudly or vehemently; to bawl."]}], "ಕೊರಲ್ದಂಡೆ": [{"type": "noun", "defs": ["a necklace or garland worn round the neck."]}], "ಕೊರಲ್ವಲೆ": [{"type": "noun", "defs": ["a kind of net used to catch wild animals."]}], "ಕೊರಲ್ವಾಗು": [{"type": "verb", "defs": ["to bend one's neck."]}], "ಕೊರವ": [{"type": "noun", "defs": ["a kind of fish (cāna marōliyas).", "another fish, Ophiocephelus punctatus."]}, {"type": "noun", "defs": ["a man belonging to a nomadic sect, main occupation of the members of which is mat-weaving and bamboo-basket making.", "that caste.", "(fig.) a man who habitually annoys, troubles others; a wicked man.", "a man who pretends to be pious, virtuous, innocent, etc. without really being so."]}], "ಕೊರವಂಜಿ": [{"type": "noun", "defs": ["a woman belonging to a nomadic sect Korava among tribal people in Karnāṭaka, who generally is a fortune-teller on traditional lines.", "a system of dance prevalent in South India."]}], "ಕೊರವಿ": [{"type": "noun", "defs": ["= ಕೊರವಂಜಿ - 1.", "a woman whopretends to be pious, virtuous, innocent, etc. without really being so."]}], "ಕೊರವಿತ್ತಿ": [{"type": "noun", "defs": ["= ಕೊರವಂಜಿ - 1.", "ಸೂಳೆ ಮುಪ್ಪಾಗಿ ಕೊರವಿತ್ತಿಯಾದಳು sūḷe muppāgi koravittiyādaḷu (prov.) he became a saint when he cannot rob any more due to old age."]}], "ಕೊರವುಕಾರ": [{"type": "noun", "defs": ["the head of a family (?)."]}], "ಕೊರವೆ": [{"type": "noun", "defs": ["= ಕೊರವ2."]}], "ಕೊರಸಾಟ": [{"type": "noun", "defs": ["the act, an instance or speaking sarcastically, jeeringly."]}], "ಕೊರಸಿಗ": [{"type": "noun", "defs": ["the small sized, deciduous tree Holarrhena antidysentrica of Apocynaceae family."]}], "ಕೊರಸು": [{"type": "noun", "defs": ["a kind of bird."]}], "ಕೊರಳ್": [{"type": "noun", "defs": ["= ಕೊರಳು."]}], "ಕೊರಳಾರ": [{"type": "noun", "defs": ["a necklace or garland worn round the neck."]}], "ಕೊರಳಿಸು": [{"type": "verb", "defs": ["to put (a garland, necklace, etc.) round (another's) neck; to cause to wear (something) round the neck."]}], "ಕೊರಳು": [{"type": "noun", "defs": ["the part of the body connecting the head to the shoulders; the neck.", "sound formed in the larynx etc. and uttered by the mouth, esp. human utterance in speaking, shouting, singing, etc.; voice.", "the ability to produce this.", "the characteristic speech sounds normally made by a particular person.", "tone in singing.", "an ear of grain; a spike.", "ಕೊರಳ ಮಟ್ಟಕ್ಕೂ ಹೂತು, ಮುಗಿಲ ಮಟ್ಟಕ್ಕೆ ಹಾರು ಅಂದಹಾಗೆ koraḷa maṭṭakkū hūtu mugila maṭṭakke hāru anda hāge (prov.) (proverbial simile) to bind the legs of a man with fetters and ask him to a race."]}], "ಕೊರಳುಕೊಯ್ಕ": [{"type": "noun", "defs": ["= ಕೊರಳುಗೊಯ್ಕ."]}], "ಕೊರಳುಗಟ್ಟು": [{"type": "verb", "defs": ["to hold one's neck (to hold back).", "(one's voice) to get stuck; to not come out; to not be expressed audibly or clearly (as from grief, joy, etc.)."]}], "ಕೊರಳುಗಣ್ಣಿ": [{"type": "noun", "defs": ["a noose to catch a person by neck."]}], "ಕೊರಳುಗೊಯಿಕ": [{"type": "noun", "defs": ["= ಕೊರಳುಗೊಯ್ಕ."]}], "ಕೊರಳುಗೊಯ್ಕ": [{"type": "noun", "defs": ["a man who cuts throats; a murderer.", "a ruthless man; a cold-blooded cheat."]}], "ಕೊರಳುಗೊಯ್ಕೆ": [{"type": "noun", "defs": ["a woman whocuts throats; a murderer; a cut-throat.", "a ruthless woman."]}], "ಕೊರಳುಗೊಳಿಸು": [{"type": "verb", "defs": ["to keep (another) under check, control.", "to accept, agree (meekly, helplessly)."]}], "ಕೊರಳುಚೌಕ": [{"type": "noun", "defs": ["a towel or long or broad piece of cloth worn about the neck, head for warmth; muffler, neckerchief, etc."]}], "ಕೊರಳುದ್ದ": [{"type": "adjective", "defs": ["(said of height, length, etc.) coming upto one's neck."]}, {"type": "adverb", "defs": ["upto one's neck; reaching to the neck."]}], "ಕೊರಳುಪಟ್ಟಿ": [{"type": "noun", "defs": ["that part of a garment which covers, encircles or is nearest the neck; collar.", "a long piece of cloth worn about the neck for warmth.", "a leather belt tied round the neck of a dog for holding it with a chain."]}], "ಕೊರಳುಬ್ಬಸ": [{"type": "noun", "defs": ["a tight feeling in the throat, as from restrained emotion or a choking of windpipe caused by physical disorders."]}], "ಕೊರಳುಲಿ": [{"type": "noun", "defs": ["sound made through the mouth, by human beings in talking, singing or by birds in making their characteristic sounds."]}], "ಕೊರಳೇರು": [{"type": "verb", "defs": ["(sound) to be produced from the throat.", "to sit on (another's) neck; to annoy, trouble (continuously)."]}], "ಕೊರಳ್ಕಾಪು": [{"type": "noun", "defs": ["a piece of armour to protect the throat; a gorget."]}], "ಕೊರಿ": [{"type": "noun", "defs": ["that which is separated by cutting."]}, {"type": "noun", "defs": ["the plant Carissa carandas of Apocynaceae family."]}], "ಕೊರಿಗೊರಿ": [{"type": "noun", "defs": ["a kind of herb."]}], "ಕೊರಿಪಿಡಿ": [{"type": "noun", "defs": ["the act or an instance of harassing or troubling; annoyance; persecution."]}], "ಕೊರಿಪೋಗು": [{"type": "verb", "defs": ["to be or get cut off from; to be separated from."]}], "ಕೊರಿಯಿಸು": [{"type": "verb", "defs": ["to cause to cut, amputate or slay.", "to cause to carve."]}], "ಕೊರಿವಿ": [{"type": "noun", "defs": ["= ಕೊರವಂಜಿ - 1."]}], "ಕೊರೆ": [{"type": "verb", "defs": ["to make an opening in as with a sharp-edged instrument; to pierce; to incise; to cut.", "to pierce, hit sharply, constrict, etc. so as to hurt.", "to hurt the feelings of.", "to remove or divide into parts with a sharp-edged instrument; to sever.", "to make or shape by or as by cutting, chipping, hewing, etc; to carve statues.", "to blind temporarily or confuse the sight of, as by an excess of light; to dazzle.", "to ignite a match stick by rubbing its tip (on the match box).", "(fig.) to write carelessly or uninterestingly.", "(fig.) to cause boredom by talking incessantly or uninterestingly.", "(cold by being severe) to be nipping or smarting."]}, {"type": "verb", "defs": ["to make a snorting or grunting sound in breathing during sleep; to snore.", "(dial.) to bark (as a dog)."]}, {"type": "noun", "defs": ["the condition of lacking something; absence of something essential; a lack or shortage; deficiency; incompleteness.", "the amount, number by which a thing falls short; deficit."]}, {"type": "noun", "defs": ["the act of cutting, severing.", "a piece or part cut off or separated from.", "a bag that is not filled to its maximum capacity; a partially filled bag."]}, {"type": "noun", "defs": ["the plant Paspalum scrobiculatum ( = P. fumentaceum) of Poaceae family.", "its millet.", "the plant Flueggea virosa of Euphorbiaceae family."]}, {"type": "noun", "defs": ["a cloth; fabric; woven material.", "worn and dirty clothes.", "the small, flat, wingless insect Pediculus humanus corporis of Anoplura order with sucking mouthparts, parasitic on the skin of humans, which thrive in dirty clothes; the human body louse."]}, {"type": "noun", "defs": ["an embankment or bund of a water tank."]}, {"type": "verb", "defs": ["to go round (a building, property, etc.) in order to keep watch; to guard."]}], "ಕೊರೆಕಂಬಿ": [{"type": "noun", "defs": ["a slender, sharp, pointed instrument used for writing, etching, engraving, etc.; a stylus."]}], "ಕೊರೆಗೆಯ್": [{"type": "verb", "defs": ["to lessen in any way, as in size, weight, amount, value, price, etc.; to diminish; to reduce."]}], "ಕೊರೆತ": [{"type": "noun", "defs": ["the act of cutting, severing.", "the act of carving; a sculpturing.", "the effect of severe cold on the skin.", "(fig.) weariness and dissatisfaction resulting from uninteresting and long talk."]}], "ಕೊರೆದಿನ": [{"type": "noun", "defs": ["a day of absence from one's duty."]}], "ಕೊರೆನೋಟ": [{"type": "noun", "defs": ["a sharp, probing look."]}], "ಕೊರೆಪ್ರಾಣ": [{"type": "noun", "defs": ["the departing soul.", "a man at the last moment of his life."]}], "ಕೊರೆಬೀಳು": [{"type": "verb", "defs": ["to fall short; to be deficient; to be incomplete."]}], "ಕೊರೆಯ": [{"type": "noun", "defs": ["a man who is lacking something that is essential."]}], "ಕೊರೆಯಚ್ಚು": [{"type": "noun", "defs": ["a thin sheet of metal, paper, etc., in which a pattern or lettering is cut, for producing a corresponding pattern on the surface beneath by the application of ink, paint, etc.; a stencil."]}], "ಕೊರೆಯಿಸು": [{"type": "verb", "defs": ["= ಕೊರೆಸು."]}], "ಕೊರೆಯುಳಿ": [{"type": "noun", "defs": ["a slender, sharp instrument, for hollowing out, carving inside; a scooper or burin."]}], "ಕೊರೆವಾಯಿ": [{"type": "noun", "defs": ["one who talks continuously (esp. senselessly or causing boredom)."]}], "ಕೊರೆಸಂಬಳ": [{"type": "noun", "defs": ["the unpaid salary; the held-up pay."]}], "ಕೊರೆಸು": [{"type": "verb", "defs": ["to cause to cut, amputate or slay.", "to cause to carve."]}], "ಕೊರೆಸೂಜಿ": [{"type": "noun", "defs": ["a slender needle like instrument used for etching; a etching-needle."]}], "ಕೊರ್ಕು": [{"type": "verb", "defs": ["any of usu. large gruiform wading birds of Gruidae family, with very long legs and neck, and a long, straight bill a crane."]}, {"type": "verb", "defs": ["a bird's bill; the beak."]}], "ಕೊರ್ಚು": [{"type": "verb", "defs": ["to cut into very small pieces; to chop; to mince."]}, {"type": "verb", "defs": ["to talk proudly about deeds, abilities, etc., either one's own or those of someone close to one, esp. in a manner showing too much pride and satisfaction; to boast; to brag."]}, {"type": "noun", "defs": ["the offensive smell of urine."]}, {"type": "noun", "defs": ["a bunch of flower, fruits, etc."]}], "ಕೊರ್ಜು": [{"type": "noun", "defs": ["the small sized, deciduous tree Holarrhena antidysentrica of Apocynaceae family."]}], "ಕೊರ್ತಿ": [{"type": "noun", "defs": ["a type of folk dance prevalent among Tamil people in Koḍagu district of Karnāṭaka."]}], "ಕೊರ್ಬಿಸು": [{"type": "verb", "defs": ["to cause to grow opulently; to make fat; to fatten.", "to grow opulently; to become fat."]}], "ಕೊರ್ಬು": [{"type": "verb", "defs": ["to become more in number, increase.", "to become bigger in size; to become fat; to fatten or develop (oneself).", "to be excited (from joy, success, etc.).", "to become arrogant, overbearing."]}, {"type": "noun", "defs": ["an increase; a growth; opulence.", "any of various mixtures of solid or semisolid triglycerides which are the chief components adipose animal tissue or of many seeds of plants, used in cooking and inthe manufacture of soaps; fat.", "the act or quality of being arrogant.; arrogance; overbearing pride."]}], "ಕೊರ್ಬುಗಳೆ": [{"type": "verb", "defs": ["to lower in pride; to make another become modest or humble in mind; to humble."]}], "ಕೊರ್ಬುಗುಡು": [{"type": "verb", "defs": ["to cause to become, to encourage to be, arrogant or haughty."]}], "ಕೊರ್ಬುವಡೆ": [{"type": "verb", "defs": ["= ಕೊರ್ಬು1."]}], "ಕೊರ್ಮಾತಿ": [{"type": "noun", "defs": ["a woman belonging to a nomadic sect Korava among tribal people in Karnāṭaka, who gen. is a fortune-teller on traditional lines.", "a system of dance prevalent in South India."]}], "ಕೊರ್ಲೆ": [{"type": "noun", "defs": ["the grass Panicum Italicum of Poaceae family.", "its small, round millet.", "a kind ofnt."]}], "ಕೊರ್ವಿಸು": [{"type": "verb", "defs": ["= ಕೊರ್ಬಿಸು."]}], "ಕೊರ್ವು": [{"type": "verb", "defs": ["= ಕೊರ್ಬು1."]}, {"type": "noun", "defs": ["= ಕೊರ್ಬು2."]}], "ಕೊರ್ವುವಡೆ": [{"type": "verb", "defs": ["= ಕೊರ್ಬು1."]}], "ಕೊಲ್": [{"type": "verb", "defs": ["to cause the death of (another living being); to make die; to kill.", "to destroy the vital or active qualities of; to destroy; to put an end to; to ruin.", "to inflict pain; to torment; to torture.", "to spend (time) on matters of little or no importance.", "to beat; to strike at.", "to render the opponents pawn ineffective or remove it from the board (as in dice game). ಕೊಂದಾಟ kond āṭa the act of killing; 2. a making the pawn of the opponent ineffective or a removing it from the board (as in dice-game); ಕೊಂದಾಡು kondāḍu to engage in a fierce fight; ಕೊಂದಿಕ್ಕಿಸು kondikkisu to cause to kill, murder; ಕೊಂದಿಕ್ಕು kondikku to kill; to murder; ಕೊಂದು ಕೂಗು kondu kūgu to kill (in a battlefield) and make a loud sound (celebrating the victory)."]}, {"type": "noun", "defs": ["the act of or condition of being, joining together.", "a flat, buoyant structure of logs, boards, barrels, etc. fastened together, and used like a boat; a raft; a float."]}, {"type": "noun", "defs": ["a long, slender piece of wood, used for reaching (something), poking, beating, etc."]}], "ಕೊಲ": [{"type": "noun", "defs": ["all the descendants of a common ancestor; a house, a lineage; a family.", "a group or set of persons or things; a class."]}], "ಕೊಲಂಬಾಬೇರು": [{"type": "noun", "defs": ["the plant Jateorrhiza columba of Menispermaceae family; columbo root; radix-colombae."]}], "ಕೊಲಜ": [{"type": "noun", "defs": ["a man of noble descent."]}], "ಕೊಲಜೆ": [{"type": "noun", "defs": ["a woman of noble descent."]}], "ಕೊಲವಲಿಕೆ": [{"type": "noun", "defs": ["the plant Hygrophila auriculata ( = H. spinosa, = Asteracantha longifolia) of Acanthaceae family.", "the plant Barleria longiflora of Acanthaceae family."]}], "ಕೊಲಾಮಿ": [{"type": "noun", "defs": ["a Dravidian language, akin to Telugu, spoken in central and southern parts of India."]}], "ಕೊಲಾರಿ": [{"type": "noun", "defs": ["a bullock cart with a decorated arch like shelter over it.", "the arch like shelter itself."]}], "ಕೊಲಿಕೆ": [{"type": "noun", "defs": ["one loop or ring of a chain etc.; a link.", "a connecting part, esp. a thing that unites or provides continuity."]}], "ಕೊಲಿಗ": [{"type": "noun", "defs": ["one who kills; a killer; a murderer."]}], "ಕೊಲಿಮೆ": [{"type": "noun", "defs": ["a fire-pit of a smith.", "an enclosed chamber or structure in which heat is produced, as by burning fuel, for warming a building, reducing ores and metals, etc.; a furnace.", "(fig.) any extremely hot place."]}], "ಕೊಲಿಸು": [{"type": "verb", "defs": ["to cause to kill, murder.", "to cause to inflict great physical pain or mental anguish in; to cause to torment, torture; ಕೊಲಿಸಿಕೊಳ್ kolisikoḷto get killed, murdered."]}], "ಕೊಲು": [{"type": "verb", "defs": ["= ಕೊಲ್1."]}], "ಕೊಲುಕುಟಕನಗಿಡ": [{"type": "noun", "defs": ["a plant Gloriosa superba of Liliaceae family; country aconite."]}], "ಕೊಲುಮೆ": [{"type": "noun", "defs": ["= ಕೊಲಿಮೆ."]}], "ಕೊಲೆ": [{"type": "verb", "defs": ["to cause the death of; to make die; to kill; to murder."]}, {"type": "noun", "defs": ["an unlawful, premeditated killing of a person or animal; murder.", "great physical pain or mental anguish.", "the act or an instance of using something (as a language, music etc.) in bungling, unskilful or offensive manner.", "ಕೊಲೆಮಾಡು kole māḍu to kill (a person or another animal) unlawfully.", "(fig.) to spoil, mangle (a language, artwork) by rough, careless, offensive manners."]}], "ಕೊಲೆಕೋಣೆ": [{"type": "noun", "defs": ["a room in which condemned persons are killed, executed; a death-chamber."]}], "ಕೊಲೆಗ": [{"type": "noun", "defs": ["= ಕೊಲೆಗಡಿಕ."]}], "ಕೊಲೆಗಡಕ": [{"type": "noun", "defs": ["= ಕೊಲೆಗಡಿಕ."]}], "ಕೊಲೆಗಡಿಕ": [{"type": "noun", "defs": ["a man who kills another person or an animal unlawfully and premeditatedly; a killer; a murderer."]}], "ಕೊಲೆಗಡಿಕತನ": [{"type": "noun", "defs": ["the tendency to kill unlawfully; the habitual practice of killing human beings or animals unlawfully and premeditatedly. 2) the quality of being utterly cruel, heartless; cruelty."]}], "ಕೊಲೆಗಡಿಕೆ": [{"type": "noun", "defs": ["a woman who kills another person or an animal unlawfully and premeditatedly; a female killer; a murderer."]}], "ಕೊಲೆಗಡಿಗ": [{"type": "noun", "defs": ["= ಕೊಲೆಗಡಿಕ."]}], "ಕೊಲೆಗಡುಕ": [{"type": "noun", "defs": ["= ಕೊಲೆಗಡಿಕ."]}], "ಕೊಲೆಗಡುಕತನ": [{"type": "noun", "defs": ["= ಕೊಲೆಗಡಿಕತನ."]}], "ಕೊಲೆಗಾರ": [{"type": "noun", "defs": ["a man who has killed another person or animal; a killer; a murderer."]}], "ಕೊಲೆಗಾರಿಕೆ": [{"type": "noun", "defs": ["the act or manner of murdering or the tendency to murder."]}], "ಕೊಲೆಗಾರ್ತಿ": [{"type": "noun", "defs": ["a woman who has killed another human being or an animal; a female killer, murderer."]}], "ಕೊಲೆಗಾಱ": [{"type": "noun", "defs": ["= ಕೊಲೆಗಾರ."]}], "ಕೊಲೆಗುತ್ತ": [{"type": "noun", "defs": ["any serious disease that causes or is capable of causing death; a fatal disease."]}], "ಕೊಲೆಗೆಲಸ": [{"type": "noun", "defs": ["an act of murdering; a murderous deed."]}], "ಕೊಲೆಗೇಡಿ": [{"type": "noun", "defs": ["= ಕೊಲೆಗಡಿಕ."]}], "ಕೊಲೆಗೈ": [{"type": "verb", "defs": ["to commit a murder; to kill."]}], "ಕೊಲೆಗೊಳ್": [{"type": "verb", "defs": ["= ಕೊಲೆಗೊಳ್ಳು."]}], "ಕೊಲೆಗೊಳ್ಳು": [{"type": "verb", "defs": ["to be murdered; to be killed unlawfully and premeditatedly.", "to kill so; to murder."]}], "ಕೊಲೆಪಡು": [{"type": "verb", "defs": ["= ಕೊಲೆಗೊಳ್ಳು - 1."]}], "ಕೊಲೆಪಾತ": [{"type": "noun", "defs": ["= ಕೊಲೆಪಾತಕ- 2."]}], "ಕೊಲೆಪಾತಕ": [{"type": "noun", "defs": ["= ಕೊಲೆಗಡಿಕ.", "the guilt or sin of committing murder."]}], "ಕೊಲೆಪಾತಕಿ": [{"type": null, "defs": []}], "ಕೊಲೆಬಲೆ": [{"type": "noun", "defs": ["any stratagem or ambush designed to kill; a trap to murder."]}], "ಕೊಲೆಬೀೞ್": [{"type": "verb", "defs": ["to be murdered; to be killed unlawfully and premeditatedly."]}], "ಕೊಲೆಮನೆ": [{"type": "noun", "defs": ["= ಕೊಲೆಕೋಣೆ."]}], "ಕೊಲೆಸಾಯ್": [{"type": "verb", "defs": ["to be killed; to be murdered."]}], "ಕೊಲ್ಗತ್ತಿ": [{"type": "noun", "defs": ["a kind of heavy sword (used to slaughter animals)."]}], "ಕೊಲ್ಲ": [{"type": "noun", "defs": ["(dial.) a smith who works in iron; a blacksmith."]}], "ಕೊಲ್ಲಗೆಡಹು": [{"type": "verb", "defs": ["to kill (heinously)."]}], "ಕೊಲ್ಲಗೊಲೆ": [{"type": "noun", "defs": ["= ಕೊಲ್ಲುಗೊಲೆ."]}], "ಕೊಲ್ಲಟಗಿತ್ತಿ": [{"type": "noun", "defs": ["= ಕೊಲ್ಲಟಿಗಿತ್ತಿ."]}], "ಕೊಲ್ಲಟಿ": [{"type": "noun", "defs": ["(masc.) an expert performer of tricks in tumbling or on the trapeze, tightrope, etc.; skilled gymnast; an acrobat."]}], "ಕೊಲ್ಲಟಿಗ": [{"type": "noun", "defs": ["= ಕೊಲ್ಲಟಿ."]}], "ಕೊಲ್ಲಟಿಗತನ": [{"type": "noun", "defs": ["the art, practice or profession of an acrobat."]}], "ಕೊಲ್ಲಟಿಗವೆಣ್": [{"type": "noun", "defs": ["= ಕೊಲ್ಲಟಿಗಿತ್ತಿ."]}], "ಕೊಲ್ಲಟಿಗಿತ್ತಿ": [{"type": "noun", "defs": ["(fem.) an expert performer of tricks in tumbling or on the trapeze, tightrope, etc.; skilled gymnast; an acrobat."]}], "ಕೊಲ್ಲಣ": [{"type": "noun", "defs": ["any activity or experience that gives enjoyment or recreation; pastime; a sport.", "the act or process of travelling.", "a group of persons or things gathered together; an assembly; an assemblage."]}], "ಕೊಲ್ಲಣಿಗೆ": [{"type": "noun", "defs": ["= ಕೊಲ್ಲಣ - 2 & 3.", "a false or deceiving appearance; pretence."]}], "ಕೊಲ್ಲಣಿಗೆವರಿ": [{"type": "verb", "defs": ["to move, proceed together in a group."]}], "ಕೊಲ್ಲಣಿಸು": [{"type": "verb", "defs": ["to move from place to place.", "to come together; to assemble."]}], "ಕೊಲ್ಲಾಯ್ತ": [{"type": "noun", "defs": ["a man who puts up false or deceiving appearance; a pretender."]}], "ಕೊಲ್ಲಾರ": [{"type": "noun", "defs": ["a bullock cart with a decorated arch like shelter over it.", "the arch like shelter itself."]}], "ಕೊಲ್ಲಾರಬಂಡಿ": [{"type": "noun", "defs": ["= ಕೊಲ್ಲಾರ - 1."]}], "ಕೊಲ್ಲಾರಭಂಡಿ": [{"type": "noun", "defs": ["= ಕೊಲ್ಲಾರ - 1."]}], "ಕೊಲ್ಲಾರಿ": [{"type": "noun", "defs": ["= ಕೊಲ್ಲಾರ."]}, {"type": "noun", "defs": ["a chief or leader; a chieftain."]}], "ಕೊಲ್ಲಾರಿಚಕ್ಕಡಿ": [{"type": "noun", "defs": ["= ಕೊಲ್ಲಾರ - 1."]}], "ಕೊಲ್ಲಾರಿಬಂಡಿ": [{"type": "noun", "defs": ["= ಕೊಲ್ಲಾರ - 1."]}], "ಕೊಲ್ಲಾರು": [{"type": "noun", "defs": ["= ಕೊಲ್ಲಾರ."]}], "ಕೊಲ್ಲಾಸೆ": [{"type": "noun", "defs": ["the tendency to murder."]}], "ಕೊಲ್ಲಿ": [{"type": "noun", "defs": ["that which is bent or the portion so bent; a bend; a curve.", "the place where two walls running from different directions meet; a corner; the angle made by them.", "that (esp. a domestic animal) which strays.", "a small current or flow of water; a stream.", "a part of a sea or lake, indenting the shoreline; a wide inlet; a bay or gulf."]}], "ಕೊಲ್ಲಿ ಆವು": [{"type": "noun", "defs": ["= ಕೊಲ್ಲಿಯಾವು."]}], "ಕೊಲ್ಲಿತನ": [{"type": "noun", "defs": ["the quality or condition of deviating from what is considered right, good or normal; pervertedness."]}], "ಕೊಲ್ಲಿನೋಟ": [{"type": "noun", "defs": ["a looking from the outer corner of an eye; a side glance."]}], "ಕೊಲ್ಲಿಯಾವು": [{"type": "noun", "defs": ["a cow that strays."]}], "ಕೊಲ್ಲಿವಲೆ": [{"type": "noun", "defs": ["a kind of net for catching wild animals."]}], "ಕೊಲ್ಲಿಸು": [{"type": "verb", "defs": ["to cause to kill, murder.", "to cause to inflict great physical pain or mental anguish in; to cause to torment, torture."]}], "ಕೊಲ್ಲು": [{"type": "verb", "defs": ["to cause the death of; to make die; to kill.", "to destroy the vital or active qualities of; to destroy; to put an end to; to ruin.", "to inflict pain; to torment; to torture.", "to spend (time) on matters of little or no importance.", "to beat; to strike at.", "to render the opponents pawn ineffective or remove it from the board (as in dice game)."]}], "ಕೊಲ್ಲುಗ": [{"type": "noun", "defs": ["a man who kills another man or animal unlawfully and premeditatedly; a killer; a murderer."]}], "ಕೊಲ್ಲುಗೊಲೆ": [{"type": "noun", "defs": ["a heinous, abominable murder."]}], "ಕೊಲ್ಲೆ": [{"type": "noun", "defs": ["= ಕೊಲ್ಲಿ."]}, {"type": "noun", "defs": ["a limb extending from a tree or bough; a branch."]}], "ಕೊಲ್ಲೆನೋಟ": [{"type": "noun", "defs": ["= ಕೊಲ್ಲಿನೋಟ."]}], "ಕೊಲ್ಲೈಸು": [{"type": "verb", "defs": ["to move to a side.", "to turn aside from the straight or natural course."]}], "ಕೊವರ": [{"type": "noun", "defs": ["a person who makes earthenware pots, dishes, etc.; a maker of ceramic vessels; a potter."]}, {"type": "noun", "defs": ["a boy or man as he is related to either or both parents; a male descendant; a son.", "a young man.", "3.Ṣaṇmukha, son of Śiva."]}], "ಕೊವರಿ": [{"type": "noun", "defs": ["a girl or woman as she is related to either or both parents; a female descendant; a daughter.", "a girl or woman who has never had sexual intercourse; a virgin."]}], "ಕೊವ್ವರಿ": [{"type": "noun", "defs": ["= ಕೊವ್ವರೆ."]}], "ಕೊವ್ವರೆ": [{"type": "noun", "defs": ["the act or an instance of moving rapidly in a circular manner; whirling.", "the state of being carried away with joy, love, etc.; excited state of the mind; rapture; ecstasy.", "confusion; agitation of the mind."]}], "ಕೊವ್ವರೆಗೊಳ್": [{"type": "verb", "defs": ["to be excited by joy, love, success, etc.; to be carried away by such events.", "to be agitated or confused.", "to be struck by wonder.", "to desire strongly; to be fascinated.", "to extend oneself; to spread oneself within or throughout; to cover an object completely."]}], "ಕೊವ್ವರೆಗೊಳಿಸು": [{"type": "verb", "defs": ["to enchant; to charm; to fascinate.", "to cause to cover from all sides; to cause to fill the entire space or room."]}], "ಕೊಸಕಿಲು": [{"type": "noun", "defs": ["a kind of plant.", "its flower."]}], "ಕೊಸಕು": [{"type": "noun", "defs": ["= ಕೊಸಗು."]}], "ಕೊಸಗಿಜೆ": [{"type": "noun", "defs": ["a kind of tree."]}], "ಕೊಸಗಿಲೆ": [{"type": "noun", "defs": ["= ಕೊಸಕಿಲು."]}], "ಕೊಸಗು": [{"type": "noun", "defs": ["the large, evergreen tree Pterospermum acerifolium ( = P. aceroides) of Sterculiaceae family."]}], "ಕೊಸರ್": [{"type": "verb", "defs": ["= ಕೊಸರು1."]}], "ಕೊಸರಾಟ": [{"type": "noun", "defs": ["the act of trying to get freed from another's hold, grip.", "the act or habit of bargaining for a lower price or more quantity in buying something; a haggling.", "an act, process or instance of pulling, drawing toward or back and forth."]}], "ಕೊಸರಾಡು": [{"type": "verb", "defs": ["= ಕೊಸರು1 - 1 & 2."]}, {"type": "verb", "defs": ["= ಕೊಸರು1 - 4; 2) to force to lower the price of."]}], "ಕೊಸರಿ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಕೊಸರಿಕೆ": [{"type": "noun", "defs": ["= ಕೊಸರಾಟ."]}], "ಕೊಸರಿಡು": [{"type": "verb", "defs": ["to shake and throw down or off."]}], "ಕೊಸರು": [{"type": "verb", "defs": ["to try to get freed from another's hold, grip.", "to pull; to draw toward.", "to become excessive or forceful (as wrath); to become overbearing.", "to make a rough sound, as in resistance.", "to tell about or describe, something in detail (often, in a manner that causes boredom).", "(uncleared throat) to make indistinct sound.", "ಕೊಸರಿಕೊಳ್ಳು kosarikoḷḷu to get freed from another's hold, grip."]}, {"type": "verb", "defs": ["to persistently ask for more quantity or to lower the price, etc. to haggle."]}, {"type": "noun", "defs": ["strong desire, esp. for wealth; avarice; greed.", "a haggling for extra quantity; the quantity haggled for or got by haggling; something extra number or quantity given free of cost by the seller against purchase of some quantity; a baker's dozen.", "excessiveness."]}], "ಕೊಸರುಮಾತು": [{"type": "noun", "defs": ["an additional work , words or remark."]}], "ಕೊಸಲು": [{"type": "noun", "defs": ["= ಕೊಸಱು2."]}], "ಕೊಸವ": [{"type": "noun", "defs": ["a vile, morally contemptible, despicable man."]}], "ಕೊಸಱಿಕೆ": [{"type": "noun", "defs": ["the quality that captivates the mind; beauty; charm; elegance."]}], "ಕೊಸಱು": [{"type": "verb", "defs": ["to attract or please greatly; to enchant; to allure; to fascinate; to charm."]}, {"type": "noun", "defs": ["the condition of being fascinated; fascination."]}], "ಕೊಸಾಕುಳಿ": [{"type": "noun", "defs": ["a distressing or difficult happening or situation; a trouble."]}], "ಕೊಸಾರನೆ": [{"type": "adverb", "defs": ["(getting freed from another's grip) with a heavy shaking (of hand); with a resisting force."]}], "ಕೊಸಿ": [{"type": "verb", "defs": ["= ಕೊಸೆ1."]}], "ಕೊಸಿಅಕ್ಕಿ": [{"type": "noun", "defs": ["(dial.) rice got from husking boiled paddy."]}], "ಕೊಸೆ": [{"type": "verb", "defs": ["to have sexual intercourse; to copulate."]}, {"type": "verb", "defs": ["to try (vehemently or with a resisting force) to get freed from another's grip."]}, {"type": "noun", "defs": ["a particular manner of mounting a horse.", "a long narrow strap with each end attached to the bit, used to guide or check a horse etc. in riding or driving; a rein."]}, {"type": "noun", "defs": ["sexual intercourse; copulation.", "the organ for copulation and ejecting urine, in men; the penis."]}], "ಕೊಸೆಗೊಳ್": [{"type": "verb", "defs": ["to check or guide a horse by pulling the rein while riding."]}], "ಕೊಹಿಸು": [{"type": "verb", "defs": ["to cause to cut, amputate or slay.", "to cause to pull out (flowers, fruits, etc.) from a plant."]}], "ಕೊಹೆ": [{"type": "noun", "defs": ["the coughing sound.", "a sound imitating it."]}], "ಕೊಳ್": [{"type": "verb", "defs": ["to take; to receive in one's hand; to accept.", "to take in to one's control or authority.", "to get by paying or agreeing to pay money or some equivalent; to purchase; to buy.", "(rain or anything like rain) to pour down.", "to strike quickly; to rap on.", "to catch (as fire).", "to seize, pierce or cut with the teeth; to prick or wound with a sting; to bite.", "to become useful.", "to consider; to taken into account.", "to hold in esteem; to respect; to adore.", "to earn; to get as a reward for one's labour or service.", "to agree; to consent; to accept.", "to cover from all or almost all sides; to capture; to attack.", "(math.) to separate (a quantity) into equal parts; to divide.", "to be avoided; to be fended off", "ಕೊಂಡುಕೊಳ್ಳು koṇḍu koḷḷu to purchase something (by paying its price); to buy; 2. to have a person (esp. a government official) by bribing; to buy over; ಕೊಂಡೊಯ್ಯು koṇḍoyyu to carry (something) away."]}, {"type": "noun", "defs": ["the sound of a sudden and loud laugh.", "a sound imitating it."]}], "ಕೊಳ": [{"type": "noun", "defs": ["an old unit of measure of varying quantities (8 seers to ten seers)."]}, {"type": "noun", "defs": ["a body of still water formed naturally or by hollowing or embanking; a pond; a lake.", "a tub, now usu. a bathroom fixture, in which to take a bath; a bath-tub."]}, {"type": "noun", "defs": ["an agreed or regular meeting place; a rendezvous."]}], "ಕೊಳಂಗಟ್ಟು": [{"type": "verb", "defs": ["(a liquid) to be collected at a place in substantial quantity (as to look like a pond)."]}], "ಕೊಳಂಗೊಳ್": [{"type": "verb", "defs": ["= ಕೊಳಂಗಟ್ಟು.", "to be confined to a small place; to be imprisoned."]}], "ಕೊಳಂಜ": [{"type": "noun", "defs": ["the plant Alpinia galangas of Zingiberaceae family.", "another plant of the same family Alpinia officinarum.", "the plant Rubia cordifolia ( = R. munjista) of Rubiaceae family."]}], "ಕೊಳಂಜನ": [{"type": "noun", "defs": ["= ಕೊಳಂಜ."]}], "ಕೊಳಂಜಿ": [{"type": "noun", "defs": ["(dial.) a small tract of rice-field."]}], "ಕೊಳಂಜು": [{"type": "noun", "defs": ["= ಕೊಳಂಜ."]}], "ಕೊಳಂಬ": [{"type": "noun", "defs": ["a stoppage of work."]}], "ಕೊಳಂಬು": [{"type": "noun", "defs": ["= ಕೊಳಂಬ."]}], "ಕೊಳಕ": [{"type": "noun", "defs": ["an unclean, dirty man."]}], "ಕೊಳಕಟ್ಟೆಹುಲ್ಲು": [{"type": "noun", "defs": ["the grass Cenchrus ciliaris of Poaceae family; bunch grass."]}], "ಕೊಳಕರಣಿ": [{"type": "noun", "defs": ["a village accountant (profession of which usu. is got hereditarily)."]}], "ಕೊಳಕಿ": [{"type": "noun", "defs": ["an unclean, dirty woman."]}], "ಕೊಳಕು": [{"type": "adjective", "defs": ["that is soiled; dirty; unclean; putrid; rotten.", "disagreeable or contemptible; mean; nasty.", "unfair; dishonest; unsportsmanlike.", "not proper and fitting; unseemly; improper; indecent.", "morally offensive; obscene; pornographic."]}, {"type": "noun", "defs": ["the quality or condition of being dirty; dirtiness.", "disgustingly offensive dirt, garbage, etc.; filth.", "the quality of a dishonest, unfair person; unfairness; dishonesty.", "anything considered as foul as this; esp., anything viewed as grossly indecent or obscene."]}], "ಕೊಳಕುತನ": [{"type": "noun", "defs": ["the quality of being dirty;", "the habit or tendency of being dirty; dirtiness."]}], "ಕೊಳಕುತಗಣೆ": [{"type": "noun", "defs": ["the insect, Dysdercus cingulatus; a cotton stainer; a red-bug."]}], "ಕೊಳಕುನಗೆ": [{"type": "noun", "defs": ["an indecent smile; the smile of a hypocrite person."]}], "ಕೊಳಕುನಾರು": [{"type": "noun", "defs": ["the plant Desmodium Gangāticum of Papilionaceae family."]}, {"type": "verb", "defs": ["to give off a strong, unpleasant smell; to stink."]}], "ಕೊಳಕುನಾಱು": [{"type": "verb", "defs": ["= ಕೊಳಕುನಾರು2."]}], "ಕೊಳಕುನುಡಿ": [{"type": "verb", "defs": ["to abuse; to use indecent and offensive language."]}, {"type": "noun", "defs": ["indecent or offensive speech."]}], "ಕೊಳಕುಮಂಡಲ": [{"type": "noun", "defs": ["the viper, Daboia elegans, which puffs out poison in its breath, that causes decomposition and putrefaction of the portion of the human body which comes into its contact."]}]}