{"ಕ್ರಿಯಾಋದ್ಧಿ": [{"type": "noun", "defs": ["(Jain.) the attainment of certain superhuman powers."]}], "ಕ್ರಿಯಾಂಗ": [{"type": "noun", "defs": ["a movement or movements collectively, of the body or of part of the body, to express or emphasise ideas, emotions, etc, in a drama staged, but not including delivery of dialogue.", "(mus.) one of the four old classifications of musical modes (but, opinions differ about the exact nature of this; however, this is now obs.)."]}], "ಕ್ರಿಯಾಕರ್ಮ": [{"type": "noun", "defs": ["(used in pl.) funeral rites and ceremonies."]}], "ಕ್ರಿಯಾಕಾಯವಾದಿ": [{"type": "noun", "defs": ["one who argues that the human body is meant only for action (karma)."]}], "ಕ್ರಿಯಾಕಾರ": [{"type": "noun", "defs": ["an agreement between two or more people to do something; a contract.", "a beginner in learning something; a novice; a new student."]}], "ಕ್ರಿಯಾಕಾರಕ": [{"type": "noun", "defs": ["that which causes a work happen; an active force or substance producing an effect; an agent."]}], "ಕ್ರಿಯಾಕಾಲ": [{"type": "noun", "defs": ["the time of an action; the proper time for performing a rite."]}], "ಕ್ರಿಯಾಕುಶಲ": [{"type": "adjective", "defs": ["having or showing skill; accomplished; expert; skilful."]}, {"type": "noun", "defs": ["a man who is very skilful or highly trained and informed in some special field."]}], "ಕ್ರಿಯಾಕುಶಲೆ": [{"type": "noun", "defs": ["a woman whois very skilful or highly trained and informed in some special field."]}], "ಕ್ರಿಯಾಖಂಡನ": [{"type": "noun", "defs": ["a failing to accomplish (something); such a failure."]}], "ಕ್ರಿಯಾಗುಪ್ತ": [{"type": "noun", "defs": ["(rhet.) a figure of speech, in which the verb or verbal clause is suggested indirectly or to be understood though not plainly expressed."]}], "ಕ್ರಿಯಾಗೋಚರದ್ರ್ಧಿ": [{"type": "noun", "defs": ["= ಕ್ರಿಯಾಋದ್ಧಿ."]}], "ಕ್ರಿಯಾಗೋಪಕ": [{"type": "noun", "defs": ["(rhet.) a figure of speech in which a verb, though present in a sentence, remains unobserved or is not obvious."]}], "ಕ್ರಿಯಾಚಾರ": [{"type": "noun", "defs": ["the act or an instance of doing, working, performing; performance."]}], "ಕ್ರಿಯಾಜ್ಞಾನ": [{"type": "noun", "defs": ["awareness or knowledge of action being or to be done."]}], "ಕ್ರಿಯಾತ್ಮಕ": [{"type": "adjective", "defs": ["functional; active - a) that is acting, functioning, working, moving, etc.; b) capable of acting, functioning, etc.; c) causing action, motion or change; d) characterised by much action or motion; lively, busy, agile, quick, etc."]}, {"type": "noun", "defs": ["(gram.) a word that indicates or includes the sense of an action."]}], "ಕ್ರಿಯಾತ್ಮಕತೆ": [{"type": "noun", "defs": ["the quality of a) acting, functioning, working, moving, etc.; b) being capable of acting, functioning, etc.; c) causing action, motion or change."]}], "ಕ್ರಿಯಾತ್ಮಕಶಿಕ್ಷಣ": [{"type": "noun", "defs": ["education that prepares students' attitude towards the practicalities, practical application, etc. (instead of being mere academic)."]}], "ಕ್ರಿಯಾತ್ಮಕಾವ್ಯಯ": [{"type": "noun", "defs": ["(gram.) any indeclinable that partakes of the nature of a verb."]}], "ಕ್ರಿಯಾದೀಕ್ಷೆ": [{"type": "noun", "defs": ["(vīr.) a formal initiation of a person by his preceptor into Vīraśaiva religion."]}], "ಕ್ರಿಯಾದ್ವೇಷ": [{"type": "noun", "defs": ["prejudice of a witness towards the cause."]}], "ಕ್ರಿಯಾದ್ವೇಷಿ": [{"type": "noun", "defs": ["a witness whose testimony is prejudicial to the cause."]}], "ಕ್ರಿಯಾದ್ವೈತ": [{"type": "noun", "defs": ["a performing of an action disinterestedly with the attitude that the Supreme Being is the actual doer, but not oneself.", "an agent that brings a thing into being or initiates a change."]}], "ಕ್ರಿಯಾನಿವೃತ್ತಿ": [{"type": "noun", "defs": ["a giving up of what one has to do; abandonment of one's action."]}], "ಕ್ರಿಯಾಪಟು": [{"type": "adjective", "defs": ["characterised by much action or motion; lively, busy, agile, quick, etc.; active."]}, {"type": "noun", "defs": ["an active, agile, responsive person or thing."]}], "ಕ್ರಿಯಾಪದ": [{"type": "noun", "defs": ["any of a class of words expressing action, existence or occurrence; a verb."]}], "ಕ್ರಿಯಾಪರಿಚ್ಛೇದ": [{"type": "noun", "defs": ["the improvement of efficiency by a) giving different parts of a manufacturing process etc. to different people, b) dividing the job among different people; division of labour."]}], "ಕ್ರಿಯಾಪಾದ": [{"type": "noun", "defs": ["that part of āgamas (auxiliary scriptures to Vedas) that deal with the procedures to be followed in worshipping a God or gods.", "(law) the third division of a legal plain, that is, witnesses, documents and others proofs adduced by the plaintiff or complainant."]}], "ಕ್ರಿಯಾಪೂರ್ವಕ": [{"type": "noun", "defs": ["that which is following, adhering to, the rules of scriptures."]}, {"type": "adverb", "defs": ["following, adhering or as per, the rules of scriptures."]}], "ಕ್ರಿಯಾಪ್ರಕೃತಿ": [{"type": "noun", "defs": ["the fundamental element of a verb, exclusive of all affixes and inflections; a root-verb."]}], "ಕ್ರಿಯಾಫಲ": [{"type": "noun", "defs": ["consequence of an act; anything brought about by an action."]}], "ಕ್ರಿಯಾಭಸಿತ": [{"type": "noun", "defs": ["(vīr.) holy ashes formally given by a preceptor to his disciple."]}], "ಕ್ರಿಯಾಭಾಗ": [{"type": "noun", "defs": ["= ಕ್ರಿಯಾಪಾದ."]}], "ಕ್ರಿಯಾಭೋಗಿ": [{"type": "noun", "defs": ["a person or animal that is engaged in actions and undergoing the effects thereof without understanding or analysing the process."]}], "ಕ್ರಿಯಾಭ್ರಮೆ": [{"type": "noun", "defs": ["the illusion of action, one of the factors that bind the soul to the worldly, non-spiritual affairs."]}], "ಕ್ರಿಯಾಭ್ರಷ್ಟ": [{"type": "adjective", "defs": ["that has failed in one's duties.", "not being grateful, thankful; ungrateful."]}, {"type": "noun", "defs": ["a man who has failed in his duties.", "a man not feeling thankful or grateful."]}], "ಕ್ರಿಯಾಭ್ರಷ್ಟೆ": [{"type": "noun", "defs": ["a woman whohas failed in her duties.", "a woman not feeling thankful or grateful."]}], "ಕ್ರಿಯಾಮಂತ್ರ": [{"type": "noun", "defs": ["(Jain.) a hymn that is capable of bringing results."]}], "ಕ್ರಿಯಾಮಥನ": [{"type": "noun", "defs": ["an action that is performed with a purpose; a deliberate action."]}], "ಕ್ರಿಯಾಮಾರ್ಗ": [{"type": "noun", "defs": ["the path of action (as diff. from paths of yoga or knowledge)."]}], "ಕ್ರಿಯಾಮಾಲೆ": [{"type": "noun", "defs": ["a series of actions (to be performed in a successive order).", "a table containing different forms (with inflections and affixes) of each verb."]}], "ಕ್ರಿಯಾಯೋಗ": [{"type": "noun", "defs": ["performance of actions, worldly and religious rites, without having desire for the results.", "the part of yoga practice which uses procedures requiring effort.", "a type of yoga which employs ritual as one of the techniques.", "a hard preliminary stage requiring adoption of the ascetic way of life dedicated study of the scriptures, etc. in order to prepare oneself for the higher stage of meditative absorptions leading to the realisation.", "(in modern phil.) an incorporating into one's working life, principles compatible with the goal, thereby progressing in one's regular meditative sessions.", "the employment of expedients or means.", "(gram.) connection with the verb."]}], "ಕ್ರಿಯಾರೂಪ": [{"type": "noun", "defs": ["that which is able to be put into practice, to be effected, accomplished or done; practicability.", "a set of facts, principles, rules, etc. classified or arranged in a regular orderly form in showing a logical plan linking the various parts; system."]}], "ಕ್ರಿಯಾರ್ಥ": [{"type": "noun", "defs": ["= ಕ್ರಿಯಾಪದ."]}], "ಕ್ರಿಯಾರ್ಥಕ": [{"type": "noun", "defs": ["= ಕ್ರಿಯಾಪದ."]}], "ಕ್ರಿಯಾರ್ಥಕಾವ್ಯಯ": [{"type": "noun", "defs": ["= ಕ್ರಿಯಾತ್ಮಕಾವ್ಯಯ."]}], "ಕ್ರಿಯಾಲಿಂಗ": [{"type": "noun", "defs": ["(vīr.) a small idol of Śiva, of one's choice tied by one's spiritual teacher.", "(vīr.) manifestation of the deity in the state of material body, being one of the three degrees of manifestation (cf. ಪ್ರಾಣಲಿಂಗ, ಭಾವಲಿಂಗ).", "(gram.) a desired gender."]}], "ಕ್ರಿಯಾಲೋಪ": [{"type": "noun", "defs": ["the action or an act of neglecting or failing to perform something, esp. a duty.", "omission, non-observance or discontinuance of any of the essential religious ceremonies.", "a violating of a set procedures, rules or custom (esp. in the conduct of legislative meetings); point of order."]}], "ಕ್ರಿಯಾವಂತ": [{"type": "adjective", "defs": ["characterised by much action or motion; lively, busy, agile, quick, etc.; active."]}, {"type": "noun", "defs": ["an active, agile, responsive man.", "a man who is grateful, thankful.", "a man observing religious rites strictly as per the rules."]}], "ಕ್ರಿಯಾವತಿ": [{"type": "noun", "defs": ["an active, agile, responsive woman.", "a woman whois grateful, thankful.", "a woman observing religious rites strictly as per the rules.", "(vīr.) one of the several types of religious initiations received from one's preceptor."]}], "ಕ್ರಿಯಾವತ್ವ": [{"type": "noun", "defs": ["the act or fact of performing ceremonies of a religion or one's duties."]}], "ಕ್ರಿಯಾವರ್ತನೆ": [{"type": "noun", "defs": ["operation - a) the condition of being in action or at work; b) a process or action that is part of a series in some work."]}], "ಕ್ರಿಯಾವಾಚಕ": [{"type": "noun", "defs": ["a word used to indicate the occurrence of or performance of an action or the existence of a state or condition, connecting the subject of a sentence with the rest of the predicate; a verb."]}], "ಕ್ರಿಯಾವಾಚಿ": [{"type": "noun", "defs": ["= ಕ್ರಿಯಾವಾಚಕ."]}], "ಕ್ರಿಯಾವಾಹಿ": [{"type": "noun", "defs": ["= ಕ್ರಿಯಾವಾಹಿನಿ."]}], "ಕ್ರಿಯಾವಾಹಿನಿ": [{"type": "noun", "defs": ["a nerve that carry impulses away from a nerve centre; an efferent nerve."]}], "ಕ್ರಿಯಾವಿಭಕ್ತಿ": [{"type": "noun", "defs": ["an inflection to a verb to express the relations of case, number, gender, person, tense, etc."]}], "ಕ್ರಿಯಾವಿಶೇಷ": [{"type": "noun", "defs": ["a particular or special work, job or action."]}], "ಕ್ರಿಯಾವಿಶೇಷಣ": [{"type": "noun", "defs": ["any of a class of words used generally to modify a verb, an adjective, another adverb, a phrase or a clause, by expressing time, place, manner, degree, cause, etc.; an adverb."]}], "ಕ್ರಿಯಾವೃತ್ತಿ": [{"type": "noun", "defs": ["the tendency, quality of being active, diligent, industrious."]}], "ಕ್ರಿಯಾವೇತ್ತ": [{"type": "noun", "defs": ["one who knows the rules of action, manner of any rite."]}], "ಕ್ರಿಯಾಶಕ್ತಿ": [{"type": "noun", "defs": ["a being able; capacity or power to do (something physical or mental); ability; capability.", "an active force."]}], "ಕ್ರಿಯಾಶಬ್ದ": [{"type": "noun", "defs": ["= ಕ್ರಿಯಾವಾಚಕ."]}], "ಕ್ರಿಯಾಶೀಲ": [{"type": "adjective", "defs": ["= ಕ್ರಿಯಾವಂತ1."]}, {"type": "noun", "defs": ["= ಕ್ರಿಯಾವಂತ2."]}], "ಕ್ರಿಯಾಶೀಲತೆ": [{"type": "noun", "defs": ["the quality, tendency of engaging, involving actively in a work, process, etc."]}], "ಕ್ರಿಯಾಶೀಲೆ": [{"type": "noun", "defs": ["= ಕ್ರಿಯಾವತಿ - 1 & 2."]}], "ಕ್ರಿಯಾಶುದ್ಧಿ": [{"type": "noun", "defs": ["the quality or state of being sincere, honest in performing one's duty."]}], "ಕ್ರಿಯಾಶೂನ್ಯ": [{"type": "adjective", "defs": ["not active, performing or moving; not functioning."]}, {"type": "noun", "defs": ["a man having or showing a disposition to avoid exertion; a slothful man."]}], "ಕ್ರಿಯಾಶೂನ್ಯತೆ": [{"type": "noun", "defs": ["the quality or condition of being inactive or not functioning or not tending to function; lack of activeness."]}], "ಕ್ರಿಯಾಶೂನ್ಯೆ": [{"type": "noun", "defs": ["a woman having or showing a disposition to avoid exertion; a slothful woman."]}], "ಕ್ರಿಯಾಸಕ್ತ": [{"type": "adjective", "defs": ["given to action rather than contemplation or speculation; having the interest or tendency to work; practical; active."]}, {"type": "noun", "defs": ["a man given to action rather than contemplation or speculation; an active, practical man."]}], "ಕ್ರಿಯಾಸಕ್ತತೆ": [{"type": "noun", "defs": ["= ಕ್ರಿಯಾಸಕ್ತಿ."]}], "ಕ್ರಿಯಾಸಕ್ತಿ": [{"type": "noun", "defs": ["the interest to work; the tendency of involving in action rather than contemplation or speculation."]}], "ಕ್ರಿಯಾಸಕ್ತೆ": [{"type": "noun", "defs": ["a woman given to action rather than contemplation or speculation; an active, practical woman."]}], "ಕ್ರಿಯಾಸಮಭಿಹಾರ": [{"type": "noun", "defs": ["recurrence of what one has to do or done; repetition of one's duties, performances."]}], "ಕ್ರಿಯಾಸಮಾಸ": [{"type": "noun", "defs": ["(gram.) a compound word in which one of thecomponents is a verb; a verbal compound."]}], "ಕ್ರಿಯಾಸಮಿತಿ": [{"type": "noun", "defs": ["a committee formed to take active steps, remedial measures, etc. esp. in politics or public administration; an action committee or group."]}], "ಕ್ರಿಯಾಸಾಧಕ": [{"type": "noun", "defs": ["that which is instrumental (in causing)."]}], "ಕ್ರಿಯಾಸಿದ್ಧಿ": [{"type": "noun", "defs": ["the act or fact of accomplishing, completing or fulfilling something; accomplishment."]}], "ಕ್ರಿಯಾಹೀನ": [{"type": "adjective", "defs": ["that is not performing one's duties.", "not being grateful, thankful; ungrateful."]}, {"type": "noun", "defs": ["a man who has is not working, active.", "a man not feeling thankful or grateful; an ingrate."]}], "ಕ್ರಿಯಾಹೀನೆ": [{"type": "noun", "defs": ["a woman whohas is not working, active.", "a woman not feeling thankful or grateful; an ingrate."]}], "ಕ್ರಿಯೆ": [{"type": "noun", "defs": ["the doing of something; action.", "an act or thing done; performance.", "a special duty or performance of an organ in human and other animals.", "a feeling of gratitude; an expression of it; gratefulness; thankfulness; gratitude.", "the act or process of applying the mind so as to acquire knowledge or understanding, as by reading, investigating, etc.; a study.", "the service rendered to a sick person; medical aid or treatment; medical service.", "a religious, ceremonial act, rite, etc.; observance; a ritual performance.", "any act of reparation, self-punishment, etc. done in repentance for a sin or wrong doing; penance.", "that by which something is done or obtained; agency; a means.", "a formal examination of the facts of a case by a court of law to decide the validity of a charge or claim; a trial.", "a usual method or custom; convention; practice.", "a beginning; commencement.", "the part of a sentence or clause containing what is said about a subject, including the logical copula; a predicate.", "a word used to indicate an action, state or occurrence; a verb."]}], "ಕ್ರಿಯೆಗೆಯ್": [{"type": "verb", "defs": ["to do; to perform.", "to medically treat a sick person; to tend the sick, injured, etc."]}], "ಕ್ರಿಯೆಗೆಯ್ಸು": [{"type": "verb", "defs": ["to cause to do.", "to cause to, get, arrange for medical treatment (of a sick, injured person)."]}], "ಕ್ರಿಯೆಬಟ್ಟಲು": [{"type": "noun", "defs": ["(vīr.) a small container used to drink holy water with which the linga (the symbol of Śiva) is washed."]}], "ಕ್ರಿಯೆವೆಱು": [{"type": "verb", "defs": ["to subject to an initiation or an ordeal that purifies or cleanses and makes one fit for further religious advancement."]}], "ಕ್ರಿಶ್ಚನ್": [{"type": "adjective", "defs": ["= ಕ್ರಿಶ್ಚಿಯನ್1."]}, {"type": "noun", "defs": ["= ಕ್ರಿಶ್ಚಿಯನ್2."]}], "ಕ್ರಿಶ್ಚಿಯನ್": [{"type": "adjective", "defs": ["of or professing the religion based on these teachings; Christian."]}, {"type": "noun", "defs": ["a person professing belief in Jesus as the Christ or in the religion based on the teachings of Jesus; an adherent of Christianity; a Christian."]}], "ಕ್ರಿಶ್ಚಿಯನ್‍ಧರ್ಮ": [{"type": "noun", "defs": ["the Christian religion, based on the Old and New Testament; the Christian faith; the doctrines of Christ and his disciples; Christianity."]}], "ಕ್ರಿಷ್ಟ": [{"type": "noun", "defs": ["a corrupt form of the word 'ಕೃಷ್ಣ'."]}], "ಕ್ರಿಸ್ಮಸ್": [{"type": "noun", "defs": ["the festival celebrating the birth of Jesus Christ on December 25.", "its celebration."]}], "ಕ್ರಿಸ್ತ": [{"type": "noun", "defs": ["Jesus of Nazareth, regarded by Christians as the realisation of the Messianic prophecy; Christ; (originally a title, Jesus the Christ, later used as part of the name (Jesus Christ)."]}], "ಕ್ರಿಸ್ತಪೂರ್ವ": [{"type": "adjective", "defs": ["(of a date) reckoned backwards from the birth of Jesus."]}, {"type": "noun", "defs": ["the period before the birth of Jesus (usu. reckoned backwards)."]}], "ಕ್ರಿಸ್ತಮತ": [{"type": "noun", "defs": ["= ಕ್ರಿಶ್ಚಿಯನ್‍ಧರ್ಮ."]}], "ಕ್ರಿಸ್ತಶಕ": [{"type": "noun", "defs": ["a reckoning of date from the birth of Jesus; Anon Dominic."]}], "ಕ್ರಿಸ್ತಾನ": [{"type": "noun", "defs": ["= ಕ್ರಿಶ್ಚಿಯನ್2."]}], "ಕ್ರಿಸ್ತಿಯ": [{"type": "adjective", "defs": ["= ಕ್ರಿಶ್ಚಿಯನ್1."]}, {"type": "noun", "defs": ["= ಕ್ರಿಶ್ಚಿಯನ್2."]}], "ಕ್ರಿಸ್ತೀಯ": [{"type": "adjective", "defs": ["= ಕ್ರಿಶ್ಚಿಯನ್1."]}, {"type": "noun", "defs": ["= ಕ್ರಿಶ್ಚಿಯನ್2."]}], "ಕ್ರೀ": [{"type": "noun", "defs": ["the doing of something; an action.", "an act or thing done.", "behaviour; habitual conduct.", "habitual activity characterised by energy and boldness.", "a usual method or custom; convention; practice.", "religious, ceremonial act, rite, etc.; observance.", "any act of reparation, self-punishment, etc. done in repentance for a sin or wrongdoing; penance."]}], "ಕ್ರೀಂಕಾರ": [{"type": "noun", "defs": ["the cry of a swan.", "a sound imitating it."]}], "ಕ್ರೀಡನ": [{"type": "noun", "defs": ["= ಕ್ರೀಡೆ."]}], "ಕ್ರೀಡನಶೀಲ": [{"type": "adjective", "defs": ["= ಕ್ರೀಡಾಶೀಲ1."]}, {"type": "noun", "defs": ["= ಕ್ರೀಡಾಶೀಲ2."]}], "ಕ್ರೀಡನಶೀಲತೆ": [{"type": "noun", "defs": ["= ಕ್ರೀಡಾಶೀಲತೆ."]}], "ಕ್ರೀಡನಶೀಲೆ": [{"type": "noun", "defs": ["= ಕ್ರೀಡಾಶೀಲೆ."]}], "ಕ್ರೀಡಮಾನ": [{"type": "adjective", "defs": ["playing; sporting; making merry."]}], "ಕ್ರೀಡಾಂಗಣ": [{"type": "noun", "defs": ["a place for outdoor games and recreation; a large, oval, round or U-shaped, usu. open structure, as for football, baseball, track events, etc., with tiers of seats for thousands of spectators; a play ground; a stadium."]}], "ಕ್ರೀಡಾಕುಳಿ": [{"type": "noun", "defs": ["a pond, pool for water-sport."]}], "ಕ್ರೀಡಾಗೃಹ": [{"type": "noun", "defs": ["a building where indoor games are played; a place of entertainment.", "a gambling house; a sporting house."]}], "ಕ್ರೀಡಾಗೋಳಕ": [{"type": "noun", "defs": ["a round or egg-shaped object varying greatly in size, material, and degree of hardness, and inflated or solid, according to the purpose for which it is intended to be used used in various games; a ball."]}], "ಕ್ರೀಡಾಚಳ": [{"type": "noun", "defs": ["= ಕ್ರೀಡಾಶೈಲ."]}], "ಕ್ರೀಡಾಪಟು": [{"type": "noun", "defs": ["a person who is interested or takes part in sports; esp. in hunting, fishing, etc. a sportsman or sportswoman."]}], "ಕ್ರೀಡಾಪರ್ವತ": [{"type": "noun", "defs": ["= ಕ್ರೀಡಾಶೈಲ."]}], "ಕ್ರೀಡಾಬ್ರಹ್ಮವಾದ": [{"type": "noun", "defs": ["the theory that propounds that this phenomenal world is the creation of the Supreme Being for his sport."]}], "ಕ್ರೀಡಾಮನೋಭಾವ": [{"type": "noun", "defs": ["a the quality of a person who can take loss or defeat without complaint or victory without gloating, and who treats his opponents with fairness, generosity, courtesy, etc.; sportsman-spirit."]}], "ಕ್ರೀಡಾರಥ": [{"type": "noun", "defs": ["a cart, chariot used in sporting, merrymaking, etc."]}], "ಕ್ರೀಡಾಲೋಕ": [{"type": "noun", "defs": ["the sphere of sports; the world of sports."]}], "ಕ್ರೀಡಾವನ": [{"type": "noun", "defs": ["a garden used as a meeting place and for entertainments; a pleasure-garden."]}], "ಕ್ರೀಡಾವಿನೋದ": [{"type": "noun", "defs": ["pleasure derived from sports."]}], "ಕ್ರೀಡಾವಲೋಲತೆ": [{"type": "noun", "defs": ["fondness for or deep interest in sports."]}], "ಕ್ರೀಡಾಶಾಲೆ": [{"type": "noun", "defs": ["= ಕ್ರೀಡಾಗೃಹ."]}], "ಕ್ರೀಡಾಶೀಲ": [{"type": "adjective", "defs": ["sportive - a) fond of or full of sport or merriment; playful b) doing in fun or play, not earnest."]}, {"type": "noun", "defs": ["a man who is fond of full of sport or merriment; a playful man.", "a man who by nature, does something in fun or for play; an insincere man."]}], "ಕ್ರೀಡಾಶೀಲತೆ": [{"type": "noun", "defs": ["the quality of being fond of or full of sport or merriment; playful.", "the nature of doing something in fun or play, lacking interest or sincerity."]}], "ಕ್ರೀಡಾಶೀಲತ್ವ": [{"type": "noun", "defs": ["= ಕ್ರೀಡಾಶೀಲತೆ."]}], "ಕ್ರೀಡಾಶೀಲೆ": [{"type": "noun", "defs": ["a woman who is fond of full of sport or merriment; a playful woman.", "a woman who by nature does something in fun or for play; an insincere woman."]}], "ಕ್ರೀಡಾಶೈಲ": [{"type": "noun", "defs": ["a mountain like mound or structure made for playing games on; an artificial hill."]}], "ಕ್ರೀಡಾಸಕ್ತ": [{"type": "adjective", "defs": ["fond of or interested in sport or merriment.", "engaged or involved in sport."]}, {"type": "noun", "defs": ["a man fond of or interested in sport or merriment.", "a man engaged or involved in sport."]}], "ಕ್ರೀಡಾಸಕ್ತತೆ": [{"type": "noun", "defs": ["= ಕ್ರೀಡಾಸಕ್ತಿ."]}], "ಕ್ರೀಡಾಸಕ್ತಿ": [{"type": "noun", "defs": ["the quality of being fond of sport or merriment; playful.", "the fact of being engaged or involved in sport."]}], "ಕ್ರೀಡಾಸಕ್ತೆ": [{"type": "noun", "defs": ["a woman fond of or interested in sport or merriment.", "a woman engaged or involved in sport."]}], "ಕ್ರೀಡೆ": [{"type": "noun", "defs": ["any activity or experience that gives enjoyment or recreation; any form of play or way of playing; amusement; recreation; sport; frolic; sport; a game.", "sexual intercourse including the erotic foreplay."]}], "ಕ್ರೀತ": [{"type": "adjective", "defs": ["obtained by paying a price; bought; purchased."]}, {"type": "noun", "defs": ["a boy adopted by a person, by paying money to the parent or parents of the boy."]}], "ಕ್ರೀತದಾಸ": [{"type": "noun", "defs": ["a man who is purchased by another as a slave, in a feudal system."]}], "ಕ್ರೀತದಾಸಿ": [{"type": "noun", "defs": ["a woman who is purchased by another as a slave, in a feudal system."]}], "ಕ್ರೀದಾಸಿ": [{"type": "noun", "defs": ["= ಕ್ರೀತದಾಸಿ."]}], "ಕ್ರೀವಂತ": [{"type": "noun", "defs": ["an active, agile, responsive man.", "a man who is grateful, thankful.", "a man observing religious rites strictly as per the rules."]}], "ಕ್ರೀಶುದ್ಧಾತ್ಮ": [{"type": "noun", "defs": ["a man who is honest in his action."]}], "ಕ್ರೀಶುದ್ಧಾತ್ಮೆ": [{"type": "noun", "defs": ["a woman whois honest in his action."]}], "ಕ್ರುಂಚ": [{"type": "noun", "defs": ["a kind of wading bird with a long neck, long legs, and a long, tapered bill, living along marshes and river banks; a kind of heron."]}], "ಕ್ರುಕರ": [{"type": "noun", "defs": ["name of one of the five vital airs of the body, helping in digesting the food and in the functioning of the eyelids."]}], "ಕ್ರುಕರಮಾರುತ": [{"type": "noun", "defs": ["= ಕ್ರುಕರ."]}], "ಕ್ರುಕರವಾಯು": [{"type": "noun", "defs": ["= ಕ್ರುಕರ."]}], "ಕ್ರುದ್ಧ": [{"type": "adjective", "defs": ["violently angry; full of fury or wild rage; furious."]}, {"type": "noun", "defs": ["a man in violent anger; a furious man."]}], "ಕ್ರುದ್ಧಮುದ್ರೆ": [{"type": "noun", "defs": ["a facial gesture to convey the feeling of enraged mind."]}], "ಕ್ರುದ್ಧೆ": [{"type": "noun", "defs": ["a woman in violent anger; a furious woman."]}], "ಕ್ರುಷ್ಟ": [{"type": "adjective", "defs": ["calling or crying out.", "weeping; wailing."]}, {"type": "noun", "defs": ["a long, pitiful cry of grief and pain.", "the act of wailing."]}], "ಕ್ರೂಜೆ": [{"type": "noun", "defs": ["= ಕ್ರೂಶ."]}], "ಕ್ರೂರ": [{"type": "adjective", "defs": ["disposed to inflict suffering; having or showing indifference to or pleasure in another's pain; merciless; pitiless; hard-hearted; cruel."]}, {"type": "noun", "defs": ["a man who deliberately seeks to inflict pain and suffering; he who enjoys others' suffering; a merciless, cruel man.", "a man who steals or is guilty of theft; a thief.", "the diurnal bird of prey Falco jugger of the family Falconidae, having long pointed wings; a falcon.", "boiled rice."]}], "ಕ್ರೂರಕರ್ಮ": [{"type": "noun", "defs": ["a cruel act; a deliberate inflicting of paid and suffering."]}], "ಕ್ರೂರಕರ್ಮಿ": [{"type": "noun", "defs": ["= ಕ್ರೂರ2 - 1."]}], "ಕ್ರೂರಗ್ರಾಹ್ಯ": [{"type": "noun", "defs": ["a man who believes or yields to slandereṛs words."]}], "ಕ್ರೂರಚಿತ್ತ": [{"type": "noun", "defs": ["a hard-hearted, unyielding, relentless man."]}], "ಕ್ರೂರಚಿತ್ತೆ": [{"type": "noun", "defs": ["a hard-hearted, unyielding, relentless woman."]}], "ಕ್ರೂರತನ": [{"type": "noun", "defs": ["the quality or condition of being cruel; inhumanity; hardheartedness; cruelty."]}], "ಕ್ರೂರದರ್ಶಿನಿ": [{"type": "noun", "defs": ["a woman who displays inhumanity, cruelty in her action."]}], "ಕ್ರೂರಮಾವು": [{"type": "noun", "defs": ["the evergreen tree Persaea macrantha ( = machilus macrantha) of Lauraceae family."]}], "ಕ್ರೂರಾಜ್ಞೆ": [{"type": "noun", "defs": ["a cruel, inhuman order, direction, injunction or command."]}], "ಕ್ರೂರಾಸ್ತ್ರ": [{"type": "noun", "defs": ["a fierce, ferocious weapon."]}], "ಕ್ರೂರಿ": [{"type": "noun", "defs": ["a person or animal that deliberately seeks to inflict pain and suffering or enjoys otherś suffering; a merciless, cruel person or animal."]}], "ಕ್ರೂಶ": [{"type": "noun", "defs": ["an upright post with a bar across it near the top, on which the ancient Romans fastened convicted persons to die; a cross.", "a representation or figure of a cross, used as a badge, decoration, etc.", "a cross with the figure of the crucified Jesus on it; a representation of a cross, in any of various recognised forms, as a symbol of the crucifixion of Jesus, hence of the Christian; a cross; a crucifix."]}], "ಕ್ರೂಶಾರೋಹಣ": [{"type": "noun", "defs": ["the crucifying of Jesus or a representation of this as in painting; crucifixion."]}], "ಕ್ರೂಸ": [{"type": "noun", "defs": ["= ಕ್ರೂಶ."]}], "ಕ್ರೇಂಕಾರ": [{"type": "noun", "defs": ["the cry of a swan.", "a sound imitating it."]}], "ಕ್ರೇಣಿ": [{"type": "noun", "defs": ["the act or an instance of buying, purchasing; a purchase."]}], "ಕ್ರೇತವ್ಯ": [{"type": "adjective", "defs": ["that can be purchased.", "that is fit to be bought."]}], "ಕ್ರೇತೃ": [{"type": "noun", "defs": ["a person who acquires or aims to acquire possessions; a purchaser; a buyer."]}], "ಕ್ರೇಯ": [{"type": "adjective", "defs": ["= ಕ್ರೇತವ್ಯ."]}], "ಕ್ರೈಸ್ತ": [{"type": "adjective", "defs": ["of or professing the religion based on these teachings of Jesus, the Christ; Christian."]}, {"type": "noun", "defs": ["a person professing belief in Jesus as the Christ or in the religion based on the teachings of Jesus; an adherent of Christianity; a Christian."]}], "ಕ್ರೈಸ್ತಧರ್ಮ": [{"type": "noun", "defs": ["the Christian religion, based on the Old and New Testament; the Christian faith; the doctrines of Christ and his disciples; Christianity."]}], "ಕ್ರೈಸ್ತಮತ": [{"type": "noun", "defs": ["= ಕ್ರೈಸ್ತಧರ್ಮ."]}], "ಕ್ರೋಂ": [{"type": "noun", "defs": ["(myst.) a mystical syllable krōm."]}], "ಕ್ರೋಟನ್ನು": [{"type": "noun", "defs": ["the ornamental plant Codiaeum variegatum of Euphorbiaceae family; croton."]}], "ಕ್ರೋಡ": [{"type": "noun", "defs": ["the chest - a) the part of the body enclosed by the ribs, breastbone, and diaphragm; thorax; b) the outside front part of this.", "the swine Sus scrofa; a hog.", "Viṣṇu, in his third of ten major incarnations, in the form of a boar.", "the planet Saturn.", "(myth.) one of the eight serpents which bear the earth.", "an elephant, Elephas maximus."]}], "ಕ್ರೋಡಪತ್ರ": [{"type": "noun", "defs": ["a page inserted in replacement of a portion or portions of test in a missing or damaged page in a literary work.", "a note, remark, explanation, etc. written by a reader on the sidelines or at the foot of a page of a book.", "additional or supplementary material at the end of a book or other writing; an appendix."]}], "ಕ್ರೋಡವಸೆ": [{"type": "noun", "defs": ["any of various mixtures of solid or semisolid triglycerides found in the tissues of a hog; the fat of a hog."]}], "ಕ್ರೋಡಶಾಲೆ": [{"type": "noun", "defs": ["a building in which elephants are sheltered and fed."]}], "ಕ್ರೋಡೀಕರಣ": [{"type": "noun", "defs": ["the act of embracing; a hug; a clasp; an embrace.", "the act of gathering or collecting from different places or sources and putting together (in an orderly form)."]}], "ಕ್ರೋಡೀಕರಿಸು": [{"type": "verb", "defs": ["to clasp in the arms, usu. as an expression of affection or desire; to hug; to embrace.", "to collect; to gather; to put together; to compile; to muster."]}], "ಕ್ರೋಡೀಕೃತ": [{"type": "adjective", "defs": ["put together; collected; gathered; compiled; mustered."]}], "ಕ್ರೋಧ": [{"type": "noun", "defs": ["excessive or violent anger; fury; rage."]}], "ಕ್ರೋಧಚರ್ವಿತ": [{"type": "noun", "defs": ["(in erotics) one of the ten types of fighting lightly with the teeth by a lover."]}], "ಕ್ರೋಧನ": [{"type": "adjective", "defs": ["enraged; violently angry; furious."]}, {"type": "noun", "defs": ["= ಕ್ರೋಧ.", "a man in violent anger; a furious man.", "name of the fifty ninth year in the cycle of sixty years in Hindu system."]}], "ಕ್ರೋಧವಾಣಿ": [{"type": "noun", "defs": ["furious speech or words."]}], "ಕ್ರೋಧಾಂಧ": [{"type": "noun", "defs": ["a man who is not able or willing to understand, judge from excessive rage."]}], "ಕ್ರೋಧಾತಿರೇಕ": [{"type": "noun", "defs": ["unreasonably excessive rage."]}], "ಕ್ರೋಧಿ": [{"type": "noun", "defs": ["a man in violent anger; a furious man.", "name of the thirty eighth year in the cycle of sixty years in Hindu system."]}], "ಕ್ರೋಧಿನಿ": [{"type": "noun", "defs": ["the passionate stage of an elephant in rut."]}], "ಕ್ರೋಧೋನ್ಮತ್ತ": [{"type": "adjective", "defs": ["being incapable of reasoning because of one's own fury."]}, {"type": "noun", "defs": ["a man incapable of reasoning because of his own fury.", "ಕ್ರೋಧೋನ್ಮತ್ತನಾಗು krōdhōnmattanāgu to become blind by anger; to lose one's judgement owning to one's wrath."]}], "ಕ್ರೋಧೋನ್ಮತ್ತತೆ": [{"type": "noun", "defs": ["the state of being furious and because of which, being incapable of taking judgement."]}], "ಕ್ರೋಧೋನ್ಮತ್ತೆ": [{"type": "noun", "defs": ["a woman incapable of reasoning because of her own fury."]}], "ಕ್ರೋಶ": [{"type": "noun", "defs": ["a calling out; a cry; yell; scream.", "a measure of distance (of three to four miles)."]}], "ಕ್ರೋಷಾ": [{"type": "noun", "defs": ["a kind of needlework in which loops of a thread or yarn are interwoven by means of a single hooked needle; crochet."]}], "ಕ್ರೋಷ್ಟು": [{"type": "noun", "defs": ["a man who cries, yells; a screamer.", "a wild doglike mammal Canis aureus of the genus Canis, which usu. hunts for food in packs at night, and also eat carrion and certain plants; a jackal."]}], "ಕ್ರೋಷ್ಟುವಿನೆ": [{"type": "noun", "defs": ["= ಕ್ರೋಷ್ಟುವಿನ್ನೆ."]}], "ಕ್ರೋಷ್ಟುವಿನ್ನೆ": [{"type": "noun", "defs": ["the plant Hemionite sarifolia ( = H. cordifolia) of Polypodiaceae family."]}], "ಕ್ರೋಷ್ಟø": [{"type": "noun", "defs": ["a plant of Convolvulus genus, of the morning-glory family, with funnel-shaped flowers and triangular leaves."]}], "ಕ್ರೋಷ್ಟ್ರೀ": [{"type": "noun", "defs": ["the plant Ipomoea paniculata ( = Batatas paniculata) of Convolvulaceae family.", "a female jackal (Canis aureus)."]}], "ಕ್ರೋಸು": [{"type": "noun", "defs": ["= ಕ್ರೂಶ."]}], "ಕ್ರೋಳ": [{"type": "noun", "defs": ["the chest - a) the part of the body enclosed by the ribs, breastbone, and diaphragm; thorax; b) the outside front part of this."]}], "ಕ್ರೌಂಚ": [{"type": "noun", "defs": ["any of large, brownish shorebirds of Scolopacidae family (Numenius genus), with long legs and a long, down-curved bill; a curlew.", "one of the seven mythological divisions of the world.", "a mythological mountain in the Himalayas.", "(myth.) name of a daemon."]}], "ಕ್ರೌಂಚದಾರಣ": [{"type": "noun", "defs": ["(myth.) Ṣaṇmukha, who split the mountain ಕ್ರೌಂಚ."]}], "ಕ್ರೌಂಚಪದ": [{"type": "noun", "defs": ["(pros.) a meter having twenty five syllables in each quarter."]}], "ಕ್ರೌಂಚವ್ಯೂಹ": [{"type": "noun", "defs": ["an arraying of troops for battle in the shape of the heron; a heron-array."]}], "ಕ್ರೌಂಚಾರಾತಿ": [{"type": "noun", "defs": ["= ಕ್ರೌಂಚದಾರಣ.", "(myth.) Paraśurāma, the sixth incarnation of Viṣṇu."]}], "ಕ್ರೌಂಚಾರಿ": [{"type": "noun", "defs": ["= ಕ್ರೌಂಚದಾರಣ."]}], "ಕ್ರೌಂಚಾಸನ": [{"type": "noun", "defs": ["a particular yogic posture, resembling a standing heron."]}], "ಕ್ರೌರ್ಯ": [{"type": "noun", "defs": ["the quality or condition of being cruel; inhumanity; hardheartedness; cruelty."]}], "ಕ್ಲಪ್ತ": [{"type": "adjective", "defs": ["having exact limits; precise; certain; definite."]}], "ಕ್ಲಪ್ತಕಾಲ": [{"type": "noun", "defs": ["a pre-determined time."]}], "ಕ್ಲಪ್ತವೃತ್ತ": [{"type": "noun", "defs": ["a thing imagined; an object of imagination."]}], "ಕ್ಲಬ್ಬು": [{"type": "noun", "defs": ["a group of people associated for a common purpose or mutual advantage, usu. in an organisation that meets regularly, as for entertainment, sports, pastime, etc; a club.", "the room, building or facilities used by such a group."]}], "ಕ್ಲಮ": [{"type": "noun", "defs": ["physical or mental exhaustion; weariness; fatigue."]}], "ಕ್ಲಮಥ": [{"type": "noun", "defs": ["= ಕ್ಲಮ."]}], "ಕ್ಲಮಥು": [{"type": "noun", "defs": ["= ಕ್ಲಮ.", "a sensation of hurting or strong discomfort, in some part of the body, caused by an injury, disease or functional disorder; pain."]}], "ಕ್ಲಾಂತ": [{"type": "adjective", "defs": ["tired; weary; exhausted; fatigued."]}], "ಕ್ಲಾಂತಿ": [{"type": "noun", "defs": ["= ಕ್ಲಮ."]}], "ಕ್ಲಾರ್ಕು": [{"type": "noun", "defs": ["an office worker who keeps records, types letters, does filing, etc. ; a clerk."]}], "ಕ್ಲಿಕ್‍ದುಂಬಿ": [{"type": "noun", "defs": ["a kind of beetles."]}], "ಕ್ಲಿನ್ನ": [{"type": "adjective", "defs": ["moist; wet; damp.", "tearful; weeping."]}, {"type": "noun", "defs": ["the condition of being moist, damp; wetness."]}], "ಕ್ಲಿನ್ನಾಕ್ಷ": [{"type": "noun", "defs": ["a weeping man; a man with tearful eyes.", "a man with dim vision."]}], "ಕ್ಲಿನ್ನಾಕ್ಷೆ": [{"type": "noun", "defs": ["a weeping woman; a woman with tearful eyes.", "a woman with dim vision."]}], "ಕ್ಲಿಶಿತ": [{"type": "adjective", "defs": ["suffering; pained; distressed; afflicted.", "tired; weary; exhausted; fatigued."]}], "ಕ್ಲಿಶ್ಯಮಾನ": [{"type": "adjective", "defs": ["= ಕ್ಲಿಶಿತ."]}, {"type": "noun", "defs": ["an afflicted, distressed man."]}], "ಕ್ಲಿಷ್ಟ": [{"type": "adjective", "defs": ["difficult - a) needing much effort or skill; b) troublesome, perplexing; c) (of a person) a not easy to please or satisfy; d) characterised by hardships or problems (a difficult period in on's life)."]}, {"type": "noun", "defs": ["a trouble - a) a misfortune; calamity; mishap; b) a distressing or difficult happening or situation.", "(rhet.) a style that is complex to understand (considered as a fault in literary work)."]}], "ಕ್ಲಿಷ್ಟಕ": [{"type": "noun", "defs": ["a man who inflicts pain or is habitually harmful, troublesome."]}], "ಕ್ಲಿಷ್ಟತೆ": [{"type": "noun", "defs": ["the quality of - a) being troublesome, perplexing; b) needing much effort or skill; c) being hard, complex to understand."]}], "ಕ್ಲೀತಕ": [{"type": "noun", "defs": ["the plant Glycyrrhiza glabra ( = G. glandulifera) of Papilionaceae family; Liquorice."]}], "ಕ್ಲೀತನ": [{"type": "noun", "defs": ["= ಕ್ಲೀತಕ."]}], "ಕ್ಲೀಬ": [{"type": "noun", "defs": ["a man who is unable to engage in sexual intercourse, esp. because of an inability to have an erection; an impotent man.", "a castrated man.", "a man lacking physical strength, vigour or is shamefully timid.", "a man disinclined to work or doing little work; a lazy man.", "a stingy, miserly man; a miser.", "(gram.) the noun or pronoun, etc. that is neither masculine nor feminine gender; neuter gender."]}], "ಕ್ಲೀಬತನ": [{"type": "noun", "defs": ["= ಕ್ಲೈಬ್ಯ."]}], "ಕ್ಲೀಬವರ್ಣ": [{"type": "noun", "defs": ["a consonant or vowel that is very weak and mainly occur in non-Kannaḍa words used in Kannaḍa with little or no modification( as ಋ, ೠ, ಶ, ಷ)."]}], "ಕ್ಲೀಬಸ್ವರ": [{"type": "noun", "defs": ["a vowel that is very weak and mainly occur in non-Kannaḍa words used in Kannaḍa with little or no modification( as ಋ, ೠ)."]}], "ಕ್ಲೀವ": [{"type": "noun", "defs": ["= ಕ್ಲೀಬ."]}], "ಕ್ಲುಪ್ತ": [{"type": "noun", "defs": ["= ಕ್ಲಪ್ತ."]}], "ಕ್ಲುಪ್ತಕಾಲ": [{"type": "noun", "defs": ["= ಕ್ಲಪ್ತಕಾಲ."]}], "ಕ್ಲುಪ್ತಿ": [{"type": "noun", "defs": ["a making certain or definite; a determining; ascertainment; determination."]}], "ಕ್ಲೇದನ": [{"type": "noun", "defs": ["the act of making moist, damp; a dampening.", "the act of making the mind soft or softer; a making the heart become tender."]}], "ಕ್ಲೇದನೆ": [{"type": "noun", "defs": ["= ಕ್ಲೇದನ."]}], "ಕ್ಲೇಶ": [{"type": "noun", "defs": ["great suffering, as from worry, grief or pain; agony; anguish.", "(phil.) any of the five types of obstacles that cause anguish (they being ignorance, self-conceit; passion, hatred, and instinctive clinging to worldly life).", "intense anger; rage; fury; wrath.", "the quality or fact of being thoughtful, cautious or guarded.", "worldly occupation; mundane affairs."]}], "ಕ್ಲೇಶಂಗೊಳಿಸು": [{"type": "verb", "defs": ["to cause pain to; to cause to suffer; to hurt; to distress."]}], "ಕ್ಲೇಶಂಬಡು": [{"type": "verb", "defs": ["= ಕ್ಲೇಶಪಡು."]}], "ಕ್ಲೇಶಕ್ಷತ": [{"type": "noun", "defs": ["a man who has suffered pain or undergone affliction; a distressed man."]}], "ಕ್ಲೇಶಕ್ಷತೆ": [{"type": "noun", "defs": ["a woman who has suffered pain or undergone affliction; a distressed woman."]}], "ಕ್ಲೇಶಗೊಳ್": [{"type": "verb", "defs": ["to feel pain; to be afflicted."]}], "ಕ್ಲೇಶನ": [{"type": "noun", "defs": ["the act of causing affliction; persecution."]}], "ಕ್ಲೇಶಪಂಚಕ": [{"type": "noun", "defs": ["(pl.) (phil.) the five types of obstacles (ignorance, self-conceit; passion, hatred, and instinctive clinging to worldly life) that cause anguish."]}], "ಕ್ಲೇಶಪಡು": [{"type": "verb", "defs": ["to suffer pain; to undergo affliction; to be persecuted."]}], "ಕ್ಲೇಶರಹಿತ": [{"type": "adjective", "defs": ["free from affliction, pain, distress.", "(to understand) not being difficult; simple; understandable."]}, {"type": "noun", "defs": ["a man not having complicated, complex nature; a simple, straightforward man."]}], "ಕ್ಲೇಶರಹಿತೆ": [{"type": "noun", "defs": ["a woman not having complicated, complex nature; a simple, straightforward woman."]}], "ಕ್ಲೇಶಸಹಿಷ್ಣು": [{"type": "noun", "defs": ["a person having ability to stand pain, distress, fatigue, etc. patiently, calmly and courageously."]}], "ಕ್ಲೇಶಾನುಬಂಧ": [{"type": "noun", "defs": ["a series of painful, afflicting, distressing incidents or occasions."]}], "ಕ್ಲೇಶಿ": [{"type": "noun", "defs": ["a person who in distress; an afflicted person.", "a person who afflicts pain, causes distress."]}], "ಕ್ಲೈಬ್ಯ": [{"type": "noun", "defs": ["the quality or fact of a man who is unable to engage in sexual intercourse, esp. because of an inability to have an erection; impotency.", "lack of physical strength, vigour or the quality of being shamefully timid."]}], "ಕ್ಲೈಬ್ಯತೆ": [{"type": "noun", "defs": ["= ಕ್ಲೈಬ್ಯ."]}], "ಕ್ಲೋಮ": [{"type": "noun", "defs": ["either of the two spongelike respiratory organs in the thorax of vertebrates, that oxygenate the blood and remove carbon dioxide from it; the lung.", "a saclike structure in many animals, serving for temporary storage of fluid or semifluid excretions, as urine; the urinary bladder."]}], "ಕ್ಲೋರೋಫಾರಂ": [{"type": "noun", "defs": ["= ಕ್ಲೋರೋಫಾರ್ಮು."]}], "ಕ್ಲೋರೋಫಾರ್ಮು": [{"type": "noun", "defs": ["a toxic, carcinogenic, colourless, volatile liquid, CHCl3, with a sweet taste, used as a solvent, fumigant, etc. and, formerly, as a general anesthetic; chloroform."]}], "ಕ್ಲೋವರು": [{"type": "noun", "defs": ["the clover plant Trifolium pratense with flowers in reddish, ball-shaped heads, grown for fodder and forage; red-clover."]}], "ಕ್ವಚಿತ": [{"type": "adverb", "defs": ["in, to or at some place not known or specified.", "at some time, degree.", "occasionally but infrequently; rarely; seldom.", "secretly; hiddenly."]}], "ಕ್ವಚಿತ್ತ": [{"type": "adverb", "defs": ["= ಕ್ವಚಿತ."]}], "ಕ್ವಚಿತ್ತು": [{"type": "adverb", "defs": ["= ಕ್ವಚಿತ."]}], "ಕ್ವಚಿತ್ಪ್ರಯೋಗ": [{"type": "noun", "defs": ["a very occasional usage (of a word, grammatical form, etc.)."]}], "ಕ್ವಣ": [{"type": "noun", "defs": ["the sharp, slight metallic sound (as of ornaments, glasses, etc.); a clinking sound.", "the sound emanated from a string of a musical instrument, as vīṇe, when plucked with little jerking movements of the fingers."]}], "ಕ್ವಣತ್ಕಂಕಣ": [{"type": "noun", "defs": ["the short, sharp, light sound of the bangles (of glass) or ornamental metal bands worn about the wrist."]}], "ಕ್ವಣನ": [{"type": "noun", "defs": ["= ಕ್ವಣ."]}], "ಕ್ವಣಿತ": [{"type": "noun", "defs": ["= ಕ್ವಣ."]}], "ಕ್ವಥನ": [{"type": "noun", "defs": ["the act or an instance of cooking.", "the fact of being boiled; a boiling or bubbling up; effervescence."]}], "ಕ್ವಥನಬಿಂದು": [{"type": "noun", "defs": ["the temperature at which a liquid boils; boiling point."]}], "ಕ್ವಥನಮಾಪಕ": [{"type": "noun", "defs": ["an instrument for the precise measurement of boiling points; an ebullioscope."]}], "ಕ್ವಥನಮಾಪನ": [{"type": "noun", "defs": ["the precise measurement of boiling points, esp. as a means of determining the molecular weight of a compound from the rise in the boiling point of a liquid when the compound is dissolved in the liquid."]}], "ಕ್ವಥಿತ": [{"type": "adjective", "defs": ["cooked.", "boiled."]}], "ಕ್ವಯನಾಮರ": [{"type": "noun", "defs": ["the tree Cinchona succirubra of Rubiaceae family, from the bark of which quinine and related medicinal alkaloids are obtained; cinchona tree."]}], "ಕ್ವಯನು": [{"type": "noun", "defs": ["= ಕ್ವಿನೀನು."]}], "ಕ್ವಾಣ": [{"type": "noun", "defs": ["= ಕ್ವಣ."]}], "ಕ್ವಾಥ": [{"type": "noun", "defs": ["an extract or the essence, flavour, etc. produced of by boiling; a decoction."]}], "ಕ್ವಾಥರಸ": [{"type": "noun", "defs": ["= ಕ್ವಾಥ."]}], "ಕ್ವಾಥೋದ್ಭವ": [{"type": "noun", "defs": ["= ಕ್ವಾಥ.", "copper sulphate; green vitriol."]}], "ಕ್ವಿಂಟಲ್": [{"type": "noun", "defs": ["= ಕ್ವಿಂಟಾಲು."]}], "ಕ್ವಿಂಟಾಲು": [{"type": "noun", "defs": ["a metric unit of weight, equal to 100 kilograms (220.46 lbs.); a quintal."]}], "ಕ್ವಿನಾಯಿನ್": [{"type": "noun", "defs": ["= ಕ್ವಿನೀನು."]}], "ಕ್ವಿನೀನು": [{"type": "noun", "defs": ["a bitter, crystalline alkaloid, extracted from cinchona (Cinchona succirubra) bark; quinine."]}], "ಕ್ಷಂತೃ": [{"type": "noun", "defs": ["a man who, by his nature, can tolerate, endure or forbear."]}], "ಕ್ಷಕಾರ": [{"type": "noun", "defs": ["the compound of consonants, 'ಕ್ಷ'."]}], "ಕ್ಷಕಿರಣ": [{"type": "noun", "defs": ["a band of electromagnetic radiation with wavelengths between gamma rays and ultraviolet radiation, produced by the bombardment of a substance (usu. one of the heavy metals) by a stream of electrons moving at great velocity, as in a vacuum tube, capable of penetrating opaque or solid substances, ionizing gases and body tissues through which they pass or, by extended exposure, destroying tissue, and affecting photographic plates and fluorescent screens, used in diagnosis, and treatment of certain organic disorders, esp. of internal structures of the body; x-ray.", "(fig.) a deep, probing examination, going beyond what is apparent."]}], "ಕ್ಷಕಿರಣಪಟ": [{"type": "noun", "defs": ["a photograph made by means of X-rays."]}], "ಕ್ಷಣ": [{"type": "noun", "defs": ["a measure of time equal to forty eight seconds.", "a very short period of time; moment; instant.", "free, unoccupied time during which a person may indulge in rest, recreation, etc.; leisure; free-time.", "a right, proper or auspicious moment.", "that which chiefly engages one's time; (one's) trade, profession or business; occupation.", "a time or day of feasting or celebration; a joyous occasion; a festival; a festival occasion.", "the middle, central portion of (anything).", "the condition or fact of being dependent upon or controlled by another; dependence.", "a condition of being very low in position, status, quality, etc.", "the condition of a slave, serf or the like; subjection to a master; slavery or bondage; servitude.", "ಕ್ಷಣ ಚಿತ್ತ, ಕ್ಷಣ ಪಿತ್ತ kṣaṇa citta, kṣaṇa pitta the quality or condition of a person who changes his opinion or reverses his own thought, without reason, frequently; fickleness."]}], "ಕ್ಷಣಗಂಡ": [{"type": "noun", "defs": ["a series of afflicting, distressing or impeding incidents or occasions, occurring very frequently."]}], "ಕ್ಷಣಗಭಸ್ತಿ": [{"type": "noun", "defs": ["= ಕ್ಷಣಪ್ರಭೆ."]}], "ಕ್ಷಣದಾಚರ": [{"type": "noun", "defs": ["a person moving, functioning or active during the night; a devil; an evil spirit; a demon."]}], "ಕ್ಷಣದಾಟನ": [{"type": "noun", "defs": ["= ಕ್ಷಣದಾಚರ."]}], "ಕ್ಷಣದೆ": [{"type": "noun", "defs": ["the period of actual darkness after sunset and before sunrise; night."]}], "ಕ್ಷಣನ": [{"type": "noun", "defs": ["the act or an instance of hurting, injuring.", "a killing; murder."]}], "ಕ್ಷಣಪದವಿ": [{"type": "noun", "defs": ["a position, status, etc. that lasts for a very short period."]}], "ಕ್ಷಣಪ್ರಭೆ": [{"type": "noun", "defs": ["a sudden, brief light; a flash; a lightning.", "(fig.) a sudden, brief display of thought, understanding."]}], "ಕ್ಷಣಭಂಗವೃತ್ತಿ": [{"type": "noun", "defs": ["that which lasts for a very short period; an ephemeral thing."]}], "ಕ್ಷಣಭಂಗಿ": [{"type": "noun", "defs": ["= ಕ್ಷಣಭಂಗವೃತ್ತಿ."]}], "ಕ್ಷಣಭಂಗುರ": [{"type": "adjective", "defs": ["short-lived; transitory; of a passing nature; not enduring or permanent; temporary, fleeting or ephemeral; transient."]}], "ಕ್ಷಣಭಂಗುರತೆ": [{"type": "noun", "defs": ["the quality or fact of being temporary, fleeting, ephemeral or not enduring; transitoriness."]}], "ಕ್ಷಣಮಾತ್ರ": [{"type": "adverb", "defs": ["for a moment or short period; temporarily; momentarily."]}], "ಕ್ಷಣರುಚಿ": [{"type": "noun", "defs": ["= ಕ್ಷಣಪ್ರಭೆ."]}], "ಕ್ಷಣವಂತ": [{"type": "noun", "defs": ["(Jain.) a man who is extremely quiet and unperturbed by external affairs."]}]}