{"ತೊನೆಹ": [{"type": "noun", "defs": ["= ತೊನೆಪ."]}], "ತೊನ್ನ": [{"type": "noun", "defs": ["a man having smooth, white patches on various parts of the body caused by leucoderma."]}], "ತೊನ್ನಿ": [{"type": "noun", "defs": ["a woman having smooth, white patches on various parts of the body caused by leucoderma."]}], "ತೊನ್ನು": [{"type": "noun", "defs": ["a skin disorder characterised by smooth, white patches on various parts of the body, caused by the loss of the natural pigment; leucoderma; vitiligo."]}], "ತೊನ್ನುಗೊಳ್": [{"type": "verb", "defs": ["= ತೊನ್ನುಹಿಡಿ."]}], "ತೊನ್ನುಬಡಕ": [{"type": "noun", "defs": ["= ತೊನ್ನ."]}], "ತೊನ್ನುಬಡಕಿ": [{"type": "noun", "defs": ["= ತೊನ್ನಿ."]}], "ತೊನ್ನುವಿಡಿ": [{"type": "verb", "defs": ["= ತೊನ್ನುಹಿಡಿ."]}], "ತೊನ್ನುಹಿಡಿ": [{"type": "verb", "defs": ["(leucoderma) to affect a person with white patches on the body."]}], "ತೊನ್ನೆ": [{"type": "noun", "defs": ["= ತೊನ್ನಿ."]}], "ತೊಪ್": [{"type": "noun", "defs": ["an onomatopoeically formed word imitating the heavy sound made by an object when fell down loosely."]}], "ತೊಪತೊಪ": [{"type": "noun", "defs": ["an onomatopoeically formed word imitating the sound as made by continuous fall of rain drops."]}], "ತೊಪತೊಪನೆ": [{"type": "adverb", "defs": ["(falling) continuously with or as with the sounds of rain drops."]}], "ತೊಪ್ಪಟೆ": [{"type": "noun", "defs": ["the natural outer covering of fruits or vegetables; the skin.", "the outside covering of the stems and roots of trees and woody plants; the bark."]}], "ತೊಪ್ಪಡೆ": [{"type": "noun", "defs": ["= ತೊಪ್ಪಟೆ."]}], "ತೊಪ್ಪನೆ": [{"type": "adverb", "defs": ["(falling) suddenly and with a heavy sound (as made by an object that fell loosely)."]}], "ತೊಪ್ಪರು": [{"type": "noun", "defs": ["the plant Boerhaavia diffusa (= B. procumbens, = B. repens) of Nyctaginaceae family; the spreading hog weed."]}], "ತೊಪ್ಪಲ": [{"type": "noun", "defs": ["= ತೊಪ್ಪಲು."]}], "ತೊಪ್ಪಲು": [{"type": "noun", "defs": ["(collectively) leaves (esp. young ones) of plants.", "the tree Acacia leucophloea of Mimosae family.", "another acacia tree Acacia farnesiana of the same family.", "the twining shrub Aristolochia indica of Aristolochiaceae family; Indian birth wort; serpent root plant."]}], "ತೊಪ್ಪಾಲೆ": [{"type": "noun", "defs": ["= ತೊಪ್ಪಲು."]}], "ತೊಪ್ಪಿಗೆ": [{"type": "noun", "defs": ["any close-fitting head covering, either brimless or with a projecting brim, and made of wool, cotton, etc.; a cap."]}], "ತೊಪ್ಪು": [{"type": "noun", "defs": ["= ತೊಪ್."]}], "ತೊಪ್ಪೆ": [{"type": "noun", "defs": ["the condition or fact of being very fat, without strength; fatness, stoutness; obesity; corpulence.", "ತೊಪ್ಪೆ ಮೈ toppe mai the body (of a person) that is very fat but not having corresponding strength."]}, {"type": "noun", "defs": ["the excrement of cattle, buffalo, that is not dried.", "ತೊಪ್ಪೆ ತಟ್ಟು toppe taṭṭu to make flat cake from the undried dung of cattle or buffalo; ತೊಪ್ಪೆ ಹಾಕು toppe hāku (said of cattle, buffalo) to discharge the dung."]}], "ತೊಬಟೆ": [{"type": "noun", "defs": ["= ತೊಪ್ಪಟೆ - 2."]}], "ತೊಬ್ಬು": [{"type": "verb", "defs": ["to work as a slave."]}], "ತೊಮ್ಮೆ": [{"type": "adverb", "defs": ["nine times."]}, {"type": "noun", "defs": ["a connected group; a cluster; a bunch.", "a collection or assemblage of large number of persons at a place.", "a line in which number of persons or things are arranged; a row.", "the fact or state of excelling; superiority; eminence; excellence."]}], "ತೊಮ್ಮೆವಡೆ": [{"type": "verb", "defs": ["to become more in quantity, number, degree, etc."]}], "ತೊಯ್": [{"type": "verb", "defs": ["= ತೊಯ್ಯು."]}], "ತೊಯಿ": [{"type": "noun", "defs": ["= ತೊಯೆ."]}], "ತೊಯಿಸು": [{"type": "verb", "defs": ["= ತೊಯ್ಯಿಸು."]}], "ತೊಯೆ": [{"type": "noun", "defs": ["a dish made of pulses with or without vegetables."]}], "ತೊಯ್ತ": [{"type": "noun", "defs": ["the condition of being soaked (thoroughly) (as in water)."]}], "ತೊಯ್ಯಿಸು": [{"type": "verb", "defs": ["to make thoroughly wet; to drench or saturate; to soak."]}], "ತೊಯ್ಯು": [{"type": "verb", "defs": ["to become soaked in a liquid (as water, blood, etc.).", "to cause to be soaked so."]}], "ತೊರಂಗಲು": [{"type": "noun", "defs": ["the medium-sized, evergreen tree Pongamia pinnata (= P. glabra) of Papilionaceae family, known for its cool shadow and hard wood."]}], "ತೊರಕೆ": [{"type": "noun", "defs": ["a kind of fish."]}], "ತೊರಕೆಬಲೆ": [{"type": "noun", "defs": ["a kind of fish-catching net."]}], "ತೊರಟೆ": [{"type": "noun", "defs": ["that which has become a soft, semisolid mass; a coagulated thing."]}], "ತೊರತಿ": [{"type": "noun", "defs": ["= ತೊರತ್ತಿ."]}], "ತೊರತೆ": [{"type": "noun", "defs": ["the natural source of a stream; a oozing of usu. water from underground; something that oozes."]}], "ತೊರತ್ತಿ": [{"type": "noun", "defs": ["the large, evergreen tree Hydnocarpus alpina of Flacourtiaceae family.", "another tree of the same family, H. Laurifolia (= H. wightiana)."]}], "ತೊರನಿ": [{"type": "noun", "defs": ["( wrong form of) ತೊರಿಸಿ."]}], "ತೊರಲೆ": [{"type": "noun", "defs": ["a kind of."]}], "ತೊರವಿ": [{"type": "noun", "defs": ["the act of giving up or sacrificing (something); abandonment; sacrifice.", "exemption from the controls, restraints or confinements, 3. that which is fit to be or must be, abandoned."]}], "ತೊರಸು": [{"type": "verb", "defs": ["= ತೊರೆಸು."]}], "ತೊರಳಿ": [{"type": "noun", "defs": ["= ತೊರಳೆ."]}], "ತೊರಳೆ": [{"type": "noun", "defs": ["a large, vascular, lymphatic organ in the upper left part of the abdominal cavity of vertebrates, near the stomach, that has various functions in modifying the structure of the blood and forms part of the immune system; the spleen."]}], "ತೊರಿಗ": [{"type": "noun", "defs": ["a kind of insect."]}], "ತೊರಿಸಿ": [{"type": "noun", "defs": ["the plant Wendlandia glabrata of Rubiaceae family."]}], "ತೊರೆ": [{"type": "verb", "defs": ["to abandon - a) to leave completely and finally; to forsake utterly; to desert; b) to give up; to discontinue; to withdraw from; c) to give up the control of."]}, {"type": "verb", "defs": ["(milk) to be generated (in plenty) in the breast (of a woman).", "(milk) to flow out from the female breast.", "to ooze out; to percolate down.", "to cause to ooze or percolate.", "to flow (as a river).", "to extend over a greater or a considerable area; to spread oneself.", "to become (physically) develop well.", "to happen; to occur."]}, {"type": "noun", "defs": ["a natural stream of water of fairly large size flowing in a definite course; a river.", "a great flowing or overflowing of water, esp. over land not usu. submerged; a flood."]}], "ತೊರೆಕಣಗಿಲೆ": [{"type": "noun", "defs": ["the tree Barringtonia acutangula of Lecythidaceae family; Indian oak."]}], "ತೊರೆಕರೆ": [{"type": "verb", "defs": ["either of the banks of a river."]}], "ತೊರೆಗರೆ": [{"type": "verb", "defs": ["= ತೊರೆಬಿಡು."]}], "ತೊರೆಗರೆಯಿಸು": [{"type": "verb", "defs": ["= ತೊರೆಬಿಡಿಸು."]}], "ತೊರೆದವನ": [{"type": "noun", "defs": ["a kind of fragrant plant that grows on the banks of rivers."]}], "ತೊರೆನೇರಲು": [{"type": "verb", "defs": ["the rose apple tree Jambosa vulgaris of Myrtaceae family.", "its fruit."]}], "ತೊರೆಬಿಡಿಸು": [{"type": "verb", "defs": ["to cause (the female breast) to let the milk flow out."]}], "ತೊರೆಬಿಡು": [{"type": "verb", "defs": ["(the female breast) to let the milk flow out."]}], "ತೊರೆಮತ್ತಿ": [{"type": "noun", "defs": ["the large, evergreen tree Terminalia arjuna of Combretaceae family, with hard wood used for building construction, agricultural implements and boat-building."]}], "ತೊರೆಮಾವು": [{"type": "noun", "defs": ["a variety of mango trees that grows on river banks."]}], "ತೊರೆಮೆಂತಿ": [{"type": "noun", "defs": ["the three leaved indigo, Indigo trita of Papilionaceae family."]}], "ತೊರೆಮೆಂತೆ": [{"type": "noun", "defs": ["= ತೊರೆಮೆಂತಿ."]}], "ತೊರೆಯ": [{"type": "noun", "defs": ["a caste the members of which are chiefly engaged in catching fish for living.", "a male member belonging to this caste; a fisherman.", "a man who gets his livelihood by operation of boats; a boatman."]}], "ತೊರೆಯಿಂಗುಳ": [{"type": "noun", "defs": ["the plant Alhagi maurorum of Papilionaceae family."]}], "ತೊರೆಯಿಸು": [{"type": "verb", "defs": ["= ತೊರೆಸು."]}], "ತೊರೆಯಿೞುಪು": [{"type": "verb", "defs": ["= ತೊರೆಬಿಡು."]}], "ತೊರೆಯೊಳ್ಕು": [{"type": "verb", "defs": ["to flow in stream."]}], "ತೊರೆಸು": [{"type": "verb", "defs": ["to cause to leave, abandon, give up (something).", "to cause to become uninterested in worldly matters.", "to reduce the quantity, size, extent or degree (of something)."]}], "ತೊರೆಹ": [{"type": "noun", "defs": ["the act of giving up or sacrificing (something); abdication; abandonment; sacrifice."]}], "ತೊರೆಹಾಲು": [{"type": "noun", "defs": ["milk that is flowing out from the breast of a woman."]}], "ತೊರ್ತು": [{"type": "noun", "defs": ["a maid servant or a male servant, esp. one appointed for menial work.", "a promiscuous woman; a prostitute."]}], "ತೊರ್ತುವೆಸ": [{"type": "noun", "defs": ["the duty of a slave or servant; menial work or works."]}], "ತೊರ್ತುವೆಸಗೆಯ್": [{"type": "verb", "defs": ["to work as a slave."]}], "ತೊಲ": [{"type": "noun", "defs": ["= ತೊಲೆ3."]}], "ತೊಲಂಗಿಸು": [{"type": "verb", "defs": ["= ತೊಲಗಿಸು."]}], "ತೊಲಂಗು": [{"type": "verb", "defs": ["= ತೊಲಗು1."]}], "ತೊಲಗಿಕೆ": [{"type": "noun", "defs": ["the act or an instance of departing; a going away; departure.", "a being completely destroyed."]}], "ತೊಲಗಿಸು": [{"type": "verb", "defs": ["to cause to go away (from).", "to destroy; to extinguish.", "to throw off or away; to shed; to cast off.", "to push aside or away; to push roughly; to shove.", "to cause to go back; to make (another) withdraw himself or herself.", "to cause to spread over a wide area; to throw (something) about here and there; to scatter.", "to cut into pieces."]}], "ತೊಲಗು": [{"type": "verb", "defs": ["to leave a place; to depart.", "to go away (as being defeated, dishonoured, etc.).", "to cause to separate from.", "to move, fall down, smoothly.", "to move toward one's side as to leave space for another to move freely.", "to withdraw oneself as from fear, diffidence, etc.", "to go or come back, as to a former place; to return.", "to push forward using force.", "to disappear from another's sight.", "(a celestial body, as the sun, moon,etc.) to make an apparent descent toward and below the horizon; to set.", "(a danger, harm, trouble, etc.) to be removed or averted.", "to be over; to come to an end.", "to be destroyed.", "to be defeated; to lose in contest.", "to throw off or away; to shed; to cast off."]}, {"type": "noun", "defs": ["a particular lock or catch in wrestling."]}], "ತೊಲಗೆ": [{"type": "noun", "defs": ["= ತೊಲಿಗ."]}], "ತೊಲಿ": [{"type": "noun", "defs": ["that which is hollow, empty.", "a hole or hollow place; cavity.", "the hollow eye-socket.", "a protuberant, huge belly.", "(fig.) that which is without any worth or of no use, importance or value; a person who is utterly weak."]}], "ತೊಲಿಗ": [{"type": "noun", "defs": ["the plant Connarus monocarpus of Connaraceae family."]}], "ತೊಲೆ": [{"type": "verb", "defs": ["to move away; to go out."]}, {"type": "verb", "defs": ["to move oneself (as something held or fastened at one end or as a part of the body) repeatedly back and forth, from side to side or up and down; to swing; to wag; to sway."]}, {"type": "noun", "defs": ["a long, thick piece of wood, used in building as a horizontal support for a roof, ceiling, etc.; a beam.", "a section of the trunk or of a large branch of a felled tree, either in its natural state or cut up for use in building, as firewood, etc.; a log.", "a long, heavy log of wood used in ancient wars to bang and open the entrance gates of a fort.", "a seat suspended from above by means of a loop of rope or between ropes or rods, on which one may sit and swing to and fro for recreation; a swing.", "an ancient unit of weight, equal to the weight of a rupee coin.", "an instrument for weighing, esp. one that opposes equal weights, as in two matched shallow pans hanging from either end of a lever supported exactly in the middle; a balance.", "similarity in some respects between two or more different things; resemblance.", "a southern constellation between Virgo and Scorpio; the Scales.", "the seventh sign of the zodiac, entered by the sun about September 23; Libra."]}], "ತೊಲೆಗೋಲ್": [{"type": "noun", "defs": ["= ತೊಲೆಗೋಲು."]}], "ತೊಲೆಗೋಲು": [{"type": "noun", "defs": ["the beam of a weighing balance."]}], "ತೊವಟೆ": [{"type": "noun", "defs": ["the natural outer covering of fruits or vegetables; the skin.", "the outside covering of the stems and roots of trees and woody plants; the bark."]}], "ತೊವಡು": [{"type": "noun", "defs": ["= ತೊವಟೆ."]}], "ತೊವರ್": [{"type": "verb", "defs": ["to become or turn astringent."]}, {"type": "noun", "defs": ["= ತೊವರು1."]}], "ತೊವರಮಣ್ಣು": [{"type": "noun", "defs": ["a kind of fragrant earth."]}], "ತೊವರಿ": [{"type": "noun", "defs": ["the pea plant Cajanus indicus with yellow flowers, widely grown in tropical land for its edible seed; the pigeon pea plant.", "its seed."]}], "ತೊವರು": [{"type": "noun", "defs": ["the astringent taste."]}, {"type": "noun", "defs": ["= ತೊವರಿ."]}], "ತೊವರೇಱು": [{"type": "verb", "defs": ["= ತೊವರ್1."]}], "ತೊವರ್ಚು": [{"type": "verb", "defs": ["= ತೊವರ್1."]}], "ತೊವಲ್": [{"type": "verb", "defs": ["(a plant) to put forth young leaves.", "to be covered, spread over with."]}, {"type": "verb", "defs": ["(collectively) the young leaves of a plant.", "ತೊವಲನಿಕ್ಕು tovalanikku = ತೊವಲಿಕ್ಕು - 2."]}, {"type": "noun", "defs": ["= ತೊವಲು."]}], "ತೊವಲಿಕ್ಕು": [{"type": "verb", "defs": ["(a plant) to put forth young leaves.", "to cover a big pit with the twigs and leaves (to deceive others or animals)."]}], "ತೊವಲು": [{"type": "noun", "defs": ["the external limiting tissue layer of an animal body especially when forming a tough but flexible cover relatively impermeable from without while intact; the skin.", "the integument of an animal separated from the body, either raw or processed; hide; leather.", "the bark of a tree.", "the hard and tough outer layer of certain fruits as lemon orange, etc."]}], "ತೊವಲ್ಗೊಳ್": [{"type": "verb", "defs": ["= ತೊವಲ್ವಿಡಿ."]}], "ತೊವಲ್ವಲೆ": [{"type": "noun", "defs": ["a net made of leather or leather threads."]}], "ತೊವಲ್ವಿಡಿ": [{"type": "verb", "defs": ["to hold a bunch of young leaves indicating one's surrender."]}], "ತೊವೆ": [{"type": "noun", "defs": ["= ತೊವ್ವೆ."]}], "ತೊವ್ವೆ": [{"type": "noun", "defs": ["a dish made of pulses with or without vegetables."]}], "ತೊಸಕ್": [{"type": "noun", "defs": ["an onomatopoeic word imitating the sound produced by a thing collapsing loosely and suddenly."]}], "ತೊಸೆ": [{"type": "noun", "defs": ["the very fat, corpulent, strengthless body (of a living being)."]}], "ತೊಸೆಯ": [{"type": "noun", "defs": ["a man having very fat, corpulent body with relatively less strength."]}], "ತೊಳಂಕು": [{"type": "noun", "defs": ["= ತೊಳಕು."]}], "ತೊಳಂಚಿ": [{"type": "noun", "defs": ["= ತೊಳಸಿ."]}], "ತೊಳಂಚೆ": [{"type": "noun", "defs": ["= ತೊಳಸಿ."]}], "ತೊಳಕಲು": [{"type": "noun", "defs": ["the kitchen waste water."]}], "ತೊಳಕು": [{"type": "noun", "defs": ["the central portion of a human body, i.e. the part between the ribs and the hips; the waist."]}], "ತೊಳಗು": [{"type": "verb", "defs": ["to give forth or glow with light; to shine."]}, {"type": "noun", "defs": ["reflecting light; radiance; brilliance; shining."]}], "ತೊಳಚಿ": [{"type": "noun", "defs": ["= ತೊಳಸಿ."]}], "ತೊಳಚೆ": [{"type": "noun", "defs": ["= ತೊಳಸಿ."]}], "ತೊಳಪ": [{"type": "noun", "defs": ["= ತೊಳಗು2."]}], "ತೊಳಪು": [{"type": "noun", "defs": ["the state or quality of shining by reflecting light; glitter, sparkle, sheen or gloss; lustre."]}], "ತೊಳಲ್": [{"type": "verb", "defs": ["= ತೊಳಲು1."]}, {"type": "noun", "defs": ["= ತೊಳಲು2."]}], "ತೊಳಲಾಟ": [{"type": "noun", "defs": ["= ತೊಳಲ್2 - 1 & 3."]}], "ತೊಳಲಾಡು": [{"type": "verb", "defs": ["= ತೊಳಲು1 - 1 & 8."]}], "ತೊಳಲಿಕಲ್ಲು": [{"type": "noun", "defs": ["a set two stone discs, of which one is fixed with a pivot on the other turns horizontally, used to husk paddy.", "a cylindrical stone used to grind kitchen items, in a mortar."]}], "ತೊಳಲಿಕೆ": [{"type": "noun", "defs": ["= ತೊಳಲು2.", "the act of passing along a road, beat, etc. or around or through a specified area by policemen, guards, etc. to maintain order and security."]}], "ತೊಳಲಿಸು": [{"type": "verb", "defs": ["to cause to wander.", "to cause to undergo trouble or distressing situation."]}], "ತೊಳಲು": [{"type": "verb", "defs": ["to wander - a) to ramble without a definite purpose or objective; roam, rove or stray; b) to go aimlessly, indirectly or casually; to meander.", "to be subject to the cycle of births and deaths.", "(a picture) to appear before one's eyes.", "to make a regular and repeated circuit of (an area, town, camp, etc.) for purpose of guarding or inspecting; to patrol.", "to go; to move from one place to another.", "to go from place to place publicising or spreading, disseminating something.", "to go over or look through for the purpose of finding something; to search; to explore.", "to undergo suffering or distress."]}, {"type": "noun", "defs": ["a wandering.", "the condition of being confused, bewildered or perplexed; bafflement.", "a troubled or distressing condition."]}, {"type": "noun", "defs": ["(collectively) young leaves of a plant."]}], "ತೊಳಲೆ": [{"type": "noun", "defs": ["a large, vascular, lymphatic organ in the upper left part of the abdominal cavity of vertebrates, near the stomach, that has various functions in modifying the structure of the blood and forms part of the immune system; the spleen."]}], "ತೊಳಲ್ಕೆ": [{"type": "noun", "defs": ["= ತೊಳಲಿಕೆ."]}], "ತೊಳಸಂಬಟ್ಟೆ": [{"type": "noun", "defs": ["an utterly disordered, confusing condition."]}], "ತೊಳಸಾಟ": [{"type": "noun", "defs": ["the act or fact of wandering esp. aimlessly or under a distressing condition.", "a physical or mental struggle; tussle."]}], "ತೊಳಸಿ": [{"type": "noun", "defs": ["any of a genus (Ocimum) of fragrant plants of the mint family, esp. a white-flowered garden herb (Ocimum sanctum which is religiously regarded as a goddess)."]}], "ತೊಳಸು": [{"type": "verb", "defs": ["to pound, beat (to hull paddy, polish rice, etc.) 2.to strike or drive with repeated, heavy blows."]}, {"type": "verb", "defs": ["to stir, agitate a liquid (in a container) (as with a ladle).", "(nausea, a feeling of loathing) to happen (as a result of which one would vomit).", "to become excited or disturbed.", "to propel a boat by or as by using oars; to row.", "to wander; to roam.", "to talk about something in a roundabout, indirect or lengthy manner (without directly dealing).", "to physically fight with."]}, {"type": "verb", "defs": ["to shine brightly; to sparkle.", "to rub or grind (an object) as to make it shining and sharp or sharper."]}, {"type": "noun", "defs": ["the act or fact of wandering esp. aimlessly or under a distressing condition.", "the condition of the mind in which it is incapable of concentration.", "the movement of the eye-balls.", "dissension or conflict between persons, because of differing ideas, wishes, interests, temperament. etc.; friction; conflict.", "the state of being entangled; entanglement.", "ತೊಳಸಾಗು toḷasāgu to get confused; to be puzzled or baffled; ತೊಳಸು ಮೆಳಸು toḷasu meḷasu = ತೊಳಸಂಬಟ್ಟೆ."]}], "ತೊಳಸುಗ": [{"type": "noun", "defs": ["a man who opposes or strives against."]}], "ತೊಳಸುಗೊಳ್ಳು": [{"type": "verb", "defs": ["to get tangled (in a difficult condition)."]}], "ತೊಳಹ": [{"type": "noun", "defs": ["the act of washing, cleaning."]}, {"type": "noun", "defs": ["= ತೊಳಗು2."]}], "ತೊಳಿಸು": [{"type": "verb", "defs": ["= ತೊಳಸು1."]}], "ತೊಳೆ": [{"type": "verb", "defs": ["to clean; to wash.", "to remove by rubbing; to erase or rub out.", "to avoid (a harmful condition) from happening; to prevent; to avert.", "to be completely erased or removed from.", "to destroy; to extinguish.", "ತೊಳೆದ ಕೆಂಡ toḷeda keṇḍa a piece of coal that is extinguished; 2. (fig.) a person with very black complexion; ತೊಳೆದ ಮುತ್ತು toḷeda muttu a pearl that is cleaned; 2) a person who is free from sin or guilt; a pure-hearted person."]}, {"type": "noun", "defs": ["any of several segments of a fruit (as orange, jackfruit, etc.) each of which is an independent whole and which can be separated from each other", "ತೊಗಲು ತೊಳೆ ಆದೀತೆ? togalu toḷeādīte? (prov.) a piece of ordinary glass can never become a gem."]}, {"type": "noun", "defs": ["either of the external openings of the nose; a nostril."]}, {"type": "noun", "defs": ["a long pole with a broad blade at one end used to row a boat; an oar.", "ತೊಳೆ ಹಾಕು toḷe hāku to propel a boat by or as by using oars; to row."]}], "ತೊಳೆತ": [{"type": "noun", "defs": ["the act of washing, cleaning."]}], "ತೊಳೆಯಿಸು": [{"type": "verb", "defs": ["to cause to wash or clean."]}], "ತೊಳ್ತಳ": [{"type": "noun", "defs": ["a disorderly or confused collection or mass of things; jumble; hodgepodge.", "the act of trampling heavily on.", "a taking (another) into one's control.", "the rate or rapidity of any action.", "the condition of being fastened or bound by."]}], "ತೊಳ್ತಳಂದುಳಿ": [{"type": "verb", "defs": ["to tread heavily as to crush (something) into a shapeless mass."]}], "ತೊಳ್ತು": [{"type": "noun", "defs": ["a maid servant, esp. one appointed for menial work.", "a male servant, esp. one appointed for menial work.", "a prostitute; a promiscuous woman."]}], "ತೊಳ್ತುಗೆಯ್": [{"type": "verb", "defs": ["to employ, keep a person as a slave.", "to work as a slave."]}], "ತೊಳ್ತುಗೆಯ್ಮೆ": [{"type": "noun", "defs": ["= ತೊೞ್ತುಗೆಲಸ."]}], "ತೊಳ್ತುಗೆಲಸ": [{"type": "noun", "defs": ["= ತೊೞ್ತುವೆಸ."]}], "ತೊಳ್ತುಗೊಡು": [{"type": "verb", "defs": ["= ತೊೞ್ತುಗೊಡು."]}], "ತೊಳ್ತುಗೊಳ್": [{"type": "verb", "defs": ["= ತೊೞ್ತುಗೊಳ್."]}], "ತೊಳ್ತುಬಾಳ್": [{"type": "verb", "defs": ["to live the life of a slave."]}], "ತೊಳ್ಪುಟ್ಟಿ": [{"type": "noun", "defs": ["= ತೊಳ್ಮಗ."]}], "ತೊಳ್ಮಗ": [{"type": "noun", "defs": ["a son of one's maid servant (commonly used as an abusive term)."]}], "ತೊಳ್ಳು": [{"type": "verb", "defs": ["to become clean."]}], "ತೊಳ್ಳೆ": [{"type": "noun", "defs": ["= ತೊಳಲೆ."]}], "ತೊಳ್ಳೆಮೀನು": [{"type": "noun", "defs": ["a kind of fish."]}], "ತೊಱಡು": [{"type": "noun", "defs": ["a hook or sickle attached to a long pole for plucking fruits from trees."]}], "ತೊಱವಿ": [{"type": "noun", "defs": ["the act of giving up or sacrificing (something); abandonment; sacrifice.", "exemption from the controls, restraints or confinements.", "that which is fit to be or must be, abandoned."]}], "ತೊಱಸು": [{"type": "verb", "defs": ["= ತೊಱೆಯಿಸು."]}], "ತೊಱಿಸು": [{"type": "verb", "defs": ["= ತೊಱೆಯಿಸು."]}], "ತೊಱು": [{"type": "noun", "defs": ["farm animals collectively, as domesticated cows, bulls, etc.; cattle.", "a herd of cattle."]}], "ತೊಱುವಳ್ಳ": [{"type": "noun", "defs": ["a man whose occupation is tending and herding of cows; a cowherd.", "a man belonging to the caste members of which are mainly engaged in tending of cows."]}], "ತೊಱುವಾಳ್ಳ": [{"type": "noun", "defs": ["= ತೊಱುವಳ್ಳ."]}], "ತೊಱೆ": [{"type": "verb", "defs": ["to abandon - a) to leave completely and finally; to forsake utterly; to desert; b) to give up; to discontinue; to withdraw from; c) to give up the control of."]}, {"type": "noun", "defs": ["a natural stream of water of fairly large size flowing in a definite course; a river.", "a great flowing or overflowing of water, esp. over land not normally submerged; a flood."]}], "ತೊಱೆಕಡವ": [{"type": "noun", "defs": ["a tree (akin to the tree cadamba, Anthocephalus indicus) that grows on the banks of rivers."]}], "ತೊಱೆಗಟ್ಟು": [{"type": "verb", "defs": ["to flow overwhelmingly; to flood."]}], "ತೊಱೆಗಣಗಿಲೆ": [{"type": "noun", "defs": ["the tree Barringtonia acutangula of Lecythidaceae family; Indian oak."]}], "ತೊಱೆಗಣಜಿಲು": [{"type": "noun", "defs": ["the cane plant Calamus viminalis (var. Fasciculata) of Arecaceae family."]}], "ತೊಱೆಗಣಿಗಿಲು": [{"type": "noun", "defs": ["= ತೊಱೆಗಣಗಿಲೆ."]}], "ತೊಱೆಗಣಿಗಿಲೆ": [{"type": "noun", "defs": ["= ತೊಱೆಗಣಗಿಲೆ."]}], "ತೊಱೆಗಣಿಜಿಲು": [{"type": "noun", "defs": ["= ತೊಱೆಗಣಜಿಲು."]}], "ತೊಱೆಗಣಿಜಿಲೆ": [{"type": "noun", "defs": ["= ತೊಱೆಗಣಜಿಲು."]}], "ತೊಱೆಗರೆ": [{"type": "noun", "defs": ["= ತೊಱೆದಡಿ."]}], "ತೊಱೆದಡಿ": [{"type": "noun", "defs": ["the bank of a river."]}], "ತೊಱೆದವನ": [{"type": "noun", "defs": ["a kind of fragrant plant that grows on the banks of rivers."]}], "ತೊಱೆನಾಯ್": [{"type": "noun", "defs": ["an otter-like carnivorous animal with webbed feet used in swimming."]}], "ತೊಱೆಮತ್ತಿ": [{"type": "noun", "defs": ["the large, evergreen tree Terminalia arjuna of Combretaceae family, with hard wood used for building construction, agricultural implements and boat-building."]}], "ತೊಱೆಮಲ್ಲಿಗೆ": [{"type": "noun", "defs": ["a variety of jasmine that grows on the banks of rivers."]}], "ತೊಱೆಮಾವು": [{"type": "noun", "defs": ["a variety of mango trees that grows on river banks."]}], "ತೊಱೆಯ": [{"type": "noun", "defs": ["a caste the members of which are chiefly engaged in catching fish for living.", "a male member belonging to this caste; a fisherman.", "a man who gets his livelihood by operation of boats; a boatman."]}], "ತೊಱೆಯಿಂಗುಳ": [{"type": "noun", "defs": ["the plant Alhagi maurorum of Papilionaceae family."]}], "ತೊಱೆಯಿಸು": [{"type": "verb", "defs": ["to cause to leave, abandon, give up (something).", "to cause to become uninterested in worldly matters.", "to reduce the quantity, size, extent or degree (of something)."]}], "ತೊಱೆವರಿ": [{"type": "verb", "defs": ["to flow (as a river)."]}], "ತೊಱೆವು": [{"type": "noun", "defs": ["the act or instance of departing; departure."]}], "ತೊಱೆವೇಂಟೆ": [{"type": "noun", "defs": ["a hunting in waters; the catching of fish for sport or for a living; fishing."]}], "ತೊಱೆಹ": [{"type": "noun", "defs": ["the act of giving up or sacrificing (something); abdication abandonment; sacrifice."]}], "ತೊಱ್ತುಳಿದುಳಿ": [{"type": "verb", "defs": ["to trample heavily on (as to make the object being trampled a shapeless mass)."]}], "ತೊೞಕಲ್": [{"type": "noun", "defs": ["the act or fact of wandering esp. aimlessly or under a distressing condition."]}], "ತೊೞಲ್": [{"type": "verb", "defs": ["to wander - a) to ramble without a definite purpose or objective; roam, rove or stray; b) to go aimlessly, indirectly or casually; to meander.", "to be subject to the cycle of births and deaths.", "(a picture) to appear before one's eyes.", "to make a regular and repeated circuit of (an area, town, camp, etc.) for purpose of guarding or inspecting; to patrol.", "to move from one place to another; to go.", "to go from place to place publicising or spreading, disseminating something.", "to go over or look through for the purpose of finding something; to search; to explore.", "to undergo suffering or distress."]}, {"type": "noun", "defs": ["a wandering.", "the condition of being confused, bewildered or perplexed; bafflement.", "a troubled or distressing condition."]}], "ತೊೞಲಿ": [{"type": "noun", "defs": ["= ತೊೞಲ್2 - 1."]}], "ತೊೞಲಿಕಲ್": [{"type": "noun", "defs": ["a set two stone discs, of which one is fixed with a pivot on the other turns horizontally, used to husk paddy.", "a cylindrical stone used to grind kitchen items, in a mortar."]}], "ತೊೞಲಿಕಲ್ಲು": [{"type": "noun", "defs": ["= ತೊೞಲಿಕಲ್."]}], "ತೊೞಲು": [{"type": "verb", "defs": ["= ತೊೞಲ್1."]}], "ತೊೞಲ್ಕೆ": [{"type": "noun", "defs": ["a wandering.", "a troubled or distressing condition.", "the act of passing along a road, beat, etc. or around or through a specified area by policemen, guards, etc. to maintain order and security."]}], "ತೊೞಲ್ಚು": [{"type": "verb", "defs": ["to cause to wander.", "to cause to undergo trouble or distressing situation.", "to cause to spread, disseminate (news)."]}], "ತೊೞಸು": [{"type": "verb", "defs": ["to stir, agitate a liquid (in a container) (with a ladle).", "(nausea, a feeling of loathing) to happen (as a result of which one would vomit).", "to become excited or disturbed.", "to propel a boat by or as by using oars; to row.", "to wander; to roam.", "to talk about something in a roundabout, indirect or lengthy manner (without directly dealing).", "to physically fight with."]}, {"type": "noun", "defs": ["the act or fact of wandering esp. aimlessly or under a distressing condition.", "the condition of the mind in which it is incapable of concentration.", "the movement of the eye-balls.", "dissension or conflict between persons, because of differing ideas, wishes, interests, temperament. etc.; friction; conflict.", "the state of being entangled; entanglement."]}], "ತೊೞ್ತು": [{"type": "noun", "defs": ["= ತೊಳ್ತು ."]}], "ತೊೞ್ತುಗೆಲಸ": [{"type": "noun", "defs": ["= ತೊೞ್ತುವೆಸ."]}], "ತೊೞ್ತುಗೊಡು": [{"type": "verb", "defs": ["to put into slavery; to make a slave of."]}], "ತೊೞ್ತುಗೊಳ್": [{"type": "verb", "defs": ["to employ, keep a person as a slave."]}], "ತೊೞ್ತುತನ": [{"type": "noun", "defs": ["the condition of being or the obligation of a slave; slavery; serfdom."]}], "ತೊೞ್ತುತೊಡರ್": [{"type": "noun", "defs": ["a binding that subjects a person to be a slave; the fetters of slavery."]}], "ತೊೞ್ತುವೆಸ": [{"type": "noun", "defs": ["the duty of a slave or servant; menial work or works."]}], "ತೊೞ್ತುವೆಸಗೆಯ್": [{"type": "verb", "defs": ["to work as a slave."]}], "ತೊೞ್ತುೞಿ": [{"type": "noun", "defs": ["a disorderly or confused collection or mass of things; jumble; hodgepodge.", "the act of trampling heavily on.", "a taking (another) into one's control.", "the rate or rapidity of any action.", "the condition of being fastened or bound by."]}], "ತೊೞ್ತುೞಿದುೞಿ": [{"type": "verb", "defs": ["to tread heavily as to crush (something) into a shapeless mass."]}], "ತೊೞ್ಪುಟ್ಟಿ": [{"type": "noun", "defs": ["a son of one's maid servant (commonly used as an abusive term)."]}], "ತೊೞ್ಪುಟ್ಟು": [{"type": "noun", "defs": ["= ತೊೞ್ಪುಟ್ಟಿ."]}], "ತೋ": [{"type": "verb", "defs": ["to become soaked in a liquid (as water, blood, etc.).", "to cause to be soaked so."]}], "ತೋಂಟ": [{"type": "noun", "defs": ["= ತೋಟ1."]}], "ತೋಂಟವಾಳ": [{"type": "noun", "defs": ["= ತೋಟಗಾರ."]}], "ತೋಂಟವಾಳತಿ": [{"type": "noun", "defs": ["a woman who tends gardens; a gardener.", "the wife of a gardener."]}], "ತೋಂಟವಾಳಿಗ": [{"type": "noun", "defs": ["= ತೋಟಗಾರ."]}], "ತೋಂಟವೆಸ": [{"type": "noun", "defs": ["a working (as a labour) in a garden."]}], "ತೋಂಟವೆಸಂಗೆಯ್": [{"type": "verb", "defs": ["to work as a labour in a garden."]}], "ತೋಂಟಿ": [{"type": "noun", "defs": ["= ತೋಟಿ1."]}, {"type": "noun", "defs": ["= ತೋಟಿ2."]}], "ತೋಂಟಿಗ": [{"type": "noun", "defs": ["= ತೋಟಗಾರ."]}], "ತೋಂಟಿಗವೆಸ": [{"type": "noun", "defs": ["= ತೋಂಟವೆಸ."]}], "ತೋಂಟಿಗವೆಸಂಗೆಯ್": [{"type": "verb", "defs": ["= ತೋಂಟವೆಸಂಗೆಯ್."]}], "ತೋಂಟಿಗೊಳ್": [{"type": "verb", "defs": ["= ತೋಟಿಗೊಳು."]}], "ತೋಂಡಿಪರೀಕ್ಷೆ": [{"type": "noun", "defs": ["an examination in which the examiner examines the examinee in person; oral examination."]}], "ತೋಕ": [{"type": "noun", "defs": ["a child (girl or son)."]}], "ತೋಕಿಸು": [{"type": "verb", "defs": ["to shoot (an arrow).", "(the heavy sound of conch, drum, etc.) to be made."]}], "ತೋಕು": [{"type": "verb", "defs": ["to shoot (an arrow).", "to cause to fall like rain.", "to spill or flow out.", "to agitate (oneself as a fan) to direct a current of air toward.", "to be scattered and driven away; to be dispelled."]}, {"type": "noun", "defs": ["a gun, fired from the shoulder, with spiral grooves cut into the inner surface of the barrel."]}], "ತೋಕುಳಿ": [{"type": "noun", "defs": ["the act of soaking (something) in a liquid.", "a pit where hides are soaked (in tannin) while being processed."]}], "ತೋಕೆ": [{"type": "noun", "defs": ["the long, brightly coloured tail of a peacock.", "the corresponding tail of other birds as parrots.", "the long blades at the bottom of a sugarcane.", "the last point of anything; the final point; the end."]}], "ತೋಕೆಗೋಧಿ": [{"type": "noun", "defs": ["the cereal grass Avena byzantina of Poaceae family; Indian oat.", "the grain of this grass."]}], "ತೋಚಿಕೆ": [{"type": "noun", "defs": ["a sudden, brief display of thought, understanding, feeling; a flash of thought."]}], "ತೋಚಿಕೊಳ್ಳು": [{"type": "verb", "defs": ["to thing (about something); to judge."]}], "ತೋಚು": [{"type": "verb", "defs": ["to come to the mind; to be seen or realised by the mind."]}], "ತೋಟ": [{"type": "noun", "defs": ["a piece of ground where vegetables, fruits, flowers ornamental shrubs or trees, etc. are grown; a garden.", "a large, cultivated planting of trees or other plants; plantation as rubber plantation, coffee plantation etc.", "ತೋಟದಸೊಪ್ಪು tōṭada soppu the biennial plant Apium graveolens (var. dulce) of Apiaceae family, whose long, crisp leafstalks are used as a vegetable; garden celery."]}, {"type": "noun", "defs": ["= ತೋಟಾ1."]}], "ತೋಟಕ": [{"type": "noun", "defs": ["(pros.) a kind of metre having twelve syllables in each line."]}], "ತೋಟಗಟ್ಟು": [{"type": "noun", "defs": ["a garden area."]}], "ತೋಟಗಾರ": [{"type": "noun", "defs": ["a man who tends gardens; a gardener."]}], "ತೋಟಗಾರಿಕೆ": [{"type": "noun", "defs": ["the art or science of growing flowers, fruits, vegetables, and shrubs, in gardens or orchards; horticulture."]}], "ತೋಟತುಡಿಕೆ": [{"type": "noun", "defs": ["a garden and the like."]}], "ತೋಟದೂರ": [{"type": "noun", "defs": ["a man who is totally or partially unable to hear; a deaf man."]}], "ತೋಟಪಟ್ಟಿ": [{"type": "noun", "defs": ["the piece of land where a garden is raised."]}], "ತೋಟವಳ": [{"type": "noun", "defs": ["= ತೋಟಗಾರ."]}], "ತೋಟವಾಳ": [{"type": "noun", "defs": ["= ತೋಟಗಾರ."]}], "ತೋಟವಾಳಿಗ": [{"type": "noun", "defs": ["= ತೋಟಗಾರ."]}], "ತೋಟಾ": [{"type": "noun", "defs": ["a cylindrical case of metal, for holding a complete charge of powder, and often also the bullet or the shot for a rifle, machine gun or other small arm; a cartridge."]}, {"type": "noun", "defs": ["= ತೋಡ3."]}], "ತೋಟಿ": [{"type": "noun", "defs": ["a physical fight between; battle; combat.", "a mental struggle arising from opposing demands or impulses; mental conflict.", "repeated attacks or continuous torment or harassment inflicted.", "entanglement in another's business (usu. resulting in trouble to oneself).", "the ability and aptitude to face dangers or risky undertakings.", "a feeling of discontent or covetousness with regard to another's advantages, success, possessions, etc; envy."]}, {"type": "noun", "defs": ["a man employed in a village to clean the public areas, remove garbage, etc.", "a man of mean or inferior quality."]}, {"type": "noun", "defs": ["the bill of a bird.", "the opening through which an animal or human takes in food; the mouth.", "a lip orifice or projecting tube, as on a teapot, water jug, etc. , by which a liquid is poured or discharged; a spout."]}], "ತೋಟಿಕಾಱ": [{"type": "noun", "defs": ["= ತೋಟಿಗಾಱ."]}], "ತೋಟಿಗ": [{"type": "noun", "defs": ["= ತೋಟಗಾರ."]}], "ತೋಟಿಗಾಱ": [{"type": "noun", "defs": ["a man engaged in a war."]}], "ತೋಟಿಗಿತಿ": [{"type": "noun", "defs": ["a woman who tends gardens; a gardener.", "the wife of a gardener."]}], "ತೋಟಿಗೈ": [{"type": "verb", "defs": ["to engage in a battle or in a single combat; to attempt to defend oneself against or to subdue, defeat or destroy an adversary; to fight."]}], "ತೋಟಿಗೊಳು": [{"type": "verb", "defs": ["to undertake a fight; to fight."]}], "ತೋಟಿಯ": [{"type": "noun", "defs": ["a valorous man; a brave soldier."]}], "ತೋಟೆ": [{"type": "noun", "defs": ["the natural outer covering of fruits or vegetables; the skin.", "the outside covering of the stems and roots of trees and woody plants; the bark."]}, {"type": "noun", "defs": ["= ತೋಟಾ1."]}, {"type": "noun", "defs": ["a kind of medicinal herb."]}], "ತೋಟ್ಟಪಟ್ಟು": [{"type": "noun", "defs": ["a piece of land where a garden is raised."]}], "ತೋಡ": [{"type": "noun", "defs": ["a kind of white rat that infects crops, esp. paddy."]}, {"type": "noun", "defs": ["a Dravidian aboriginal clan living in and around Nilagiri region of Tamil Nadu in South India.", "a man belonging to that clan.", "the language spoken by them."]}, {"type": "noun", "defs": ["an ornamental metal band worn around the wrist (usu. presented to a person by a king as a title).", "a small pouch for keeping money.", "a cylindrical packet containing monetary coins of the same denomination, arranged one above the other.", "a metal band worn around the ankle as a symbol of honour.", "(in gen.) anything worn around the ankle as an ornament."]}], "ತೋಡಾ": [{"type": "noun", "defs": ["= ತೋಡ3."]}], "ತೋಡಿ": [{"type": "noun", "defs": ["(mus.) one of the important and most popular mode (rāga) in Karnāṭaka system derived from the main mode Hanuma Tōḍi."]}], "ತೋಡಿಟ್ಟಿ": [{"type": "noun", "defs": ["a two-pronged spear."]}], "ತೋಡಿಸು": [{"type": "verb", "defs": ["to cause to dig or excavate."]}, {"type": "verb", "defs": ["to consider (something) as equal to."]}], "ತೋಡು": [{"type": "verb", "defs": ["to break and turn up or remove (ground, etc.) with a spade or other tool or with hands, claws, snout, etc.; to dig.", "to penetrate (something) with or as with a pointed weapon.", "to draw out (as the sword from its sheath).", "to transfer food items from one vessel to another, hot water from a boiler to a bucket, etc.", "to go out; to move out of.", "to tell openly one's feelings to another.", "ತೋಡಿಕೊಳ್ಳು tōḍikoḷḷu to share, openly and humbly, one's feelings, thoughts, etc. with another."]}, {"type": "noun", "defs": ["a hole, cavity, ditch, etc. made by digging in ground.", "an inclined or vertical trough or passage down which something may be slid or dropped.", "a current or flow of water, esp. one running along the downward surface of a hill."]}, {"type": "noun", "defs": ["two identical, similar or corresponding things that are matched for use together; a pair.", "the state or quality of being equal; correspondence in quantity, degree, value, rank or ability; equality.", "a great number of people, animals or things gathered together; a multitude."]}, {"type": "noun", "defs": ["the act or mode of shooting arrows."]}, {"type": "noun", "defs": ["a scheme or program for making, doing or arranging something; project, design, schedule, etc.; a plan.", "anything that works against (usu.) an evil or unwanted condition."]}], "ತೋಡುಂಗಿಱು": [{"type": "verb", "defs": ["to consider (something) as equal to."]}], "ತೋಡುಕೈ": [{"type": "noun", "defs": ["= ತೋಡುಗೈ."]}], "ತೋಡುಗೆಲಸ": [{"type": "noun", "defs": ["the act of digging or excavating; excavation."]}], "ತೋಡುಗೈ": [{"type": "noun", "defs": ["a utensil, usu. hand shaped, used to take up or out food from a vessel.", "a small, round instrument with a pointed end, used to take out small quantities of sugar, flour, grain, etc. from a bag, by piercing it; a scoop."]}], "ತೋಡುದಾರಿ": [{"type": "noun", "defs": ["a road made by digging a raised ground."]}], "ತೋಡುದೋಣಿ": [{"type": "noun", "defs": ["a boat made by hollowing the middle portion of a big log of wood."]}], "ತೋಡುಹಾವುಗೆ": [{"type": "noun", "defs": ["a kind of shoe shaped and hollowed from a single piece of wood; a sabot."]}], "ತೋಡೆ": [{"type": "noun", "defs": ["= ತೋಡ3."]}, {"type": "adverb", "defs": ["in a small degree; to a slight extent; only slightly; not much; little."]}], "ತೋತಾಪುರಿ": [{"type": "noun", "defs": ["a variety in mango trees, the fruit of which has a parrot-beak-like bend at the extremity.", "its fruit."]}], "ತೋತಾಯ": [{"type": "noun", "defs": ["the act or legal offence of imitating or counterfeiting documents to deceive; forgery.", "a man who deceives or cheats others, esp. by pretending to be someone or something that he is not; an impostor.", "a man who makes false claim for a property."]}], "ತೋತ್ತರ": [{"type": "noun", "defs": ["the act of praising usu. singing a song or hymn."]}], "ತೋತ್ರ": [{"type": "noun", "defs": ["a stick used to goad an elephant, horse, ox, etc. into action; a goad."]}], "ತೋದ": [{"type": "noun", "defs": ["a driving of cattle, horse, etc. (usu. using force).", "a sensation of strong discomfort, in some part of the body, caused by an injury, disease or functional disorder."]}], "ತೋದನ": [{"type": "noun", "defs": ["= ತೋತ್ರ.", "the act of beating or banging (repeatedly).", "a severe pain either body or mental."]}], "ತೋದೆ": [{"type": "noun", "defs": ["a false reason or motive put forth to hide the real one; a pretext."]}], "ತೋದ್ಯ": [{"type": "noun", "defs": ["any of the percussion instruments."]}], "ತೋನು": [{"type": "verb", "defs": ["to be hanging or suspended."]}], "ತೋಪಡ": [{"type": "noun", "defs": ["a carpenteṛs tool, having an inclined, adjustable blade, for paring, truing, levelling or smoothing a wood surface.", "(fig.) the fact or an instance of not succeeding in passing through an examination.", "(fig.) a heavy expense that one has to bear unwillingly."]}, {"type": "noun", "defs": ["= ತೋಬರಿ."]}], "ತೋಪರ": [{"type": "noun", "defs": ["= ತೋಪಡ1."]}], "ತೋಪಿ": [{"type": "noun", "defs": ["any close-fitting head covering, either brimless or with a projecting brim, and made of wool, cotton, etc.; a cap."]}], "ತೋಪು": [{"type": "noun", "defs": ["a group of trees planted and cultivated to bear fruit, nuts, etc.; a grove."]}, {"type": "noun", "defs": ["outward impression; appearance; aspect.", "the form of anything, as having a definite shape, outline.", "anything offered as a bait to attract or tempt.", "the place or region where wild animals are hunted.", "the act of deceiving or something that deceives; deception.", "the act of aiming at (as in shooting).", "the position or guidance of a leader; the act or an instance of leading."]}, {"type": "noun", "defs": ["a large, mounted piece of artillery for firing heavy projectiles; a cannon."]}], "ತೋಪುಖಾನಿ": [{"type": "noun", "defs": ["= ತೋಫಖಾನೆ."]}], "ತೋಪೊಳೆ": [{"type": "verb", "defs": ["to shine brightly."]}], "ತೋಫಖಾನೆ": [{"type": "noun", "defs": ["a building where cannons, rifles, gunpowder, shells, bullets, etc. are stored."]}], "ತೋಫು": [{"type": "noun", "defs": ["= ತೋಪು3."]}], "ತೋಬಡ": [{"type": "noun", "defs": ["= ತೋಪಡ1."]}], "ತೋಬರ": [{"type": "noun", "defs": ["= ತೋಬರಿ."]}], "ತೋಬರಿ": [{"type": "noun", "defs": ["a bag with horse-gram or chick-pea, tied to the mouth of horses."]}], "ತೋಮ": [{"type": "noun", "defs": ["a group of large number of persons, collected at a place."]}], "ತೋಮರ": [{"type": "noun", "defs": ["= ತೋಮರರಗಳೆ.", "a spear-like, heavy weapon.", "an arrow with a crescent-shaped blade at the tip.", "a heavy, metal club; a mace."]}], "ತೋಮರರಗಳೆ": [{"type": "noun", "defs": ["(pros.) a kind of meter in which two lines are grouped as one unit for alliteration purpose and each line having four groups of five units each."]}], "ತೋಮಾಲೆ": [{"type": "noun", "defs": ["a large garland or string of flowers."]}], "ತೋಮೆ": [{"type": "noun", "defs": ["a connected group; a cluster; a bunch.", "a collection or assemblage of large number of persons at a place.", "a line in which number of persons or things are arranged; a row.", "the fact or state of excelling; superiority; eminence; excellence."]}], "ತೋಯ": [{"type": "noun", "defs": ["a dish made of pulses and sometimes with vegetables."]}, {"type": "noun", "defs": ["water.", "(pros.) a syllabic feet with one short syllable followed by two long syllables."]}], "ತೋಯದ": [{"type": "noun", "defs": ["a cloud, that gives water (i.e. that rains)."]}], "ತೋಯಧಿ": [{"type": "noun", "defs": ["the reservoir of water; the ocean."]}], "ತೋಯನಿಧಾನ": [{"type": "noun", "defs": ["= ತೋಯಧಿ."]}], "ತೋಯನಿಧಿ": [{"type": "noun", "defs": ["= ತೋಯಧಿ."]}], "ತೋಯಪಾನ": [{"type": "noun", "defs": ["the act or an instance of drinking water."]}], "ತೋಯಪಿಪ್ಪಲಿ": [{"type": "noun", "defs": ["the aquatic plant Commelina clavata (= C. salicifolia) of Commelinaceae family."]}], "ತೋಯರಾಶಿ": [{"type": "noun", "defs": ["a great mass of water; the ocean."]}], "ತೋಯಿ": [{"type": "noun", "defs": ["= ತೋಯ1."]}], "ತೋಯಿಪಿಪ್ಪಲು": [{"type": "noun", "defs": ["the plant Ludvigia adscendens (= Jussiaea repens) of Onagraceae family."]}], "ತೋಯಿಲ": [{"type": "noun", "defs": ["polluted, dirty water."]}], "ತೋಯಿಸು": [{"type": "verb", "defs": ["to wet (something) thoroughly in a liquid; to soak."]}], "ತೋಯು": [{"type": "verb", "defs": ["to become soaked in a liquid (as water, blood, etc.).", "to cause to be soaked so."]}], "ತೋಯೆ": [{"type": "noun", "defs": ["= ತೋಯ1."]}], "ತೋಯೋದ್ದೇಶ": [{"type": "noun", "defs": ["= ತೋಯಧಿ."]}], "ತೋಯೌಕಸ": [{"type": "noun", "defs": ["any of the beings living in water; an aquatic animal."]}], "ತೋರ": [{"type": "adjective", "defs": ["thick; fat; corpulent; plump.", "large; huge.", "gigantic; immense."]}, {"type": "noun", "defs": ["that which is fat, corpulent.", "the shape or contour of the body.", "excessiveness; plenitude."]}]}