{"ತ್ರಿಪತ್ರಿಣಿ": [{"type": "noun", "defs": ["a kind of plant."]}], "ತ್ರಿಪದಿ": [{"type": "noun", "defs": ["a three-legged stool of low height; a tripod.", "the vine Cissus pedata of Vitaceae family; iguana's foot vine.", "a thick rope for tying elephants.", "(pros.) a meter having three lines."]}], "ತ್ರಿಪದಿಕೆ": [{"type": "noun", "defs": ["= ತ್ರಿಪದಿ - 1."]}], "ತ್ರಿಪದೆ": [{"type": "noun", "defs": ["= ತ್ರಿಪದಿ - 4."]}], "ತ್ರಿಪದೋನ್ನತಿ": [{"type": "noun", "defs": ["(pros.) a verse having four lines, three of which have three groups of three syllables(-uu) followed by one long syllable (-), and one line has four groups of three syllables (-uu)."]}], "ತ್ರಿಪರ್ಣ": [{"type": "noun", "defs": ["= ತ್ರಿಪತ್ರ - 1 & 2."]}], "ತ್ರಿಪರ್ಣಿ": [{"type": "noun", "defs": ["the wild cotton plant Gossypium hirsutum (= G. neglectum).", "its trifoliate leaves.", "the plant Hemionites arifolia (= H. cordifolia) of Polypodiaceae family)."]}], "ತ್ರಿಪಾದಿ": [{"type": "noun", "defs": ["(astrol.) any of the six asterisms (Křttike, Punarvasu, Uttare, Viśakhe, Uttarāṣāḍa and Pūrvābhādre, which are considered inauspicious ones) whose three quarters are considered to be under one zodiac sign and the fourth under another sign."]}], "ತ್ರಿಪಿಟಕ": [{"type": "noun", "defs": ["a collection of scriptures originally recorded from oral traditions in the first century B.C., divided into one of three parts (Pitaka): sermons (Sutta Pitaka), the rules of the Buddhist order (Vinaya Pitaka), and several treatises on philosophy and psychology (Abhidhamma Pitaka); Pali canon; Tripitaka."]}], "ತ್ರಿಪೀಡಿ": [{"type": "noun", "defs": ["collectively three successive generations."]}], "ತ್ರಿಪೀಡಿದಾನ": [{"type": "noun", "defs": ["a gift of substantial worth which can be enjoyed by three successive generations."]}], "ತ್ರಿಪುಂಡ್ರ": [{"type": "noun", "defs": ["the three strips marked horizontally on the forehead with sacred ashes, as a sectarian mark."]}], "ತ್ರಿಪುಂಡ್ರಕ": [{"type": "noun", "defs": ["= ತ್ರಿಪುಂಡ್ರ."]}], "ತ್ರಿಪುಚ್ಛ": [{"type": "noun", "defs": ["(mus.) a singing or playing of the same note three times, mixing another note in between."]}], "ತ್ರಿಪುಟ": [{"type": "adjective", "defs": ["having the form of a triangle; three-cornered; triangular."]}, {"type": "noun", "defs": ["a slender, straight, pointed missile that is shot from a bow; an arrow.", "the shore or bank of a body of water.", "the length from the elbow to the tip of the middle-finger when stretched straight, which was considered a unit of length; a cubit.", "the brittle-pods containing upto three edible seeds, of the plant Arachis hypogaea of Papilionaceae family; the pea-nut.", "a group of three things, subjects, persons that are mutually related.", "a measure of time in music, having one beat followed varying number of counts (as three, four, five, seven etc.), two units having one beat and one count each."]}], "ತ್ರಿಪುಟಿ": [{"type": "noun", "defs": ["= ತ್ರಿಪುಟ2 - 5.", "the central point between two eye brows, just above the nose."]}], "ತ್ರಿಪುಟಿಜ್ಞಾನ": [{"type": "noun", "defs": ["the knowledge of the phenomenal world, soul and Śiva."]}], "ತ್ರಿಪುಟೀಜ್ಞಾನ": [{"type": "noun", "defs": ["= ತ್ರಿಪುಟಿಜ್ಞಾನ."]}], "ತ್ರಿಪುಟೀಸ್ಥಾನ": [{"type": "noun", "defs": ["= ತ್ರಿಪುಟಿ - 2."]}], "ತ್ರಿಪುಟೆ": [{"type": "noun", "defs": ["the plant Convolvulus turpethum of Convolvulaceae family.", "the plant Ipomea turpethum of Convolvulaceae family."]}], "ತ್ರಿಪುಡ": [{"type": "noun", "defs": ["= ತ್ರಿಪುಟ2 - 6.", "2.a particular kind of gait in dancing."]}], "ತ್ರಿಪುಡೆ": [{"type": "noun", "defs": ["(pros.) a metre having three rhyming lines."]}], "ತ್ರಿಪುರವಾಸ": [{"type": "noun", "defs": ["a variety of flute."]}], "ತ್ರಿಪ್ರಾಸ": [{"type": "noun", "defs": ["(pros.) a kind of alliteration in which three consonants, between the first and the fourth vowels, repeats in each lines of a verse."]}], "ತ್ರಿಫಲ": [{"type": "noun", "defs": ["a set of three fruits, gooseberry (Phyllanthus emblica), myrobalan (Terminalia chebulan) and Belleric myrobalan (Terminalia bellirica), used for medicinal purpose."]}], "ತ್ರಿಫಲೆ": [{"type": "noun", "defs": ["= ತ್ರಿಫಲ."]}], "ತ್ರಿಫಳೆ": [{"type": "noun", "defs": ["= ತ್ರಿಫಲ."]}], "ತ್ರಿಭಂಗ": [{"type": "noun", "defs": ["(dance) a standing with neck, waist and the leg (at knee) bent slightly."]}], "ತ್ರಿಭಂಗಭಂಗಿ": [{"type": "noun", "defs": ["= ತ್ರಿಭಂಗ."]}], "ತ್ರಿಭಂಗಿ": [{"type": "noun", "defs": ["collectively the narcotic, hallucinogen drugs that are smoked, drunk or eaten (or chewed)."]}, {"type": "noun", "defs": ["= ತ್ರಿಭಂಗ.", "that which is bent at three points or has three hook-like points.", "(phil.) three objects of worldly attachments - wife, children and wealth."]}], "ತ್ರಿಭಂಗಿಭಣಿತೆ": [{"type": "noun", "defs": ["a mode or way of bending one's body at three points (at the neck, waist and knee)."]}], "ತ್ರಿಭಂಡಿ": [{"type": "noun", "defs": ["= ತ್ರಿಪುಟೆ."]}], "ತ್ರಿಭಿನ್ನ": [{"type": "noun", "defs": ["(musc.) a type of regulated vibration of a note around its natural place while singing or playing on musical instruments."]}], "ತ್ರಿಭುಜ": [{"type": "noun", "defs": ["(geom.) a closed plane figure having three sides and three angles; a triangle."]}], "ತ್ರಿಭುವನ": [{"type": "noun", "defs": ["the three worlds, the physical world, lower region and the heaven."]}], "ತ್ರಿಮತ": [{"type": "noun", "defs": ["(collectively) the three subdivisions in Brāhmaṇa community, based on the philosophical teachings of Śankara, Rāmānuja and Mādhva, popularly known as Smārtha, Srī Vaiṣṇava and Vaiṣṇava respectively."]}], "ತ್ರಿಮತಸ್ಥ": [{"type": "adjective", "defs": ["belonging to the three subdivisions in Brāhmaṇa community, based on the philosophical teachings of Śankara, Rāmānuja and Mādhva, popularly known as Smārtha, Srī Vaiṣṇava and Vaiṣṇava respectively."]}, {"type": "noun", "defs": ["(only in pl.) a man belonging to the three subdivisions in Brāhmaṇa community, based on the philosophical teachings of Śankara, Rāmānuja and Mādhva, popularly known as Smārtha, Srī Vaiṣṇava and Vaiṣṇava."]}], "ತ್ರಿಮದ": [{"type": "noun", "defs": ["arrogance caused by one's education (or knowledge), wealth and nobility of birth or status."]}], "ತ್ರಿಮಲ": [{"type": "noun", "defs": ["(phil.) the three objects that make a spiritual aspirant dirty - women, wealth and property."]}], "ತ್ರಿಮಾತ್ರ": [{"type": "noun", "defs": ["(pros.) a syllable having the length of three prosodic units."]}], "ತ್ರಿಮಾತ್ರಕ": [{"type": "noun", "defs": ["= ತ್ರಿಮಾತ್ರ."]}], "ತ್ರಿಮಾತ್ರಾಗಣ": [{"type": "noun", "defs": ["(pros.) a syllabic feet with three short or one long with one long units."]}], "ತ್ರಿಮುಖ": [{"type": "noun", "defs": ["(collectively) three divisions of something (as arithmetic, geometry and algebra of mathematics)."]}], "ತ್ರಿಮೂರ್ತಿ": [{"type": "noun", "defs": ["(used only in pl., with the termination ಗಳು) the three Hindu Godheads Brahma, Viṣṇu, and Śiva; the Hindu Trinity."]}], "ತ್ರಿಯಂಬಕ": [{"type": "noun", "defs": ["Śiva, who has three eyes, including a fiery one on the forehead.", "(pros.) a long syllable."]}], "ತ್ರಿಯಕ್ಷ": [{"type": "noun", "defs": ["= ತ್ರಿಯಂಬಕ."]}], "ತ್ರಿಯಕ್ಷರ": [{"type": "adjective", "defs": ["having three letters or syllables (as a word or metric foot); formed by the combination of three syllables."]}, {"type": "noun", "defs": ["'ಓಮ್', the mystic syllable which is the combination 'ಅ, ಉ and ಮ'.", "a man who habitually makes false and slanderous statements against and in the absence of a third person who is not present, with an intention to damage the character or reputation; a slanderer."]}], "ತ್ರಿಯಾಮೆ": [{"type": "noun", "defs": ["the division of a 24-hour-day, which is further divided into three subdivisions of three hours each; evening."]}], "ತ್ರಿರತ್ನ": [{"type": "noun", "defs": ["(Buddh.) the three gems of Buddhism - the Buddha, Dharma (religious righteousness) and religious organisation."]}], "ತ್ರಿರತ್ನಿ": [{"type": "noun", "defs": ["a linear measure that is three times the length of the arm from the end of the closed fist to the elbow."]}], "ತ್ರಿಲೋಕ": [{"type": "noun", "defs": ["the three worlds, the physical world, lower region and the heaven."]}], "ತ್ರಿವದಿ": [{"type": "noun", "defs": ["= ತ್ರಿಪುಡೆ."]}], "ತ್ರಿವಲಿ": [{"type": "noun", "defs": ["(used only in pl., with the termination ಗಳು) the three crosswise folds on the abdomen (of women).", "a squirrel, which has three stripes on its back.", "a kind of sīre (sari, the oblong, unsewn cloth worn by women) with three lines running along the border.", "a three-stringed ornamental chain or necklace."]}, {"type": "noun", "defs": ["a kind of musical instrument."]}], "ತ್ರಿವಳಿ": [{"type": "noun", "defs": ["= ತ್ರಿವಲಿ1."]}, {"type": "noun", "defs": ["= ತ್ರಿವಲಿ2."]}], "ತ್ರಿವಳೆ": [{"type": "noun", "defs": ["= ತ್ರಿವಲಿ2."]}], "ತ್ರಿವಾರ": [{"type": "adverb", "defs": ["three times.", "certainly; definitely."]}], "ತ್ರಿವಿಕ್ರಮ": [{"type": "noun", "defs": ["one of the forms of Viṣṇu, in which he pervaded the earth, lower region and the heaven, each by a gigantic step."]}], "ತ್ರಿವಿಕ್ರಮಾಸನ": [{"type": "noun", "defs": ["a kind of yogic posture."]}], "ತ್ರಿವಿಗ್ರಹಗತಿ": [{"type": "noun", "defs": ["(Jain.) the three stages the soul of a dead person is supposed to undergo before taking next birth."]}], "ತ್ರಿವಿಡಿ": [{"type": "noun", "defs": ["= ತ್ರಿಪುಡ."]}], "ತ್ರಿವಿಧಿ": [{"type": "noun", "defs": ["= ತ್ರಿಪುಡೆ."]}], "ತ್ರಿವಿಷ್ಟಪ": [{"type": "noun", "defs": ["the abode of gods; the heaven."]}], "ತ್ರಿವುಡೆ": [{"type": "noun", "defs": ["= ತ್ರಿಪುಡ."]}, {"type": "noun", "defs": ["= ತ್ರಿಪುಡೆ."]}], "ತ್ರಿವೃತೆ": [{"type": "noun", "defs": ["the plant Ipomoea turpethum of Convolvulaceae family."]}], "ತ್ರಿವೇಣಿ": [{"type": "noun", "defs": ["a place where three rivers meet.", "Prayāga, where the rivers Gange, Yamune and Sarasvati join together."]}], "ತ್ರಿವೇಣೀಸಂಗಮ": [{"type": "noun", "defs": ["= ತ್ರಿವೇಣಿ.", "a coming together of three persons, three kinds of merits, eminence, etc."]}], "ತ್ರಿವೇಣುಕ": [{"type": "noun", "defs": ["the triangle-shaped structure in a bullock-cart, between the main body of the cart and the front end of the beam where the yoke is fixed; the cart-driveṛs seat."]}], "ತ್ರಿವೇದಿ": [{"type": "noun", "defs": ["a person who has studied and is well versed with any three of the four Vēdas.", "a man well versed in Nyāya, Mīmāmse, and Vēdānta."]}], "ತ್ರಿಶಂಕು": [{"type": "noun", "defs": ["name of a mythological king.", "(fig.) a man who is unable to make a choice between two options or is in a helpless or awkward situation caused by indecision.", "any of leaping, plant-eating orthopteran insects of various families, esp. of Acrididae, with powerful hind legs adapted for jumping; a gross-hopper.", "a cat.", "the male of the bird Cuculus melanoleucus, fabled to live only upon rain drops.", "a small southern constellation near the celestial pole containing Coalsack; the Southern Cross; the Crux."]}], "ತ್ರಿಶಂಕುರಾಶಿ": [{"type": "noun", "defs": ["= ತ್ರಿಶಂಕು - 6."]}], "ತ್ರಿಶಂಕುಸ್ಥಾನ": [{"type": "noun", "defs": ["(fig.) an awkward position between two positions, conditions, etc."]}], "ತ್ರಿಶಂಕುಸ್ಥಿತಿ": [{"type": "noun", "defs": ["(fig.) an awkward situation between two positions, conditions, etc."]}], "ತ್ರಿಶಂಕುಸ್ವರ್ಗ": [{"type": "noun", "defs": ["= ತ್ರಿಶಂಕುಸ್ಥಿತಿ."]}], "ತ್ರಿಶತ": [{"type": "adjective", "defs": ["amounting to or equalling three hundred in number.", "next after the two hundred ninety nine in a series."]}, {"type": "noun", "defs": ["the cardinal number three hundred; 300."]}], "ತ್ರಿಶಾಲ": [{"type": "adjective", "defs": ["that has three layers, storeys (as a building)."]}, {"type": "noun", "defs": ["a three-storied building."]}], "ತ್ರಿಶೂಲ": [{"type": "noun", "defs": ["a three-pronged weapon, with a long staff; a trident.", "a god.", "a mound of earth, leaves, etc., formed by a colony of ants in digging or constructing their underground nest; an ant-hill.", "a cruel man."]}], "ತ್ರಿಶೂಲ ಊಬಿನಹುಲ್ಲು": [{"type": "noun", "defs": ["the grass Aristida funiculata of Poaceae family."]}], "ತ್ರಿಶೂಲಿ": [{"type": "noun", "defs": ["Śiva, who has a trident as one of his weapons.", "the grass Aristida funiculata of Poaceae family."]}], "ತ್ರಿಶೃಂಗಿ": [{"type": "noun", "defs": ["the name of a mythological mountain believed to be in Lanka."]}], "ತ್ರಿಶ್ರ": [{"type": "noun", "defs": ["(mus.) a unit in time that has one beat followed by three counts."]}], "ತ್ರಿಷವಣ": [{"type": "noun", "defs": ["the three divisions (morning, noon and evening) of the period of light between sunrise and sunset."]}], "ತ್ರಿಷಷ್ಟಿ": [{"type": "adjective", "defs": ["amounting to or equalling sixty three.", "next after the sixty two in a series."]}, {"type": "noun", "defs": ["the cardinal number three hundred; 63."]}], "ತ್ರಿಷ್ಟುಪ್ಪು": [{"type": "noun", "defs": ["(pros.) the meter that has eleven syllables in each quarter."]}], "ತ್ರಿಷ್ಯ": [{"type": "noun", "defs": ["that which has three corners (as a triangle)."]}], "ತ್ರಿಸಂಗು": [{"type": "noun", "defs": ["a kind of plant."]}], "ತ್ರಿಸಂಚ": [{"type": "noun", "defs": ["a group or combination of three things."]}], "ತ್ರಿಸಂಜೆ": [{"type": "noun", "defs": ["= ತ್ರಿಸಂಧ್ಯೆ - 1."]}], "ತ್ರಿಸಂಜ್ಞ": [{"type": "noun", "defs": ["(used only in pl., with the termination ಗಳು) three modes of expression, i.e. speech, movement of eyes and other physical gestures."]}], "ತ್ರಿಸಂಧಿ": [{"type": "noun", "defs": ["= ತ್ರಿಸಂಧ್ಯೆ - 1.", "the dried, pungent, fragrant flower bud of the evergreen tree Eugenia aromatica of Myrtaceae family used as spice; clove."]}], "ತ್ರಿಸಂಧಿಗ್ರಾಹಿ": [{"type": "noun", "defs": ["a person having the capability of understanding, keeping in memory, anything that is read or heard only three times."]}], "ತ್ರಿಸಂಧ್ಯೆ": [{"type": "noun", "defs": ["the three divisions (morning, noon and evening) of the period of light between sunrise and sunset.", "a kind of plant.", "its flower."]}], "ತ್ರಿಸರ": [{"type": "noun", "defs": ["a three-stringed ornamental chain or necklace."]}], "ತ್ರಿಸೂಲಿ": [{"type": "noun", "defs": ["the grass Aristida funiculata of Poaceae family(?)."]}], "ತ್ರಿಸೆ": [{"type": "noun", "defs": ["a sensation of dryness in the mouth and throat caused by need of water."]}], "ತ್ರಿಸ್ನೇಹ": [{"type": "noun", "defs": ["a combination of ghee (clarified butter), castor seed oil and sesame oil, used for various medicinal purpose."]}], "ತ್ರಿಳೋಕ": [{"type": "noun", "defs": ["= ತ್ರಿಲೋಕ."]}], "ತ್ರೀಂದ್ರಿಯ": [{"type": "adjective", "defs": ["having three sensual organs - the skin, tongue and nose."]}, {"type": "noun", "defs": ["(in pl.) three sensual organs - the skin, tongue and nose.", "any of the living beings having these organs."]}], "ತ್ರುಟಿ": [{"type": "noun", "defs": ["a tiny particle of anything; a jot; an atom.", "a very minute space of time.", "lack of something necessary for completeness; deficiency; shortcoming.", "the plant Alpinia cardamomum; small cardamoms.", "the act of cutting or breaking (something).", "a piece broken from the whole.", "the act or an instance of breaking one's promise.", "destruction; loss.", "uncertainty; doubt.", "a kind of tree."]}], "ತ್ರುಟಿತ": [{"type": "adjective", "defs": ["broken; splintered; fractured.", "wounded; injured; cut.", "lost due to breakage, lack of proper maintenance."]}, {"type": "noun", "defs": ["that which is broken or fractured.", "(Jain.) a very minute space of time; a letter or letters or a portion of a text on a palm-leave or paper that is lost due to breakage or lack of proper maintenance."]}], "ತ್ರುಟಿತಾಂಗ": [{"type": "noun", "defs": ["(Jain.) a very minute space of time."]}], "ತ್ರುವ್ವಿ": [{"type": "noun", "defs": ["a meaningless term used at the end of each quarter of a song, merely for rhyme."]}], "ತ್ರೇತಾಗ್ನಿ": [{"type": "noun", "defs": ["the three sacred fires, dakṣiṇāgni, gārhapatya andāvahanīya, taken collectively.", "a man who maintains perpetually these fires."]}], "ತ್ರೇತಾಯುಗ": [{"type": "noun", "defs": ["= ತ್ರೇತೆ - 3."]}], "ತ್ರೇತೆ": [{"type": "noun", "defs": ["= ತ್ರೇತಾಗ್ನಿ - 1.", "a group or set of three things; a triad.", "the second of the four ages of the Hindus (which has 196,000 years).", "a count of three in the game of dice."]}], "ತ್ರೈಕಾಲ": [{"type": "noun", "defs": ["the three main divisions of time -i.e. past, present and future times."]}], "ತ್ರೈಕಾಲಿಕ": [{"type": "adjective", "defs": ["happening regularly in the morning, noon and evening.", "being in the past, present and also in future."]}], "ತ್ರೈಕಾಲ್ಯ": [{"type": "adjective", "defs": ["of or relating to the past, present and future times.", "having knowledge of the past, present and future."]}], "ತ್ರೈಗುಣ್ಯ": [{"type": "noun", "defs": ["collectively the three types of fundamental qualities, they being, a) virtue, merit, excellence, b) dynamism, vigour, c) ignorance, wickedness, excessive selfishness."]}], "ತ್ರೈಜಗ": [{"type": "noun", "defs": ["the three worlds - the physical world, the lower region and the heaven."]}], "ತ್ರೈತ": [{"type": "noun", "defs": ["a union or group of three; a triad."]}], "ತ್ರೈದಶ್ಯ": [{"type": "adjective", "defs": ["of or relating to the heaven; of or belonging to gods."]}], "ತ್ರೈಧರೆ": [{"type": "noun", "defs": ["= ತ್ರೈಜಗ."]}], "ತ್ರೈಪುಂಡ್ರ": [{"type": "noun", "defs": ["the three stripes marked horizontally on the forehead with sacred ashes, as a sectarian mark."]}], "ತ್ರೈಮಲ": [{"type": "noun", "defs": ["the three impurities as sexual appetite, greed for riches and avariciousness for property."]}], "ತ್ರೈಮಾಸಿಕ": [{"type": "adjective", "defs": ["happening or being published once every three months; trimonthly."]}, {"type": "noun", "defs": ["a periodical published once in every three months."]}], "ತ್ರೈರಾಶಿ": [{"type": "noun", "defs": ["(arith.) a method of finding the fourth quantity using three known quantities."]}], "ತ್ರೈರಾಶಿಕ": [{"type": "noun", "defs": ["= ತ್ರೈರಾಶಿ."]}], "ತ್ರೈರಾಸಿಕ": [{"type": "noun", "defs": ["= ತ್ರೈರಾಶಿ."]}], "ತ್ರೈಲೋಕ್ಯ": [{"type": "noun", "defs": ["= ತ್ರೈಜಗ."]}], "ತ್ರೈಲೋಕ್ಯಮೋಹಿನಿ": [{"type": "noun", "defs": ["a kind of mystic power by which anything in the three worlds can be enchanted or mesmerised."]}], "ತ್ರೈವರ್ಣ": [{"type": "noun", "defs": ["(pl.) the three upper classes of Hindu society - they are brāhmaṇa, Kṣatriya (military caste and vaiśya (trading community)."]}], "ತ್ರೈವರ್ಣಿಕ": [{"type": "noun", "defs": ["a man belonging to any of the three upper classes of Hindu society - i.e. brāhmaṇa, Kṣatriya (military caste) and vaiśya (trading community)."]}], "ತ್ರೈವಿಕ್ರಮ": [{"type": "noun", "defs": ["one of the forms of Viṣṇu, in which he pervaded the earth, lower region and the heaven, each by a gigantic step."]}], "ತ್ರೈವಿದ್ಯ": [{"type": "noun", "defs": ["(pl.) the three Vedas - Řgvēda, Yajurvēda and Sāmavēda."]}], "ತ್ರೈಷಷ್ಟಿ": [{"type": "adjective", "defs": ["= ತ್ರಿಷಷ್ಟಿ1."]}, {"type": "noun", "defs": ["= ತ್ರಿಷಷ್ಟಿ2."]}], "ತ್ರೈಸಂಧ್ಯೆ": [{"type": "noun", "defs": ["= ತ್ರಿಸಂಧ್ಯೆ - 1."]}], "ತ್ರೈಳೋಕ್ಯ": [{"type": "noun", "defs": ["= ತ್ರೈಜಗ."]}], "ತ್ರೋಟಕ": [{"type": "adjective", "defs": ["that presents the substance or general idea in brief form; summarizing; concise; condensed; summary."]}, {"type": "noun", "defs": ["(rhet.) a kind of composition chiefly romantic in character."]}], "ತ್ರೋಟಿ": [{"type": "noun", "defs": ["the bill of a bird.", "any of the birds.", "a kind of fish.", "the tree Gmelina arborea (= Premna arborea) of Verbenaceae family."]}], "ತ್ರ್ಯಂಗ": [{"type": "noun", "defs": ["(pl.). collectively two hands and the head."]}], "ತ್ರ್ಯಂಬಕ": [{"type": "adjective", "defs": ["having three eyes."]}, {"type": "noun", "defs": ["Śiva, who has three eyes, including a fiery one on the forehead."]}], "ತ್ರ್ಯಂಶ": [{"type": "noun", "defs": ["any of the three equal parts of something; a third."]}], "ತ್ರ್ಯಕ್ಷ": [{"type": "noun", "defs": ["= ತ್ರ್ಯಂಬಕ2."]}], "ತ್ರ್ಯಕ್ಷರ": [{"type": "adjective", "defs": ["having three letters or syllables (as a word or metric foot); formed by the combination of three syllables."]}, {"type": "noun", "defs": ["'ಓಮ್', the mystic syllable which is the combination 'ಅ, ಉ and ಮ'.", "a man who habitually makes false and slanderous statements against and in the absence of a third person who is not present, with an intention to damage the character or reputation; a slanderer.", "(rhet.) a poetic composition using only three letters."]}], "ತ್ರ್ಯಕ್ಷರಿ": [{"type": "noun", "defs": ["a hymn or mystic syllable having only three letters."]}], "ತ್ರ್ಯಣುಕ": [{"type": "noun", "defs": ["that which has or made of three atoms."]}], "ತ್ರ್ಯಶ್ರೀಕೃತ": [{"type": "adjective", "defs": ["(dance.) a posture in which one foot is placed in the normal position, and the other kept perpendicular to it (forming a right angle)."]}], "ತ್ರ್ಯಸ್ರ": [{"type": "adjective", "defs": ["having three corners or angles."]}, {"type": "noun", "defs": ["(dance.) a bending of the neck toward the shoulder blade."]}], "ತ್ರ್ಯಸ್ರಿ": [{"type": "noun", "defs": ["a kind of small vessel used for drinking the juice of sōma plant in religious sacrifices."]}], "ತ್ರ್ಯಾಹಿಕ": [{"type": "adjective", "defs": ["having food-supplies that would last for three days."]}, {"type": "noun", "defs": ["a man who has stored food-supplies that would last for three days.", "a kind of fever that relapses every third day."]}], "ತ್ರ್ಯೂಷಣ": [{"type": "noun", "defs": ["(collectively) the three pungent, medicinal substances ginger, long pepper and pepper."]}], "ತ್ವಕ್ಕು": [{"type": "noun", "defs": ["= ತ್ವಚೆ."]}], "ತ್ವಕ್ಪತ್ರ": [{"type": "noun", "defs": ["the plant Ferula assafoetida of Apiaceae family; asafoetida plant.", "its leaf.", "the tree Laurus cassia of Lauraceae family; true cinnamon.", "its fragrant, dried bark, used as spice."]}], "ತ್ವಕ್ಪತ್ರಿ": [{"type": "noun", "defs": ["= ತ್ವಕ್ಪತ್ರ."]}], "ತ್ವಕ್ಪುಷ್ಪ": [{"type": "noun", "defs": ["a bristling of the hair on the skin from joy; horripilation.", "a contagious skin disease caused by itch-mite."]}], "ತ್ವಕ್ಸಾರ": [{"type": "noun", "defs": ["the long, woody, hollow stem with stalked blades, of the grass Bambusa arundinaceae (= B. spinosa) of Poaceae family; a bamboo."]}], "ತ್ವಗಸ್ಥಿಭೂತ": [{"type": "adjective", "defs": ["totally emaciated by losing flesh."]}], "ತ್ವಗಸ್ಥೀಭೂತ": [{"type": "adjective", "defs": ["= ತ್ವಗಸ್ಥಿಭೂತ."]}], "ತ್ವಗಿಂದ್ರಿಯ": [{"type": "noun", "defs": ["= ತ್ವಚೆ - 1."]}], "ತ್ವಗ್ಗತ": [{"type": "adjective", "defs": ["gone into the skin; settled within one's body."]}], "ತ್ವಗ್ಗತಜ್ವರ": [{"type": "noun", "defs": ["the condition of increased body temperature caused by infections, characteristics of which are not obviously recognised or felt; internal pyrexia."]}], "ತ್ವಗ್ಜ": [{"type": "adjective", "defs": ["made of leather."]}], "ತ್ವಗ್ಜೀವಿ": [{"type": "noun", "defs": ["the tree Schleichera oleosa(= S. trijuga) of Sapindaceae family (?)."]}], "ತ್ವಗ್ದೋಷ": [{"type": "noun", "defs": ["any disorder in the condition of the skin; any of the skin diseases."]}], "ತ್ವಗ್ರೋಗ": [{"type": "noun", "defs": ["any of the skin diseases."]}], "ತ್ವಙ್ಮಲ": [{"type": "noun", "defs": ["impurities expelled from within the body on to or collected from without on, the skin.", "hair growing on the skin."]}], "ತ್ವಚ": [{"type": "noun", "defs": ["= ತ್ವಚೆ.", "the yellowish-brown spice made from the dried inner bark of the tree Cinnamomum zeylanicum of Lauraceae family; cinnamon."]}], "ತ್ವಚಿಸಾರ": [{"type": "noun", "defs": ["= ತ್ವಕ್ಸಾರ."]}], "ತ್ವಚೆ": [{"type": "noun", "defs": ["the skin - a) the external covering or integument of an animal body, esp. when soft and flexible; b) such an integument stripped from the body of an animal; pelt: c) the tanned or treated pelt or hide of an animal, esp. when used in apparel and accessories; leather.", "the thick external layer covering the woody stems, branches, and roots of plants, as distinct and separable from the wood easily; bark."]}], "ತ್ವದೀಯ": [{"type": "adjective", "defs": ["of, belonging to or done by you."]}], "ತ್ವರ": [{"type": "noun", "defs": ["= ತ್ವರೆ."]}], "ತ್ವರಣ": [{"type": "adjective", "defs": ["characterised by sudden or rash action, emotion, etc.; impulsive; impatient to do, get, etc."]}, {"type": "noun", "defs": ["the quality of being impatient or impetuous; impetuosity."]}], "ತ್ವರಿತ": [{"type": "adjective", "defs": ["moving or capable of moving with great speed or velocity; fleet; rapid; quick; swift."]}, {"type": "noun", "defs": ["= ತ್ವರೆ.", "a man moving, acting, responding or thinking quickly."]}], "ತ್ವರಿತಂ": [{"type": "adverb", "defs": ["quickly; swiftly; rapidly."]}], "ತ್ವರಿತಗೊಳಿಸು": [{"type": "verb", "defs": ["to increase the speed; to cause to go, run or happen quickly; to speed up."]}], "ತ್ವರಿತತೆ": [{"type": "noun", "defs": ["= ತ್ವರೆ."]}], "ತ್ವರಿತರಗಳೆ": [{"type": "noun", "defs": ["(pros.) a kind of meter, popularly known as ಮಂದಾನಿಲ ರಗಳೆ."]}], "ತ್ವರಿತೆ": [{"type": "noun", "defs": ["= ತ್ವರೆ."]}], "ತ್ವರೆ": [{"type": "noun", "defs": ["speed - a) rapidity in moving, going, travelling, proceeding or performing; swiftness; celerity; swiftness; rapidity; quickness; b) relative rapidity in moving, going, etc..", "ತ್ವರೆ ಮಾಡು tvare māḍu = ತ್ವರೆಪಡಿಸು."]}], "ತ್ವರೆಪಡಿಸು": [{"type": "verb", "defs": ["to cause to move more rapidly; to hasten; to speed up; to accelerate."]}], "ತ್ವರೆಪಡು": [{"type": "verb", "defs": ["to hurry up oneself."]}], "ತ್ವರ್ಯ": [{"type": "noun", "defs": ["= ತ್ವರೆ."]}], "ತ್ವಷ್ಟ": [{"type": "noun", "defs": ["= ತ್ವಷ್ಟೃ - 1 & 2."]}, {"type": "adjective", "defs": ["trimmed and smoothened with or as with an adze (said of wood)."]}], "ತ್ವಷ್ಟೃ": [{"type": "noun", "defs": ["a man who builds or repairs wooden structures, as houses, scaffolds, furniture or shelving; a carpenter.", "Viśvakarma, the architect of the gods.", "Brahma, the creator of the universe.", "one of the twelve gods of the class of the sun.", "Viṣṇu.", "a star in the constellation Virgo, with the brightness magnitude of 1.03; the Spica."]}], "ತ್ವಾಟ": [{"type": "noun", "defs": ["a piece of ground for growing vegetables, fruits, flowers ornamental shrubs or trees, etc.; a garden."]}], "ತ್ವಾಟದೂರ": [{"type": "noun", "defs": ["a man who is totally or partially unable to hear; a deaf man."]}], "ತ್ವಾಷ್ಟ್ರ": [{"type": "noun", "defs": ["the quality of being rash, rough, unnecessarily violent or tending to commit infractions of the rules.", "a man with wretched habits."]}], "ತ್ವಿಷಾಂಪತಿ": [{"type": "noun", "defs": ["the sun, as the lord of light."]}], "ತ್ವಿಷೆ": [{"type": "noun", "defs": ["light; radiance; luminosity; brilliance."]}], "ತ್ವೇಷ": [{"type": "adjective", "defs": ["shining; bright; splendorous; luminous.", "characterised by strong emotion, impetuosity, impatience, rashness, etc.", "of violent nature; causing dread."]}, {"type": "noun", "defs": ["strong, uncontrollable emotion.", "the act of causing dread."]}], "ತ್ಸತ್ರ": [{"type": "noun", "defs": ["a building where shelter (sometimes food also) provided benevolently to people, esp. wayfarers."]}], "ತ್ಸರು": [{"type": "noun", "defs": ["a part of a thing (as of a sword) made specifically to be grasped or held by the hand; the hilt; the handle."]}], "ಥ": [{"type": "noun", "defs": ["(gen. pronounced with the vowel 'ಅ') the thirty first letter of Kannaḍa alphabet and the seventeenth consonant.", "a symbol for the number seven."]}], "ಥಂಡಿ": [{"type": "noun", "defs": ["the condition of temperature being much lower; the sensation produced by a loss or absence of normal heat; coldness; chillness.", "a being moistened, covered or saturated with water; wetness."]}], "ಥಕ": [{"type": "noun", "defs": ["the sound imitating the one made by jumping repeatedly from joy, impatience, disappointments (as by children), etc."]}], "ಥಕಥಾಕು": [{"type": "noun", "defs": ["= ಥಕ."]}], "ಥಕಪಕ": [{"type": "noun", "defs": ["= ಥಕ."]}], "ಥಕಾರ": [{"type": "noun", "defs": ["the letter or the sound of 'ಥ'."]}], "ಥಕಾಸು": [{"type": "verb", "defs": ["to get weary and spent; to become fatigued."]}], "ಥಕ್ಕು": [{"type": "noun", "defs": ["the state or fact of being astonished; amazement; astonishment.", "ಥಕ್ಕಾಗು thakkāgu to be astonished; to be amazed; to be wonder-struck."]}], "ಥಟಕ್": [{"type": "noun", "defs": ["a onomatopoeic word imitating the sound made by a thing moving fast, falling suddenly, etc."]}], "ಥಟಕ್ಕನೆ": [{"type": "adverb", "defs": ["immediately; suddenly."]}], "ಥಟ್ಟಣೆ": [{"type": "noun", "defs": ["a group of people, animals, things, etc.; a multitude.", "an organised unit of soldiers; an army."]}], "ಥಟ್ಟನೆ": [{"type": "adverb", "defs": ["immediately; suddenly."]}], "ಥಟ್ಟಯಿಸು": [{"type": "verb", "defs": ["= ಥಟ್ಟೈಸು."]}], "ಥಟ್ಟು": [{"type": "noun", "defs": ["one of the lateral surfaces of an object, as different from to the front, back, top, and bottom; a side."]}, {"type": "noun", "defs": ["a great number of people gathered together; crowd; throng.", "an army of soldiers.", "ಥಟ್ಟು ಮಾಡು thaṭṭu māḍu to attack (an enemy place) with an army."]}], "ಥಟ್ಟುಗಿ": [{"type": "verb", "defs": ["(a pointed weapon as an arrow) to pierce through."]}], "ಥಟ್ಟುಗೆಡಹು": [{"type": "verb", "defs": ["to fell, knock down an army of soldiers."]}], "ಥಟ್ಟುಗೆಡು": [{"type": "verb", "defs": ["to go away or be separated from the group; to be dispelled, scattered."]}], "ಥಟ್ಟುಗೆಡೆ": [{"type": "verb", "defs": ["to be knocked down en masse (as soldiers in a group).", "to be knocked down, losing one's strength."]}], "ಥಟ್ಟುಚ್ಚು": [{"type": "verb", "defs": ["to come out splitting (the envelope) from within."]}], "ಥಟ್ಟುತಾಱು": [{"type": "adverb", "defs": ["bursting into pieces; in a shattered or strewn condition."]}], "ಥಟ್ಟುವರಿಯಿಸು": [{"type": "verb", "defs": ["to cause (a large number of persons) to move together; to drive (a group of persons) together."]}], "ಥಟ್ಟೈಸು": [{"type": "verb", "defs": ["to gather in a large group (at a place).", "to cover, envelop with large number of (persons, things, etc.)."]}], "ಥಟ್ಟೊಡ್ಡು": [{"type": "verb", "defs": ["to confront (another, another's army with one's army in a battlefield)."]}], "ಥಡಿ": [{"type": "noun", "defs": ["land on either side and along a river; bank.", "any line or thing marking a limit; bound; border.", "nearness; proximity.", "the border of a piece of cloth or garment; hem.", "a long mound of relatively smaller height made to prevent water from flowing to the other side; a ridge."]}], "ಥಣ್ಣಗೆ": [{"type": "adverb", "defs": ["in a moderately cold condition; coolly.", "in a manner that tends to reduce discomfort.", "in a composed manner.", "without doing any or with no inclination to, work; inactively; idly."]}], "ಥಣ್ಣನೆ": [{"type": "adverb", "defs": ["= ಥಣ್ಣಗೆ - 1, 2 & 3."]}], "ಥಣ್ಣಿ": [{"type": "noun", "defs": ["water."]}], "ಥತ್": [{"type": "interjection", "defs": ["a term used to express one's disgust, disappointment, contempt, etc."]}], "ಥತ್ವ": [{"type": "noun", "defs": ["the letter or the sound of 'ಥ'."]}], "ಥಪ್ಪಿ": [{"type": "noun", "defs": ["several objects or a quantity of material gathered or bound together; a bundle.", "a row of bundles, packages, etc. neatly arranged one above the other to a convenient height; a stack."]}], "ಥಮಾಸ": [{"type": "noun", "defs": ["the plant Alhagi maurorum of Papilionaceae family."]}], "ಥರ": [{"type": "noun", "defs": ["an onomatopoeic word imitating or suggesting the sound or condition of shivering, trembling tremulously."]}, {"type": "noun", "defs": ["a line in which persons or things or arranged (in an order).", "that which is proper, right.", "a class or rank based on one's merits.", "the quality that pleases senses, esp. the sight organ; beauty."]}, {"type": "noun", "defs": ["a horizontal layer or section of material, esp. any of several lying one upon another, as one of many layers of soil, sedimentary rock, etc.; a stratum."]}, {"type": "noun", "defs": ["a way of doing, being, being done or happening; mode of action, occurrence, etc.: manner.", "likeness; resemblance."]}], "ಥರಂಬಿಡಿ": [{"type": "verb", "defs": ["= ಥರವಿಡಿ."]}], "ಥರಗುಟ್ಟು": [{"type": "verb", "defs": ["= ಥರಥರಗುಟ್ಟು."]}], "ಥರಥರ": [{"type": "noun", "defs": ["= ಥರ1."]}, {"type": "noun", "defs": ["= ಥರ2."]}, {"type": "noun", "defs": ["= ಥರ4."]}], "ಥರಥರಗುಟ್ಟು": [{"type": "verb", "defs": ["to tremble; to shiver."]}], "ಥರಥರನೆ": [{"type": "adverb", "defs": ["(used with the verb meaning shiver, tremble) tremulously; spasmodically; violently."]}], "ಥರಥರಿಸು": [{"type": "verb", "defs": ["to shiver, tremble violently (as from fear, cold, etc.)."]}], "ಥರವಿಡಿ": [{"type": "verb", "defs": ["to follow, come in, form a line.", "to become attractive, charming."]}], "ಥರಾ": [{"type": "noun", "defs": ["= ಥರ4."]}], "ಥರಾವರಿ": [{"type": "noun", "defs": ["of different kinds or varieties."]}], "ಥರ್ಮಾಮೀಟರು": [{"type": "noun", "defs": ["an instrument for measuring temperatures, consisting of a graduated, sealed glass tube with a capillary bore that has mercury or coloured alcohol, which rises or falls with temperature changes, the temperature being determined from the graduated scale on the tube where the top of the column of the liquid coincides; a thermometer."]}], "ಥಳಕು": [{"type": "noun", "defs": ["the quality, condition or fact of shining by reflected light; gloss; sheen; lustre.", "the act of dallying, flirting; amorous toying; dalliance.", "a kind of ear-ornament.", "the quality or nature of a person who is serious and has intellectual depth or a show of it.", "any substance applied to the skin (as for cosmetic, healing or religious purpose)."]}], "ಥಳಕುಗಾತಿ": [{"type": "noun", "defs": ["a woman who pays too much attention to her appearance.", "she who cheats others with nice words."]}], "ಥಳಕುಗಾರ": [{"type": "noun", "defs": ["a man who pays too much attention to his appearance.", "he who cheats others with nice words."]}], "ಥಳತ್ಥಳಿಸು": [{"type": "verb", "defs": ["= ಥಳಥಳಿಸು."]}], "ಥಳಥಳ": [{"type": "noun", "defs": ["an onomatopoeic word - a) imitating the sound made by boiling water; the boiling or gurgling sound; b) expressing the fact of something shining.", "the condition of utter confusion or the fact of being utterly confused."]}], "ಥಳಥಳನೆ": [{"type": "adverb", "defs": ["brightly; brilliantly; sparklingly.", "with bubbles or a bubbling sound."]}], "ಥಳಥಳಾರಿಸು": [{"type": "verb", "defs": ["= ಥಳಥಳಿಸು."]}], "ಥಳಥಳಿಕೆ": [{"type": "noun", "defs": ["the fact of being reflective of light (as a polished metal surface, mirror, etc.).", "the light so reflected; lustre."]}], "ಥಳಥಳಿಲು": [{"type": "noun", "defs": ["the metallic sound produced when two heavy metal weapons strike each other."]}], "ಥಳಥಳಿಸು": [{"type": "verb", "defs": ["to shine brightly.", "to be afraid of; to get bewildered or confounded.", "to boil with bubbles and a bubbling sound."]}], "ಥಳಪಳ": [{"type": "noun", "defs": ["= ಥಳಥಳ."]}], "ಥಳಪಳನೆ": [{"type": "adverb", "defs": ["= ಥಳಥಳನೆ."]}], "ಥಳಪು": [{"type": "noun", "defs": ["radiant or luminous brightness; brilliance; lustre."]}], "ಥಳಿ": [{"type": "noun", "defs": ["the act of scattering (a liquid) in drops; a sprinkling."]}], "ಥಳಿಸು": [{"type": "verb", "defs": ["to pound, beat (to hull paddy, polish rice, etc.) 2.to strike or drive with repeated, heavy blows."]}, {"type": "verb", "defs": ["to shine brightly; to sparkle.", "to rub or grind (an object) as to make it shining and sharp or sharer."]}], "ಥಳುಕು": [{"type": "noun", "defs": ["= ಥಳಕು."]}], "ಥಳುಕುಬಟ್ಟು": [{"type": "noun", "defs": ["a small piece of reflective metal sewn pm fabric for decoration; spangle."]}], "ಥೞಿಲ್": [{"type": "noun", "defs": ["= ಥಳಥಳಿಲು."]}], "ಥಾಕು": [{"type": "noun", "defs": ["an act or instance of stopping; a coming to an end; cessation of activity; stoppage.", "a relation, logical connection, etc. that exists between two things, matters, etc."]}], "ಥಾಟು": [{"type": "noun", "defs": ["ostentatious show or display; pomp; pretentiousness."]}], "ಥಾನು": [{"type": "noun", "defs": ["a role of cloth measuring totally forty yards."]}], "ಥಾಪನೆ": [{"type": "noun", "defs": ["a founding or being founded; institution; establishment; foundation."]}], "ಥಾಲಿ": [{"type": "noun", "defs": ["a metal vessel, chiefly a water container, with narrow neck."]}], "ಥಾಲೀಪಿಟ್ಟು": [{"type": "noun", "defs": ["a kind of hard cake made of rice-flour, baked inside a vessel (as diff. from the one made on frying pan).", "similar cake made of jowar-flour baked on frying pan."]}], "ಥಾವು": [{"type": "noun", "defs": ["a place, an area.", "the region or area surrounding a particular place; neighbourhood; vicinity."]}], "ಥಾಳಥಳ್ಯ": [{"type": "noun", "defs": ["radiant or luminous brightness; brilliance; lustre."]}], "ಥಾಳಿ": [{"type": "noun", "defs": ["= ಥಾಲಿ."]}], "ಥಾಱುಥಟ್ಟು": [{"type": "noun", "defs": ["an assemblage of large number of persons at a place."]}], "ಥೂ": [{"type": "noun", "defs": ["the sound made while spitting.", "a term used to express one's disgust, disappointment, contempt, etc."]}], "ಥೂಯೆನ್ನು": [{"type": "verb", "defs": ["to express contempt or hatred by or as if by spitting saliva; to spit."]}], "ಥೂಕರಿಸು": [{"type": "verb", "defs": ["= ಥೂಯೆನ್ನು."]}], "ಥೇಟ್": [{"type": "adjective", "defs": ["= ಥೇಟು."]}], "ಥೇಟು": [{"type": "adjective", "defs": ["of similar kind, type; similar or comparable in all or most of the respects or resembling exactly (another).", "pure; unadulterated; not contaminated."]}], "ಥೇರ": [{"type": "noun", "defs": ["a Jaina or Buddhist sage.", "an aged, elderly man."]}], "ಥೇರಕಪ್ಪ": [{"type": "noun", "defs": ["a Jaina sage who adopts less severe austerity in his religious observance and way of life."]}], "ಥೈ": [{"type": "noun", "defs": ["a rhythmical syllable used to denote a single unit."]}], "ಥೈಲಿ": [{"type": "noun", "defs": ["a small bag or pouch.", "a small pouch for carrying money; a purse."]}], "ಥೊಪ್ಪನೆ": [{"type": "adverb", "defs": ["(falling) suddenly and with a heavy sound (as made by an object that fell loosely)."]}], "ಥೋಡೆ": [{"type": "noun", "defs": ["in a small degree; to a slight extent; only slightly; not much; little."]}], "ಥೋರ": [{"type": "adjective", "defs": ["thick; fat; corpulent; plump.", "large; huge.", "gigantic; immense."]}, {"type": "noun", "defs": ["that which is fat, corpulent.", "the shape or contour of the body.", "excessiveness; plenitude."]}], "ದ": [{"type": "noun", "defs": ["(gen. pronounced with the vowel 'ಅ') the thirty second letter of Kannaḍa alphabet and the eighteenth consonant.", "a symbol for the number eight."]}], "ದಂ": [{"type": "noun", "defs": ["the air inhaled and exhaled in respiration; breath.", "the quality of being patient, as the bearing of provocation, annoyance, misfortune or pain, without complaint, loss of temper or irritation; the ability or willingness to suppress restlessness or annoyance when confronted with delay.", "the quality or state of being strong, either bodily or mental power to face a dangerous or risky undertaking.", "a paroxysmal, often allergic disorder of respiration, characterised by bronchospasm, wheezing, and difficulty in expiration, often accompanied by coughing and a feeling of constriction in the chest; asthma.", "to exhale slowly as from tiredness.", "the act of drawing the smoke deep into the lungs from a cigarette, bīḍi, cigar, etc.", "the amount of smoke so drawn."]}], "ದಂಕಟ್ಟು": [{"type": "verb", "defs": ["to hold the air taken into the lungs without exhaling.", "(asthma) to be contracted."]}], "ದಂಗಾಗು": [{"type": "verb", "defs": ["to be struck with wonder, surprise, admiration, etc.; to be wonderstruck.", "to be afraid of; to fear; to become anxious.", "to be greatly occupied, engrossed in (something); to be absorbed in."]}], "ದಂಗಾಮಸ್ತಿ": [{"type": "noun", "defs": ["the quality or behaviour of a tough, lawless person; ruffianism."]}], "ದಂಗು": [{"type": "noun", "defs": ["the condition of being struck with wonder, surprise, admiration, etc.", "the feeling of anxiety, agitation of mind caused by an impending or expected danger, evil, pain, loss, etc.; fear.", "the state of being absorbed, engrossed in (something)."]}], "ದಂಗುಬಡಿ": [{"type": "verb", "defs": ["= ದಂಗಾಗು - 1 & 2."]}], "ದಂಗುಬಡಿಸು": [{"type": "verb", "defs": ["to cause to be wonderstruck.", "to cause to become perplexed, baffled."]}], "ದಂಗುಬಡು": [{"type": "verb", "defs": ["= ದಂಗಾಗು - 1 & 2."]}], "ದಂಗುವಡೆ": [{"type": "verb", "defs": ["= ದಂಗಾಗು - 1 & 2."]}], "ದಂಗೆ": [{"type": "noun", "defs": ["revolt against or forcible resistance to a legally constituted system or any authority; mutiny."]}], "ದಂಗೆಕೋರ": [{"type": "noun", "defs": ["a man who has risen up against the government or any authority; one who engages in such a movement; a rebel."]}], "ದಂಗೆಗಾರ": [{"type": "noun", "defs": ["= ದಂಗೆಕೋರ."]}], "ದಂಗೆಯೇಳು": [{"type": "verb", "defs": ["to rise up against the established government, system or any authority; to rebel."]}], "ದಂಟಿ": [{"type": "noun", "defs": ["a woman who engages in sexual intercourse for money; a whore; a prostitute."]}], "ದಂಟು": [{"type": "noun", "defs": ["the main stem of bamboo, jowar, and some other plants as amaranth; the stalk.", "the potherb Amaranthus gangetics (= A. tricolour) of Amaranthaceae family, used as a vegetable.", "(dial.) a staff of the tree flame of the forest (Butea frondosa) given to a brāhmaṇa boy at the time of his initiation in to religious learning.", "the religious ceremony observed in connection with this occasion."]}], "ದಂಟುಬೇರು": [{"type": "noun", "defs": ["roots or root like developments emanating from the stalks of plants as sugarcane, jowar, etc."]}], "ದಂಟೂರ್ತ": [{"type": "noun", "defs": ["(dial.) a ceremony observed on the fourth day of initiation of a Brāhmaṇa boy into religious learning."]}], "ದಂಟೆ": [{"type": "noun", "defs": ["= ದಂಟು - 3."]}], "ದಂಡ": [{"type": "noun", "defs": ["a club, heavy staff used as a weapon.", "a churning stick.", "a stick used to strike a percussion instrument.", "the crossbar of a balance.", "the wooden blade used to row a boat; an oar.", "a length of four cubit.", "a staff of the tree Butea frondosa held by a Brāhmaṇa boy while being initiated into religious learning.", "a rod or staff, usu. ornamented, held as a symbol of authority; a sceptre.", "the stalk of a plant.", "a long, slender piece of wood (as the one used to uphold a banner).", "a particular type of array in which soldiers are placed one behind the other in a row.", "the coarse, unrefined sugar; jaggery.", "the male organ through which semen and urine are ejected; the penis.", "punishment - a) a punishing or being punished; b) a penalty imposed on an offender for a crime or wrongdoing.", "an attack, assault, punishment of a wrong doer, enemy, etc., as one of the four expedients used in achieving a goal in politics.", "an army of soldiers.", "the quality or fact of being useless; uselessness.", "a wrong deed.", "a type of physical exercise in which, standing on the toes and the palms, the body is lowered (without allowing the knees to touch the ground), and slightly pushed forward bending the back upward; ದಂಡ ಕೊಡು daṇḍa koḍu to pay a sum of money as a punishment for having done an offence; ದಂಡ ಹಾಕು daṇḍa hāku to impose a sum of money as a punishment for an offence; ದಂಡಂ ದಶಗುಣಂ ಭವೇತ್ daṇḍam daśam guṇam bhavēt (loosely) a maxim to denote that, when other ways fail, one can be tamed, taught by chastising; baculine argument."]}], "ದಂಡಂಗೊಳ್": [{"type": "verb", "defs": ["to be punished; to be imposed a sum of money as a punishment.", "to impose a sum of money as a punishment for an offence."]}], "ದಂಡಂದೆಱು": [{"type": "verb", "defs": ["= ದಂಡತೆರು."]}], "ದಂಡಕ": [{"type": "noun", "defs": ["a thin, long staff (as of a bamboo).", "the forest between the Narmada and Gōdāvari rivers in the northern part of southern of India.", "(pros.) a meter, having more than twenty six syllables in each quarter."]}, {"type": "noun", "defs": ["a usual method or custom; a convention; a practice."]}], "ದಂಡಕಾಂತ": [{"type": "noun", "defs": ["a magnet in the form of a magnet; a bar-magnet."]}], "ದಂಡಕಾರಣ್ಯ": [{"type": "noun", "defs": ["= ದಂಡಕ1 - 2."]}], "ದಂಡಕೋಲು": [{"type": "noun", "defs": ["a staff carried by a brāhmaṇa boy initiated into religious learning or an ascetic."]}], "ದಂಡಖಂಡ": [{"type": "noun", "defs": ["a thick, short staff."]}], "ದಂಡಣೆ": [{"type": "noun", "defs": ["= ದಂಡನೆ."]}], "ದಂಡತೆರು": [{"type": "verb", "defs": ["to pay a sum of money as a punishment for having done an offence.", "(fig.) to pay unnecessarily."]}], "ದಂಡದಾಯ": [{"type": "noun", "defs": ["= ದಂಡಾಯ."]}], "ದಂಡದೋಸ": [{"type": "noun", "defs": ["= ದಂಡದೋಷ."]}], "ದಂಡದೋಷ": [{"type": "noun", "defs": ["a sum of money imposed as punishment for an offence."]}], "ದಂಡದ್ರವ್ಯ": [{"type": "noun", "defs": ["= ದಂಡಾಯ."]}], "ದಂಡಧರ": [{"type": "noun", "defs": ["a man who walks with the help of a stick.", "Yama, the Hindu god of Death and who awards punishment to human beings after their death.", "a holder of a sceptre as a symbol of sovereignty.", "a man holding a staff, as a guard, doorkeeper, etc.", "an officer in the court of law who implements the punishment awarded by the judge."]}], "ದಂಡಧಾರ": [{"type": "noun", "defs": ["= ದಂಡಧರ."]}], "ದಂಡಧಾರಣ": [{"type": "noun", "defs": ["the act or holding a staff (as by a guard)."]}]}