{"ಆತ್ತಚಿತ್ತ": [{"type": "noun", "defs": ["he who has fixed his mind on; a single-minded man."]}], "ಆತ್ತಚಿತ್ತೆ": [{"type": "noun", "defs": ["a woman with a fixed aim; she who is devoted to a purpose."]}], "ಆತ್ತಬಳ": [{"type": "adjective", "defs": ["having power or strength."]}], "ಆತ್ತಮನ": [{"type": "noun", "defs": ["he who is delighted or pleased."]}], "ಆತ್ತರಕ್ತರುಚಿ": [{"type": "noun", "defs": ["the red lustre got (as the clouds just before sun rise or immediately after the sun set)."]}], "ಆತ್ತಸಂಗರ": [{"type": "noun", "defs": ["the war that is undertaken."]}], "ಆತ್ಮ": [{"type": "noun", "defs": ["that which feels, thinks, desires etc.; the principle of life and sensation; the soul; the ego or the spirit embodied or not; innermost nature; that which one identifies with oneself.", "one's customary frame of mind or natural disposition; nature; temperament, 3) the natural quality or peculiarity or character.", "a try; attempt; endeavour; effort.", "mental or physical vigour; vitality; spirit.", "the thinking, reasoning faculty; seat of intelligence; the mind.", "the physical structure of a human being or animal; the body.", "the Supreme deity and soul of the universe; the Supreme Soul; Brahma.", "air; wind.", "the sun.", "fire.", "(in comp.) reflexively acting upon the agent, automatic.", "(fig.) that which makes something what it is; intrinsic, fundamental nature or most important quality (of something); essential being; essence.", "ಒಂದೇ ಆತ್ಮ, ಎರಡು ದೇಹ ondē ātma eraḍu dēha a bosom friend; true friends are one soul in two bodies; a friend is another self; ಆತ್ಮ ಕಾದು ಧರ್ಮ ātma kādu dharma charity begins at home."]}], "ಆತ್ಮಂಭರಿ": [{"type": "noun", "defs": ["he who is concerned too much with his own bread."]}], "ಆತ್ಮಕ": [{"type": "adjective", "defs": ["(in composition) having; of the nature of; made of or composed of (as in ಧರ್ಮಾತ್ಮಕ)"]}], "ಆತ್ಮಕಥೆ": [{"type": "noun", "defs": ["a story of a person's life written or dictated by himself or herself; autobiography."]}], "ಆತ್ಮಕೃತ": [{"type": "adjective", "defs": ["done by oneself; self-executed."]}], "ಆತ್ಮಕೃತ್ಯ": [{"type": "noun", "defs": ["one's own business; private affairs."]}], "ಆತ್ಮಕೃಷಿ": [{"type": "noun", "defs": ["the realisation of self; self-realisation, a doctrine that asserts the possibility of attaining an intuitive knowledge of spiritual truths through meditation; mysticism."]}], "ಆತ್ಮಕೃಷಿಕ": [{"type": "noun", "defs": ["a man who has attained or is trying to attain, the intuitive knowledge of spiritual truth through meditation; a mystic."]}], "ಆತ್ಮಕೌಶಲ": [{"type": "noun", "defs": ["the inherent talent of a person; inborn skill."]}], "ಆತ್ಮಕ್ಲೇಶ": [{"type": "noun", "defs": ["one's own distress, discomfort or suffering."]}], "ಆತ್ಮಕ್ಷೇಮ": [{"type": "noun", "defs": ["one's own comfort, pleasure or welfare."]}], "ಆತ್ಮಗತ": [{"type": "adjective", "defs": ["being in or accompanying the soul.", "belonging to one (used reflexively).", "produced in one's own mind."]}, {"type": "noun", "defs": ["an act or instance of talking to oneself.", "words spoken by an actor expressing his or her thoughts in such a way that they are heard by the audience but supposedly not by the other actors; soliloquy."]}], "ಆತ್ಮಗುಣ": [{"type": "noun", "defs": ["the natural quality, temperament or disposition.", "the quality or nature of the soul.", "reflexively, one's nature or disposition.", "(phil.) any of the qualities, dispositions, etc. (as uprightness, propriety, absence of selfishness, refraining from harming others etc.) that are essential for attaining the Self-knowledge."]}], "ಆತ್ಮಗುತ್ತೆ": [{"type": "noun", "defs": ["= ಆತ್ಮಗುಪ್ತೆ."]}], "ಆತ್ಮಗುಪ್ತೆ": [{"type": "noun", "defs": ["the plant Mucuna prurita ( = M. Puriens) of Papilionaceae family."]}], "ಆತ್ಮಗೌರವ": [{"type": "noun", "defs": ["proper respect for oneself and one's worth as a person; self-respect; self-esteem."]}], "ಆತ್ಮಗ್ಲಾನಿ": [{"type": "noun", "defs": ["the distressed state of the mind; the state of the mind lacking spirit."]}], "ಆತ್ಮಘಾತ": [{"type": "noun", "defs": ["the act of killing oneself intentionally or an instance of it; suicide.", "the resultant sin earned by suicide.", "(fig.) ruin of one's interests or prospects through one's own rash or dangerous actions, policies, etc.; a suicidal action."]}], "ಆತ್ಮಘಾತಕ": [{"type": "adjective", "defs": ["suicidal - a) of, involving or leading to suicide; b) having an urge to commit suicide; c) (fig.) rash to the point of being very dangerous to oneself."]}, {"type": "noun", "defs": ["one who deliberately kills or attempts to kill, oneself.", "the act of killing oneself intentionally.", "he whose action harms himself."]}], "ಆತ್ಮಘಾತಕಿ": [{"type": "noun", "defs": ["he or she who deliberately kills or attempt to kill, himself or herself.", "he or she who harms himself or herself."]}], "ಆತ್ಮಘಾತುಕ": [{"type": "noun", "defs": ["= ಆತ್ಮಘಾತಕ2."]}], "ಆತ್ಮಘೋಷ": [{"type": "noun", "defs": ["one who calls out to himself, blows his own trumpet.", "a cock.", "a crow."]}], "ಆತ್ಮಚರಿತೆ": [{"type": "noun", "defs": ["= ಆತ್ಮಕಥೆ."]}], "ಆತ್ಮಚರಿತ್ರೆ": [{"type": "noun", "defs": ["= ಆತ್ಮಕಥೆ."]}], "ಆತ್ಮಚಿಂತೆ": [{"type": "noun", "defs": ["a meditating within.", "a thinking on one's own welfare; selfish view."]}], "ಆತ್ಮಚೈತನ್ಯ": [{"type": "noun", "defs": ["one's inherent power or ability.", "the self-knowledge; the knowledge of the Supreme."]}], "ಆತ್ಮಜ": [{"type": "noun", "defs": ["one's male offspring; a son.", "the hair growing on the head.", "the liquid that caries spermatozoa; the semen.", "Manmatha, the Love-God.", "the reasoning faculty.", "any of the four Vēdas, the holy scriptures of Hindus."]}], "ಆತ್ಮಜನ್ಮ": [{"type": "noun", "defs": ["= ಆತ್ಮಜ - 1."]}], "ಆತ್ಮಜಳ": [{"type": "noun", "defs": ["one's urine."]}], "ಆತ್ಮಜಾತ": [{"type": "noun", "defs": ["= ಆತ್ಮಜ - 1."]}], "ಆತ್ಮಜಾತೆ": [{"type": "noun", "defs": ["one's female offspring; a daughter."]}], "ಆತ್ಮಜೆ": [{"type": "noun", "defs": ["= ಆತ್ಮಜಾತೆ."]}], "ಆತ್ಮಜ್ಞ": [{"type": "noun", "defs": ["(masc.) one who knows all about the soul and the Supreme or has attained the divine knowledge."]}], "ಆತ್ಮಜ್ಞತೆ": [{"type": "noun", "defs": ["the state of having full knowledge of the soul or the Supreme."]}], "ಆತ್ಮಜ್ಞಾನ": [{"type": "noun", "defs": ["the knowledge of self; the Supreme knowledge; the spiritual or divine wisdom."]}], "ಆತ್ಮಜ್ಞಾನಿ": [{"type": "noun", "defs": ["= ಆತ್ಮಜ್ಞ."]}], "ಆತ್ಮಜ್ಞೆ": [{"type": "noun", "defs": ["a woman who knows all about the soul and the Supreme or the divine knowledge."]}], "ಆತ್ಮಜ್ಯೋತಿ": [{"type": "noun", "defs": ["the light supposed to be arising from the soul; the divine lustre."]}], "ಆತ್ಮತತ್ತ್ವ": [{"type": "noun", "defs": ["the true nature of the soul or the Supreme spirit."]}], "ಆತ್ಮತತ್ತ್ವಜ್ಞ": [{"type": "noun", "defs": ["one well-versed in the knowledge of the true nature of the soul or the Supreme spirit."]}], "ಆತ್ಮತುಷ್ಟಿ": [{"type": "noun", "defs": ["self-satisfaction; a deriving of contentment from within oneself, i.e. not from external objects."]}], "ಆತ್ಮತೃಪ್ತಿ": [{"type": "noun", "defs": ["= ಆತ್ಮತುಷ್ಟಿ."]}], "ಆತ್ಮತೃಷ್ಣೆ": [{"type": "noun", "defs": ["one's individual desire, longing or craving."]}], "ಆತ್ಮತೇಜ": [{"type": "noun", "defs": ["the light supposed to be arising from the soul; the divine lustre.", "(reflexively referring) lustre of oneself.", "the proper respect for oneself and one's worth as a person; self respect; self-esteem."]}], "ಆತ್ಮತೇಜಸ್ಸು": [{"type": "noun", "defs": ["= ಆತ್ಮತೇಜ."]}], "ಆತ್ಮತ್ಯಾಗ": [{"type": "noun", "defs": ["the act of killing oneself intentionally; suicide.", "the act or an instance of sacrifice of one's life for a selfless cause; self-sacrifice."]}], "ಆತ್ಮತ್ರಯ": [{"type": "noun", "defs": ["(pl.) the three kinds of souls (the individual soul, the inner soul, and the Supreme Soul)."]}], "ಆತ್ಮದಂಡನೆ": [{"type": "noun", "defs": ["the observance of rigorous self-denial and self-discipline; asceticism.", "an awarding of punishment for oneself for a wrong act done."]}], "ಆತ್ಮದರ್ಶನ": [{"type": "noun", "defs": ["the realisation of self-knowledge or supreme wisdom."]}], "ಆತ್ಮದರ್ಶನಿ": [{"type": "noun", "defs": ["one who knows all about the soul and the Supreme or the divine knowledge; one well versed in the Vedanta philosophy."]}], "ಆತ್ಮದರ್ಶಿ": [{"type": "noun", "defs": ["= ಆತ್ಮದರ್ಶನಿ."]}], "ಆತ್ಮದೇವತೆ": [{"type": "noun", "defs": ["the deity that watches over or protects; a tutelary deity."]}], "ಆತ್ಮದ್ರೋಹ": [{"type": "noun", "defs": ["the deceiving of oneself as to one's true feelings, motives, circumstances, etc.; self-deception; self-delusion."]}], "ಆತ್ಮದ್ರೋಹಿ": [{"type": "noun", "defs": ["one that deceives of himself or herself or his/her own true feelings, motives, circumstances, etc.; a self-deceiver.", "a person that ruins his or her interests or prospects through self-action or policies or commits suicide; a suicide."]}], "ಆತ್ಮಧ್ಯಾನ": [{"type": "noun", "defs": ["the act or an instance of meditating on the inner soul.", "the act or an instance of meditating on the Supreme Soul."]}], "ಆತ್ಮಧ್ಯಾನಿ": [{"type": "noun", "defs": ["a person who meditates on the inner self or the Supreme Soul."]}], "ಆತ್ಮನಿಂದೆ": [{"type": "noun", "defs": ["an accusing or blaming of oneself; self-reproach; self-accusation."]}], "ಆತ್ಮನಿಕ್ಷೇಪ": [{"type": "noun", "defs": ["the entrusting of oneself to the Supreme, with full confidence of being protected by the latter."]}], "ಆತ್ಮನಿರಾಕರಣ": [{"type": "noun", "defs": ["= ಆತ್ಮನಿರಾಕರಣೆ."]}], "ಆತ್ಮನಿರಾಕರಣೆ": [{"type": "noun", "defs": ["self-denial - a) denial of existence of one's own soul; b) lack of consideration of oneself; c) denial or sacrifice of one's own desires and pleasures."]}], "ಆತ್ಮನಿರ್ಣಯ": [{"type": "noun", "defs": ["self-determination - a) determination or decision according to one's own mind or will, without outside influence; b) determination or decision according to one's own mind or will, without outside influence."]}], "ಆತ್ಮನಿರ್ಮಿತ": [{"type": "adjective", "defs": ["done, constructed, made by one-self; self-made."]}], "ಆತ್ಮನಿರ್ವಾಣ": [{"type": "noun", "defs": ["the final emancipation of the individual soul from the cycle of births and deaths."]}], "ಆತ್ಮನಿವೇದನ": [{"type": "noun", "defs": ["= ಆತ್ಮನಿವೇದನೆ."]}], "ಆತ್ಮನಿವೇದನೆ": [{"type": "noun", "defs": ["an offering of oneself (as a living sacrifice) to a deity; a complete surrender to the God.", "submission of one's own deeds, to a deity, as in repentance."]}], "ಆತ್ಮನಿಷ್ಠ": [{"type": "adjective", "defs": ["seeking the knowledge of self or Supreme.", "of or resulting from the feelings or temperment of the person thinking; not objective; subjective."]}, {"type": "noun", "defs": ["one who constantly seeks for self realisation and spiritual knowledge.", "he who acts depending on his own feelings or temperment."]}], "ಆತ್ಮನಿಷ್ಠೆ": [{"type": "noun", "defs": ["a seeking of the knowledge of self or Supreme."]}], "ಆತ್ಮನೇಪದ": [{"type": "noun", "defs": ["(gram.) a verb followed by 'ಕೊಳ್ಳು' which makes the object and subject the same."]}], "ಆತ್ಮನೈವೇದ್ಯ": [{"type": "noun", "defs": ["= ಆತ್ಮನಿವೇದನೆ."]}], "ಆತ್ಮಪರ": [{"type": "noun", "defs": ["he who meditates on the nature of the soul."]}], "ಆತ್ಮಪಾಲನ": [{"type": "noun", "defs": ["a taking care of and bringing up of oneself; self-protection."]}], "ಆತ್ಮಪುಣ್ಯ": [{"type": "noun", "defs": ["one's religious or moral merit or virtue."]}], "ಆತ್ಮಪುತ್ರಕ": [{"type": "noun", "defs": ["one's (own) son (as diff. from the one adopted)."]}], "ಆತ್ಮಪೂಜೆ": [{"type": "noun", "defs": ["an act or instance of adoring oneself; self-adoration."]}], "ಆತ್ಮಪ್ರಜ್ಞೆ": [{"type": "noun", "defs": ["the knowledge of the Self; self-knowledge.", "awareness of one's own existence, actions, etc.; consciousness of one's self or ego; self-consciousness."]}], "ಆತ್ಮಪ್ರತಿಷ್ಠಾಪನೆ": [{"type": "noun", "defs": ["the act of demanding recognition for oneself; self-assertion."]}], "ಆತ್ಮಪ್ರತಿಷ್ಠೆ": [{"type": "noun", "defs": ["proper respect for oneself and one's worth as a person; self esteem; self-respect.", "undue pride in oneself; exaggerated opinion of one's own importance; conceit; haughtiness."]}], "ಆತ್ಮಪ್ರತ್ಯಯ": [{"type": "noun", "defs": ["confidence in oneself, one's own abilities etc.; self-confidence.", "an exaggerated opinion of one's own importance; self-importance; officiousness.", "(phil.) the self, variously conceived as a spiritual substance on which experience is superimposed, the series of acts and mental states introspectively recognised, etc.; the ego."]}], "ಆತ್ಮಪ್ರಭೆ": [{"type": "noun", "defs": ["the illumination of the soul."]}], "ಆತ್ಮಪ್ರವಾದ": [{"type": "noun", "defs": ["a division of Jaina scriptures that deals with the soul."]}], "ಆತ್ಮಪ್ರಶಂಸೆ": [{"type": "noun", "defs": ["a praising of oneself; self-commendation; self-glorification."]}], "ಆತ್ಮಪ್ರೀತಿ": [{"type": "noun", "defs": ["love for oneself; self-love."]}], "ಆತ್ಮಬಲ": [{"type": "noun", "defs": ["the strength or power of the soul.", "one's own physical strength.", "one's military power."]}], "ಆತ್ಮಬೋಧ": [{"type": "noun", "defs": ["the knowledge of self; the Supreme knowledge; the spiritual or divine wisdom."]}], "ಆತ್ಮಭವ": [{"type": "noun", "defs": ["one's male offspring; a son.", "the cycle of one's births and deaths."]}], "ಆತ್ಮಭವೆ": [{"type": "noun", "defs": ["one's female offspring; a daughter."]}], "ಆತ್ಮಭಾವಿ": [{"type": "adjective", "defs": ["that results from the meditation on the soul or the Supreme."]}], "ಆತ್ಮಭೂ": [{"type": "noun", "defs": ["a self born, born from within or a descendant - a) Viṣṇu; b) Brahma; c) Manmatha, the Love-God; d) a male offspring; a son."]}], "ಆತ್ಮಮಲ": [{"type": "noun", "defs": ["the religious or moral impurity acquired by oneself."]}], "ಆತ್ಮಯೋಗ": [{"type": "noun", "defs": ["a studying of one's own nature and that of the soul to secure eternal felicity."]}], "ಆತ್ಮಯೋಗಿ": [{"type": "noun", "defs": ["a master of the knowledge of one's own nature, hence of spiritual knowledge."]}], "ಆತ್ಮರಕ್ಷಕ": [{"type": "noun", "defs": ["(Jain.) the god who protects those soul that is born in the heaven."]}], "ಆತ್ಮರಕ್ಷಣೆ": [{"type": "noun", "defs": ["protection of oneself; self-protection; self-defence."]}], "ಆತ್ಮರಕ್ಷೆ": [{"type": "noun", "defs": ["= ಆತ್ಮರಕ್ಷಣೆ."]}], "ಆತ್ಮರಕ್ಷೆಗೆಯ್": [{"type": "verb", "defs": ["to protect oneself."]}], "ಆತ್ಮರತಿ": [{"type": "noun", "defs": ["the intense interest in meditating on the soul or Supreme.", "delight derived from within oneself (as opp. to getting from external objects).", "sensual gratification found in one's own body; indulgence of one's own desires, impulses, etc.; self-indulgence.", "one who delights himself in meditation."]}], "ಆತ್ಮರಾಗ": [{"type": "noun", "defs": ["one's sentiment, as love, affection, kindly and generous attitude, etc."]}], "ಆತ್ಮರೂಪ": [{"type": "noun", "defs": ["nature of the soul."]}], "ಆತ್ಮಲಾಭ": [{"type": "noun", "defs": ["the virtue of self-knowledge.", "the realisation of the Supreme or divine knowledge."]}], "ಆತ್ಮಲಿಂಗ": [{"type": "noun", "defs": ["a small Liŋga (the physical representation of Śiva) in a casket, that is tied around one's neck, regarded as his personal Liŋga."]}], "ಆತ್ಮವಂಚಕ": [{"type": "noun", "defs": ["a man who cheats himself; a self-deceiver."]}], "ಆತ್ಮವಂಚಕಿ": [{"type": "noun", "defs": ["a woman who cheats herself; a self-deceiver."]}], "ಆತ್ಮವಂಚನೆ": [{"type": "noun", "defs": ["the deceiving of oneself as tp one's true feelings, motives, circumstances, etc. self-deception; self-deception; self-delusion."]}], "ಆತ್ಮವಂತ": [{"type": "noun", "defs": ["a man having self-control; a man with pure mind."]}], "ಆತ್ಮವಂತೆ": [{"type": "noun", "defs": ["a woman having self-control; a woman whose mind is pure."]}], "ಆತ್ಮವಲ್ಲಭ": [{"type": "noun", "defs": ["(with reference to a woman) one's husband.", "one's master or lord."]}], "ಆತ್ಮವಸ್ತು": [{"type": "noun", "defs": ["the self as an object.", "that which belongs to oneself.", "the life-principle; the principle relating to the soul or the Supreme."]}], "ಆತ್ಮವಿಕಾಸ": [{"type": "noun", "defs": ["development of one's spiritual knowledge."]}], "ಆತ್ಮವಿಜ್ಞಾನ": [{"type": "noun", "defs": ["the philosophical study of the self; spiritual knowledge."]}], "ಆತ್ಮವಿದ": [{"type": "noun", "defs": ["(masc.) one who knows all about the soul and the Supreme or the divine knowledge; a wise man; a sage."]}], "ಆತ್ಮವಿದೆ": [{"type": "noun", "defs": ["a woman who has realised the self and Supreme knowledge."]}], "ಆತ್ಮವಿದ್ಯೆ": [{"type": "noun", "defs": ["knowledge of the soul; spiritual knowledge."]}], "ಆತ್ಮವಿಮರ್ಶೆ": [{"type": "noun", "defs": ["appraisal of one's own knowledge, strength, weakness, etc.; self-appraisal.", "a critical analysis of one's own faults and short-comings; self-criticism."]}], "ಆತ್ಮವಿಲಾಸ": [{"type": "noun", "defs": ["one's own play, sport; amusement or recreation derived from within (as opp. to from external objects)."]}], "ಆತ್ಮವಿಶ್ವಾಸ": [{"type": "noun", "defs": ["confidence in oneself, one's own abilities etc.; self-confidence."]}], "ಆತ್ಮವೀಕ್ಷಣೆ": [{"type": "noun", "defs": ["the examination of one's own conscience (to find out whether one's motives and actions are genuine); soul-searching."]}], "ಆತ್ಮವೀರ": [{"type": "noun", "defs": ["a man having deep knowledge of the self or Supreme; a sage.", "a powerful, strong man."]}], "ಆತ್ಮವೃತ್ತ": [{"type": "noun", "defs": ["the story of one's own life written, dictated or narrated by oneself ."]}], "ಆತ್ಮವೃತ್ತಾಂತ": [{"type": "noun", "defs": ["= ಆತ್ಮವೃತ್ತ."]}], "ಆತ್ಮಶಕ್ತಿ": [{"type": "noun", "defs": ["one's inherent power or ability."]}], "ಆತ್ಮಶುದ್ಧಿ": [{"type": "noun", "defs": ["purity of mind; strict honesty; uprightness of character."]}], "ಆತ್ಮಶೋಧನೆ": [{"type": "noun", "defs": ["a looking into one's own mind, feelings, etc.; observation and analysis of oneself; an introspection."]}], "ಆತ್ಮಶ್ರಾದ್ಧ": [{"type": "noun", "defs": ["the rituals, performed by a man for himself, which otherwise should have been by his son or a nearest relative after his death."]}], "ಆತ್ಮಶ್ಲಾಘನೆ": [{"type": "noun", "defs": ["a praising of oneself; self-commendation; self-glorification."]}], "ಆತ್ಮಸಂಗ": [{"type": "noun", "defs": ["a union of an individual soul with the Supreme."]}], "ಆತ್ಮಸಂಗತ್ಯ": [{"type": "noun", "defs": ["= ಆತ್ಮಸಂಗ."]}], "ಆತ್ಮಸಂಗಾತ": [{"type": "noun", "defs": ["one's companion;", "such an association."]}], "ಆತ್ಮಸಂತುಷ್ಟ": [{"type": "adjective", "defs": ["pleased with oneself; derived the satisfaction from within; self-satisfied."]}, {"type": "noun", "defs": ["he who is self-satisfied."]}], "ಆತ್ಮಸಂತುಷ್ಟಿ": [{"type": "noun", "defs": ["satisfaction derived from within."]}], "ಆತ್ಮಸಂತುಷ್ಟೆ": [{"type": "noun", "defs": ["she who is self-satisfied; a self-satisfied woman."]}], "ಆತ್ಮಸಂತೋಷ": [{"type": "noun", "defs": ["delight derived from within, one's own deed, possession, ability, etc."]}], "ಆತ್ಮಸಂಧಾನ": [{"type": "noun", "defs": ["deep meditation on the nature or the principle of the self or Supreme."]}], "ಆತ್ಮಸಂಯಮ": [{"type": "noun", "defs": ["control of one's passions; self-restraint; self-control."]}], "ಆತ್ಮಸಂಯಮಿ": [{"type": "noun", "defs": ["one who restrains himself on his own will."]}], "ಆತ್ಮಸಂವರಣ": [{"type": "noun", "defs": ["a hiding of oneself; a covering of oneself to avoiding being seen."]}], "ಆತ್ಮಸಂಸ್ಕಾರ": [{"type": "noun", "defs": ["a cultivating of (good) habits, seasoning, etc. of oneself; self-culture; developing, broadening of one's own mind."]}], "ಆತ್ಮಸಮ": [{"type": "noun", "defs": ["an intimate person; a bosom friend."]}], "ಆತ್ಮಸಮರ್ಥನ": [{"type": "noun", "defs": ["= ಆತ್ಮಸಮರ್ಥನೆ."]}], "ಆತ್ಮಸಮರ್ಥನೆ": [{"type": "noun", "defs": ["a defending or justifying of one's own action, deed, statement, intention, etc."]}], "ಆತ್ಮಸಮರ್ಪಣ": [{"type": "noun", "defs": ["= ಆತ್ಮಸಮರ್ಪಣೆ."]}], "ಆತ್ಮಸಮರ್ಪಣೆ": [{"type": "noun", "defs": ["sacrifice of oneself or one's own interests for the benefit or the supposed benefit, of others; self-sacrifice."]}], "ಆತ್ಮಸಾಕ್ಷಾತ್ಕಾರ": [{"type": "noun", "defs": ["realisation of the true nature of one's self or of the universal soul; a getting of divine knowledge."]}], "ಆತ್ಮಸಾಕ್ಷಿ": [{"type": "noun", "defs": ["moral sense or judgement that opposes the violation of a recognized ethical principle, and which leads to feelings of guilt if such a principle is violated; conscience."]}], "ಆತ್ಮಸಾಕ್ಷಿಕ": [{"type": "adjective", "defs": ["acting as influenced by one's moral sense."]}], "ಆತ್ಮಸಾಧಕ": [{"type": "noun", "defs": ["he who strives to achieve the knowledge of the Supreme soul."]}], "ಆತ್ಮಸಾಧಕಿ": [{"type": "noun", "defs": ["she who strives to achieve the knowledge of the Supreme soul."]}], "ಆತ್ಮಸಾಧನೆ": [{"type": "noun", "defs": ["striving for the divine knowledge; self-realisation."]}], "ಆತ್ಮಸಿದ್ಧಿ": [{"type": "noun", "defs": ["attainment of highest spiritual status.", "the act of making oneself more powerful, wealthy, etc.; self-aggrandizement."]}], "ಆತ್ಮಸುಖ": [{"type": "noun", "defs": ["one's own comfort, pleasure, enjoyment, etc.", "the highest bliss as different from the sensual enjoyment."]}], "ಆತ್ಮಸುಖಿ": [{"type": "noun", "defs": ["a person that derives delight from within, as opp. to from external objects.", "one who indulges himself getting more enjoyment, esp. in a selfish way."]}], "ಆತ್ಮಸ್ತವ": [{"type": "noun", "defs": ["= ಆತ್ಮಸ್ತುತಿ."]}], "ಆತ್ಮಸ್ತವಕ": [{"type": "noun", "defs": ["he who praises of oneself; self-glorifier."]}], "ಆತ್ಮಸ್ತುತಿ": [{"type": "noun", "defs": ["a praising of oneself; self-commendation; self-glorification; self-praise."]}], "ಆತ್ಮಸ್ಥೈರ್ಯ": [{"type": "noun", "defs": ["confidence in oneself, one's own abilities, etc.; self-confidence."]}], "ಆತ್ಮಹತ್ಯ": [{"type": "noun", "defs": ["= ಆತ್ಮಹತ್ಯೆ."]}], "ಆತ್ಮಹತ್ಯೆ": [{"type": "noun", "defs": ["suicide - a) the action or an act of intentionally killing oneself; b) (fig.) any action that is destructive to one's own interests."]}], "ಆತ್ಮಹಿತ": [{"type": "noun", "defs": ["that which is salubrious to one's inner self.", "one's own good or welfare."]}], "ಆತ್ಮಾಜ್ಞೆ": [{"type": "noun", "defs": ["one's own command or behest."]}], "ಆತ್ಮಾಧೀನ": [{"type": "adjective", "defs": ["being under control of oneself.", "dependent on oneself; independent.", "of, having or capable of feeling or perception; conscious; sentient."]}], "ಆತ್ಮಾನಂದ": [{"type": "noun", "defs": ["(phil.) one of the eight types of bliss; bliss or delight that one derives from within."]}], "ಆತ್ಮಾನಾತ್ಮ ವಿವೇಕ": [{"type": "noun", "defs": ["the knowledge that can recognise the difference between the immutable self and the mutable objects."]}], "ಆತ್ಮಾನುಭವ": [{"type": "noun", "defs": ["one's own experience.", "(phil.) the bliss resultant of the realisation of self-knowledge."]}], "ಆತ್ಮಾನುಭೂತ": [{"type": "adjective", "defs": ["that is experienced by oneself."]}, {"type": "noun", "defs": ["= ಆತ್ಮಾನುಭವ."]}], "ಆತ್ಮಾನುಭೂತಿ": [{"type": "noun", "defs": ["= ಆತ್ಮಾನುಭವ."]}], "ಆತ್ಮಾನುಸಂಧಾನ": [{"type": "noun", "defs": ["deep meditation on the nature or the principle of the self or Supreme.", "the act of analysing within unbiasedly one's own thoughts, emotions."]}], "ಆತ್ಮಾಭಿಮಾನ": [{"type": "noun", "defs": ["proper respect for oneself and one's worth as a person; self-respect; self-esteem.", "undue pride in oneself, self-importance or high opinion of oneself."]}], "ಆತ್ಮಾಭಿಮಾನಿ": [{"type": "noun", "defs": ["a person that holds oneself in proper respect and esteem.", "a person having undue pride in oneself."]}], "ಆತ್ಮಾಮಿಷ": [{"type": "noun", "defs": ["the flesh from one's own body.", "one of the sixteen kinds of agreement entered by a state-head with his enemy-king."]}], "ಆತ್ಮಾಯತ್ತ": [{"type": "noun", "defs": ["the condition of having control over another.", "ಆತ್ಮಾಯತ್ತಮಾಡು ātmāyattam māḍu to get another under one's control; to exercise authority over (another); to command."]}], "ಆತ್ಮಾರತ": [{"type": "adjective", "defs": ["finding delight within oneself."]}, {"type": "noun", "defs": ["a man who gets delighted in himself."]}], "ಆತ್ಮಾರಾಮ": [{"type": "noun", "defs": ["(masc.) one who finds delight in himself; a self-pleased man."]}], "ಆತ್ಮಾರ್ಥ": [{"type": "adverb", "defs": ["for oneself; for one's own sake.", "for one's soul; for the sake of one's soul."]}], "ಆತ್ಮಾರ್ಥಕ": [{"type": "adjective", "defs": ["referring to or meaning oneself."]}], "ಆತ್ಮಾರ್ಥಕ ಸರ್ವನಾಮ": [{"type": "noun", "defs": ["(gram.) a pronoun that refers to one's self (e.g. ತಾನು, ತಾವು); a reflexive pronoun."]}], "ಆತ್ಮಾರ್ಪಣ": [{"type": "noun", "defs": ["= ಆತ್ಮಾರ್ಪಣೆ."]}], "ಆತ್ಮಾರ್ಪಣೆ": [{"type": "noun", "defs": ["offering oneself (as a living sacrifice) to a deity; self-immolation.", "submission of one's own deeds, to a deity, as in repentance."]}], "ಆತ್ಮಾರ್ಪಿತ": [{"type": "adjective", "defs": ["submitted, offered to the Supreme Soul."]}, {"type": "noun", "defs": ["that which is offered to oneself."]}], "ಆತ್ಮಾಸ್ತಿತ್ವ": [{"type": "noun", "defs": ["the fact of the soul's existence."]}], "ಆತ್ಮಾಹುತಿ": [{"type": "noun", "defs": ["the act or an instance of offering oneself to a deity; self-sacrifice; self-immolation."]}], "ಆತ್ಮೀಕರಣ": [{"type": "noun", "defs": ["the act of receiving (something) for oneself and adapting it as one's own."]}], "ಆತ್ಮೀಕರಿಸು": [{"type": "verb", "defs": ["to receive favourably; to take.", "to admit, recognise, acknowledge (a thing) as one's own."]}], "ಆತ್ಮೀಕೃತ": [{"type": "adjective", "defs": ["that is admitted, recognised or acknowledged as one's own."]}], "ಆತ್ಮೀಭಾವ": [{"type": "noun", "defs": ["= ಆತ್ಮೀಯತೆ - 1 & 2.", "3) becoming one with the Supreme."]}], "ಆತ್ಮೀಯ": [{"type": "adjective", "defs": ["of, relating, belonging to oneself; one's own.", "full of affection; tender and loving; treating as one's own; affectionate; intimate."]}, {"type": "noun", "defs": ["that which belongs to oneself.", "one related by blood; a cognate.", "one who is close; a bosom friend; an affectionate person.", "(phil.) that which is related to the soul.", "ಆತ್ಮೀಯಂ ಮಾಡು ātmīyam māḍu to make, adapt, recognise or acknowledge (another person or thing) as one's own; to own."]}], "ಆತ್ಮೀಯತೆ": [{"type": "noun", "defs": ["the feeling that a thing or another person belongs to oneself; fond feeling; warm liking.", "closeness of persons emotionally brought together; intimacy."]}], "ಆತ್ಮೀಯಪ್ರಪಂಚ": [{"type": "noun", "defs": ["(collectively) all that belongs to, assumed affectionately to be belonging to oneself."]}], "ಆತ್ಮೀಯಬಲ": [{"type": "noun", "defs": ["one's own military force."]}], "ಆತ್ಮೀಯಭಾವನೆ": [{"type": "noun", "defs": ["= ಆತ್ಮೀಯತೆ - 1."]}], "ಆತ್ಮೇಶ": [{"type": "noun", "defs": ["The Supreme, as the Lord of one's soul.", "(with reference to a woman) one's husband."]}], "ಆತ್ಮೈಶ್ವರ್ಯ": [{"type": "noun", "defs": ["the divine knowledge considered as unparalleled wealth that one can achieve."]}], "ಆತ್ಮೋದಯ": [{"type": "noun", "defs": ["spiritual development of oneself.", "one's own material prosperity."]}], "ಆತ್ಮೋದ್ಧಾರ": [{"type": "noun", "defs": ["the fact or an instance of one improving, enlightening or uplifting morally or spiritually by oneself; edification."]}], "ಆತ್ಮೋದ್ಭವ": [{"type": "noun", "defs": ["one that is born from within - a) the Love-God, Manmatha, b) a male off-spring; a son."]}], "ಆತ್ಮೋದ್ಭವೆ": [{"type": "noun", "defs": ["a female off-spring; a daughter."]}], "ಆತ್ಮೋದ್ಯೋಗ": [{"type": "noun", "defs": ["one's trade, profession or occupation."]}], "ಆತ್ಮೋನ್ನತಿ": [{"type": "noun", "defs": ["= ಆತ್ಮೋದಯ."]}], "ಆತ್ಮೋಪಾಸನೆ": [{"type": "noun", "defs": ["a meditating on the Supreme Soul."]}], "ಆತ್ಯಂತಿಕ": [{"type": "adjective", "defs": ["highest or lowest in degree; extreme; to an excessive degree; immoderate."]}], "ಆತ್ಯಂತಿಕಸುಖ": [{"type": "noun", "defs": ["the state of supreme, and everlasting pleasure and comfort; absolute bliss."]}], "ಆತ್ರೇಯ": [{"type": "noun", "defs": ["a descendant in the lineage of the sage ಅತ್ರಿ.", "the sage Durvāsa, son of the sage ಅತ್ರಿ.", "the Moon-God."]}, {"type": "adjective", "defs": ["of, relating to or being descendant of, the sage ಅತ್ರಿ."]}], "ಆತ್ರೇಯದುದ್ಯುತಿ": [{"type": "noun", "defs": ["the light of the moon; moonlight."]}], "ಆತ್ರೇಯಬಿಂಬ": [{"type": "noun", "defs": ["the moon's form as seen."]}], "ಆತ್ರೇಯಿ": [{"type": "noun", "defs": ["a female descendant of the sage ಅತ್ರಿ.", "2) the wife of the sage ಅತ್ರಿ.", "3) a woman in her courses."]}], "ಆತ್ರೇಯಿಕೆ": [{"type": "noun", "defs": ["a woman in her courses."]}], "ಆತ್ವ": [{"type": "noun", "defs": ["the letter 'ಆ'."]}], "ಆಥರ್ವಣ": [{"type": "adjective", "defs": ["originating from, relating or belonging to the Atharva Veda or its sages."]}, {"type": "noun", "defs": ["a collection of the hymns of Atharva Veda.", "the art or practice of usingh supernatural powers over people with a purpose of causing harm to them."]}], "ಆದಂ": [{"type": "adverb", "defs": ["in a special manner; particularly; specially; especially.", "to a marked degree; excessively."]}], "ಆದಕಾರಣ": [{"type": "adverb", "defs": ["as a result of this or that; for this or that reason; consequently; therefore; hence."]}], "ಆದಡೆ": [{"type": "adverb", "defs": ["on the other hand; in contrast; but.", "if it is so; if it so happens; if so."]}], "ಆದದ್ದರಿಂದ": [{"type": "adverb", "defs": ["(correctly, ಆದುದರಿಂದ) therefore; because of that or this; as a result."]}], "ಆದಮಾನುಂ": [{"type": "adverb", "defs": ["specially; particularly.", "excessively; to a marked degree."]}], "ಆದಮಿ": [{"type": "noun", "defs": ["(generally) a man."]}], "ಆದಮೆ": [{"type": "noun", "defs": ["= ಆದಂ."]}], "ಆದರ": [{"type": "noun", "defs": ["a feeling of high regard, honour or esteem; respect; reverence; veneration.", "inclination or attachment of the mind.", "fond or tender feeling; warm liking; affection.", "the act, practice or quality of being hospitable; solicitous entertainment of guests; hospitality.", "a strong desire.", "joy; happiness; pleasure.", "the act of keeping one's mind closely on something or the ability to do this; mental concentration and mental readiness for such concentration; attention."]}], "ಆದರಮಾಡು": [{"type": "verb", "defs": ["to show hospitality.", "to treat with respect or regard."]}], "ಆದರಂಗೆಯ್": [{"type": "verb", "defs": ["= ಆದರಮಾಡು."]}], "ಆದರಂಗೊಳ್": [{"type": "verb", "defs": ["to incline towards; to attach the mind."]}], "ಆದರಣೀಯ": [{"type": "adjective", "defs": ["worthy of respect or esteem; estimable; respectable.", "hospitable -a) friendly, kind, and solicitous toward guests b) prompted by or associated with friendliness and solicitude toward guests."]}, {"type": "noun", "defs": ["that which is worthy of respect or esteem; respectable.", "that which is to be or worthy of being, observed or considered."]}], "ಆದರಣೀಯತೆ": [{"type": "noun", "defs": ["the quality of being respectful."]}], "ಆದರಣೆ": [{"type": "noun", "defs": ["courteous treatment; hospitability.", "respectful treatment; respect; honour."]}], "ಆದರಪೂರ್ವಕ": [{"type": "adjective", "defs": ["courteous; hospitable; [occasionally used as adv. also]."]}], "ಆದರಿಸು": [{"type": "verb", "defs": ["to respect - a) to feel or show honour or esteem for; to hold in high regard; b) to consider or treat with deference or dutiful regard.", "to feel or show love for; to love.", "to treat with or show hospitality; to treat courteously.", "to strongly long for; to desire.", "to accept; to receive a thing or an idea favourably.", "to show or have interest in or inclination of mind for."]}], "ಆದರೆ": [{"type": "conjunction", "defs": ["on the other hand; in contrast; but.", "if it is so; if it so happens; if so."]}, {"type": "interjection", "defs": ["a doubt, uncertainty, diffidence expressed."]}], "ಆದರ್ಪಿಸು": [{"type": "verb", "defs": ["to ignore; to neglect.", "to look down; to disregard intentionally.", "to hurt - a) to cause physical pain or injury to; to wound; b) to harm or damage in some way."]}], "ಆದರ್ಶ": [{"type": "noun", "defs": ["a piece of glass, coated on the reverse side as with silver or an amalgam, that reflects the images of objects; a looking glass; a mirror.", "the object to be attained; intention or purpose; an aim.", "the highest conception of any thing an exemplary manner, behaviour, system of life etc.; a standard; a model; an ideal."]}], "ಆದರ್ಶಕ": [{"type": "adjective", "defs": ["serving as a model or example; worth imitating; exemplary; ideal."]}, {"type": "noun", "defs": ["= ಆದರ್ಶ - 1."]}], "ಆದರ್ಶಕತೆ": [{"type": "noun", "defs": ["the quality of being ideal or exemplary; exemplariness."]}], "ಆದರ್ಶನ": [{"type": "noun", "defs": ["= ಆದರ್ಶ - 1; 2) a bringing to light; publishing."]}], "ಆದರ್ಶನೀಯ": [{"type": "adjective", "defs": ["= ಆದರ್ಶಪ್ರಾಯ1."]}], "ಆದರ್ಶಪ್ರಾಯ": [{"type": "adjective", "defs": ["serving as a model or example; worth imitating; exemplary; ideal."]}, {"type": "noun", "defs": ["a person or thing that is worthy of being imitated; an ideal."]}], "ಆದರ್ಶಪ್ರಾಯತೆ": [{"type": "noun", "defs": ["the quality of being ideal or exemplary; exemplariness."]}], "ಆದರ್ಶರಾಜ್ಯ": [{"type": "noun", "defs": ["an imaginary state having perfect political, economic and social systems; Utopia."]}], "ಆದರ್ಶವಾದ": [{"type": "noun", "defs": ["idealism, the doctrine that a) truth, beauty and religious righteousness are more fundamental and useful than the external things in the world; b) things exist only as ideas in the mind rather than as material objects independent of the mind; c) things in the material world are actually manifestations of an independent realm of unchanging, immaterial models or forms."]}], "ಆದರ್ಶವಾದಿ": [{"type": "noun", "defs": ["an idealist - a) a person whose behaviour or thought is based on ideals; b) one who follows his ideals to the point of impracticality; a mere visionary or dreamer; c) an adherent or practitioner of idealism in art or philosophy."]}], "ಆದರ್ಶೀಕರಣ": [{"type": "noun", "defs": ["the act or process of making an object, aim, as ideal; idealisation.", "a regarding or showing as perfect or more nearly perfect than is true."]}], "ಆದಲಿಕೆ": [{"type": "noun", "defs": ["a short garment, with or without sleeves, worn by women on the upper part of the body, having a buttoned opening down the front (occasionally, on the back side); a jacket."]}], "ಆದಲೆ": [{"type": "noun", "defs": ["that side or portion; that end; far end.", "the front part of a building; frontage."]}, {"type": "noun", "defs": ["the act or fact of becoming, happening or producing."]}], "ಆದವೆ": [{"type": "adverb", "defs": ["in a special manner; particularly; specially; especially.", "to a marked degree; excessively."]}], "ಆದಾಗ್ಯೂ": [{"type": "preposition", "defs": ["(correctly, ಆದರೂ) in spite of; notwithstanding; despite."]}], "ಆದಾನ": [{"type": "noun", "defs": ["the act or fact of taking, receiving, accepting or seizing (of something); an instance of it.", "amount, material or energy that is put in.", "(Jain.) one of the fifty three purificatory rites."]}], "ಆದಾನನಿಕ್ಷೇಪಣ": [{"type": "noun", "defs": ["(Jain.) a keeping, displacing or lifting of any object on or from the ground, with a particular purpose of keeping any living being from being harmed."]}], "ಆದಾನಪ್ರದಾನ": [{"type": "noun", "defs": ["the act or an instance of giving and taking; an exchange."]}], "ಆದಾಬು": [{"type": "noun", "defs": ["the act of greeting or welcoming by gestures or words; salutations."]}], "ಆದಾಯ": [{"type": "noun", "defs": ["the money or other gain received, esp. in a given period, by an individual, corporation, etc. for labour or services or from property, investments, operations, etc.; income."]}], "ಆದಾಯಕರ": [{"type": "adjective", "defs": ["that brings income; helping to earn (more) profit, income; etc."]}, {"type": "noun", "defs": ["a tax on income or on that part of the income which exceeds a certain amount; income-tax."]}], "ಆದಾಯ ತೆರಿಗೆ": [{"type": "noun", "defs": ["= ಆದಾಯಕರ2."]}], "ಆದಾವತಿ": [{"type": "noun", "defs": ["the bitter attitude or feelings of an enemy or of mutual enemies; hostility; enmity; antagonism.", "ಆದಾವತಿಜನ ādāvati jana (usu. in pl.) people who oppose or compete with a person or a group of persons; antagonists; enemies; adversaries."]}], "ಆದಾವುಚ": [{"type": "noun", "defs": ["an established system of political administration by which a nation, state or district, etc. is governed; governance. 2) (dial.) management of one's income and expenditure."]}], "ಆದಿ": [{"type": "adjective", "defs": ["(used as adj. usu. in compositions) being, happening, happened, first; primary; primitive.", "first in time; existing before."]}, {"type": "noun", "defs": ["a starting or commencing; a beginning; commencement.", "first part or portion.", "the prime or fundamental cause.", "the early age in the history (of the universe, human race, etc.).", "(mus.) a bond of rhythmic cycle with eight units of two or four short notes each.", "(gram.) the case in which the subject is expressed; the nominative case, the first of the nine cases."]}], "ಆದಿ ಅಯನ": [{"type": "noun", "defs": ["the first festival of the season or the first worship of a deity."]}], "ಆದಿ ಆಂಧ್ರ": [{"type": "noun", "defs": ["one of the castes notified by the government as scheduled castes for purpose of development."]}], "ಆದಿಕಥೆ": [{"type": "noun", "defs": ["the story of early periods in history; the story of the first generation of a race or family."]}], "ಆದಿಕಮಠ": [{"type": "noun", "defs": ["(myth.) the tortoise supposed to bear the burden of the earth on its back."]}], "ಆದಿಕರ್ನಾಟಕ": [{"type": "noun", "defs": ["one of the castes notified by the government as scheduled castes for purpose of development."]}], "ಆದಿಕಲ್ಯಾಣ": [{"type": "noun", "defs": ["the auspicious ritual carried out at the beginning or before commencing a work, project, etc. 2) (Jain.) one of the five holy rituals performed to a venerable soul."]}], "ಆದಿಕವಿ": [{"type": "noun", "defs": ["the first poet - a) Brahma, who is supposed to have produced and promulgated the Vedas; b) Vālmīki, considered as the first to show other Samskřta poets, 'the path of poetry'; c) Pampa, the first recognised poet, with his immortal and unsurpassed Kannaḍa classical works 'Vikramārjuna Vijaya' and 'Ādipurāṇa'."]}], "ಆದಿಕಾರಣ": [{"type": "noun", "defs": ["the original or primary cause of everything; the first cause [(phil.) according to Vedantins, it is Brahma, while according to Naiyāyikas, atoms]."]}], "ಆದಿಕಾಂಡ": [{"type": "noun", "defs": ["genesis - a) the way in which something comes to be; beginning; origin; b) the first chapter of a book (usu. a classical one)."]}], "ಆದಿಕಾವ್ಯ": [{"type": "noun", "defs": ["Rāmāyaṇa, by Vālmīki, acknowledged as the first poem in Samskřta language.", "Vikramārjuna Vijaya the first classical Kannaḍa poetic work of Pampa."]}], "ಆದಿಕೆ": [{"type": "noun", "defs": ["a raised flooring or stage for performers, speakers, etc. ; a platform."]}], "ಆದಿಕ್ರೋಢ": [{"type": "noun", "defs": ["(myth.) the 'first boaṛ, an incarnation of Viṣṇu."]}], "ಆದಿಗ": [{"type": "noun", "defs": ["a person who goes before, preparing the way for others, setting the pattern, as an early settler or a scientist doing exploratory work; a pioneer."]}], "ಆದಿಗರ್ಭೇಶ್ವರ": [{"type": "noun", "defs": ["a man belonging, by birth, to a royal family."]}], "ಆದಿಗಿರಿ": [{"type": "noun", "defs": ["the eastern mountain, behind which the sun and moon are supposed to rise from."]}], "ಆದಿಚಕ್ರಿ": [{"type": "noun", "defs": ["(Jain.) Bharata, considered as the first emperor."]}], "ಆದಿಜ": [{"type": "noun", "defs": ["he who is born earlier than another or others."]}], "ಆದಿಜಿನ": [{"type": "noun", "defs": ["(Jain.) Vřṣabha Dēva, the first spiritual teacher."]}], "ಆದಿಜಿನೇಂದ್ರ": [{"type": "noun", "defs": ["= ಆದಿಜಿನ."]}], "ಆದಿಜಿನೇಶ್ವರ": [{"type": "noun", "defs": ["= ಆದಿಜಿನ."]}], "ಆದಿಜೀವಯುಗ": [{"type": "noun", "defs": ["the earliest geologic era, covering all the time before the Cambrian Period; Proterozoic era."]}], "ಆದಿತಾಳ": [{"type": "noun", "defs": ["(mus.) a bond of rhythmic cycle with eight units of two or four short notes each."]}], "ಆದಿತೀರ್ಥಂಕರ": [{"type": "noun", "defs": ["= ಆದಿಜಿನ."]}], "ಆದಿತೀರ್ಥಪ್ರವರ್ತಕ": [{"type": "noun", "defs": ["= ಆದಿಜಿನ."]}], "ಆದಿತೀರ್ಥೇಶ": [{"type": "noun", "defs": ["= ಆದಿಜಿನ."]}], "ಆದಿತೀರ್ಥೇಶ್ವರ": [{"type": "noun", "defs": ["= ಆದಿಜಿನ."]}], "ಆದಿತೇಯ": [{"type": "noun", "defs": ["(myth.) a son of the divine-mother, Aditi.", "a god, in general.", "the sun."]}], "ಆದಿತ್ಯ": [{"type": "noun", "defs": ["(myth.) a son of the divine-mother, Aditi; Varuṇa or any of the twelve sons of Aditi, 2) a god, in general.", "the sun.", "a class of gods.", "(pros.) a group of three syllables of which the middle one being longer and others short (u-u).", "(mus.) the last among twelve groups (called cakras) consisting of main modes from 67 to 72."]}], "ಆದಿತ್ಯಪ್ರಭ": [{"type": "noun", "defs": ["(in poetical description) a man having shining like the sun."]}], "ಆದಿತ್ಯಬಲ": [{"type": "noun", "defs": ["(astrol.) grace of the sun, one of the twelve planets that control, influence human life."]}], "ಆದಿತ್ಯಭಕ್ತ": [{"type": "noun", "defs": ["the composite plant Helianthus annuus of Asteraceae family; sun-flower plant.", "its flower; sun-flower."]}], "ಆದಿತ್ಯಭಕ್ತಿ": [{"type": "noun", "defs": ["= ಆದಿತ್ಯಭಕ್ತ."]}], "ಆದಿತ್ಯವಾರ": [{"type": "noun", "defs": ["the first day of the week; Sunday.", "ಆದಿತ್ಯವಾರದವರು ādityavāradavaru a clan of people in Karnāṭaka that worship their family or clan deity on Sundays."]}], "ಆದಿತ್ಯಸುತ": [{"type": "noun", "defs": ["any of the sons of the Sun-god, Śani, Yama, Sugrīva or Karṇa."]}], "ಆದಿತ್ಯಾಲಯ": [{"type": "noun", "defs": ["a temple where the main deity is the Sun-god."]}], "ಆದಿದೇವ": [{"type": "noun", "defs": ["the first or Supreme God - a) Viṣṇu, b) Śiva, c) Brahma, d) (Jain.) Ādijina."]}], "ಆದಿದ್ರಾವಿಡ": [{"type": "noun", "defs": ["one of the castes notified by the government as backward for purpose of development."]}], "ಆದಿಧೌರ್ಯ": [{"type": "noun", "defs": ["the first among the pioneers."]}], "ಆದಿನಾಥ": [{"type": "noun", "defs": ["= ಆದಿಜಿನ."]}], "ಆದಿನಾಥಮತ": [{"type": "noun", "defs": ["a Hindu religion, propagated by Ādijina; Jainism."]}], "ಆದಿನಾರಾಯಣ": [{"type": "noun", "defs": ["an epithet of Viṣṇu."]}], "ಆದಿನಾರಾಯಣಿ": [{"type": "noun", "defs": ["an epithet of Goddess Lakṣmi, the consort of Viṣṇu."]}], "ಆದಿಪಂಚಮ": [{"type": "noun", "defs": ["(mus.) a mode derivative of the main mode Divyamaṇi."]}], "ಆದಿಪರ್ವ": [{"type": "noun", "defs": ["the first chapter in Mahābhārata of either Vēda Vyāsa (in Samskřta) or, Kumāra Vyāsa (in Kannaḍa).", "(dial.) Yugādi, the first festival , marking the beginning, of the new year."]}], "ಆದಿಪುರಾಣ": [{"type": "noun", "defs": ["the Brahma Purāṇa, the first purāṇa, written or compiled by Vēda Vyāsa.", "(Jain.) the life history of Vřṣabha Dēva, the first spiritual Jaina teacher."]}]}