{"ಚಿತ್ತೋದ್ರೇಕ": [{"type": "noun", "defs": ["ಚಿತ್ತೋದ್ವೇಗ."]}], "ಚಿತ್ತೋದ್ವೇಗ": [{"type": "noun", "defs": ["an excited state or condition of the mind; excitement.", "distress or uneasiness of mind caused by fear of danger or misfortune; anxiety."]}], "ಚಿತ್ತೋದ್ವೇಗಕರ": [{"type": "adjective", "defs": ["that is causing excitement; exciting.", "that is causing anxiety."]}], "ಚಿತ್ಪಿಂಡ": [{"type": "noun", "defs": ["the Supreme, the Absolute Consciousness."]}], "ಚಿತ್ಪುರುಷ": [{"type": "noun", "defs": ["the personification of the Absolute Consciousness; the Supreme."]}], "ಚಿತ್ಯೆ": [{"type": "noun", "defs": ["the act of collecting together or piling up.", "a pile, esp. of wood, on which a dead body (of a human being) is burned in a funeral rite."]}], "ಚಿತ್ರ": [{"type": "adjective", "defs": ["easy to see or understand; clear; obvious; plain, apparent; evident.", "that is attractive; splendid; brilliant.", "having or marked with, varied colours or shades; variegated.", "that causes wonder; wonderful; marvellous."]}, {"type": "noun", "defs": ["a picture - a) an image or likeness of an object, person or scene produced on a flat surface, by painting, drawing; b) a printed reproduction of this; c) an image or picture made by photography.", "something strange and surprising; a cause of surprise, astonishment or admiration; a wonder.", "that which is or the quality of being, auspicious.", "any of a class of chemical elements, as iron, gold or aluminum, gen. characterised by ductility, malleability, luster, and conductivity of heat and electricity; a metal.", "a sectarian or decorative mark made on the forehead.", "the herbaceous plant Plumbago zeylanica of Plumbaginaceae family.", "air or wind.", "a continuous series of motion pictures, in which events, fictions etc. have been filmed and usu. projected on a screen, so as to convey candid reality; a cinema.", "(rhet.) a kind of verse composition in which letters, words are used in a tricky manner to give special sense.", "(rhet.) a kind of figure of speech dependent on the sound of words.", "a variety in the metre of tripadi (a verse having three lines).", "ಚಿತ್ರದ ಬೊಂಬೆ citrada bombe a beautiful, innocent child, girl or woman; 2. the state of being stupefied, bewildered and hence motionless."]}], "ಚಿತ್ರಂಬರೆ": [{"type": "verb", "defs": ["to draw a picture."]}], "ಚಿತ್ರಕ": [{"type": "noun", "defs": ["one who draws or paints pictures.", "the large feline mammal, Panthera pardus, with a black-spotted yellowish-fawn; a panther; a leopard.", "the large flesh-eating feline, Panthera tigris, having a yellow-brown coat with black stripes; a tiger.", "a sectarian or decorative mark on the forehead.", "the herbaceous plant Plumbago zeylanica of Plumbaginaceae family.", "the plant, Ricinus communis, of the Euphorbiaceae family, cultivated for its oil yielding seeds; castor plant.", "one of the four types of men according to erotic science."]}], "ಚಿತ್ರಕಂಠ": [{"type": "noun", "defs": ["any bird of the family Columbidae, having a compact body and short legs; a dove."]}], "ಚಿತ್ರಕಥೆ": [{"type": "noun", "defs": ["a wonderful or very interesting story, anecdote.", "a sequence of drawings relating an incident, adventure or mystery story, etc., specially meant for children; a story, for children, supported by ample number of pictures printed.", "the script from which a film is produced; a story adapted for making a film."]}], "ಚಿತ್ರಕರ": [{"type": "noun", "defs": ["one who draws or paints pictures."]}], "ಚಿತ್ರಕರ್ಮ": [{"type": "noun", "defs": ["the act, process of drawing or painting pictures.", "the drawing or paintings so done.", "a carved figure or design; a carving."]}], "ಚಿತ್ರಕಲೆ": [{"type": "noun", "defs": ["the art of drawing, painting pictures."]}], "ಚಿತ್ರಕವಿತ್ವ": [{"type": "noun", "defs": ["(rhet.) a kind of verse composition in which letters, words are used in a tricky manner to give special sense."]}], "ಚಿತ್ರಕಶಕ್ತಿ": [{"type": "noun", "defs": ["imagination of an artist ; a) the power of forming mental images of what is not actually present; b) the power of creating mental images of what has never been actually experienced or of creating new images or ideas by combining previous experiences; creative power."]}], "ಚಿತ್ರಕಾಯ": [{"type": "noun", "defs": ["a beautiful, well-proportioned or handsome body.", "the large flesh-eating feline, Panthera tigris, having a yellow-brown coat with black stripes; a tiger."]}], "ಚಿತ್ರಕಾಯಾಜೀವನ": [{"type": "noun", "defs": ["the processed skin of a tiger; the tiger's leather."]}], "ಚಿತ್ರಕಾರ": [{"type": "noun", "defs": ["one who draws or paints pictures."]}], "ಚಿತ್ರಕಾವ್ಯ": [{"type": "noun", "defs": ["(rhet.) a poetical work in which more importance is given to the words or their literary senses, than to the suggested senses or figurative meanings (which quality, is considered inferior)."]}], "ಚಿತ್ರಕುಟಿ": [{"type": "noun", "defs": ["a portable shelter of skins, canvas, plastic or the like, supported by one or more poles or a frame and often secured by ropes fastened to pegs in the ground; a tent."]}], "ಚಿತ್ರಗತಿ": [{"type": "noun", "defs": ["an act, movement etc. that is extraordinary, hence causing amazement."]}], "ಚಿತ್ರಗಾರ": [{"type": "noun", "defs": ["= ಚಿತ್ರಕಾರ."]}], "ಚಿತ್ರಗೀತೆ": [{"type": "noun", "defs": ["a song, set to an appealing tune, and picturised for, and included in, the sequence of a film; a film-song."]}], "ಚಿತ್ರಗುಪ್ತ": [{"type": "noun", "defs": ["an attendant of the Death God Yama, who is supposed to keep record of the virtues and vices of every individual, throughout his or her lifetime.", "(fig.) a slanderer or sly-informant."]}], "ಚಿತ್ರಗೃಹ": [{"type": "noun", "defs": ["a room or building for exhibiting or dealing in artworks; an art-gallery."]}], "ಚಿತ್ರಗೆಲಸ": [{"type": "noun", "defs": ["the act of producing art or craft works.", "something produced in one of the fine arts, as a painting, sculpture, carving, etc."]}], "ಚಿತ್ರಗೆಲಸಿ": [{"type": "noun", "defs": ["a worker in a skilled trade; an artisan or artist."]}], "ಚಿತ್ರಚರಿತ": [{"type": "noun", "defs": ["a man who has led an exemplary, wonderful life."]}], "ಚಿತ್ರಚರಿತ್ರ": [{"type": "noun", "defs": ["= ಚಿತ್ರಚರಿತ."]}], "ಚಿತ್ರಜ್ಞ": [{"type": "noun", "defs": ["a man who has expert knowledge of and keen discrimination or taste in the art of painting; a connoisseur."]}], "ಚಿತ್ರಜ್ಞೆ": [{"type": "noun", "defs": ["a woman who has expert knowledge of and keen discrimination or taste in the art of painting; a connoisseur."]}], "ಚಿತ್ರತಂಡುಲೆ": [{"type": "noun", "defs": ["the plant Embelia ribes of Myrsinaceae family, used as an insect killer."]}], "ಚಿತ್ರನ್ಯಸ್ತ": [{"type": "adjective", "defs": ["drawn, portrayed in a picture."]}], "ಚಿತ್ರಪಟ": [{"type": "noun", "defs": ["a specially prepared piece of canvas on which an oil painting is made.", "such a painting.", "a cloth of various colours or shades.", "a sequence of photographs or drawings projected on a screen in such rapid succession that they create the the optical illusion (because of the persistence of vision) of moving persons and objects; a film; a cinema."]}], "ಚಿತ್ರಪಟ್ಟಿಕೆ": [{"type": "noun", "defs": ["a strip of pictures; a row of photographs."]}], "ಚಿತ್ರಪಟ್ಟು": [{"type": "noun", "defs": ["the (long) handle that is carved or painted with pictures, of a fan (used in royal courts or temples)."]}], "ಚಿತ್ರಪತ್ರ": [{"type": "noun", "defs": ["(collectively) plant leaves of different colours or shades.", "a cloth of various colours or shades."]}], "ಚಿತ್ರಪದ": [{"type": "noun", "defs": ["(pros.) a metre with ten syllables in each line.", "(pros.) another metre with eight syllables in each line."]}], "ಚಿತ್ರಪರ್ಣಿ": [{"type": "noun", "defs": ["the plant Hedysarum lagopodioides."]}], "ಚಿತ್ರಪುಂಖ": [{"type": "noun", "defs": ["a slender, straight, pointed missile or weapon to be shot from a bow and equipped with feathers at the end of the shaft near the nock, for controlling flight; an arrow."]}], "ಚಿತ್ರಪುತ್ತಳಿ": [{"type": "noun", "defs": ["a beautiful idol.", "(fig.) a beautiful, innocent child, girl or woman.", "the state of being stupefied, bewildered and hence motionless."]}], "ಚಿತ್ರಪುತ್ರಿಕೆ": [{"type": "noun", "defs": ["= ಚಿತ್ರಪುತ್ತಳಿ."]}], "ಚಿತ್ರಪ್ರಪಂಚ": [{"type": "noun", "defs": ["a number of or series of events, incidents that are amazing, wonderful.", "the sphere of activities connected with acting in or making, distributing and exhibiting of films; the world of cinema."]}], "ಚಿತ್ರಪ್ರಬಂಧ": [{"type": "noun", "defs": ["a picture in its entirety."]}], "ಚಿತ್ರಪ್ರವರ್ತನ": [{"type": "noun", "defs": ["a particular mode, manner of using colours in painting."]}], "ಚಿತ್ರಫಲಕ": [{"type": "noun", "defs": ["the frame holding the canvas for painting on.", "a frame holding a photograph, painting, etc."]}], "ಚಿತ್ರಬಲ್ಲಾರೆ": [{"type": "noun", "defs": ["the plant Euphorbia thymifolia of Euphorbiaceae plant."]}], "ಚಿತ್ರಭಾನು": [{"type": "noun", "defs": ["the sun, the bright-shining one.", "fire or the Fire-God.", "name of the sixteenth year in the Hindu cycle of sixty years."]}], "ಚಿತ್ರಭಿತ್ತಿ": [{"type": "noun", "defs": ["a wall decorated with pictures."]}], "ಚಿತ್ರಮಂಜರಿ": [{"type": "noun", "defs": ["a collection of pictures, photographs etc.", "a film made from bits of another film or various other films; an anthology of films."]}], "ಚಿತ್ರಮಂದಿರ": [{"type": "noun", "defs": ["a building or outdoor structure designed for presentation of films; a cinema hall; a theatre."]}], "ಚಿತ್ರಮಾಲೆ": [{"type": "noun", "defs": ["a series of pictures, bits of films, etc. arranged in a particular order."]}], "ಚಿತ್ರಮೂಲ": [{"type": "noun", "defs": ["the under-shrub Plumbago zeylanica of Plumbaginaceae family; Ceylon lead wort."]}], "ಚಿತ್ರಮೂಲಿಕೆ": [{"type": "noun", "defs": ["= ಚಿತ್ರಮೂಲ."]}], "ಚಿತ್ರಮೃಗ": [{"type": "noun", "defs": ["the spotted Indian deer."]}], "ಚಿತ್ರರಥ": [{"type": "noun", "defs": ["the Sun-God, whose vehicle is made of bright rays of light.", "the Fire-God."]}], "ಚಿತ್ರರೂಪಿ": [{"type": "noun", "defs": ["a person who can change his or her form at will (as a demon)."]}], "ಚಿತ್ರರೂಪು": [{"type": "noun", "defs": ["an unusual form that causes amazement."]}], "ಚಿತ್ರಲತಿಕೆ": [{"type": "noun", "defs": ["(pros.) a metre with twenty-five syllables in each line."]}], "ಚಿತ್ರಲತೆ": [{"type": "noun", "defs": ["(pros.) a variety in the metres of tripadi (each stanza having three lines each)."]}], "ಚಿತ್ರಲಿಪಿ": [{"type": "noun", "defs": ["a picture or picture-like symbol representing an idea, as in primitive writing; pictograph.", "writing by the use of pictographs; picture writing; pictography."]}], "ಚಿತ್ರಲೀನ": [{"type": "noun", "defs": ["the creeper Aganosma cymosa (= Echites dichotoma) of Apocynceae family."]}], "ಚಿತ್ರವಧೆ": [{"type": "noun", "defs": ["a killing by inflicting severe pain.", "(fig.) the inflicting of severe pain; torture.", "(fig.) very great mental pain inflicted on or being undergone; agony; anguish."]}], "ಚಿತ್ರವರ್ತ": [{"type": "noun", "defs": ["= ಚಿತ್ರಪ್ರವರ್ತನ."]}], "ಚಿತ್ರವಸ್ತ್ರ": [{"type": "noun", "defs": ["a specially prepared piece of canvas on which an oil painting is made; canvas.", "a cloth of various colours or shades."]}], "ಚಿತ್ರವಿಚಿತ್ರ": [{"type": "adjective", "defs": ["having or marked with different patches or spots colours, shades.", "deviating from the norm, as in conduct; out of the ordinary; odd."]}], "ಚಿತ್ರವಿಧ": [{"type": "noun", "defs": ["a way, manner, mode etc. that is exquisite, astonishing, amazing or astounding."]}], "ಚಿತ್ರವಿಹಂಗ": [{"type": "noun", "defs": ["any of various broad-bodied, four-winged, hairy hymenopteran insects of Apoidea family, that gather pollen and nectar, have biting as well as sucking mouthparts, and often live in organized colonies; esp., the honeybee."]}], "ಚಿತ್ರವಿಹಗ": [{"type": "noun", "defs": ["= ಚಿತ್ರವಿಹಂಗ."]}], "ಚಿತ್ರವೀಣೆ": [{"type": "noun", "defs": ["the fret-less Vīṇe, a long, stringed musical instrument, played by plucking the strings and played by pressing the strings with a pad."]}], "ಚಿತ್ರವೃತ್ತಿ": [{"type": "noun", "defs": ["a manner, way etc. that is astonishing, marvelling."]}], "ಚಿತ್ರವೇಂಟೆ": [{"type": "noun", "defs": ["a particular manner or way of animal-hunting, as a sport."]}], "ಚಿತ್ರಶಾಲೆ": [{"type": "noun", "defs": ["a variegated sīre (sari, the traditional long unsewn cloth used by women)."]}, {"type": "noun", "defs": ["a room or building where pictures, photographs, paints etc. are exhibited."]}], "ಚಿತ್ರಶಿಖಂಡಿ": [{"type": "adjective", "defs": ["having a bright crest or colourful feathered tuft."]}, {"type": "noun", "defs": ["(pl.) the seven mythological sages of Hindu tradition.", "(particularly) Angīrasa, one of them.", "a most conspicuous north constellation between Lynx and Draco which contains more than 50 visible stars, seven of which form the Big Dipper; Ursa Major."]}], "ಚಿತ್ರಶಿಲ್ಪಿ": [{"type": "noun", "defs": ["a person who draws or paints pictures."]}], "ಚಿತ್ರಸಂಪುಟ": [{"type": "noun", "defs": ["a casket, box or chest decorated with pictures or carvings.", "(fig.) a book or holder that contains a number of or a series of pictures; an album."]}], "ಚಿತ್ರಸೂತ್ರ": [{"type": "noun", "defs": ["a kind of silk cloth."]}], "ಚಿತ್ರಸೃಷ್ಟಿ": [{"type": "noun", "defs": ["a literary work of varied styles."]}], "ಚಿತ್ರಹಿಂಸೆ": [{"type": "noun", "defs": ["extreme pain, intense suffering, unbearable distress inflicted; torture.", "(myth.) name of one of the hells."]}], "ಚಿತ್ರಾಂಗ": [{"type": "noun", "defs": ["having bands or stripes; striped."]}, {"type": "noun", "defs": ["the black-striped, large, carnivorous, tawny-coloured feline, Panthera tigris; the tiger.", "a cloth with long, narrow stripes."]}], "ಚಿತ್ರಾಂಗಿ": [{"type": "noun", "defs": ["an overcoat made of striped or variegated cloth."]}, {"type": "noun", "defs": ["a woman whose body is beautiful."]}], "ಚಿತ್ರಾಂತ": [{"type": "noun", "defs": ["(mus.) a fault in pronouncing the musical notes or the lyrics."]}], "ಚಿತ್ರಾಂಬರ": [{"type": "noun", "defs": ["a piece of cloth having different colours in spots, stripes; a part-coloured cloth.", "the clear sky in the night with stars."]}], "ಚಿತ್ರಾಕ್ಷರಿ": [{"type": "noun", "defs": ["a set of words with same number of letters in each, written one below the other, the vertical reading of the letters of which gives the same words as written across; an acrostic."]}], "ಚಿತ್ರಾನ್ನ": [{"type": "noun", "defs": ["a non-gravy food made by cooking the rice with various condiments, spices, and subsequently seasoned.", "a few grains of boiled rice symbolically offered, as part of one's daily sacrifice, to a few deities before taking one's mid-day meal."]}], "ಚಿತ್ರಾಭಾಸ": [{"type": "noun", "defs": ["the illusion, false idea created by a picture, painting, etc."]}], "ಚಿತ್ರಾಯತನ": [{"type": "noun", "defs": ["an archaic kind of poetical composition that was specific to Kannaḍa literature."]}], "ಚಿತ್ರಾರ್ಧ": [{"type": "noun", "defs": ["(archit.) a half relief or an image half of whose body is shown."]}], "ಚಿತ್ರಾರ್ಪಿತ": [{"type": "adjective", "defs": ["committed to a picture; picturised; painted.", "without moving; motionless; still; stationary."]}], "ಚಿತ್ರಾಲಂಕಾರ": [{"type": "noun", "defs": ["(rhet.) a figure of speech in which an interrogative asking has in itself the answer for it in a suggestive or implied manner."]}], "ಚಿತ್ರಾವತಿ": [{"type": "noun", "defs": ["= ಚಿತ್ರಾಹುತಿ."]}], "ಚಿತ್ರಾವಲಂಬನ": [{"type": "noun", "defs": ["the state of possessing or having various colours."]}], "ಚಿತ್ರಾವಹ": [{"type": "noun", "defs": ["that which causes to feel wonder or appreciation by being beautiful, colourful, unexpectedly pleasing, etc."]}], "ಚಿತ್ರಾವಳಿ": [{"type": "noun", "defs": ["= ಚಿತ್ರಾಂಬರ."]}], "ಚಿತ್ರಾವೞಿ": [{"type": "noun", "defs": ["= ಚಿತ್ರಾಂಬರ."]}], "ಚಿತ್ರಾಸನ": [{"type": "noun", "defs": ["a heavy, smooth-surfaced fabric, commonly of wool or nylon, for sitting on; a carpet."]}], "ಚಿತ್ರಾಹುತಿ": [{"type": "noun", "defs": ["a few grains of boiled rice symbolically offered, as part of one's daily sacrifice, to a few deities before taking one's mid-day meal."]}], "ಚಿತ್ರಾಳ": [{"type": "noun", "defs": ["a kind of plant ."]}], "ಚಿತ್ರಿ": [{"type": "noun", "defs": ["one who draws or paints pictures."]}], "ಚಿತ್ರಿಕ": [{"type": "noun", "defs": ["= ಚಿತ್ರಿ."]}], "ಚಿತ್ರಿಕೆ": [{"type": "noun", "defs": ["(fem.) one who draws or paints pictures.", "an archaic stringed, musical instrument."]}], "ಚಿತ್ರಿಗ": [{"type": "noun", "defs": ["= ಚಿತ್ರಿ."]}], "ಚಿತ್ರಿಣಿ": [{"type": "noun", "defs": ["an intelligent woman.", "a woman of one of the four types of women according to erotic science."]}], "ಚಿತ್ರಿತ": [{"type": "adjective", "defs": ["drawn or painted (as a picture); presented in a drawing, painting etc; portrayed; pictured; sketched out.", "marked with different colours in spots, stripes, etc.", "(fig.) depicted in words; described."]}], "ಚಿತ್ರಿಸು": [{"type": "verb", "defs": ["to write, draw or paint a picture; to make a picture.", "to be written, painted so.", "to film - a) to take a photograph of; b) to make a (motion) film of a novel, play, event, etc.; to shoot.", "to picture in words; to describe vividly or colourfully; to depict."]}], "ಚಿತ್ರೆ": [{"type": "noun", "defs": ["the brightest star in the constellation Virgo, with a magnitude of 1.03; the Spica.", "the onset of rain during the appearance of this star.", "the plant Anthericum tuberosum of Liliaceae family.", "the plant Cucumis madraspatanus of Cucurbitaceae family."]}], "ಚಿತ್ರೋಕ್ತಿ": [{"type": "noun", "defs": ["an expression, using words in a nonliteral sense or unusual manner to add vividness, beauty, sarcasm, etc. to what is said or written."]}], "ಚಿತ್ರೋತ್ತರ": [{"type": "noun", "defs": ["= ಚಿತ್ರಾಲಂಕಾರ.", "2.(fig.) a manner of wording a sentence in such a way that is meant to be or can be interpreted as, the answer, response or explanation for several questions, doubts or inquires."]}], "ಚಿತ್ಸುಖ": [{"type": "noun", "defs": ["spiritual joy ( achieved when pure self-consciousness is realised); the absolute bliss."]}], "ಚಿದಂಬರ": [{"type": "noun", "defs": ["the Supreme, as a formless and being in the pure Conscious state.", "the spiritual space or interval where the Supreme is realised by yōgis.", "ಚಿದಂಬರ ರಹಸ್ಯ cidambara rahasya (fig.) something beyond the normal human knowledge or understanding; anything unexplained or seemingly inexplicable matter; a mystery."]}], "ಚಿದಂಶ": [{"type": "noun", "defs": ["(phil.) the pure consciousness as the essential nature of the individual soul."]}], "ಚಿದಕವರೆ": [{"type": "noun", "defs": ["the pulse of Dolichos lablab soaked in water and skinned by squeezing."]}], "ಚಿದಕು": [{"type": "verb", "defs": ["to remove the skin of a soaked pulse by squeezing with a finger and the thumb."]}, {"type": "noun", "defs": ["that which is (soaked and) skinned by squeezing with a finger and the thumb."]}], "ಚಿದರ": [{"type": "noun", "defs": ["= ಚಿದ್ರ."]}], "ಚಿದಾತ್ಮ": [{"type": "noun", "defs": ["(phil.) the Supreme Soul as the pure Consciousness."]}], "ಚಿದಾನಂದ": [{"type": "noun", "defs": ["the philosophic combination of the pure Consciousness and the supreme Bliss, as the nature of the Absolute."]}], "ಚಿದಾನಂದರೂಪ": [{"type": "noun", "defs": ["the Absolute, characterised by the pure Consciousness and supreme Bliss."]}], "ಚಿದಾಭಾಸ": [{"type": "noun", "defs": ["th individual soul as the reflection or the like of the supreme Consciousness."]}], "ಚಿದುಕು": [{"type": "verb", "defs": ["= ಚಿದಕು1."]}, {"type": "noun", "defs": ["= ಚಿದಕು2."]}], "ಚಿದ್ಘನ": [{"type": "noun", "defs": ["personification of the absolute Consciousness."]}], "ಚಿದ್ದರೂಪ": [{"type": "noun", "defs": ["personification of the absolute Consciousness."]}], "ಚಿದ್ರ": [{"type": "noun", "defs": ["an opening caused by or as if by splitting; a hole, slit; fissure or rent.", "an open break, disagreement, breach in the friendly relationship between two persons or amongst the members of a party, society, etc.", "an act of causing or promoting dissent (esp. among the members in the enemy camp).", "a broken-away piece of a whole."]}], "ಚಿದ್ರೂಪ": [{"type": "noun", "defs": ["a man showing friendly feelings.", "the pure Consciousness.", "the Supreme."]}], "ಚಿನ": [{"type": "adjective", "defs": ["= ಚಿನ್ನ2."]}, {"type": "noun", "defs": ["= ಚಿನ್ನ3."]}], "ಚಿನಕಡಿ": [{"type": "verb", "defs": ["to break (a whole) and take out a small piece; to cut into small pieces; to mince."]}, {"type": "noun", "defs": ["a small piece or part broken away from a whole; broken piece; a fragment."]}], "ಚಿನಕಡಿಗಳೆ": [{"type": "verb", "defs": ["= ಚಿನಕಡಿ1."]}], "ಚಿನಕಡಿಗೈ": [{"type": "verb", "defs": ["= ಚಿನಕಡಿ1."]}], "ಚಿನಕಡೆವಡೆ": [{"type": "verb", "defs": ["to be cut into small pieces; to be minced."]}], "ಚಿನಕಾಳೆ": [{"type": "noun", "defs": ["= ಚಿನ್ನಗಾಳೆ."]}], "ಚಿನಕುರಳಿ": [{"type": "noun", "defs": ["parched, seasoned pulses.", "a kind of cracker that makes short but sharp sound.", "(fig.) a boy or girl that speaks fluently, cracking jokes or making cutting or caustic remarks."]}], "ಚಿನಗಡಿ": [{"type": "noun", "defs": ["= ಚಿನಕಡಿ1."]}], "ಚಿನಗಾಳೆ": [{"type": "noun", "defs": ["= ಚಿನ್ನಗಾಳೆ."]}], "ಚಿನಡಿ": [{"type": "noun", "defs": ["a cloth that is conspicuous with spots woven with bright, shining threads on it."]}], "ಚಿನಡಿಸೀರೆ": [{"type": "noun", "defs": ["a sīre that is conspicuous with spots woven with bright, shining threads on it."]}], "ಚಿನಪುಳಿ": [{"type": "noun", "defs": ["(dial.) a nut of coconut palm, in the very early stage."]}], "ಚಿನಯಿ": [{"type": "noun", "defs": ["= ಚಿನಾಯಿ."]}], "ಚಿನವರದ": [{"type": "noun", "defs": ["= ಚಿನಿವಾರ."]}], "ಚಿನವಾರ": [{"type": "noun", "defs": ["= ಚಿನಿವಾರ."]}], "ಚಿನಾಯಿ": [{"type": "noun", "defs": ["anything that belongs to, coming from originated in, China or made of china-clay.", "a kind of silk cloth."]}], "ಚಿನಾರ್": [{"type": "noun", "defs": ["the large-sized, deciduous tree Platanus lrientalis of Platnaceae family, the wood of which is used for making boxes, handicraft items, etc."]}], "ಚಿನಾಲಿ": [{"type": "noun", "defs": ["an unchaste, promiscuous woman."]}], "ಚಿನಿ": [{"type": "adjective", "defs": ["= ಚಿನ್ನ2."]}, {"type": "noun", "defs": ["= ಚಿನ್ನ3."]}, {"type": "noun", "defs": ["= ಚಿನಾಯಿ."]}], "ಚಿನಿಕಂಡ": [{"type": "noun", "defs": ["= ಚಿನಿಖಂಡ."]}], "ಚಿನಿಕಹಳೆ": [{"type": "noun", "defs": ["= ಚಿನ್ನಗಾಳೆ."]}], "ಚಿನಿಖಂಡ": [{"type": "noun", "defs": ["a chopped, hashed piece of meat."]}], "ಚಿನಿಖಂಡಗೈ": [{"type": "verb", "defs": ["to chop (meat) into small pieces; to mince; to hash."]}], "ಚಿನಿಗಡಿ": [{"type": "verb", "defs": ["= ಚಿನಕಡಿ1."]}], "ಚಿನಿಚಿದ್ರ": [{"type": "noun", "defs": ["a very small piece chopped off from a whole."]}], "ಚಿನಿಪಾಲು": [{"type": "noun", "defs": ["well boiled milk."]}], "ಚಿನಿವರ": [{"type": "noun", "defs": ["= ಚಿನಿವಾರ."]}], "ಚಿನಿವರದ": [{"type": "noun", "defs": ["= ಚಿನಿವಾರ."]}], "ಚಿನಿವಲ": [{"type": "noun", "defs": ["= ಚಿನಿವಾರ."]}], "ಚಿನಿವಾನ": [{"type": "noun", "defs": ["an additional tax; cess."]}], "ಚಿನಿವಾರ": [{"type": "noun", "defs": ["a man who makes or sells articles of gold; a goldsmith.", "a member of the caste the business of the members of which are mainly engaged in making or selling gold articles."]}], "ಚಿನಿವಾರಪೇಟೆ": [{"type": "noun", "defs": ["a street or locality in which the goldsmiths are living or carrying on their business."]}], "ಚಿನಿವಾರ್ದಿಕೆ": [{"type": "noun", "defs": ["the work or profession of making or selling gold articles."]}], "ಚಿನಿವಾಲ್": [{"type": "noun", "defs": ["= ಚಿನಿಪಾಲು."]}], "ಚಿನಿವಾಲ": [{"type": "noun", "defs": ["= ಚಿನಿವಾರ."]}], "ಚಿನಿವಾಲಕಟ್ಟೆ": [{"type": "noun", "defs": ["a street on which number of goldsmithś shops are located."]}], "ಚಿನಿವಾಲಗಟ್ಟೆ": [{"type": "noun", "defs": ["= ಚಿನಿವಾಲಕಟ್ಟೆ."]}], "ಚಿನುಕು": [{"type": "noun", "defs": ["a very small drop of liquid; a droplet."]}], "ಚಿನುಕುರಳಿ": [{"type": "noun", "defs": ["= ಚಿನಕುರಳಿ."]}], "ಚಿನುಕುಲಿ": [{"type": "noun", "defs": ["a kind of bird ."]}], "ಚಿನುಚಂಪೆ": [{"type": "noun", "defs": ["a kind of archaic musical instrument."]}], "ಚಿನುಮಯ": [{"type": "adjective", "defs": ["of the nature of pure consciousness or spiritual intelligence."]}, {"type": "noun", "defs": ["the Supreme, who is characterised by pure Consciousness."]}], "ಚಿನ್ಗಾಳೆ": [{"type": "noun", "defs": ["= ಚಿನ್ನಗಾಳೆ."]}], "ಚಿನ್ನ": [{"type": "noun", "defs": ["a precious yellow metallic element, highly malleable and ductile, and not subject to oxidation or corrosion (Symbol: Au); gold.", "a monetary coin made of gold; a gold coin.", "a term of endearment used to call children, one's sweetheart, etc.; (as) 'love', 'my love' or 'darling'.", "(fig.) a person of unblemished merit.", "ಚಿನ್ನದ ಎಳೆ cinnada eḷe a thin wire of wire, used in making ornaments or in textiles; ಚಿನ್ನದ ಗಣಿ cinnada gaṇi (fig.) a place, position, authority which provides ample opportunity to get information, income, etc.; 2. (fig.) a generous, magnanimous person; ಚಿನ್ನದ ಹಬ್ಬ cinnada habba golden jubilee - the fiftieth anniversary; b) a celebration of this; ಚಿನ್ನದ ತೊಟ್ಟಿಲಲ್ಲಿ ಹುಟ್ಟಿರು cinnada toṭṭilalli huṭṭiru (fig) to be affluent since one's birth; ಚಿನ್ನದ ಸೂಜಿ ಎಂದು ಕಣ್ಣು ಚುಚ್ಚಿಕೊ cinnada sūji endu kaṇṇu cucciko (prov.) pain inflicted by a person however dear to oneself, is still a pain; fetters even of gold are heavy; ಚಿನ್ನ ಹಿಡಿದರೂ ಮಣ್ಣಾಗು cinna hiḍidarū maṇṇāgu to be very unlucky."]}, {"type": "adjective", "defs": ["of limited size; of comparatively restricted dimensions; not big; little; small."]}, {"type": "noun", "defs": ["that which is small in size; a little thing.", "a male child; a boy."]}, {"type": "noun", "defs": ["that which cut, severed (off from a whole)."]}, {"type": "noun", "defs": ["= ಚಿನ್ನೆ."]}], "ಚಿನ್ನ ಅಗಿಲು": [{"type": "noun", "defs": ["a variety of, smaller in size than, the Indian bdellium tree."]}], "ಚಿನ್ನಂಗಾಳೆ": [{"type": "noun", "defs": ["= ಚಿನ್ನಗಾಳೆ."]}], "ಚಿನ್ನಕಾರ": [{"type": "noun", "defs": ["a kind of deer."]}], "ಚಿನ್ನಗಾಳೆ": [{"type": "noun", "defs": ["a kind of double-tube air horn used to make a long sound by blowing; a double-bugle."]}], "ಚಿನ್ನಗಿರಿ": [{"type": "noun", "defs": ["(a wrong or heterogeneous compound) the mythological mountain, supposed to be made of gold."]}], "ಚಿನ್ನಗಿರಿಚಾಪ": [{"type": "noun", "defs": ["Śiva, who, as mythology says, made the cinna giri, as his bow."]}], "ಚಿನ್ನಗೆಯಿಕ": [{"type": "noun", "defs": ["= ಚಿನ್ನಗೆಯ್ಕ."]}], "ಚಿನ್ನಗೆಯ್ಕ": [{"type": "noun", "defs": ["= ಚಿನಿವಾರ.", "the profession of a goldsmith."]}], "ಚಿನ್ನಗೆಲಸ": [{"type": "noun", "defs": ["= ಚಿನ್ನಗೆಯ್ಕ - 3."]}], "ಚಿನ್ನಗೇದಗೆ": [{"type": "noun", "defs": ["an ornament made of gold, in the shape of the screw-pine flower, worn by women on their head."]}], "ಚಿನ್ನದಾರೆ": [{"type": "noun", "defs": ["the tree Sesbania grandiflora (= Robinia grandiflora) of Papilionaceae family."]}], "ಚಿನ್ನದಾವರೆ": [{"type": "noun", "defs": ["the plant Hypericum mysorensis of Hypericeae family.", "the lotus plant Nymphea alba of Nymphaeaceae family.", "its golden coloured flower."]}], "ಚಿನ್ನಧಾರೆ": [{"type": "noun", "defs": ["= ಚಿನ್ನದಾರೆ."]}], "ಚಿನ್ನನೇರಿಳೆ": [{"type": "noun", "defs": ["the tree Syzygium malabaricum (= Eugenia malabarica) of Myrtaceae family.", "its dark blue fruit."]}], "ಚಿನ್ನನೇಱಿಲ್": [{"type": "noun", "defs": ["= ಚಿನ್ನನೇರಿಳೆ."]}], "ಚಿನ್ನಪೂ": [{"type": "noun", "defs": ["an ornament made of gold, in the shape of a flower, worn by women on their head."]}], "ಚಿನ್ನರೂಪ": [{"type": "noun", "defs": ["a boy or young man (usu. as referred to by an elder)."]}], "ಚಿನ್ನಲಾಮಜ್ಜ": [{"type": "noun", "defs": ["the tree Mesua ferrea of Guttiferae family.", "its flower."]}], "ಚಿನ್ನವರದ": [{"type": "noun", "defs": ["= ಚಿನಿವಾರ."]}], "ಚಿನ್ನವಲಗೆ": [{"type": "noun", "defs": ["a solid lump or piece of gold."]}], "ಚಿನ್ನವಾರ": [{"type": "noun", "defs": ["= ಚಿನಿವಾರ."]}], "ಚಿನ್ನವಾಲ": [{"type": "noun", "defs": ["= ಚಿನಿವಾರ."]}], "ಚಿನ್ನಾಟ": [{"type": "noun", "defs": ["a play, game, merrymaking, mischief, etc. for recreation.", "lack of seriousness or dignity of behaviour; wantonness."]}], "ಚಿನ್ನಾಟಿಕೆ": [{"type": "noun", "defs": ["the manner, habit of being childish; childishness; silly-playfulness."]}], "ಚಿನ್ನಾರಿ": [{"type": "noun", "defs": ["a cloth or other material laced with golden threads.", "a term of endearment used in calling a child."]}], "ಚಿನ್ನಾಲಿ": [{"type": "noun", "defs": ["an unchaste, promiscuous woman."]}], "ಚಿನ್ನಿ": [{"type": "noun", "defs": ["a small wooden piece (of four to five inches in length), tapered at both ends, played by hitting one end of it with a small stick and sending it flying in the air by children.", "a movable bone at the front of the human knee; the patella; the knee-cap.", "that which is small or little.", "a term of endearment calling a child."]}, {"type": "noun", "defs": ["the tree or shrubby plant Acalypha fruticosa of Euphorbiaceae family.", "another tree (or shrubby plant) Acalypha betulina of the same family."]}, {"type": "noun", "defs": ["a food made of the several kinds of coarsely pulverised grams, soaked in water, for horses."]}], "ಚಿನ್ನಿಗ": [{"type": "noun", "defs": ["= ಚಿನಿವಾರ."]}], "ಚಿನ್ನಿಕೋಲು": [{"type": "noun", "defs": ["= ಚಿನ್ನಿ - 1.", "the game played with this."]}], "ಚಿನ್ನಿದಾಂಡು": [{"type": "noun", "defs": ["a round stick, of approx. one and half feet in length used to play the game cinnikōlu.", "the game itself."]}], "ಚಿನ್ನಿಧಿ": [{"type": "noun", "defs": ["the Supreme, the great source of pure spiritual intelligence."]}], "ಚಿನ್ನಿವಾರ": [{"type": "noun", "defs": ["= ಚಿನಿವಾರ."]}], "ಚಿನ್ನಸಕ್ಕರೆ": [{"type": "noun", "defs": ["powdered sugar."]}], "ಚಿನ್ನೆ": [{"type": "noun", "defs": ["a symbol - a) something that stands for, represents or suggests another thing; esp., an object used to represent something abstract; an emblem; b) a written or printed mark, letter, abbreviation, etc. standing for an object, quality, process, quantity, etc., as in music, mathematics or chemistry."]}], "ಚಿನ್ನೆದೋರು": [{"type": "verb", "defs": ["to show, exhibit a symbol.", "to appear (before someone)."]}], "ಚಿನ್ನೆದೋಱು": [{"type": "verb", "defs": ["= ಚಿನ್ನೆದೋರು."]}], "ಚಿನ್ಮಯ": [{"type": "adjective", "defs": ["of the nature of pure consciousness or spiritual intelligence."]}, {"type": "noun", "defs": ["the Supreme, who is characterised by pure Consciousness."]}], "ಚಿನ್ಮಾತ್ರಗೋಚರ": [{"type": "adjective", "defs": ["comprehensible only by spiritual intelligence or meditation (not by the actions of bodily faculties as seeing, touching, hearing, smelling or tasting)."]}], "ಚಿಪಟ": [{"type": "adjective", "defs": ["having no elevation; flat.", "flat-nosed."]}, {"type": "noun", "defs": ["flattened rice made by soaking the paddy in water and pounding."]}], "ಚಿಪಲಿ": [{"type": "noun", "defs": ["= ಚಿಪಳಿ."]}], "ಚಿಪಳಿ": [{"type": "noun", "defs": ["a pair of small, hollowed pieces of wood held in the hand by a connecting cord clicked together with the fingers to beat time to music; wooden castanets."]}], "ಚಿಪಿಟ": [{"type": "noun", "defs": ["= ಚಿಪಟ2.", "a nose that is flat."]}], "ಚಿಪಿಟಕ": [{"type": "noun", "defs": ["= ಚಿಪಟ2."]}], "ಚಿಪಿಟಾಸ್ಯ": [{"type": "noun", "defs": ["a flat-nosed man."]}], "ಚಿಪಿಲೆ": [{"type": "noun", "defs": ["a kind of bird characterised by long tail that wags up and down."]}], "ಚಿಪುಲಿ": [{"type": "noun", "defs": ["the small tree or bushy plant Phyllanthus polyphyllus of Euphorbiaceae family."]}], "ಚಿಪುಲಿಮುಳ್ಳು": [{"type": "noun", "defs": ["= ಚಿಪುಲಿ."]}], "ಚಿಪ್ಪ": [{"type": "noun", "defs": ["the science concerned with putting scientific knowledge to practical uses in planning, designing, construction or management of machinery, roads, bridges, buildings, etc.; engineering.", "the art of carving wood, chiselling stone, casting or welding metal, moulding clay or wax, etc. into three-dimensional representations, as statues, figures, forms, etc.; sculpture.", "the work of a person who stitches clothes or footwears."]}], "ಚಿಪ್ಪಡ": [{"type": "noun", "defs": ["a slit, narrow crack in a rock."]}], "ಚಿಪ್ಪಡು": [{"type": "noun", "defs": ["(dial.) the hair that has turned grey just above the ears of a woman.", "feathers of a bird."]}], "ಚಿಪ್ಪಡೆ": [{"type": "noun", "defs": ["= ಚಿಪ್ಪಡು."]}], "ಚಿಪ್ಪಲಿಗ": [{"type": "noun", "defs": ["= ಚಿಪ್ಪಿಗ - 1."]}], "ಚಿಪ್ಪಲು": [{"type": "noun", "defs": ["a kind of fish ."]}, {"type": "noun", "defs": ["= ಚಿಪುಲಿ."]}], "ಚಿಪ್ಪಳ": [{"type": "noun", "defs": ["a long split of bamboo used to reinforce a fence on either side."]}], "ಚಿಪ್ಪಳು": [{"type": "noun", "defs": ["the act or an instance of putting another in deep trouble; harassment."]}], "ಚಿಪ್ಪಳೇಱಿಸು": [{"type": "verb", "defs": ["to trouble, torment; to torture; to harass."]}], "ಚಿಪ್ಪಾಟಿ": [{"type": "noun", "defs": ["the part of sugar cane left after the juice has been extracted or the residue of certain other processed plants, left outs of cattle fodder.", "a piece, small portion of something."]}], "ಚಿಪ್ಪಾಡಿ": [{"type": "noun", "defs": ["= ಚಿಪ್ಪಾಟಿ."]}], "ಚಿಪ್ಪಾಡೆ": [{"type": "noun", "defs": ["= ಚಿಪ್ಪಾಟಿ."]}], "ಚಿಪ್ಪಿ": [{"type": "noun", "defs": ["= ಚಿಪ್ಪಿಗ."]}], "ಚಿಪ್ಪಿಗ": [{"type": "noun", "defs": ["a man who stitches (clothes); a tailor.", "a man who models, carves or otherwise fashions figures or forms of clay, stone, metal, wood, etc.; a sculptor."]}], "ಚಿಪ್ಪಿಗಿತಿ": [{"type": "noun", "defs": ["a woman who stitches clothes."]}], "ಚಿಪ್ಪು": [{"type": "noun", "defs": ["a hard, bivalve outer covering, as of mollusc, insect, egg, etc.; a shell.", "the hard shell of a coconut covering the kernel; coconut-shell.", "the top bony top portion of the skull.", "a small chest or box with a lid, as for jewels; a casket.", "a thin piece of wood, bone, etc., made by splitting or breaking; a sliver; a splinter.", "a thin and sharp piece of wood; a splint.", "a kind of musical instrument.", "the outer covering of anything.", "a single cluster of banana fruits.", "a shell or vessel having a hollow with a pointed mouth, used to feed milk to babies."]}, {"type": "noun", "defs": ["a piece of wood or stone that is tapering from a thick back to a thin edge, used as a wedge."]}, {"type": "noun", "defs": ["the grass Cymbopogan schoenanthus (= Andropogon schoenanthus) of Poaceae family."]}], "ಚಿಪ್ಪುಕುಂಟೆ": [{"type": "noun", "defs": ["a cylindrical wooden piece with a long beam, and (usu.) four teeth-like wooden pieces that are tapered at the other end, used as a weeding implement in farms."]}], "ಚಿಪ್ಪುಗಟ್ಟು": [{"type": "verb", "defs": ["(said of nuts of coco-palm) (the shell) to grow, develop fully and become hard."]}], "ಚಿಪ್ಪುಹಂದಿ": [{"type": "noun", "defs": ["the toothless, scaly mammal, Manis crassicaudata, that eats ants; the Indian pangolin."]}], "ಚಿಬಕಳಿ": [{"type": "noun", "defs": ["the bird Totanus indica; the Indian sand-piper.", "another bird Totanus icucurns; white-tailed sand-piper."]}], "ಚಿಬಟಿಗ": [{"type": "noun", "defs": ["the grass Leptochloa calycina of Poaceae family."]}], "ಚಿಬುಕ": [{"type": "noun", "defs": ["the lower extremity of the face, below the mouth; the projecting part of the lower jaw; the chin."]}], "ಚಿಬುಕು": [{"type": "verb", "defs": ["to make crunching sound while eating something.", "to make such a sound in appreciation of the taste of a thing being eaten.", "to make an indistinct, short sound touching the tip of the tongue to the root of upper, front teeth, as appreciation, expressing pity, etc."]}], "ಚಿಬುಕುಗುಟ್ಟು": [{"type": "verb", "defs": ["= ಚಿಬುಕು - 3."]}], "ಚಿಬುಕೆ": [{"type": "noun", "defs": ["the lower lip of a horse."]}], "ಚಿಬ್ಬ": [{"type": "noun", "defs": ["= ಚಿಬ್ಬು."]}], "ಚಿಬ್ಬಂಬೊಯ್": [{"type": "verb", "defs": ["= ಚಿಬ್ಬುದೋರು."]}], "ಚಿಬ್ಬಲ್": [{"type": "noun", "defs": ["= ಚಿಬ್ಬಲು."]}], "ಚಿಬ್ಬಲು": [{"type": "noun", "defs": ["a plate-like lid made of interwoven stripes of bamboo."]}], "ಚಿಬ್ಬಿಲ್": [{"type": "noun", "defs": ["= ಚಿಬ್ಬಲು."]}], "ಚಿಬ್ಬಿಲು": [{"type": "noun", "defs": ["= ಚಿಬ್ಬಲು."]}], "ಚಿಬ್ಬು": [{"type": "noun", "defs": ["a skin disease characterised by whitish, reddish or blackish spots.", "an ornamental white dot or dots marked on the skin.", "little, dry scales shed by the skin; scurf."]}], "ಚಿಬ್ಬುದೋರು": [{"type": "verb", "defs": ["(whitish, reddish or blackish spots) to occur on the skin (affected by certain diseases)."]}], "ಚಿಬ್ಬುದೋಱು": [{"type": "verb", "defs": ["= ಚಿಬ್ಬುದೋರು."]}], "ಚಿಬ್ಬುವೊಯ್": [{"type": "verb", "defs": ["= ಚಿಬ್ಬುದೋರು."]}], "ಚಿಮಂಗಿ": [{"type": "noun", "defs": ["the hardy shrub or tree Lagerstroemia parviflora of Lythraceae family with fragrant, white colour flowers; white Indian lilac."]}], "ಚಿಮಕಲು": [{"type": "noun", "defs": ["the act or an instance of sprinkling of water, other liquids, powder etc."]}], "ಚಿಮಕಲುಮಚ್ಚೆ": [{"type": "noun", "defs": ["small dots or scars (of any colour) on the skin."]}], "ಚಿಮಕು": [{"type": "verb", "defs": ["= ಚಿಮುಕು."]}], "ಚಿಮಟ": [{"type": "noun", "defs": ["= ಚಿಮ್ಮಟ."]}], "ಚಿಮಟಿ": [{"type": "noun", "defs": ["= ಚಿಮ್ಮಟ."]}], "ಚಿಮಟಿಗೆ": [{"type": "noun", "defs": ["= ಚಿಮ್ಮಟ."]}], "ಚಿಮಟು": [{"type": "verb", "defs": ["to squeeze or compress tightly between the thumb, and a finger (to inflict pain); to nip; to pinch.", "to cut, take off by nipping with one's nail."]}], "ಚಿಮಟೆ": [{"type": "noun", "defs": ["= ಚಿಮ್ಮಟ."]}], "ಚಿಮಣಿ": [{"type": "noun", "defs": ["a chimney - a) a vertical channel conducting smoke or combustion gases etc. up and away from a fire, furnace, engine, etc.; b) the part of this which projects above a roof. 2.a hollow glassware open on both sides used to protect the flame of a burning oil-lamp.", "a bottle-type glassware used as an oil-lamp (usu. without a protective glassware for its flame)."]}], "ಚಿಮಣಿ ಎಣ್ಣೆ": [{"type": "noun", "defs": ["a thin oil distilled from petroleum or shale oil, used as a fuel, solvent, illuminant, etc.; kerosene."]}], "ಚಿಮರು": [{"type": "noun", "defs": ["a loop formed in a rope, cord, etc. by means of a slipknot so that the loop tightens as the rope is pulled; a noose."]}], "ಚಿಮಿಚಿಮಿ": [{"type": "noun", "defs": ["the splitting sound made by wet twigs while being burnt.", "a sound imitating it."]}], "ಚಿಮಿಚಿಮಿಸು": [{"type": "verb", "defs": ["to make a splitting sound (as by wet twigs while being burnt)."]}, {"type": "verb", "defs": ["to roll oneself on the floor."]}], "ಚಿಮುಕಿಸು": [{"type": "verb", "defs": ["to scatter (liquid, ashes, powder, etc.) in small drops or particles; to sprinkle."]}], "ಚಿಮುಕು": [{"type": "verb", "defs": ["= ಚಿಮುಕಿಸು."]}], "ಚಿಮುಟ": [{"type": "noun", "defs": ["= ಚಿಮ್ಮಟ."]}], "ಚಿಮುಟಾಂಗ": [{"type": "noun", "defs": ["tongs or pincers for grasping, compressing, and pulling, used esp. by surgeons and dentists; forceps."]}], "ಚಿಮುಟಿಗೆ": [{"type": "noun", "defs": ["= ಚಿಮ್ಮಟ."]}], "ಚಿಮುಟು": [{"type": "verb", "defs": ["to close one eyelid and open it again quickly, as a signal, etc.; to wink."]}], "ಚಿಮೂಕ": [{"type": "noun", "defs": ["a kind of bird ."]}], "ಚಿಮ್ಮಂಡೆ": [{"type": "noun", "defs": ["any of several jumping orthopterous insects of the family Gryllidae, that make continuous jarring sound during night, and are commonly found in places where plants are thickly grown."]}], "ಚಿಮ್ಮಟ": [{"type": "noun", "defs": ["a device having two long arms pivoted or hinged together used for seizing or lifting objects; a pair of tongs; forceps; pincers.", "a small quantity (of a powder) that can be held between the thumb and a finger."]}], "ಚಿಮ್ಮಟಿ": [{"type": "noun", "defs": ["= ಚಿಮ್ಮಟ."]}], "ಚಿಮ್ಮಟಿಗೆ": [{"type": "noun", "defs": ["= ಚಿಮ್ಮಟ."]}], "ಚಿಮ್ಮಲು": [{"type": "noun", "defs": ["a device consisting of a narrow tube of glass, rubber or metal, with a narrowed outlet and fitted at another end with a rubber bulb or piston by means of which a liquid can be drawn in and then ejected in a stream."]}], "ಚಿಮ್ಮಿ": [{"type": "noun", "defs": ["a kind of liquid food used to mix with rice."]}], "ಚಿಮ್ಮಿಸು": [{"type": "verb", "defs": ["to toss with a finger or the thumb.", "to throw something up in the air.", "to pass out, discharge (a liquid); to exude.", "to sprinkle or drop in drops.", "to brandish or wave (a weapon, as a sword).", "to move (as a fan)."]}], "ಚಿಮ್ಮು": [{"type": "verb", "defs": ["to toss or propel with a finger or the thumb.", "to push forward with a sudden force.", "to throw something up in the air.", "to jump in the air or leap forward pushing the ground simultaneously with both the feet.", "to give out or forth from within.", "to sprinkle or drop in drops.", "to brandish or wave (a weapon, as a sword).", "to move (as a fan)."]}, {"type": "noun", "defs": ["the act or an instance of jumping up or leaping forward."]}], "ಚಿಮ್ಮುಗಾಲ": [{"type": "noun", "defs": ["(fig.) a period during which one is or must be, enthusiastic."]}], "ಚಿಮ್ಮುಗೆ": [{"type": "noun", "defs": ["a stream of liquid or gas emitted or forced out, as from a spout.", "an instinct - a) a primal psychic force or drive, as fear, love or anger, etc.; b) an inborn tendency of a living being."]}], "ಚಿಮ್ಮುಗೊಳ್ಳು": [{"type": "verb", "defs": ["to move upward or forward suddenly from the ground, etc. by contracting the muscles; to jump or leap."]}], "ಚಿಮ್ಮುಗೋವಿ": [{"type": "noun", "defs": ["a device consisting of a narrow tube of glass, rubber or metal, with a narrowed outlet and fitted at another end with a rubber bulb or piston by means of which a liquid can be drawn in and then ejected in a stream."]}], "ಚಿಮ್ಮುಟ": [{"type": "noun", "defs": ["= ಚಿಮ್ಮಟ."]}], "ಚಿಮ್ಮುರಿ": [{"type": "noun", "defs": ["a long unsewn cloth wound round the head, as a headgear.", "a dhōti (an unsewn long cloth used by men to cover their body below the navel) the hem or end of which is tucked into the waist-band, passing between the legs, as by a soldier while going for a battle.", "the tying of a persons both hand on his back."]}], "ಚಿರ": [{"type": "noun", "defs": ["lasting, living for all the times to come; never coming to an end; lasting forever."]}, {"type": "noun", "defs": ["that which never comes to an end or is never dying."]}], "ಚಿರಋಣಿ": [{"type": "noun", "defs": ["a person who is grateful, indebted to another (for the help, favour received); a person of gratitude."]}], "ಚಿರಂ": [{"type": "adverb", "defs": ["for eternity; for all times; always; endlessly; forever."]}], "ಚಿರಂಜೀವ": [{"type": "noun", "defs": ["= ಚಿರಂಜೀವಿ- 1,2,3 & 4."]}], "ಚಿರಂಜೀವಿ": [{"type": "noun", "defs": ["a person who will never die.", "a long-lived person.", "a term used by an elderly person to address a younger one.", "one's son.", "the common black bird Corvus splendens; the crow."]}], "ಚಿರಂಟಿ": [{"type": "noun", "defs": ["a woman, either married or not, who stays in her father's house for long, even after her maturity.", "a young woman."]}], "ಚಿರಂಟಿಕೆ": [{"type": "noun", "defs": ["= ಚಿರಂಟಿ - 1."]}], "ಚಿರಂತನ": [{"type": "adjective", "defs": ["having lasted very long; very old; ancient.", "lasting forever; deathless; endless."]}, {"type": "noun", "defs": ["the quality or fact of lasting for long or forever.", "an aged, old man."]}], "ಚಿರಂತನಾಚಾರ್ಯ": [{"type": "noun", "defs": ["a scholar, teacher of ancient times."]}], "ಚಿರಂತಹಿಂಸೆ": [{"type": "noun", "defs": ["(myth.) name of one of the hells."]}], "ಚಿರಕಾಲ": [{"type": "noun", "defs": ["a period that is continuing without any further limit; an everlasting period."]}], "ಚಿರಕಾಲಿಕ": [{"type": "adjective", "defs": ["lasting forever; eternal.", "last for long."]}], "ಚಿರಚ": [{"type": "noun", "defs": ["= ಚಿರತೆ1."]}], "ಚಿರಚು": [{"type": "noun", "defs": ["= ಚಿರತೆ1."]}], "ಚಿರಜೀವಿ": [{"type": "noun", "defs": ["= ಚಿರಂಜೀವಿ- 1,2, & 5."]}]}