{"ಬೊಮ್ಮಚರಿಯ": [{"type": "noun", "defs": ["the state of being student (esp. studying religious subjects, before being married).", "the condition or fact of being unmarried or being under a vow to remain unmarried.", "complete abstention from sexual intercourse."]}], "ಬೊಮ್ಮಚರಿಯೆ": [{"type": "noun", "defs": ["= ಬೊಮ್ಮಚರಿಯ."]}], "ಬೊಮ್ಮಟೆ": [{"type": "noun", "defs": ["a very young child; a baby; an infant.", "that which is very tender."]}], "ಬೊಮ್ಮಡ": [{"type": "noun", "defs": ["= ಬೊಮ್ಮಡಿ."]}], "ಬೊಮ್ಮಡಿ": [{"type": "noun", "defs": ["a loud shout; an outcry.", "a heavy sound.", "a loud, deep cry or howl, as of an animal or a person; roar."]}], "ಬೊಮ್ಮತಿ": [{"type": "noun", "defs": ["= ಬೊಮ್ಮಹತಿ."]}], "ಬೊಮ್ಮದಂಡೆ": [{"type": "noun", "defs": ["the thistle plant Echinops echinatus of Asteraceae family.", "the plant Argemone mexicana of Papaveraceae family; Mexican poppy.", "the plant Tricholepis glaberrima of steraceae family."]}], "ಬೊಮ್ಮಪಾಸ": [{"type": "noun", "defs": ["a kind of mystic arrow, having Brahma, as the presiding deity."]}], "ಬೊಮ್ಮಬರೆಹ": [{"type": "noun", "defs": ["that which is supposed to have been predetermined in everyone's life by the universal principle or ultimate agency; fate."]}], "ಬೊಮ್ಮಬೋಧೆ": [{"type": "noun", "defs": ["the knowledge of the Supreme Being; self-knowledge."]}], "ಬೊಮ್ಮಯ": [{"type": "noun", "defs": ["name of a petty god."]}], "ಬೊಮ್ಮರಕ್ಕಸ": [{"type": "noun", "defs": ["the ghost of a brāhmaṇa, who lived a greedy and lewd life.", "(myth.) a descendant of a brāhmaṇa father and a demon mother."]}], "ಬೊಮ್ಮರಲು": [{"type": "noun", "defs": ["the small-sized tree of shrub Ziziphus rugosa of Rhamnaceae family; medium jujube."]}], "ಬೊಮ್ಮವಿದ": [{"type": "noun", "defs": ["a man who has got the ultimate knowledge (as the knowledge of the Supreme Being or self-knowledge)."]}], "ಬೊಮ್ಮವಿದ್ಯೆ": [{"type": "noun", "defs": ["the knowledge of the Supreme Being; self-knowledge."]}], "ಬೊಮ್ಮವೊಲೆಯ": [{"type": "noun", "defs": ["a brāhmaṇa who has violated brāhmaṇa's way of life."]}], "ಬೊಮ್ಮಶಿರೋಸ್ತ್ರ": [{"type": "noun", "defs": ["= ಬೊಮ್ಮಪಾಸ."]}], "ಬೊಮ್ಮಹತಿ": [{"type": "noun", "defs": ["a killing of a brāhmaṇa, considered as one of the five most heinous sins.", "the consequence of that sin.", "a false, persistent belief maintained in spite of evidence to the contrary; delusion."]}], "ಬೊಮ್ಮಹಾಸ": [{"type": "noun", "defs": ["= ಬೊಮ್ಮಪಾಸ."]}], "ಬೊಮ್ಮಾಂಡ": [{"type": "noun", "defs": ["the totality of known or supposed objects and phenomena throughout space; the cosmos; the macrocosm; the universe."]}], "ಬೊಮ್ಮಾರ": [{"type": "noun", "defs": ["a street or part of a town where brāhmana's live."]}], "ಬೊಮ್ಮಿ": [{"type": "noun", "defs": ["the plant Centella asiatica ( = Hydrocotyle asiatica) of Apiaceae family.", "the plant Sarcostemma acidum ( = S. bevistigma) of Asclepiadaceae family."]}], "ಬೊಮ್ಮೆ": [{"type": "noun", "defs": ["a child's toy, puppet, marionette, etc. made to resemble a human being, an animal or a thing; a puppet, doll.", "the contractile circular opening, apparently black, in the center of the iris of the eye.", "the shape, outline or configuration of anything, independent of colour, material, etc.; a form."]}], "ಬೊಮ್ಮೇತಿ": [{"type": "noun", "defs": ["= ಬೊಮ್ಮಹತಿ."]}], "ಬೊಮ್ಮೇತಿಗಾಱ": [{"type": "noun", "defs": ["he who has killed a brāhmaṇa, and hence committed one of the five most heinous sins.", "a man who instigates, causes another to kill a brāhmaṇa."]}], "ಬೊಮ್ಮೋಪದೇಶ": [{"type": "noun", "defs": ["a teaching of the Supreme knowledge (to another).", "a religious function, held just before sending a brāhmaṇa student to the residence of the teacher for learning, in which he is initiated with the hymn of light (the Gāyatri hymn) by his father and invested with the sacred thread; (now that religious function only)."]}], "ಬೊರಗೆ": [{"type": "noun", "defs": ["a deep hole (as in the earth).", "a hole in a wall, ground, tree, etc. (where rodents, insects, etc. live)."]}], "ಬೊರ್ಮ": [{"type": "noun", "defs": ["= ಬೊಮ್ಮ."]}], "ಬೊಲ್ಲ": [{"type": "noun", "defs": ["a horse whose face is white."]}, {"type": "independent clause", "defs": ["(an interjection used in praising a performer); bravo!; well-done!."]}], "ಬೊಲ್ಲಿ": [{"type": "noun", "defs": ["the telling of a happening or connected series of happenings, whether true or fictitious; a narration; a story."]}], "ಬೊಲ್ಲು": [{"type": "noun", "defs": ["= ಬೊಲ್ಲ2."]}], "ಬೊಲ್ಲೆ": [{"type": "noun", "defs": ["a false statement; falsehood; lie."]}], "ಬೊಹರಿ": [{"type": "noun", "defs": ["the black bumble-bee.", "the act of turning about (vertically on one's central axis), swinging or brandishing.", "(in sword or mace fight) a jumping up and turning in the air, to avoid one's opponent's blow.", "a toy, inversely conical, with a point on which it is made to spin with the help a string or cord; a top.", "a ring-like ornament for the ears.", "the side-lock on either side of the face, between the ears and the cheeks.", "a walking of a horse in a circular manner.", "the tree Ziziphus mauritiana ( = Z. jujuba) of Rhamnaceae family.", "its fruit.", "the medium sized evergreen tree Thespesia populnea of Malvaceae family; Indian tulip.", "(fig.) the male gonad or reproductive gland, either of two oval glands located in the scrotum; testis."]}], "ಬೊಳ್ಮು": [{"type": "adjective", "defs": ["having an empty space or only air, within; having a cavity inside; not solid; hollow."]}], "ಬೊಳ್ಳಿಡು": [{"type": "verb", "defs": ["(a dog, wolf, etc.) to utter the characteristic long, loud, wailing cry; to howl.", "to make a similar cry."]}], "ಬೊಳ್ಳು": [{"type": "noun", "defs": ["the characteristic cry of a dog; barking sound.", "(derog.) a speech that is harsh, impolite and discourteous."]}], "ಬೊಳ್ಳುಗರೆ": [{"type": "noun", "defs": ["= ಬೊಳ್ಳಿಡು."]}], "ಬೊಳ್ಳೆ": [{"type": "noun", "defs": ["the quality or fact of being hollow, empty.", "the quality of being empty or worthless."]}], "ಬೋ": [{"type": "independent clause", "defs": ["a mode of addressing respectful persons."]}], "ಬೋಂಡ": [{"type": "noun", "defs": ["a kind of fried eatable made of bengal gram flour.", "(coll.) a plump, chubby person."]}], "ಬೋಕಾಣಗಿತ್ತಿ": [{"type": "noun", "defs": ["(dial.) a woman who do not express her emotions, intentions to others."]}], "ಬೋಕಾಣಿ": [{"type": "noun", "defs": ["= ಬೋಕಾಣಗಿತ್ತಿ."]}], "ಬೋಕಿ": [{"type": "noun", "defs": ["a piece of broken pottery; a potsherd.", "the bowl of a beggar."]}], "ಬೋಕೆ": [{"type": "noun", "defs": ["= ಬೋಕಿ."]}], "ಬೋಗ": [{"type": "noun", "defs": ["the act or state of enjoying; a pleasurable experiencing of something; enjoyments.", "the fact of undergoing the miseries that are the effect of one's past deeds."]}], "ಬೋಗಣಿ": [{"type": "noun", "defs": ["= ಬೋಗುಣಿ."]}], "ಬೋಗನ್‍ವಿಲ್ಲ": [{"type": "noun", "defs": ["any of woody tropical vines of the Bougainvillea genus and the four-o'clock family, having inconspicuous flowers surrounded by large, showy purple or red bracts; bougainvillaea."]}], "ಬೋಗರ": [{"type": "adjective", "defs": ["free from pretense, affectation or hypocrisy; sincere; honest and forthright."]}], "ಬೋಗಾರ": [{"type": "noun", "defs": ["a man who makes or repairs metal objects, esp. by shaping the metal while it is hot and soft; metalworker: a smith."]}, {"type": "noun", "defs": ["a kind of plant."]}, {"type": "noun", "defs": ["a kind of bird."]}], "ಬೋಗಾಱ": [{"type": "noun", "defs": ["= ಬೋಗಾರ1."]}], "ಬೋಗಾಱದೆಱಿಗೆ": [{"type": "noun", "defs": ["an archaic tax levied on metal workers."]}], "ಬೋಗಾಱದೆಱೆ": [{"type": "noun", "defs": ["= ಬೋಗಾಱದೆಱಿಗೆ."]}], "ಬೋಗಾಱಿಕೆ": [{"type": "noun", "defs": ["= ಬೋಗಾಱದೆಱಿಗೆ."]}], "ಬೋಗಿ": [{"type": "noun", "defs": ["a man who is enjoying or having a pleasurable experience of something; an enjoyer."]}, {"type": "noun", "defs": ["a rail carriage or car; a bogie."]}], "ಬೋಗುಡಿಚೆ": [{"type": "noun", "defs": ["a kind of plant.."]}], "ಬೋಗುಣಿ": [{"type": "noun", "defs": ["a round, wide, shallow container, as for holding water to wash in; a basin."]}], "ಬೋಗುನಿ": [{"type": "noun", "defs": ["= ಬೋಗುಣಿ."]}], "ಬೋಗೇನವೆಲಿಯ": [{"type": "noun", "defs": ["= ಬೋಗನ್‍ವಿಲ್ಲ."]}], "ಬೋಗೋಣಿ": [{"type": "noun", "defs": ["= ಬೋಗುಣಿ."]}], "ಬೋಚಿ": [{"type": "noun", "defs": ["(children's term) the female breast."]}], "ಬೋಜ": [{"type": "noun", "defs": ["a kind of liquor."]}], "ಬೋಜಗಾರ": [{"type": "noun", "defs": ["a man who produces ಬೋಜ, a kind of liquor."]}], "ಬೋಜಾ": [{"type": "noun", "defs": ["= ಬೋಜೆ."]}], "ಬೋಜುಕಾರ": [{"type": "noun", "defs": ["(masc.) a friend or companion of the bridegroom at a wedding; best-man."]}], "ಬೋಜುಗಾರ್ತಿ": [{"type": "noun", "defs": ["(fem.) a friend or companion of the bride at a wedding."]}], "ಬೋಜೆ": [{"type": "noun", "defs": ["anything one has to bear or put up with; heavy load, as of work, duty, responsibility."]}], "ಬೋಟಿ": [{"type": "noun", "defs": ["= ಬೋಟು3."]}], "ಬೋಟು": [{"type": "noun", "defs": ["an item or source of income (for a state or local government)."]}, {"type": "noun", "defs": ["the outer skin of the tamarind fruit."]}, {"type": "noun", "defs": ["a small, open vessel or watercraft propelled by oars; a boat."]}], "ಬೋಡ": [{"type": "noun", "defs": ["a man destitute of teeth.", "a man who has shaven his head completely.", "a man having no hair on the scalp; a bald man.", "a destitute man.", "(dial.) a slow-witted man; a dull fellow.", "an ox not having horns."]}], "ಬೋಡಿ": [{"type": "noun", "defs": ["a woman destitute of teeth.", "a woman who has shaven her head completely.", "a woman having no hair on the scalp; a bald woman.", "a term of abuse."]}], "ಬೋಡು": [{"type": "adjective", "defs": ["having no teeth; toothless.", "having white fur or feathers on the head, as some animals and birds; bald.", "having no hair on the scalp; bald.", "not covered by natural growth; bald."]}, {"type": "noun", "defs": ["the fact or condition of not having teeth.", "the condition of not having hair on the scalp.", "the condition of not being covered by natural growth."]}], "ಬೋಡುಕಡಲೆ": [{"type": "noun", "defs": ["the thistle Sphaeranthus indicus of Asteraceae family."]}], "ಬೋಡುಗಿಡ": [{"type": "noun", "defs": ["the plant Orobanche ceruna (var. desertorum) of Orobanchaceae family."]}], "ಬೋಡುಗೈ": [{"type": "verb", "defs": ["to scrape away the surface (of something)."]}], "ಬೋಡುಳಿಕೆಹುಲ್ಲು": [{"type": "noun", "defs": ["the tree Scleropyrum wallichianum of Santalaceae family."]}], "ಬೋಡೆ": [{"type": "noun", "defs": ["the grass Cymbopogon martinii ( =Andropogon martini) of Poaceae family."]}], "ಬೋಣಿ": [{"type": "noun", "defs": ["the quality of being attractive; attractiveness; loveliness; charm; beauty."]}, {"type": "noun", "defs": ["the first cash sale of the day made by a seller.", "the first customer who purchases something by paying cash.", "(gen.) the first one that happens in the day."]}], "ಬೋದ": [{"type": "noun", "defs": ["the condition of being or becoming swollen.", "a swollen part; a protuberance or prominence; a swelling."]}, {"type": "noun", "defs": ["the egret Egretta garzetta of Ciconliformes of Ardeidae family, with long, black bill and legs, and white or dull-white plumes, that lives by rivers, ponds or in marshy areas."]}, {"type": "noun", "defs": ["= ಬೋಧನೆ."]}], "ಬೋದಡೆ": [{"type": "noun", "defs": ["a thick, rough sheet of cloth, used to cover the body for warmth."]}], "ಬೋದಬೋಟೆ": [{"type": "noun", "defs": ["= ಬೋದ1.", "ಬೋದಬೋಟೆಯಾಗು bōda bōṭeyāgu to become swollen or dilated."]}], "ಬೋದದೋರಗ": [{"type": "noun", "defs": ["the tree Cleistanthus collinus of Euphorbiaceae family."]}], "ಬೋದಿಗೆ": [{"type": "noun", "defs": ["(in building construction) a stone or wooden structure placed in between the top of a pillar and a beam."]}, {"type": "noun", "defs": ["the large-sized, tree Shorea talura ( = S. robusta, = Vatica robusta) of Dipterocarpaceae family, having coriaceous leaves, the wood of which is used for railway sleeper, buildings, etc."]}], "ಬೋದಿನ ಗಿಡ": [{"type": "noun", "defs": ["the plant Ardisia solanacea of Myrsinaceae family."]}], "ಬೋದು": [{"type": "noun", "defs": ["= ಬೋದಿಗೆ1."]}, {"type": "noun", "defs": ["the quality or fact of being hollow at the centre or inside; hollowness.", "a hole, cavity.", "a depression in the ground where water gets stagnated."]}, {"type": "noun", "defs": ["a kind of grass that is not eaten by cattle or is not of any use to human.", "ಬೋದು ಬೆಳೆದ ಹೊಲ ಹಾದೀಲಿದ್ದರೇನು, ಬೀದಿಲಿದ್ದರೇನು? bōda beḷeda hola hādīliddarēnu, bīdiliddarēnu (prov.) it is of no consequence where an useless thing is."]}], "ಬೋದುಗೆ": [{"type": "noun", "defs": ["= ಬೋದಿಗೆ1."]}], "ಬೋದೆ": [{"type": "noun", "defs": ["= ಬೋದು3."]}], "ಬೋದೆಸರ": [{"type": "noun", "defs": ["the plant Stemodia viscosa of Scrophulariaceae family."]}], "ಬೋಧ": [{"type": "noun", "defs": ["the act, process of teaching, educating.", "the state of being conscious; awareness of one's own existence, sensations, thoughts, surroundings, etc.; consciousness.", "familiarity or conversance with a particular subject or branch of learning; knowledge.", "the product of mental activity as perception, apprehension, thought, understanding, etc.", "the act of blowing, expanding (as a flower).", "(pros.) a group consisting of three long syllablic instants (---); molassus."]}], "ಬೋಧಕ": [{"type": "noun", "defs": ["he who imparts knowledge; a teacher; a preceptor."]}], "ಬೋಧಕಿ": [{"type": "noun", "defs": ["she who imparts knowledge; a teacher; a preceptor."]}], "ಬೋಧನೆ": [{"type": "noun", "defs": ["the act, process or an instance of teaching; enlightening.", "(fig.) an urging, inciting some evil action; instigation."]}], "ಬೋಧಾಳ": [{"type": "noun", "defs": ["(dial.) an innocent, guileless man."]}], "ಬೋಧಾಳು": [{"type": "noun", "defs": ["a quick-witted, intelligent man."]}], "ಬೋಧಿ": [{"type": "noun", "defs": ["perfect knowledge or wisdom.", "the knowledge or wisdom got by Gautama, the founder of Buddhism, when he got enlightened.", "the tree (Ficus religiosa of Moraceae family) under which Gautama was enlightend (in Gayā, in the present Bihār state)."]}], "ಬೋಧಿಸತ್ತ್ವ": [{"type": "noun", "defs": ["Gautama Buddha (563 - 483 BC) the founder of Buddhism.", "one who is in the stage of becoming a buddha, in the next birth."]}], "ಬೋಧಿಸತ್ವ": [{"type": "noun", "defs": ["= ಬೋಧಿಸತ್ತ್ವ."]}], "ಬೋಧಿಸು": [{"type": "verb", "defs": ["to give the studies of, by giving leasons, lectures, examples, etc.; to instruct; to teach."]}], "ಬೋಧೆ": [{"type": "noun", "defs": ["a knowing, understanding or realising.", "that which is known, understanding or realised; knowledge; reaslisation.", "the ability to learn or understand from experience; ability to acquire and retain knowledge; mental ability; intelligence.", "the act or process of thinking; reflection; meditation; cogitation; thought.", "to act or process of expanding, blowing (as a flower).", "development of intelligence, comprehending power or wisdom; an awakening; enlightenment.", "the state of being conscious; awareness of one's own feelings, what is happening around one, etc.; consciousness."]}], "ಬೋನ": [{"type": "noun", "defs": ["any cooked substance taken into and assimilated by animals to keep them alive and enable them grow; a cooked food.", "the act of cooking, preparing food.", "any food substance offered to a deity.", "a cogulated mass of over-cooked rice.", "a large quantity or number; a mass.", "a kind of paste applied to on the membrane of a percussion instrument, to improve the quality of sound."]}, {"type": "noun", "defs": ["a kitchen vessel, used to cook food."]}], "ಬೋನಂಗಾರೆ": [{"type": "noun", "defs": ["= ಬೋನಗಾರೆ."]}], "ಬೋನಗಾರ": [{"type": "noun", "defs": ["a man who cooks food (esp. as a profession); a cook."]}], "ಬೋನಗಾರೆ": [{"type": "noun", "defs": ["the plant Gardenia uliginosa (Randia uliginosa) of Rubiaceae family.", "the plant Xeromphis spinosa ( = Gardenia floribunda, Randia dumetorum) of the same family."]}], "ಬೋನಗಾಱ": [{"type": "noun", "defs": ["= ಬೋನಗಾರ."]}], "ಬೋನಗಾರ್ತಿ": [{"type": "noun", "defs": ["= ಬೋನಗಿತ್ತಿ."]}], "ಬೋನಗಿತ್ತಿ": [{"type": "noun", "defs": ["a woman who cooks food; a cook."]}], "ಬೋನಗುಡಿಕೆ": [{"type": "noun", "defs": ["a container for food or cooking vessel."]}], "ಬೋನಗೋಂಟಿಗೆ": [{"type": "noun", "defs": ["a room or place equipped for cooking; a kitchen."]}], "ಬೋನಮಿಡು": [{"type": "verb", "defs": ["to serve food."]}], "ಬೋನಮೆತ್ತು": [{"type": "verb", "defs": ["= ಬೋನವೆತ್ತು."]}], "ಬೋನವೆತ್ತು": [{"type": "verb", "defs": ["to prepare food (by cooking)."]}], "ಬೋನಸ್ಸು": [{"type": "noun", "defs": ["payment over and above salary given to an employee as an incentive or reward; bonus."]}], "ಬೋನಾಶಿ": [{"type": "noun", "defs": ["a wide-mouthed, cylindrical container, hung on a shoulder with a string tied to it, used for receiving alms."]}], "ಬೋನಾಸಿ": [{"type": "noun", "defs": ["= ಬೋನಾಶಿ."]}], "ಬೋನಿಕ್ಕು": [{"type": "verb", "defs": ["to set a trap to catch an animal."]}], "ಬೋನಿಗ": [{"type": "noun", "defs": ["a catcher of animals by trapping."]}], "ಬೋನು": [{"type": "noun", "defs": ["any device for catching animals, as one that snaps shut tightly when stepped on; a trap.", "a box or enclosed structure made of wires, bars, etc., for confining birds or animals; a cage.", "(fig.) any stratagem to trick unsuspecting persons."]}], "ಬೋನುಗಾರೆ": [{"type": "noun", "defs": ["= ಬೋನಗಾರೆ."]}], "ಬೋಬಾಟ": [{"type": "noun", "defs": ["the act of contending; a strife, struggle, controversy, dispute, quarrel, etc.; a contention.", "the act of objecting; an expression of opposition, disapproval or dislike; objection."]}], "ಬೋಭಾಟೆ": [{"type": "noun", "defs": ["= ಬೋಬಾಟ."]}], "ಬೋಯ": [{"type": "noun", "defs": ["a man who serves or attends.", "the chief or superintendent of servants.", "a man who catches fish for his living; a fisherman.", "a man whose profession is to carry palankeen on his shoulder.", "a man who is skilled in the operation of boats or whose profession is to convey people on a waterbody through a boat."]}], "ಬೋಯಿ": [{"type": "noun", "defs": ["= ಬೋಯ."]}], "ಬೋಯಿಕೆ": [{"type": "noun", "defs": ["the profession of an attendant; service."]}], "ಬೋಯಿತಿ": [{"type": "noun", "defs": ["a woman belonging to fishermeṇs caste.", "a woman belonging to boatmeṇs caste."]}], "ಬೋರ": [{"type": "noun", "defs": ["= ಬೋರಗುದುರೆ.", "the reddish borwn colour."]}, {"type": "noun", "defs": ["a man who does not have any property or money and hence unable to clear his debts; a bankrupt."]}, {"type": "noun", "defs": ["= ಬೋರೆ2."]}], "ಬೋರಂಗಿ": [{"type": "noun", "defs": ["a kind of large insect with brown wings.", "a fascinating, alluring woman."]}], "ಬೋರಂಟಿ": [{"type": "noun", "defs": ["a kite, made of a light frame, coverd with a paper, cloth, etc., flown in the wind at the end of a string, that makes a continuous jarring sound."]}], "ಬೋರಗುದುರೆ": [{"type": "noun", "defs": ["a reddish-brown horse."]}], "ಬೋರಮಾಳ": [{"type": "noun", "defs": ["a necklace which has Indian plum-like golden beads strung into it."]}], "ಬೋರಮಾಳು": [{"type": "noun", "defs": ["= ಬೋರಮಾಳ."]}], "ಬೋರಲಿಡು": [{"type": "verb", "defs": ["to keep (something) or turn upside down; to invert."]}], "ಬೋರಲು": [{"type": "noun", "defs": ["the topsy-turvy condition.", "the condition of being, lying facing downward.", "ಬೋರಲು ಬೀಳು bōralu bīḷu to lie on one's face and chest; 2. (while lying) to turn the back upwards; ಬೋರಲು ಹಾಕು bōralu hāku = ಬೋರಲಿಡು."]}], "ಬೋರಲುಪಾಲೆ": [{"type": "noun", "defs": ["the medium sized, evergreen tree Lophopetalum wightianum of Celastraceae family, the wood is used in match-box and match-sticking making."]}], "ಬೋರಾಡು": [{"type": "verb", "defs": ["to move, play a bustlingly (as from excitement)."]}], "ಬೋರಿ": [{"type": "noun", "defs": ["= ಬೋರೆ2."]}], "ಬೋರಿಗೆ": [{"type": "noun", "defs": ["= ಬೋಹರಿಗೆ."]}], "ಬೋರಿಯ": [{"type": "noun", "defs": ["a chequered or colourful carpet."]}], "ಬೋರಿಸರ": [{"type": "noun", "defs": ["= ಬೋರಮಾಳ."]}], "ಬೋರು": [{"type": "noun", "defs": ["= ಬೋರೆ1."]}], "ಬೋರೆ": [{"type": "noun", "defs": ["a small hill; a mound; a hillock.", "a bruised area of tissue, of a surface, etc.; a bruise."]}, {"type": "noun", "defs": ["the medium size, deciduous tree Ziziphus mauritiana ( = Z. jujuba) of Rhamnaceae family.", "its edible fruit.", "another plant Ziziphus vulgaris ( = Z. sativa) of the same family.", "its fruit."]}, {"type": "noun", "defs": ["= ಬೋರ2."]}], "ಬೋರ್ಗರೆ": [{"type": "verb", "defs": ["to make a roaring sound."]}], "ಬೋರ್ಗರೆಯಿಸು": [{"type": "verb", "defs": ["to cause to make a roaring sound."]}], "ಬೋರ್ಗಲ್ಲು": [{"type": "noun", "defs": ["a rough, undressed huge stone; a rock."]}], "ಬೋರ್ಡು": [{"type": "noun", "defs": ["a large, smooth, dark surface of slate or other material on which to write or draw with chalk; a chalkboard; a blackboard.", "a small, flat, usu. rectangular piece of a plank, for writing name, address or some information, etc.; a board.", "a group of persons who manage or control a business, school system, etc.; a board or council."]}], "ಬೋಲಬಗರಿ": [{"type": "noun", "defs": ["(dial.) a kind of toy made of dried coconut kernel."]}], "ಬೋಲು": [{"type": "noun", "defs": ["the rhythmic sounds produced by a percussion instrument."]}], "ಬೋವ": [{"type": "noun", "defs": ["= ಬೋಯ."]}], "ಬೋವಗಾಱ": [{"type": "noun", "defs": ["= ಬೋಯ - 2."]}], "ಬೋವಗಾಱಿಕೆ": [{"type": "noun", "defs": ["the office of the superintendent of servants or attendants."]}], "ಬೋವಗಾಱಿಕೆತನ": [{"type": "noun", "defs": ["= ಬೋವಗಾಱಿಕೆ."]}], "ಬೋವಸೊಂಡೆ": [{"type": "noun", "defs": ["the plant Solanum torvum of Solanaceae family.", "its fruit."]}], "ಬೋವಿ": [{"type": "noun", "defs": ["= ಬೋಯ."]}, {"type": "noun", "defs": ["the ficus tree Ficus tsiela of Moraceae family; yellow barked fig."]}], "ಬೋವಿತಿ": [{"type": "noun", "defs": ["= ಬೋಯಿತಿ."]}], "ಬೋವು": [{"type": "noun", "defs": ["= ಬೋಯ."]}, {"type": "noun", "defs": ["= ಬೋವಿ2."]}], "ಬೋಸ": [{"type": "noun", "defs": ["a man destitute of teeth.", "a slow-witted, dull fellow."]}, {"type": "noun", "defs": ["an accessory or article used to beautify the appearance of a person; an ornament."]}], "ಬೋಸಡಿ": [{"type": "noun", "defs": ["= ಬೋಸುಡಿ."]}], "ಬೋಸರ": [{"type": "noun", "defs": ["the tendency to cheat others."]}], "ಬೋಸರಗಿತ್ತಿ": [{"type": "noun", "defs": ["a woman who habitually cheats others; a cheat."]}], "ಬೋಸರಣೆ": [{"type": "noun", "defs": ["= ಬೋಸರ."]}], "ಬೋಸರಿಗ": [{"type": "noun", "defs": ["a man who habitually cheats others; a cheat."]}], "ಬೋಸರಿಗತನ": [{"type": "noun", "defs": ["= ಬೋಸರ."]}], "ಬೋಸರಿಗೆ": [{"type": "noun", "defs": ["= ಬೋಸರ."]}], "ಬೋಸರಿಸು": [{"type": "verb", "defs": ["to deceive by trikery; to mislead; to cheat.", "to extent sham courtesy, affection.", "to infuse enthusiasm; to encourage."]}], "ಬೋಸಿ": [{"type": "noun", "defs": ["a woman destitute of teeth."]}, {"type": "noun", "defs": ["a relatively wide-mouthed vessel, used for taking out and pouring water."]}], "ಬೋಸು": [{"type": "noun", "defs": ["the state or fact of not having teeth; toothlessness."]}], "ಬೋಸುಡಿ": [{"type": "noun", "defs": ["the external genital organ of the woman; the vulva.", "(fig.) (a vulgar, abusive term) a harlot; a whore."]}], "ಬೋಹಣ": [{"type": "noun", "defs": ["= ಬೋನ1."]}], "ಬೋಹಣಿಸು": [{"type": "verb", "defs": ["to apply a kind of paste to the membrane of a percussion instrument, as to produce good sound."]}], "ಬೋಹರಿಗೆ": [{"type": "noun", "defs": ["a brush made of a bundle of straw or stiff strands of synthetic material bound tightly at one end; a broom."]}], "ಬೋಹರಿಸು": [{"type": "verb", "defs": ["to sweep with or as with a broom."]}], "ಬೋಳ": [{"type": "noun", "defs": ["end of life; death.", "something that may cause death or injury; a peril."]}, {"type": "noun", "defs": ["a man destitute of teeth.", "a man who has shaven his head completely.", "a man having no hair on the scalp; a bald man.", "a destitute man.", "(dial.) a slow-witted man; a dull fellow.", "an ox not having horns."]}, {"type": "noun", "defs": ["the plant Commiphora myrrha ( = Balsamodendron myrrha) of Burseraceae family."]}], "ಬೋಳಂಗಡಲೆ": [{"type": "noun", "defs": ["= ಬೋಳಗಡಲೆ."]}], "ಬೋಳಂದರು": [{"type": "noun", "defs": ["the large sized, deciduous tree Lagerstroemia lanceolata of Lythraceae family.", "its teak."]}], "ಬೋಳಕ": [{"type": "noun", "defs": ["= ಬೋಳುಕ."]}], "ಬೋಳಕ್ಕಾರು": [{"type": "noun", "defs": ["(dial.) a half-ripe fruit."]}], "ಬೋಳಗಡಲೆ": [{"type": "noun", "defs": ["the plant Abutilon indicum of Malvaceae family; Indian abutilon; (?)."]}], "ಬೋಳತರ": [{"type": "noun", "defs": ["the plant Sphaeranthus indicus of Asteraceae family."]}], "ಬೋಳತರಗ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಬೋಳದರಗ": [{"type": "noun", "defs": ["= ಬೋಳತರಗ."]}], "ಬೋಳಮಟೆ": [{"type": "noun", "defs": ["the large-sized, deciduous tree Garugha pinnata of Burseraceae family."]}], "ಬೋಳಯಿಸು": [{"type": "verb", "defs": ["to influence or persuade (a person) by flattery, soothing words, coaxing, etc. ; to cajole; to wheedle."]}], "ಬೋಳಯ್ಸು": [{"type": "verb", "defs": ["= ಬೋಳಯಿಸು."]}], "ಬೋಳರೆ": [{"type": "noun", "defs": ["a piece of stone that is flat, broad, and fairly thick; a stone slab."]}], "ಬೋಳವಿಸು": [{"type": "verb", "defs": ["= ಬೋಳಯಿಸು."]}], "ಬೋಳಾಮಸ್ತಕಿ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಬೋಳಾರ್": [{"type": "noun", "defs": ["the large-sized, deciduous tree Tetrameles nudiflora of Datiscaceae family, with white, soft wood, used in making boats."]}], "ಬೋಳಿ": [{"type": "noun", "defs": ["a woman destitute of teeth.", "a woman who has shaven her head completely.", "a woman having no hair on the scalp; a bald woman.", "a term of abuse."]}], "ಬೋಳಿಸು": [{"type": "verb", "defs": ["to cut off (hair, esp. the beard) at the surface of the skin; to shave.", "(fig.) to remove any sign of; to obliterate; to erase.", "(fig.) (to spend away another's money; to make another spend all the money he or she has."]}], "ಬೋಳು": [{"type": "adjective", "defs": ["having no teeth; toothless.", "having white fur or feathers on the head, as some animals and birds; bald.", "having no hair on the scalp; bald.", "not covered by natural growth; bald.", "ಬೋಳು ಬೋಳಾಗಿರು boḷu boḷāgiru to be or to look unornamented."]}, {"type": "noun", "defs": ["the fact or condition of not having teeth.", "the condition of not having hair on the scalp.", "the condition of not being covered by natural growth."]}], "ಬೋಳುಕ": [{"type": "noun", "defs": ["a man or boy employed by another, as the one employed to perform domestic duties; a servant."]}], "ಬೋಳುಗರೆ": [{"type": "verb", "defs": ["(a dog, wolf, etc.) to utter the characteristic long, loud, wailing cry; to howl.", "to make a similar cry."]}], "ಬೋಳುಗೈ": [{"type": "noun", "defs": ["a hand (or arm) without having any ornaments."]}], "ಬೋಳುತಲೆ": [{"type": "noun", "defs": ["a man having no hair on the scalp."]}], "ಬೋಳುದಲೆ": [{"type": "noun", "defs": ["= ಬೋಳುತಲೆ."]}], "ಬೋಳುಮಂಡೆ": [{"type": "noun", "defs": ["= ಬೋಳುತಲೆ."]}], "ಬೋಳೆ": [{"type": "noun", "defs": ["a kind of arrow."]}, {"type": "noun", "defs": ["a stretch of elevated land without having trees and other plants except grass."]}, {"type": "adjective", "defs": ["without guile; innocent; straightforward; candid."]}, {"type": "noun", "defs": ["a man without guile; a candid, frank, straightforward man."]}], "ಬೋಳೆಯ": [{"type": "noun", "defs": ["a deity; a god."]}, {"type": "noun", "defs": ["= ಬೋಳೆ3."]}], "ಬೋಳೆಯತನ": [{"type": "noun", "defs": ["the quality of being unaffected, simple; artlessness; childlike innocence.", "lack of good sense, good judgement; foolishness; stupidity."]}], "ಬೋಳೈಸು": [{"type": "verb", "defs": ["= ಬೋಳಯಿಸು."]}], "ಬೋೞ": [{"type": "noun", "defs": ["= ಬೋಳ1."]}, {"type": "noun", "defs": ["= ಬೋಳ2."]}, {"type": "noun", "defs": ["= ಬೋಳ3."]}], "ಬೋೞಗಡಲೆ": [{"type": "noun", "defs": ["= ಬೋಳಗಡಲೆ."]}], "ಬೋೞತರ": [{"type": "noun", "defs": ["= ಬೋಳತರ."]}], "ಬೋೞಿಸು": [{"type": "verb", "defs": ["= ಬೋಳಿಸು."]}], "ಬೋೞಿಸುಹ": [{"type": "noun", "defs": ["the act or an instance of shaving the hair."]}], "ಬೋೞು": [{"type": "adjective", "defs": ["= ಬೋಳು1."]}, {"type": "noun", "defs": ["= ಬೋಳು2."]}], "ಬೋೞುಮಂಡೆ": [{"type": "noun", "defs": ["= ಬೋಳುತಲೆ."]}], "ಬೋೞೆ": [{"type": "noun", "defs": ["= ಬೋಳೆ1."]}], "ಬೋೞೆಯ": [{"type": "noun", "defs": ["= ಬೋಳೆಯ1."]}], "ಬೌದ್ಧ": [{"type": "adjective", "defs": ["of, relating to, derived from or appealing to the intellect; intellectual.", "of or relating to Gautama Buddha or Buddhism."]}, {"type": "noun", "defs": ["the ninth major incornation of Viṣṇu, as Gautama Buddha.", "a follower of Buddhism."]}], "ಬೌದ್ಧಮತ": [{"type": "noun", "defs": ["a religion originated in India by Gautama Buddha and later spreading to China, Burma, Japan, Tibet, and parts of southeast Asia, holding that life is full of suffering caused by desire a which can be overcome by right thinking, self-denial; Buddhism."]}], "ಬೌದ್ಧಾವತಾರ": [{"type": "noun", "defs": ["= ಬೌದ್ಧ2 - 1."]}], "ಬೌದ್ಧಿಕ": [{"type": "adjective", "defs": ["intellectual - a) appealing to or engaging the intellect; b) of or pertaining to the intellect or its use; c) possessing or showing intellect or mental capacity, esp. to a high degree; d) guided or developed by or relying on the intellect rather than upon emotions or feelings; rational; e) characterised by or suggesting a predominance of intellect."]}], "ಬೌದ್ಧಿಕತೆ": [{"type": "noun", "defs": ["the quality of being intellectual.", "the exercise of the intellect.", "devotion to intellectual pursuits.", "excessive emphasis on abstract or intellectual matters, esp. with a lack of proper consideration for emotions."]}], "ಬೌಲಿ": [{"type": "noun", "defs": ["= ಬೌಳಿ."]}], "ಬೌಳಿ": [{"type": "noun", "defs": ["(mus.) a musical mode in Karnāṭaka system, derived from the main mode Māyāmāḷava gauḷa."]}], "ಬೃತಿಪಾತ": [{"type": "noun", "defs": ["= ಬೃತೀಪಾತ."]}], "ಬೃತೀಪಾತ": [{"type": "noun", "defs": ["(astrol.) a conjugation of the sun and moon, in which they are in opposite ayana and have the same declination, the sum of their longitudes being 180 degree."]}], "ಬ್ಯವಸಾಯ": [{"type": "noun", "defs": ["the science, art or occupation concerned with cultivating land, raising crops, and feeding, breeding, and raising livestock; agriculture; farming.", "a strenuous effort; attempt; endeavour.", "the state of being ready, prepared for; preparation.", "any vocation or business; a profession."]}], "ಬ್ಯವಹಾರ": [{"type": "noun", "defs": ["a work which one is regularly engaged in; profession; occupation.", "the buying and selling of commodities and services; commerce; trade; business.", "anything bought and sold; any article of commerce; commodity.", "the way a person behaves or acts; conduct; manners; behaviour.", "an interfering into another's affairs."]}], "ಬ್ಯಾಂಕು": [{"type": "noun", "defs": ["an institution for receiving, lending, exchanging, and safeguarding money; a bank."]}], "ಬ್ಯಾಂಡು": [{"type": "noun", "defs": ["a group of musicians playing together, upon wind and percussion instruments; a band."]}], "ಬ್ಯಾಂಡೇಜು": [{"type": "noun", "defs": ["a strip of cloth, esp. gauze or other dressing used to bind or cover an injured part of the body; a bandage."]}], "ಬ್ಯಾಕೀರ್ಣ": [{"type": "adjective", "defs": ["spread about here and there, without any order."]}], "ಬ್ಯಾಕ್ಟೀರಿಯಾ": [{"type": "noun", "defs": ["(sing.) any of several microscopic creatures making up a division of microorganisms which are typically one-celled, have no chlorophyll, multiply by simple division some of which cause diseases such as pneumonia and anthrax, while others are necessary for fermentation, nitrogen fixation, etc.; bacterium."]}], "ಬ್ಯಾಖ್ಯಾನ": [{"type": "noun", "defs": ["a thorough exposition; a detailed explanation."]}], "ಬ್ಯಾಗು": [{"type": "noun", "defs": ["a container or receptacle of leather, plastic, cloth, paper, etc., having a wide mouth usu. with a handle or handles."]}], "ಬ್ಯಾಣ": [{"type": "noun", "defs": ["an extent of level country, not having plants, buildings, etc.; a plain area."]}], "ಬ್ಯಾದ": [{"type": "noun", "defs": ["a man whose profession is hunting animals; a hunter."]}], "ಬ್ಯಾದಳ": [{"type": "noun", "defs": ["the acacia tree Acacia farnesiana of Mimosae family."]}], "ಬ್ಯಾದಿ": [{"type": "noun", "defs": ["illness; disease."]}], "ಬ್ಯಾಪ್ತ": [{"type": "adjective", "defs": ["spread or diffused throughout all parts of; pervaded."]}], "ಬ್ಯಾಪ್ತಿ": [{"type": "noun", "defs": ["the space, amount or degree to which a thing extends; extent.", "range or limits of anything; extent."]}], "ಬ್ಯಾಮೋಹ": [{"type": "noun", "defs": ["irrarational, foolish love or attachment; infatuation."]}], "ಬ್ಯಾರ": [{"type": "noun", "defs": ["the buying and selling of commodities; trade."]}], "ಬ್ಯಾರಿ": [{"type": "noun", "defs": ["a man who buys and sells commodities for profit; a dealer; a trader; a merchant.", "a clan of Muslim traders originally from Arabia, settled in the coastal ditricts of Karnāṭaka and part of Kerala, who speak Tuḷu mixed with Malayālam.", "a man belonging to this clan."]}], "ಬ್ಯಾಲ": [{"type": "noun", "defs": ["a wild elephant."]}], "ಬ್ಯಾಲೆ": [{"type": "noun", "defs": ["a classical dance form demanding grace and precision and employing formalised steps and gestures set in intricate, flowing patterns to create expression through movement, presenting a story, idea or mood; a ballet."]}], "ಬ್ಯಾವರ್ಣಿಸು": [{"type": "verb", "defs": ["to explain thoroughly."]}], "ಬ್ಯೋಮ": [{"type": "noun", "defs": ["the sky."]}], "ಬ್ರಜ": [{"type": "noun", "defs": ["a group of people, animals, etc. gathered at a place; a multitude."]}], "ಬ್ರಣ": [{"type": "noun", "defs": ["an infected spot on the body, as an ulcer, boil, blister, etc.; a sore."]}], "ಬ್ರತ": [{"type": "noun", "defs": ["any religious act or obligation enjoined by the gods; any meritorious act of devotion or austerity; a vow."]}], "ಬ್ರತಿ": [{"type": "noun", "defs": ["a man who has undertaken an act of austerity in meditation for realising the Supreme Knowledge; a sage."]}], "ಬ್ರಧ್ನ": [{"type": "noun", "defs": ["the sun.", "the root of a tree.", "a day (a period of twenty four hours).", "the plant Calotropis gigantea of Asclepiadaceae family.", "a heavy, soft, malleable, bluish-gray metallic chemical element used in batteries and in numerous alloys and compounds (symbol - Pb); lead.", "a horse.", "Śiva.", "Brahma.", "the pointed tip of an arrow.", "a kind of disease."]}], "ಬ್ರಮಾತಿ": [{"type": "noun", "defs": ["a killing of a brāhmaṇa, considered as one of the five most heinous sins.", "the consequence of that sin.", "a false, persistent belief maintained in spite of evidence to the contrary; delusion."]}], "ಬ್ರಯ": [{"type": "noun", "defs": ["the amount of money expended; expense; expenditure.", "something that is given as a gift, donation.", "complete destruction.", "(math.) what is left undivided when one number is divided by another that is not one of its factors; remainder."]}], "ಬ್ರಶ್ಶು": [{"type": "noun", "defs": ["= ಬ್ರಷ್ಷು."]}], "ಬ್ರಷ್ಷು": [{"type": "noun", "defs": ["a device consisting of bristles, hairs or the like, set in or attached to a hard back, used for painting, cleaning, polishing, grooming, etc.; a brush."]}], "ಬ್ರಹ್ಮ": [{"type": "noun", "defs": ["the impersonal Supreme Being or Principle of the universe.", "the hymns of vedas.", "the vedas.", "collectively, the Agamas a class of Hindu scriptures.", "the sacred syllable Ōm.", "the brāhmaṇa caste.", "religious austerity.", "the state of being student (esp. studying religious subjects, before being married).", "the condition or fact of being unmarried or being under a vow to remain unmarried.", "complete abstention from sexual intercourse.", "emancipation of the soul; freedom from the cycle of birts and deaths.", "the knowledge of the Supreme; self-knowledge.", "a man having this knowledge.", "the individual soul.", "the sacred hymn of Gāyatri.", "the chief priest of religious sacrifice.", "Brahma, the Creator of the universe.", "Satyalōka, the abode of Brahma.", "any substance taken as food.", "truth; fact.", "the quality, status or condition of being a brāhmaṇa.", "Břhaspati, the preceptor of gods.", "the sun.", "(pl.) seven progenitors of the human race.", "Rudra, one of the formidable form of Śiva.", "Indra, the lord of gods.", "the moon.", "fire or the Fire-God.", "(astrol.) one of the twenty seven yōgas (astrological conjugation).", "a person with intellectual interests or tastes or is engaged in intellectual work; an intellectual.", "name of a demi-god.", "(pros.) a metre having two syllables."]}], "ಬ್ರಹ್ಮಕಂಬಿ": [{"type": "noun", "defs": ["the threads that are hanging out at the border of a cloth, which are tied into small knots.", "(fig.) the everlasting poverty of a brāhmaṇa."]}], "ಬ್ರಹ್ಮಕರ್ಮ": [{"type": "noun", "defs": ["the rituals performed by the Brahma, the chief priest in a religious sacrifice.", "the daily rituals of a brāhmaṇa."]}], "ಬ್ರಹ್ಮಕಾಂಡ": [{"type": "noun", "defs": ["the knowledge of upanishads, that uphold the supremacy of self-knowledge, rather than rituals."]}], "ಬ್ರಹ್ಮಕಾಂತ": [{"type": "noun", "defs": ["(arch.) a class of pillars.", "a type of storeyed buildings."]}], "ಬ್ರಹ್ಮಗಂಟು": [{"type": "noun", "defs": ["a knot tied in the sacrificial thread.", "(fig.) an unseverable, inseparable relationship.", "a very complex problem that is very difficult or impossible to solve."]}], "ಬ್ರಹ್ಮಗಂಬಿ": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮಕಂಬಿ."]}], "ಬ್ರಹ್ಮಗಣ": [{"type": "noun", "defs": ["a set of two or three syllables (also known as Ratigaṇa) having (in any of these four combinations of prosodic units --, -u, uu- or uuu)."]}], "ಬ್ರಹ್ಮಗ್ರಂಥಿ": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮಗಂಟು - 1."]}], "ಬ್ರಹ್ಮಚಕ್ರ": [{"type": "noun", "defs": ["the universe considered as a whole; the macrocosm.", "a mystic circle or circles drawn by conjurers.", "(yoga.) the central point of the gross body."]}], "ಬ್ರಹ್ಮಚರ್ಯ": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮಚರ್ಯೆ."]}], "ಬ್ರಹ್ಮಚರ್ಯೆ": [{"type": "noun", "defs": ["the state of being student (esp. studying religious subjects, before being married).", "the condition or fact of being unmarried or being under a vow to remain unmarried.", "complete abstention from sexual intercourse."]}], "ಬ್ರಹ್ಮಚಾರಿ": [{"type": "noun", "defs": ["(masc.) a student before entering into married life.", "an unmarried man or a man under a vow to remain unmarried.", "(masc.) one who abstains from sexual intercourse.", "Śiva.", "Skanda, son of Śiva."]}], "ಬ್ರಹ್ಮಚಾರಿಣಿ": [{"type": "noun", "defs": ["an unmarried man or a man under a vow to remain unmarried.", "(fem.) one who abstains from sexual intercourse.", "the Goddess Durga."]}], "ಬ್ರಹ್ಮಜಾತಿ": [{"type": "noun", "defs": ["the class of diamonds that is considered as best ."]}], "ಬ್ರಹ್ಮಜಿಜ್ಞಾಸೆ": [{"type": "noun", "defs": ["the sincere desire of knowing Brahma or having the knowledge of the Supreme Being."]}], "ಬ್ರಹ್ಮಜ್ಞ": [{"type": "noun", "defs": ["a man possessing sacred knowledge (as taught by the upanishads), knowing and realising the Supreme Spirit.", "Kārtikēya, son of Śiva.", "Viṣṇu."]}], "ಬ್ರಹ್ಮಜ್ಞಾನ": [{"type": "noun", "defs": ["the knowledge of universal permeation of the one Spirit as taught by the vedanta (or the philosophy of upanishads); spiritual wisdom."]}], "ಬ್ರಹ್ಮಜ್ಞಾನಿ": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮಜ್ಞ - 1."]}], "ಬ್ರಹ್ಮಜ್ಯೋತಿ": [{"type": "noun", "defs": ["the luminosity of Brahma, the Creator of the universe.", "Śiva."]}], "ಬ್ರಹ್ಮಣಸ್ಪತಿ": [{"type": "noun", "defs": ["Viṣṇu.", "Břhaspati, the god of wisdom and eloquence, and the preceptor of gods."]}], "ಬ್ರಹ್ಮಣ್ಯ": [{"type": "adjective", "defs": ["relating to the Supreme Spirit, the principle of the Universe or to the knowledge of it.", "relating to Brahma, the Creator.", "fit to be ordained to be, followed by a brāhmaṇa."]}, {"type": "noun", "defs": ["he who has studied, and well-vered with, vedas.", "he who is pleasing or helpful to brāhmaṇas.", "Kārtikēya, son of Śiva.", "Viṣṇu.", "the tree Areca catechu of Arecaceae family; betel nut tree.", "the mulberry tree (as Morus alba, Morus indica, etc.) of Moraceae tree.", "the grass Saccharus munja of Poaceae family.", "any of the varieties of the cotton producing plants (family: Malvaceae).", "the planet saturn.", "that which is proper to or is in favour of, brāhmaṇas."]}], "ಬ್ರಹ್ಮತತ್ತ್ವ": [{"type": "noun", "defs": ["the universal principle that sustains the entire universe.", "knowledge of this."]}], "ಬ್ರಹ್ಮತಿ": [{"type": "noun", "defs": ["a killing of a brāhmaṇa, considered as one of the five most heinous sins.", "the consequence of that sin.", "a false, persistent belief maintained in spite of evidence to the contrary; delusion.", "(fig.) a person who is persistently and irritantly after another."]}], "ಬ್ರಹ್ಮತಿಕಾಱ": [{"type": "noun", "defs": ["he who has killed a brāhmaṇa, and hence committed one of the five most heinous sins.", "a man who instigates, causes another to kill a brāhmaṇa."]}], "ಬ್ರಹ್ಮತೇಜ": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮತೇಜಸ್ಸು."]}], "ಬ್ರಹ್ಮತೇಜಸ್ಸು": [{"type": "noun", "defs": ["the luminosity of Brahma, the Creator of the universe.", "the luminosity or the supposed flowing of luminosity of or profound intelletual influence that emanates from, a master of Supreme Knowledge."]}], "ಬ್ರಹ್ಮತ್ತಿ": [{"type": "noun", "defs": ["a kind of ficus tree."]}], "ಬ್ರಹ್ಮತ್ವ": [{"type": "noun", "defs": ["the state of identification of oneself with Brahma, the Supreme Being.", "the state or fact of being Brahma.", "the condition, rank or fact pf being a brāhmaṇa.", "the office of the chief priest of a religious sacrifice."]}], "ಬ್ರಹ್ಮದಂಡ": [{"type": "noun", "defs": ["the curse of a brāhmaṇa.", "an amount of money presented to a brāhmaṇa.", "Śiva.", "an arm-rest used by sages.", "a mystical weapon, of which Brahma is the presiding deity.", "the spinal column; the backbone."]}], "ಬ್ರಹ್ಮದಂಡಿ": [{"type": "noun", "defs": ["the thistle plant Echinops echinatus of Asteraceae family.", "the plant Argemone mexicana of Papaveraceae family; Mexican poppy.", "the plant Tricholepis glaberrima of steraceae family."]}], "ಬ್ರಹ್ಮದಂಡೆ": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮದಂಡಿ."]}], "ಬ್ರಹ್ಮದರ್ಭೆ": [{"type": "noun", "defs": ["the plant Trachyspermum ammi ( = Carum copiticum) of Apiaceae family; bishop's weed.", "its seed."]}], "ಬ್ರಹ್ಮದರ್ಶಿ": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮಜ್ಞ - 1."]}], "ಬ್ರಹ್ಮದಾಯ": [{"type": "noun", "defs": ["the knowledge of Brahma or the Universal Principle, that is got hereditarily.", "money or land donated to a brāmaṇa who completed the study of vedas."]}], "ಬ್ರಹ್ಮದಾರು": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮಣ್ಯ2 - 5, 6 & 8.", "the tree Ficus religiosa of Moraceae family; the peepul tree."]}], "ಬ್ರಹ್ಮದೇಯ": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮದಾಯ - 2.", "a marriage conducted, as per the rules prescribed for brāhmaṇa caste."]}], "ಬ್ರಹ್ಮದ್ವೇಷ": [{"type": "noun", "defs": ["hatred or antipathy against brāhmaṇa caste."]}], "ಬ್ರಹ್ಮದ್ವೇಷಿ": [{"type": "noun", "defs": ["a person having hatred or antipathy against brāhmaṇa caste."]}], "ಬ್ರಹ್ಮಧರ್ಮ": [{"type": "noun", "defs": ["the true nature or quality of Brahma."]}], "ಬ್ರಹ್ಮನಾಡಿ": [{"type": "noun", "defs": ["(yoga) the central part of suṣumne, a important passage that exist in the body for the internal, vital winds."]}], "ಬ್ರಹ್ಮನಾಳ": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮನಾಡಿ."]}], "ಬ್ರಹ್ಮಪಟ್ಟ": [{"type": "noun", "defs": ["the office of Brahma.", "(fig.) an office, rank or power that is everlasting."]}], "ಬ್ರಹ್ಮಪಾಶ": [{"type": "noun", "defs": ["a mystical weapon, of which Brahma is the presiding deity.", "(fig.) a knot, bond getting freed from which is impossible."]}], "ಬ್ರಹ್ಮಪಿಶಾಚಿ": [{"type": "noun", "defs": ["the ghost of a brāhmaṇa."]}], "ಬ್ರಹ್ಮಪುತ್ರ": [{"type": "noun", "defs": ["a river flowing from south west Tibet through north east India and joining the Gangā River in Bangladesh (approx. 2900 km).", "a kind of deadly poison."]}], "ಬ್ರಹ್ಮಪುರ": [{"type": "noun", "defs": ["the abode of Brahma.", "that part of a town where brāhmaṇas live."]}], "ಬ್ರಹ್ಮಪುರಾಣ": [{"type": "noun", "defs": ["one of the eighteen purāṇas, supposed to have been revealed by Brahma to Dakṣa."]}], "ಬ್ರಹ್ಮಪುರಿ": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮಪುರ."]}], "ಬ್ರಹ್ಮಪ್ರಾಪ್ತಿ": [{"type": "noun", "defs": ["the state of identification of oneself with Brahma, the Supreme Being."]}], "ಬ್ರಹ್ಮಬಂಧು": [{"type": "noun", "defs": ["an unworthy brāhmaṇa; a brāhmaṇa, who violates the brāhmaṇa dharma."]}], "ಬ್ರಹ್ಮಬಿಂದು": [{"type": "noun", "defs": ["name of one of the upanishads.", "(fig.) a drop of saliva sputtered while reciting the veda."]}], "ಬ್ರಹ್ಮಬ್ರುವ": [{"type": "noun", "defs": ["= ಬ್ರಹ್ಮಬಂಧು."]}]}