{"ಗಬ್ಬವನೆ": [{"type": "noun", "defs": ["= ಗಬ್ಬಗರ."]}], "ಗಬ್ಬವಿಕ್ಕಿಸು": [{"type": "verb", "defs": ["to bring down another's undue pride, arrogance etc."]}], "ಗಬ್ಬವಿಕ್ಕು": [{"type": "verb", "defs": ["to lose belief in one's own abilities, confidence, etc.; to become diffident.", "to become humble; to sub-due or eschew one's pride; to be modest."]}], "ಗಬ್ಬಾಳಿಕೆ": [{"type": "noun", "defs": ["irrational governance; indiscreet, injudicious, imprudent management."]}], "ಗಬ್ಬಿ": [{"type": "adjective", "defs": ["arrogant; haughty; headstrong."]}, {"type": "noun", "defs": ["a man of inordinate pride or arrogance; a haughty man.", "excessiveness; abundance.", "a man of esteem."]}, {"type": "noun", "defs": ["an arrogant, haughty woman."]}], "ಗಬ್ಬಿಗ": [{"type": "noun", "defs": ["a man of high social status."]}], "ಗಬ್ಬಿಗಲಿ": [{"type": "noun", "defs": ["a strong man."]}], "ಗಬ್ಬಿಗೆ": [{"type": "noun", "defs": ["the headgear used to control a horse, consisting of buckled leather straps, a metal bit, and reins; a bridle."]}], "ಗಬ್ಬಿತನ": [{"type": "noun", "defs": ["the quality of being arrogant, inordinately proud; arrogance; undue pride."]}], "ಗಬ್ಬಿಲ": [{"type": "noun", "defs": ["any mouse-like nocturnal mammal of the order Chiroptera, capable of flight by means of membranous wings extending from its forelimbs; a bat."]}], "ಗಬ್ಬಿಲಾಯಿ": [{"type": "noun", "defs": ["= ಗಬ್ಬಿಲ."]}], "ಗಬ್ಬು": [{"type": "noun", "defs": ["a strong, offensive smell or odour; stink; stench.", "any dirty, stinking material."]}, {"type": "noun", "defs": ["= ಗಬ್ಬ2."]}], "ಗಬ್ಬುಚಕ್ಕೆ": [{"type": "noun", "defs": ["the tree Gironniera cuspidata ( = G. reticulata) of Ulmaceae family, whose wood emits a very offensive smell; hellish incense."]}], "ಗಬ್ಬುಜವ್ವನೆ": [{"type": "noun", "defs": ["a youthful woman."]}], "ಗಬ್ಬುಜಾಲಿ": [{"type": "noun", "defs": ["the tree Acacia latronum of Mimosae family."]}], "ಗಬ್ಬುತಿಗಣೆ": [{"type": "noun", "defs": ["the insect, Dysdercus cingulatus; a cotton stainer; a red-bug."]}], "ಗಬ್ಬುನಾತ": [{"type": "noun", "defs": ["= ಗಬ್ಬು1 - 1."]}], "ಗಬ್ಬುನಾರು": [{"type": "verb", "defs": ["to give off a strong, unpleasant smell; to emit stench; to stink."]}], "ಗಬ್ಬುವಾಸನೆ": [{"type": "noun", "defs": ["= ಗಬ್ಬು1."]}], "ಗಬ್ಬುಶಾವಂತಿ": [{"type": "noun", "defs": ["the plant Tridax procumbens of Asteraceae family."]}], "ಗಬ್ಬುಸಣ್ಣಶಾವಂತಿ": [{"type": "noun", "defs": ["= ಗಬ್ಬುಶಾವಂತಿ."]}], "ಗಬ್ಬುಸೊಪ್ಪು": [{"type": "noun", "defs": ["the plant Blumea mollis ( = B. wightiana) of Asteraceae family."]}], "ಗಬ್ಬುಹಿಡಿ": [{"type": "verb", "defs": ["to become stinking."]}], "ಗಬ್ಬುಹೊಡೆ": [{"type": "verb", "defs": ["= ಗಬ್ಬುನಾರು."]}], "ಗಬ್ಬುಳಗಂದಿ": [{"type": "noun", "defs": ["a kind of cloth."]}], "ಗಬ್ಲು": [{"type": "noun", "defs": ["= ಗಬ್ಬು1 - 1."]}], "ಗಭಸ್ತಿ": [{"type": "noun", "defs": ["a ray or beam of light.", "the sun.", "the forepart of the arm; the hand.", "Svāhā, the wife of the fire-god Agni."]}], "ಗಭಸ್ತಿಕರ": [{"type": "noun", "defs": ["the sun."]}], "ಗಭಸ್ತಿಮಂಡಲ": [{"type": "noun", "defs": ["a ring of light that seems to encircle the sun, resulted from the refraction of light through ice crystals in our atmosphere; halo."]}], "ಗಭಸ್ತಿಮಾಲಿ": [{"type": "noun", "defs": ["the sun."]}], "ಗಭೀರ": [{"type": "adjective", "defs": ["extending down, inward, etc. considerably; very deep.", "deeply or intensely felt; being so.", "not inclined to flirt; not given to fun, cheap amusement; restrained in speech, action, etc.; dignified; decent.", "solemn; deeply earnest.", "that cannot easily or superficially be understood; of, containing, implying or characterised by mystery; that which requires serious thought, study, etc.; intellectually profound; marked by intellectual depth; serious; grave.", "inspiring awe or admiration through grandeur, beauty, etc.; sublime; stately; majestic.", "sounding grave, solemn (said of a person's voice).", "of or in the octaves lower than the normal one (i.e. below the middle C)."]}, {"type": "noun", "defs": ["= ಗಭೀರಗುಣ.", "a sober man; a man of serious thought, action, etc."]}], "ಗಭೀರಗುಣ": [{"type": "noun", "defs": ["the quality or fact of being deep (usu. being difficult to measure the depth).", "the quality or condition of being difficult to grasp or comprehend.", "the solemn feeling, character or appearance; serious or awesome quality; solemnity; gravity."]}], "ಗಭೀರತೆ": [{"type": "noun", "defs": ["= ಗಭೀರಗುಣ."]}], "ಗಭೀರಧ್ವಾನ": [{"type": "noun", "defs": ["a deep, heavy or solemn sound."]}], "ಗಭೀರನಿನದ": [{"type": "noun", "defs": ["= ಗಭೀರಧ್ವಾನ.2) a man whose voice is impressively solemn."]}], "ಗಭೀರನಿನಾದ": [{"type": "noun", "defs": ["= ಗಭೀರನಿನದ."]}], "ಗಭೀರವೃತ್ತಿ": [{"type": "noun", "defs": ["= ಗಭೀರಗುಣ.", "a serious, earnest or sober behaviour, profession etc."]}], "ಗಭೀರೋಕ್ತಿ": [{"type": "noun", "defs": ["an impressive, solemn, serious speech."]}], "ಗಮ": [{"type": "noun", "defs": ["a sweet smell; pleasant odour; fragrance; ಗಮಗಮ ಅನ್ನು gama gama a nnu to emit pleasant smell; to be fragrant.", "to have or be filled with, a pleasant odour."]}, {"type": "noun", "defs": ["the act of going, moving, walking.", "the quality of acting or doing suddenly with little thought; rashness; impulsiveness; impetuousness.", "lack of full knowledge."]}], "ಗಮಂಡ": [{"type": "noun", "defs": ["the chief of a village."]}], "ಗಮಕ": [{"type": "adjective", "defs": ["impressing upon the mind; making clear or intelligible; convincing."]}, {"type": "noun", "defs": ["that which helps understanding the meaning (of something) clearly.", "a way or method in which something is done, happens or must be done or must happen.", "the quality of being worthy of esteem or honour; dignified manner, style, etc.; elegance.", "the condition of being enthusiastic or thrilled.", "a reciting of poetry melodiously, using musical modes suitable to the sentiments of the situation in the poetry, and depicting the meaning lucidly.", "the act or process of giving moral or religious advice; a counselling.", "the advice so given; counsel.", "one who preaches or advices.", "(gram.) a kind of compound of words in which the former word is a number, pronoun, adjective or noun formed from a verb.", "the enhancing of the beauty of a musical note by moving or oscillating it around its natural position in a regulated manner."]}], "ಗಮಕಕಲೆ": [{"type": "noun", "defs": ["the art of reciting of poetry melodiously, using musical modes suitable to the sentiments of the situation in the poetry, and depicting the meaning lucidly."]}], "ಗಮಕರಿಸು": [{"type": "verb", "defs": ["to add fragrance to; to make (something) fragrant."]}], "ಗಮಕವೆಱು": [{"type": "verb", "defs": ["to become elegant, beautiful."]}], "ಗಮಕಸಪ್ತಕ": [{"type": "noun", "defs": ["(collectively) seven kinds of gamakas, i.e. artful regulation of the movement of a particular musical note around its natural position, that adds to the melody."]}], "ಗಮಕಸಮಾಸ": [{"type": "noun", "defs": ["= ಗಮಕ2 - 9."]}], "ಗಮಕಿ": [{"type": "noun", "defs": ["a person who recites poetry using appropriate musical modes and depicts the idea of the poetry in a limpid manner."]}], "ಗಮಕಿತೆ": [{"type": "noun", "defs": ["the quality of a ಗಮಕಿ."]}], "ಗಮಕಿಸು": [{"type": "verb", "defs": ["to act in a reckless haste with little or no thought."]}], "ಗಮಕು": [{"type": "noun", "defs": ["the quality of being elegant; dignified richness and grace; polished fastidiousness or refined grace."]}], "ಗಮಗಮ": [{"type": "noun", "defs": ["the scent, odour or volatile particles emitted by substances that smell agreeable."]}], "ಗಮಗಮಿಸು": [{"type": "verb", "defs": ["to be fragrant; to emit or be emitting a sweet smell."]}], "ಗಮಜು": [{"type": "noun", "defs": ["a show, in a pretending manner, one's status, talent, richness, etc.; arrogance arising from self-conceit."]}], "ಗಮಟು": [{"type": "noun", "defs": ["a very offensive smell."]}], "ಗಮನ": [{"type": "noun", "defs": ["a sweet, pleasing smell; a fragrance; a pleasant odour."]}, {"type": "noun", "defs": ["the act of going, moving, walking.", "manner of moving, walking; gait.", "(in comp.) sexual intercourse; copulation.", "attention - a) the act of keeping one's mind closely on something or the ability to do this; mental concentration; b) mental readiness for such concentration; c) notice; observation; d) care or consideration.", "ಗಮನ ಸೆಳೆ gamana seḷe to deliberately draw another's attention (to a particular subject); ಗಮನ ಸೆಳೆಯುವ ಸೂಚನೆ gamana seḷeyuva sūcane a motion, in a legislative house, to draw the attention of the chairperson and the house to an urgent matter that is not in the normal agenda for discussion; a draw-attention motion."]}], "ಗಮನಗೇಡಿ": [{"type": "noun", "defs": ["a person so dreamy or lost in thought as not to pay attention to what one is doing or what is going on around one; an absent-minded person."]}], "ಗಮನಗೇಡಿಕೆ": [{"type": "noun", "defs": ["the quality or condition of being lost in thought resulting in what is going on around oneself is not able to draw his or her attention."]}], "ಗಮನಪ್ರಾಯಶ್ಚಿತ್ತ": [{"type": "noun", "defs": ["(Jain.) an act of self-punishment or a penance observed for having probably killed or injured insects while walking."]}], "ಗಮನಶ್ರಮ": [{"type": "noun", "defs": ["(mus.) the fifty-third of the seventy two main modes in Karnāṭaka system."]}], "ಗಮನಾಗಮನ": [{"type": "noun", "defs": ["the act of going and coming.", "the act of strolling; usual or leisurely walk.", "habitual visiting; the act of frequenting.", "the fact of being born and dying; birth and death."]}], "ಗಮನಾರ್ಹ": [{"type": "adjective", "defs": ["worth considering; important; noteworthy; considerable.", "much or large.", "remarkable; outstanding."]}], "ಗಮನಾರ್ಹತೆ": [{"type": "noun", "defs": ["the quality of being noteworthy, important.", "the quality of being much or large.", "the quality of being remarkable or outstanding."]}], "ಗಮನಾಲಸ": [{"type": "adjective", "defs": ["moving slowly; slow; not active."]}, {"type": "noun", "defs": ["a slow, lethargic man."]}], "ಗಮನಾಲಸೆ": [{"type": "noun", "defs": ["a slow, lethargic woman."]}], "ಗಮನಿ": [{"type": "noun", "defs": ["a cheat; a fraud; a deceiver.", "a man devoted to or concerned with the affairs, pleasures, etc. of this world (as opp. to being devoted to spiritual life)."]}, {"type": "noun", "defs": ["a vein at the root of the thumb."]}], "ಗಮನಿಕೆ": [{"type": "noun", "defs": ["the quality or fact of agreeing; compatibility; a becoming one with."]}], "ಗಮನಿಸು": [{"type": "verb", "defs": ["to move (along, away, out etc.); to go.", "to notice, perceive or observe; to pay attention to; ಗಮನಿಸಿಕೊ gamanisiko = ಗಮನಿಸು - 2.", "to grease (someone's palm) to get some favour."]}], "ಗಮನೀಯ": [{"type": "adjective", "defs": ["accessible - a) that can be approached or entered; b) easy to approach or enter.", "worthy of being approached or entered.", "that must be or worthy of being observed, noticed.", "much or large; considerable; substantial."]}, {"type": "noun", "defs": ["that which must be seen, noticed, observed, etc."]}], "ಗಮಲು": [{"type": "noun", "defs": ["a smell, whether pleasant or unpleasant; an odour."]}], "ಗಮಸಾಲೆ": [{"type": "noun", "defs": ["a kind of fragrant rice."]}], "ಗಮಾಡಿಸು": [{"type": "verb", "defs": ["= ಗಮಾಯಿಸು."]}], "ಗಮಾಯಿಸು": [{"type": "verb", "defs": ["to be fragrant; to emit or be emitting a sweet smell."]}], "ಗಮಾರ": [{"type": "noun", "defs": ["a country person, esp. one regarded as unsophisticated, simple, awkward, uncouth, etc,; a rustic."]}], "ಗಮಾರಿ": [{"type": "noun", "defs": ["Gmelina arborea ( = Premna arborea) , a medium to large sized deciduous tree of Verbenaceae family."]}], "ಗಮಿಯಿಸು": [{"type": "verb", "defs": ["= ಗಮಿಸು."]}], "ಗಮಿಸು": [{"type": "verb", "defs": ["to move (along, away, out etc.); to go.", "to become known; to come to (one's) notice."]}], "ಗಮ್ಮ": [{"type": "noun", "defs": ["much hotness; great warmth.", "the salty liquid given forth in drops through the pores of the skin; perspiration; sweat."]}], "ಗಮ್ಮಕುಚ್ಚು": [{"type": "verb", "defs": ["(the warmth or hotness) to be felt, experience."]}], "ಗಮ್ಮಗಾವು": [{"type": "noun", "defs": ["the heat, warmth of the summer season."]}], "ಗಮ್ಮತು": [{"type": "noun", "defs": ["= ಗಮ್ಮತ್ತು."]}], "ಗಮ್ಮತ್ತು": [{"type": "noun", "defs": ["showy display; snobbish behaviour; disdainful pride; haughtiness; snobbery.", "fun - a) lively, joyous play or playfulness; amusement, sport, recreation, etc.; b) enjoyment or pleasure.", "ಗಮ್ಮತ್ತುಮಾಡು gammattu māḍu to make fun for amusement (not seriously); to fun."]}], "ಗಮ್ಮನೆ": [{"type": "adverb", "defs": ["quickly; immediately; soon; at once.", "making no sound; silently; mutely."]}, {"type": "adverb", "defs": ["with fragrance; emitting a sweet smell."]}], "ಗಮ್ಮಿಡು": [{"type": "verb", "defs": ["to make a heavy but indistinct sound."]}], "ಗಮ್ಮು": [{"type": "noun", "defs": ["disdainful pride; haughtiness."]}], "ಗಮ್ಮುಟ್ಟು": [{"type": "verb", "defs": ["(sweat) to be given forth through the pores of the skin."]}], "ಗಮ್ಮೈಸು": [{"type": "verb", "defs": ["to have a strong feeling or emotion; excitement, anger, etc."]}], "ಗಮ್ಯ": [{"type": "adjective", "defs": ["that can be approached, reached, entered, etc.", "that can be easily understood; knowable; intelligible.", "fit for cohabitation or sexual relation."]}, {"type": "noun", "defs": ["the place toward which someone or something intends or has to go, is going or sent; the destination."]}], "ಗಮ್ಯಗಮಕಭಾವ": [{"type": "noun", "defs": ["(rhet.) the relation that exists between the knowable and the means of knowing."]}], "ಗಮ್ಯತೆ": [{"type": "noun", "defs": ["the act, fact of approaching, reaching or entering something.", "the quality, fact or condition of being approachable; accessibility."]}], "ಗಮ್ಯವಡು": [{"type": "verb", "defs": ["to be known, understood fully."]}], "ಗಮ್ಯಸ್ಥಾನ": [{"type": "noun", "defs": ["= ಗಮ್ಯ2."]}], "ಗಮ್ಯೆ": [{"type": "noun", "defs": ["a woman with whom a man can have sexual relation."]}], "ಗಯ": [{"type": "noun", "defs": ["a building for human beings to live in; a house.", "(collectively) the affairs connected with one's home; household; family matter.", "one's own house.", "much money or property; wealth.", "a descendant or descendants collectively; progeny.", "the sky."]}, {"type": "noun", "defs": ["a kind of bird."]}], "ಗಯಾ": [{"type": "noun", "defs": ["= ಗಯೆ."]}], "ಗಯಾವಳ": [{"type": "noun", "defs": ["a brāhmaṇa subsisting upon the offerings made by the pilgrims at Gaye, a pilgrimage city in Bihār in North India.", "(fig.) a man who gets money from others by begging persistently."]}], "ಗಯಾವಾಳ": [{"type": "noun", "defs": ["= ಗಯಾವಳ."]}], "ಗಯಾಳ": [{"type": "noun", "defs": ["a man who can be easily frightened; he who lacks self-confidence; a timid man; a coward.", "a man who pretends to be what he is not; a deceitful man; a hypocrite."]}], "ಗಯಾಳವಿದ್ಯ": [{"type": "noun", "defs": ["the practice or an instance of deception; trickery; the use of tricks."]}], "ಗಯೆ": [{"type": "noun", "defs": ["name of a holy city in Bihār, in North India."]}], "ಗಯ್ಯಾಳಿ": [{"type": "noun", "defs": ["an ill-natured, fierce, quarrelsome woman; a virago; a shrew; a fishwife."]}], "ಗಯ್ಯಾಳಿತನ": [{"type": "noun", "defs": ["quarrelsomeness, ill-nature of a woman."]}], "ಗರ": [{"type": "noun", "defs": ["any score shown by dice in games of chance, when rolled."]}, {"type": "noun", "defs": ["a large, opaque, non-luminous mass, usu. with its own moons, that revolves about a star; esp., any of the sun's nine major planets: Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, Neptune, and Pluto; a planet.", "(astrol.) any of the nine planets (the sun, moon, Mercury, Jupiter, Venus, Saturn, Rāhu and Kētu) which are supposed to influence and control the life of all human beings.", "an evil spirit that is believed to possess human beings; ಗರಂಗಳ ಬಲ್ಲಹ garangaḷa ballaha the prominent one among the nine planets; the sun; ಗರಂಗಳಾಣ್ಮ garangaḷāṇma the sun (as the leader of planets); ಗರಮುಟ್ಟು gara muṭṭu (an evil spirit) to affect adversely; to harm; ಗರಮುಟ್ಟೆ gara muṭṭe gowing to touch the sky (or a planet); ಗರವಕೊಳ್ garavakoḷ to be possessed by an evil spirit."]}, {"type": "noun", "defs": ["a building for human beings to live in; a house."]}, {"type": "noun", "defs": ["the act of drinking.", "that which can be drunk; any beverage, water, etc.", "a substance causing illness or death when eaten, drunk or absorbed even in relatively small quantities; poison.", "(astrol.) the fifth of the eleven divisions of the day."]}, {"type": "noun", "defs": ["a machine or device used for lifting water from a well."]}, {"type": "noun", "defs": ["an indeclinable used to express joy, gladness, appreciation, wonder, sarcasm, grief, etc."]}], "ಗರಂ": [{"type": "adjective", "defs": ["hot - a) having a high temperature, esp. one that is higher than that of the human body; b) characterised by a relatively or abnormally high temperature; very warm.", "angry - a) feeling, showing or resulting from anger; b) wild and stormy, as if angry.", "ಗರಂ ಆಗು garam āgu to become hot; to be heated; 2. to become angry."]}, {"type": "noun", "defs": ["much hotness; great warmth; heat.", "a feeling of displeasure resulting from injury, mistreatment, opposition, etc.; anger."]}], "ಗರಕ": [{"type": "adjective", "defs": ["absorbed deeply; engrossed (in)."]}], "ಗರಕರಣ": [{"type": "noun", "defs": ["(astrol.) the fifth of the eleven divisions of the day."]}], "ಗರಕಾಲಕಂಧರ": [{"type": "noun", "defs": ["(myth.) Śiva, whose throat is black with a deadly poison he drank."]}], "ಗರಕು": [{"type": "verb", "defs": ["to become black from excessive heat; to get charred."]}, {"type": "noun", "defs": ["roughness of a surface."]}, {"type": "noun", "defs": ["the quality of being black; blackness.", "that which is black."]}, {"type": "noun", "defs": ["the quality of being rough, hard; lack of smoothness; roughness."]}], "ಗರಕ್ಕನೆ": [{"type": "adverb", "defs": ["(turning, moving etc.) suddenly; quickly."]}], "ಗರಗ": [{"type": "noun", "defs": ["the plant Eclipta prostrata ( = E. alba) of Asteraceae family; weed-ham."]}], "ಗರಗಟೆ": [{"type": "noun", "defs": ["a kind of fish."]}], "ಗರಗಟ್ಟಿ": [{"type": "noun", "defs": ["(dial.) a liquid dish made using vegetables, used to mix with rice."]}], "ಗರಗಟ್ಟು": [{"type": "verb", "defs": ["to become stiff and brittle from drying.", "to be obstructed, impeded."]}], "ಗರಗತಿಗ": [{"type": "noun", "defs": ["the tree Pandanus fascicularis ( = P. odoratissimus, = P. tectorius) of Pandanaceae family; screw pine tree.", "its flower."]}], "ಗರಗತ್ತಿ": [{"type": "noun", "defs": ["the tree Ficus asperrima of Moraceae family, with soft wood, leaves of which are used for softening the surface of other woods, by rubbing on; sand-paper tree."]}], "ಗರಗರ": [{"type": "noun", "defs": ["the quality of a thing that pleases the senses, esp. of sight; beauty; loveliness.", "the quality or condition of being neat, clean or tidy; tidiness."]}, {"type": "adverb", "defs": ["a sound produced by a thing that is spinning or turning around its centre or axis."]}], "ಗರಗರನೆ": [{"type": "adverb", "defs": ["pleasingly; beautifully; in a lovely manner.", "in a more excellent manner; in a more suitable way."]}, {"type": "noun", "defs": ["(turning, rotating, etc.) rapidly; quickly; at speed."]}], "ಗರಗರಿ": [{"type": "noun", "defs": ["= ಗರಗರ1."]}], "ಗರಗರಿಕೆ": [{"type": "noun", "defs": ["a combination of qualities such as shape, colour, etc., that pleases the aesthetic senses, esp. the sight; beauty.", "the quality or state of being neat orderly or methodically arranged; tidiness.", "usefulness; comfortableness."]}, {"type": "noun", "defs": ["= ಗರಗರ2.", "the sound of sobbing."]}], "ಗರಗರಿಕೆವಡೆ": [{"type": "verb", "defs": ["to become beautiful; to be pleasing."]}], "ಗರಗರಿಸು": [{"type": "verb", "defs": ["to become or be made tidy."]}, {"type": "verb", "defs": ["to make ' ಗರಗರ ' sound (as the one made by a wheel turning with speed on its axis)."]}], "ಗರಗಸ": [{"type": "noun", "defs": ["a cutting tool, hand-operated or mechanical, having a blade with a series of sharp teeth, used to cut esp. wood with a to-and-fro or circular movement; a saw."]}, {"type": "noun", "defs": ["= ಗರಗತ್ತಿ.", "the tree Ficus cunia of Moraceae family; cluster fig."]}], "ಗರಗಸಮೀನು": [{"type": "noun", "defs": ["any of an order (Pristiformes) of large, tropical, shark-like rays, having the head prolonged into a flat, saw-like snout edged with large teeth on either side; a saw fish."]}], "ಗರಗಸವಳ್ಳಿ": [{"type": "noun", "defs": ["a kind of creeper."]}], "ಗರಗು": [{"type": "noun", "defs": ["= ಗರಗ."]}, {"type": "noun", "defs": ["the quality of being stiff and brittle, easily broken, snapped or crumbled; crispness.", "leaves that are fallen from the plants and dried."]}], "ಗರಗುವಡೆ": [{"type": "noun", "defs": ["a small, crisp, spicy cake, fried in oil."]}], "ಗರಗೆ": [{"type": "noun", "defs": ["a kind of bird."]}], "ಗರಗೊಬ್ಬಟ್ಟು": [{"type": "noun", "defs": ["a kind of crisp, sweet cake."]}], "ಗರಚಿ": [{"type": "noun", "defs": ["a kind of tree."]}], "ಗರಜ": [{"type": "noun", "defs": ["= ಗರಕರಣ."]}], "ಗರಜಾಕರಣ": [{"type": "noun", "defs": ["= ಗರಕರಣ."]}], "ಗರಜು": [{"type": "noun", "defs": ["anything that is inevitable, unavoidable, etc.; necessity; need."]}], "ಗರಜೆ": [{"type": "noun", "defs": ["= ಗರಕರಣ."]}], "ಗರಟಿಗೆ": [{"type": "noun", "defs": ["the act or fact of keeping awake and alert, in order to look after, protect or guard; a watch; a vigil.", "dizziness caused by spinning oneself or reeling of the head."]}], "ಗರಟಿಗೆಬರು": [{"type": "verb", "defs": ["to go round (a building, property, etc.) in order to keep watch; to guard.", "to have dizziness."]}], "ಗರಟೆ": [{"type": "noun", "defs": ["the hard outer case of a coconut nut kernel; coconut shell."]}, {"type": "noun", "defs": ["the bamboo Oxytenanthera monostigma of Graminae (Poaceae) family."]}], "ಗರಟ್ಟ": [{"type": "noun", "defs": ["a grinding stone usu. consisting of a manually operated stone disc rotating on its axis on another fixed stone disc.", "a man who destroys (others) completely."]}], "ಗರಡಬೇವು": [{"type": "noun", "defs": ["the tree Melia composita of Meliaceae family.", "another tree of the same family, Melia azedarach ( = Azadirachta indica)."]}], "ಗರಡಿ": [{"type": "noun", "defs": ["a place for living; a shelter; an abode.", "a room or building equipped for physical training and athletic games and sports; a gymnasium.", "physical or mental exertion; work; toil; labour.", "a shrine in a village for the departed soul.", "ಒಂದೇ ಗರಡಿಯಲ್ಲಿ ಕಲಿತವರು ondē garaḍiyalli kalitavaru men who know each other's trade secrets, techniques, strong and weak points, etc."]}], "ಗರಡಿಮನೆ": [{"type": "noun", "defs": ["= ಗರಡಿ -2 & 4."]}], "ಗರಡಿಯಾಳು": [{"type": "noun", "defs": ["= ಗರಡಿಸಾಧಕ."]}], "ಗರಡಿಸಾಧಕ": [{"type": "noun", "defs": ["an expert in gymnastics."]}], "ಗರಡಿಸಾಧನೆ": [{"type": "noun", "defs": ["physical training as in a gymnasium."]}], "ಗರಣ": [{"type": "noun", "defs": ["seizure - a) the act of one who seizes or an instance of this; b) the state or an instance of being seized.", "the obscuring of the light from one celestial body by the passage of another between it and the observer or between it and its source of illumination; an eclipse."]}], "ಗರಣೆ": [{"type": "noun", "defs": ["a coagulated mass (as of curds, over-cooked rice, etc.); a thick mass of coagulated liquid, esp. of blood; a clot.", "a paste applied to the central part of the skin or parchment of percussion instruments as mridanga, tabala. etc."]}], "ಗರಣೆಗಟ್ಟು": [{"type": "verb", "defs": ["to become a coagulated mass; to become thickened; to be clotted."]}], "ಗರಣೆಗೊಳ್": [{"type": "verb", "defs": ["= ಗರಣೆಗಟ್ಟು."]}], "ಗರತಿ": [{"type": "noun", "defs": ["a woman whokeeps the house.", "a chaste, virtuous woman."]}], "ಗರತಿಗೆಲಸ": [{"type": "noun", "defs": ["the household works a house-keeper."]}], "ಗರತಿತನ": [{"type": "noun", "defs": ["chastity, virtue of a household-woman."]}], "ಗರತಿಪ್ಪಾಳೆ": [{"type": "noun", "defs": ["a turning around rapidly of a child holding its arms, as play or for fun."]}], "ಗರತಿಹಾಡು": [{"type": "noun", "defs": ["a kind of folk song, sung by women."]}], "ಗರದ": [{"type": "noun", "defs": ["a man who feeds, administers poison."]}], "ಗರದಿ": [{"type": "adjective", "defs": ["large, huge; very big."]}, {"type": "noun", "defs": ["noise and unruly situation; loud and confusing noise.", "a condition marked by excited, enthusiastic movements."]}], "ಗರಧರ": [{"type": "noun", "defs": ["(myth.) Śiva, who holds in his throat a deadly poison which he drank."]}], "ಗರಪು": [{"type": "verb", "defs": ["to mark, break or cut the surface of slightly with or as with nails; to scratch.", "to tear or dig with or as with the nails or claws.", "to move the hand in a liquid, on the surface of something, as to find out something by the touch."]}], "ಗರಬಡಿ": [{"type": "verb", "defs": ["(an evil spirit) to possess a human being.", "to become completely perplexed or bewildered."]}], "ಗರಬಲ": [{"type": "noun", "defs": ["(astrol.) the favourable influence of a planet or planets."]}], "ಗರಬಾಡು": [{"type": "verb", "defs": ["to move the hand thoroughly in a liquid, on the surface of something, as to find out something by the touch."]}], "ಗರಬು": [{"type": "verb", "defs": ["= ಗರಪು."]}, {"type": "noun", "defs": ["= ಗರಸು."]}], "ಗರಭೃತ್ಕಟಕ": [{"type": "noun", "defs": ["Śiva who wears serpents as armlets."]}], "ಗರಮ್": [{"type": "adjective", "defs": ["hot - a) having a high temperature, esp. one that is higher than that of the human body; b) characterised by a relatively or abnormally high temperature; very warm.", "angry - a) feeling, showing or resulting from anger; b) wild and stormy, as if angry."]}, {"type": "noun", "defs": ["much hotness; great warmth; heat.", "a feeling of displeasure resulting from injury, mistreatment, opposition, etc.; anger."]}], "ಗರಮ": [{"type": "adjective", "defs": ["= ಗರಮ್1."]}, {"type": "noun", "defs": ["= ಗರಮ್2."]}], "ಗರಮಮಸಾಲೆ": [{"type": "noun", "defs": ["any of several vegetable substances, as cloves, cinnamon, nutmeg or pepper, used to season food; a hot spice."]}], "ಗರಮಾಗರಮ": [{"type": "noun", "defs": ["that which is piping hot."]}], "ಗರಮೀ": [{"type": "noun", "defs": ["much hotness; great warmth; heat.", "a disease transmitted only or chiefly by sexual intercourse with an individual infected, as syphilis or gonorrhoea."]}], "ಗರಮು": [{"type": "adjective", "defs": ["= ಗರಮ್1."]}, {"type": "noun", "defs": ["= ಗರಮ್2."]}], "ಗರಲ": [{"type": "noun", "defs": ["= ಗರಳ ."]}], "ಗರಲಕಂಧರ": [{"type": "noun", "defs": ["= ಗರಳಕಂಧರ."]}], "ಗರಲಗ್ರೀವ": [{"type": "noun", "defs": ["= ಗರಳಕಂಧರ."]}], "ಗರಲಧರ": [{"type": "noun", "defs": ["= ಗರಲಧರ."]}], "ಗರಲಪೂರ": [{"type": "noun", "defs": ["= ಗರಳಪೂರ."]}], "ಗರಲಭುಕ್ಕು": [{"type": "noun", "defs": ["= ಗರಳಭುಕ್ಕು."]}], "ಗರಲವಿಶಿಖ": [{"type": "noun", "defs": ["= ಗರಳವಿಶಿಖ."]}], "ಗರಲಾಭಿರಾಮ": [{"type": "noun", "defs": ["Śiva, whose throat is coloured by the poison he drank."]}], "ಗರಲಾಶನ": [{"type": "noun", "defs": ["= ಗರಳಭುಕ್ಕು."]}], "ಗರವಟ": [{"type": "noun", "defs": ["the act or fact of keeping awake and alert, in order to look after, protect or guard; a watch; a vigil.", "the act of rotating (oneself) rapidly."]}, {"type": "noun", "defs": ["a chart showing the positions of different planets in the sky."]}, {"type": "noun", "defs": ["a religious sacrifice performed in propitiation of a deity."]}], "ಗರವಟಿ": [{"type": "noun", "defs": ["= ಗರವಟ1 -1."]}], "ಗರವಟಿಗ": [{"type": "noun", "defs": ["a man hired to guard a building or other property against thieves, vandals or trespassers; a watchman; a guard."]}, {"type": "noun", "defs": ["a village servant whose duty is to channel and regulate water to agricultural fields."]}], "ಗರವಟಿಗೆ": [{"type": "noun", "defs": ["= ಗರವಟ1 -1.", "dizziness caused by spinning oneself or reeling of the head."]}], "ಗರವಟಿಗೆಬರು": [{"type": "verb", "defs": ["to go round (a building, property, etc.) in order to keep watch; to guard.", "(dizziness) to affect a person; to be felt."]}], "ಗರವಟಿಗೆವರ್": [{"type": "verb", "defs": ["= ಗರವಟಿಗೆಬರು."]}], "ಗರವಟಿಬರ್": [{"type": "verb", "defs": ["= ಗರವಟಿಗೆಬರು."]}], "ಗರವಟಿಸು": [{"type": "verb", "defs": ["to make a hole in or through with or as with a drill or other rotating tool; to bore; to drill.", "to go round (a building, property, etc.) in order to keep watch; to guard."]}], "ಗರವಟ್ಟ": [{"type": "noun", "defs": ["= ಗರವಟ3."]}], "ಗರವಟ್ಟಿಗೆ": [{"type": "noun", "defs": ["= ಗರವಟಿಗೆ."]}], "ಗರವಟ್ಟಿಗೆವರ್": [{"type": "verb", "defs": ["= ಗರವಟಿಗೆಬರು."]}], "ಗರವರ": [{"type": "noun", "defs": ["a most deadly venom."]}], "ಗರವರಿಸು": [{"type": "verb", "defs": ["= ಗರವಟಿಸು."]}], "ಗರವು": [{"type": "verb", "defs": ["to rob or despoil (a person or place) by force; to plunder; to rob.", "to attract; to pull towards."]}], "ಗರವೊಟ್ಟಿಗೆ": [{"type": "noun", "defs": ["= ಗರವಟಿಗೆ."]}], "ಗರವೊಡೆ": [{"type": "verb", "defs": ["= ಗರಹೊಡೆ."]}], "ಗರವೊಯ್": [{"type": "verb", "defs": ["= ಗರಹೊಡೆ."]}], "ಗರಸು": [{"type": "noun", "defs": ["a mixture of coarse sand and rock fragments; gravel.", "a piece of land having brown soil abounding in pebbles or small rock fragments."]}], "ಗರಸೆ": [{"type": "noun", "defs": ["a kind of flat, square bamboo basket.", "an apparatus made usu. of bamboo, used for winnowing; a winnow.", "a man who cannot keep secrets."]}], "ಗರಹರಣ": [{"type": "adjective", "defs": ["counteracting a poison."]}, {"type": "noun", "defs": ["that which is used as a remedy to counteract a poison; an antidote."]}], "ಗರಹರಣಮೂಲಿಕೆ": [{"type": "noun", "defs": ["any of the herbs used as an antidote."]}], "ಗರಹಿಡಿ": [{"type": "verb", "defs": ["= ಗರಹೊಡೆ."]}], "ಗರಹೊಡೆ": [{"type": "verb", "defs": ["(an evil spirit) to possess a human being.", "to overwhelmingly shock; to stun."]}], "ಗರಹೊಯ್": [{"type": "verb", "defs": ["= ಗರಹೊಡೆ."]}], "ಗರಳ": [{"type": "noun", "defs": ["a substance that when introduced into or absorbed by a living organism causes death or injury, esp. one that kills by rapid action even in a small quantity; a poison.", "the poison secreted by some snakes, introduced into the body of the victim by bite; venom."]}], "ಗರಳಕಂಧರ": [{"type": "noun", "defs": ["(myth.) Siva, whose throat is black with the deadly poison he drank.", "the throat (of Śiva) which holds the poison he drank."]}], "ಗರಳಗೊರಳ": [{"type": "noun", "defs": ["= ಗರಳಕಂಧರ - 1."]}], "ಗರಳಗೊರಳು": [{"type": "noun", "defs": ["= ಗರಳಕಂಧರ - 2."]}], "ಗರಳಗ್ರೀವ": [{"type": "noun", "defs": ["= ಗರಳಕಂಧರ."]}], "ಗರಳಧರ": [{"type": "noun", "defs": ["(myth.) Śiva, who holds in his throat a deadly poison which he drank."]}], "ಗರಳಪೂರ": [{"type": "noun", "defs": ["that which is venomous; a poisonous snake."]}], "ಗರಳಪ್ರಾಣಿ": [{"type": "noun", "defs": ["any venomous animal, as a snake, insect, etc."]}], "ಗರಳಭುಕ್ಕು": [{"type": "noun", "defs": ["Śiva, who drank poison."]}], "ಗರಳಭುಗ್ರಸನ": [{"type": "noun", "defs": ["Basava, one of the social reformers of Karnāṭaka of 12th century, who used to meditate on Śiva's name."]}], "ಗರಳವನಸ್ಪತಿ": [{"type": "noun", "defs": ["any of the plants that is poisonous."]}], "ಗರಳವಿಶಿಖ": [{"type": "noun", "defs": ["an arrow which has a poisonous point."]}], "ಗರಳಾಶನ": [{"type": "noun", "defs": ["= ಗರಳಭುಕ್ಕು."]}], "ಗರಳು": [{"type": "noun", "defs": ["the throat - a) the front part of the neck; b) the upper part of the passage leading from the mouth and nose to the stomach and lungs, including the pharynx and the upper larynx, trachea, and oesophagus."]}], "ಗರಳು ತಿರುಗು": [{"type": "verb", "defs": ["= ಗರಳೊಡೆ."]}], "ಗರಳುಲಿ": [{"type": "noun", "defs": ["sound made through the mouth, esp. by human beings in talking, singing, etc.; voice."]}], "ಗರಳೆ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಗರಳೊಡೆ": [{"type": "verb", "defs": ["(the voice of a boy) to change (on attaining the teenage) and start becoming man-like."]}], "ಗರಾಣ": [{"type": "noun", "defs": ["(correctly, ಘರಾನ) 1. a family, lineage.", "a school (as of music, painting, etc.) maintaining some traditions peculiar to it, which makes it different from other such schools."]}], "ಗರಾವು": [{"type": "noun", "defs": ["the ghost of a person who committed suicide by hanging oneself."]}], "ಗರಿ": [{"type": "noun", "defs": ["any of the growths covering the body of a bird or making up a large part of the wing surface, as down or contour feathers; a feather.", "a feather or featherlike part fastened to the shaft of an arrow to help control its flight.", "an arrow.", "the leaf of a palm tree.", "a petal of a flower.", "a rectangular piece of paper, esp. one of a number of pieces cut to a definite, uniform size, and bound together making a book; a sheet of paper."]}], "ಗರಿಕಟ್ಟು": [{"type": "verb", "defs": ["= ಗರಿಗಟ್ಟು."]}], "ಗರಿಕಟ್ಟೆ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಗರಿಕು": [{"type": "verb", "defs": ["to become black from excessive heat; to get charred."]}], "ಗರಿಕೆ": [{"type": "noun", "defs": ["(in gen.) any green grass that cattle, buffalo eat.", "the grass Cynodon dactylon ( = Panicum dactylon) of Poaceae family."]}], "ಗರಿಗ": [{"type": "noun", "defs": ["a kind of bird ; or a bird, in gen. (582-45)?."]}], "ಗರಿಗಂಟಿ": [{"type": "noun", "defs": ["= ಗರಿಗಂಟೆ."]}], "ಗರಿಗಂಟೆ": [{"type": "noun", "defs": ["the tree Nothapodytes foetida ( = Mappia foetida) of Ocacinaceae family; fetid holly."]}], "ಗರಿಗಟ್ಟು": [{"type": "verb", "defs": ["to fasten a feather or featherlike part to the shaft of an arrow.", "(fig.) to become strong; to be strengthened.", "(fig.) to become enthusiastic or elated."]}], "ಗರಿಗಣ್": [{"type": "noun", "defs": ["the spot on a peacock's tail feather.", "a peacock."]}], "ಗರಿಗಣ್ವಕ್ಕಿ": [{"type": "noun", "defs": ["a peacock."]}], "ಗರಿಗರಿಲ್": [{"type": "noun", "defs": ["the metallic sound of weapons as of swords.", "a sound imitating it."]}], "ಗರಿಗೆ": [{"type": "noun", "defs": ["a round vessel of any size, made of earthenware, with a small mouth, used for holding liquids; a pot."]}], "ಗರಿಗೆಡು": [{"type": "verb", "defs": ["(said of a bird) to lose feathers from the wing.", "(fig.) to lose one's natural strength."]}], "ಗರಿಗೆದರ್": [{"type": "verb", "defs": ["= ಗರಿಗೆದರು."]}], "ಗರಿಗೆದರು": [{"type": "verb", "defs": ["to spread (one's) plumage (as a peacock while dancing).", "(fig.) to become enthusiastic from encouragement, joy, success, etc."]}], "ಗರಿಗೊಳ್ಳು": [{"type": "verb", "defs": ["to have wings or wing-like devices that helps one fly.", "(fig.) to become enthusiastic from encouragement, joy, success, etc."]}], "ಗರಿಟೋಪಿ": [{"type": "noun", "defs": ["a cap having a feather or feathers on it; a feathered cap."]}], "ಗರಿಣಿ": [{"type": "noun", "defs": ["a woman, esp. a married woman, whose principal occupation is managing a household and taking care of domestic affairs."]}], "ಗರಿತುಂಬು": [{"type": "verb", "defs": ["(said of a bird) (feathers) to develop.", "(fig.) (one's natural strength) to develop."]}], "ಗರಿತೆಗೆ": [{"type": "verb", "defs": ["= ಗರಿಗೆದರು."]}], "ಗರಿಪೂ": [{"type": "noun", "defs": ["the flower of the tree Pandanus fascicularis ( = P. odoratissimus, = P. tectorius) of Pandanaceae family; screw pine flower."]}], "ಗರಿಬಿಚ್ಚು": [{"type": "verb", "defs": ["= ಗರಿಗೆದರು."]}], "ಗರಿಮ": [{"type": "noun", "defs": ["= ಗರಿಮೆ."]}], "ಗರಿಮರಿ": [{"type": "noun", "defs": ["= ಗರಿಮುರಿ."]}], "ಗರಿಮಾವಾಪ್ತಿ": [{"type": "noun", "defs": ["the act or fact of getting importance, dignity, venerableness or excellence."]}], "ಗರಿಮುರಿ": [{"type": "noun", "defs": ["the quality or condition of starched, pressed clothes, that are stiff.", "the quality of a dish that is stiff, brittle, and crisp; crispness."]}], "ಗರಿಮೂಡು": [{"type": "verb", "defs": ["(feathers) to be put forth; to make the wings strong (as to enable a bird fly).", "(fig.) (zeal, enthusiasm, etc.) to become more; (spirit) to be raised."]}], "ಗರಿಮೆ": [{"type": "noun", "defs": ["the quality of being heavy; heaviness; weight.", "any of the qualities as being important, venerable, worthy of, excellent, etc.", "an art of making, at will, oneself heavier than naturally one is, one of the eight yogic accomplishments."]}], "ಗರಿಯ": [{"type": "noun", "defs": ["an important, venerable man; a man of excellence."]}], "ಗರಿಯವರೆ": [{"type": "noun", "defs": ["a kind of bean plant."]}], "ಗರಿಯಿಕ್ಕು": [{"type": "verb", "defs": ["to put forth feathers; (the wing of a bird) to become strong.", "(fig.) to gain strength."]}], "ಗರಿಯೊಡೆ": [{"type": "verb", "defs": ["= ಗರಿಯಿಕ್ಕು."]}], "ಗರಿಲನೆ": [{"type": "adverb", "defs": ["with a sound (as the one made by a strong flame)."]}], "ಗರಿಷ್ಠ": [{"type": "adjective", "defs": ["hard to lift or move because of great weight; weighty; heavy.", "of much significance, importance.", "worthy of respect or reverence; venerable; having dignity.", "greatest possible, permissible or reached; maximum."]}, {"type": "noun", "defs": ["that which is heavy.", "that which is significant, important.", "a venerable, respectable man.", "the largest of a specified set of real numbers."]}], "ಗರಿಷ್ಠಬಿಂದು": [{"type": "noun", "defs": ["(math.) the value of available when it ceases to increase and begins to diminish."]}], "ಗರಿಹೊಯ್": [{"type": "verb", "defs": ["to flap the wings (as in flying).", "to become more, strong, etc."]}], "ಗರೀಬ": [{"type": "noun", "defs": ["a man lacking the necessities of life or living in complete poverty; a poor man."]}], "ಗರೀಬಿ": [{"type": "noun", "defs": ["the condition or quality of being poor; indigence; poverty."]}], "ಗರೀಯ": [{"type": "adjective", "defs": ["heavy or heavier.", "having much significance, consequence, value or important.", "worthy of respect or reverence; venerable."]}], "ಗರುಕ": [{"type": "noun", "defs": ["the tree Celtis tetrandra of Ulmaceae family; lotus tree."]}], "ಗರುಕು": [{"type": "noun", "defs": ["the quality of being black; blackness.", "that which is black."]}, {"type": "noun", "defs": ["the quality of being rough, hard; lack of smoothness; roughness."]}], "ಗರುಕೆ": [{"type": "noun", "defs": ["= ಗರಿಕೆ."]}], "ಗರುಗ": [{"type": "noun", "defs": ["the plant Eclipta prostrata ( = E. alba) of Asteraceae family; weed-ham."]}], "ಗರುಗಲು": [{"type": "noun", "defs": ["= ಗರುಗ."]}, {"type": "noun", "defs": ["the state of (something) having lost weight by excessive drying."]}], "ಗರುಗು": [{"type": "noun", "defs": ["the quality of being stiff and brittle, easily broken, snapped or crumbled; crispness.", "leaves that are fallen from the plants and dried."]}], "ಗರುಗೊಡೆ": [{"type": "noun", "defs": ["a small, crisp, spicy cake, fried in oil."]}], "ಗರುಡ": [{"type": "noun", "defs": ["the Brahmini kite, Haliastur indus, an accipitrine bird with long, pointed wings, forked tail and white neck.", "(myth.) the king of birds, which is used by Viṣṇu as his vehicle.", "the symbol for the number one.", "any of a family (Bucerotidae) of large, tropical, Old World coraciiform birds with partly united toes and a huge, curved bill, often with a bony protuberance; a hornbill.", "a particular military array.", "a soldier, body-guard or servant of a king who has taken an oath that he would die immediately following the death of his master.", "the tradition of such a soldier, bodyguard or servant.", "a particular class of gods.", "(dance.) one of the twenty three postures.", "(dance.) one of the twenty four hand gestures (gesture with both the hands as held together in worship).", "the constellation in the Milky Way, nearly centered on the celestial equator, consisting of the star Altair; Aquila; ಗರುಡನ ಗೆರೆ garuḍana gere = ಗರುಡರೇಖೆ."]}], "ಗರುಡಕಂಭ": [{"type": "noun", "defs": ["= ಗರುಡಗಂಬ."]}], "ಗರುಡಕಾರೆ": [{"type": "noun", "defs": ["the plant Gardenia uliginosa ( = Randia uliginosa) of Rubiaceae family."]}], "ಗರುಡಗಂಬ": [{"type": "noun", "defs": ["a tall stone pillar, with bells at the top, erected in front of a temple (usu. of Viṣṇu).", "a stone pillar planted in memory of a person who committed suicide following his masteṛs death.", "a pillar (to which the accused person would be tied) in front of a village office where, in the erstwhile system, the accused persons were tried.", "a metal stand with a votive lamp and an idol of brahminee kite is inset.", "(fig.) a very tall person."]}], "ಗರುಡಗಂಭ": [{"type": "noun", "defs": ["= ಗರುಡಗಂಬ."]}], "ಗರುಡಗಣ್ಣು": [{"type": "noun", "defs": ["(fig.) ability to see keenly, like a hawk; a keen-sight; hawk-eye."]}], "ಗರುಡಗಮನ": [{"type": "noun", "defs": ["Viṣṇu, whose vehicle is Garuḍa, the king of birds."]}], "ಗರುಡಗಾಂಧಾರಿ": [{"type": "noun", "defs": ["(arch.) a musical mode."]}], "ಗರುಡಗಾಮಿ": [{"type": "noun", "defs": ["= ಗರುಡಗಮನ."]}], "ಗರುಡಘೋಟಕ": [{"type": "noun", "defs": ["= ಗರುಡಗಮನ."]}], "ಗರುಡತುರಂಗ": [{"type": "noun", "defs": ["= ಗರುಡಗಮನ."]}], "ಗರುಡದೃಷ್ಟಿ": [{"type": "noun", "defs": ["= ಗರುಡಗಣ್ಣು."]}], "ಗರುಡಧ್ವಜ": [{"type": "noun", "defs": ["a banner with the figure of Brahminee kite (Garuḍa).", "Viṣṇu, who has Garuḍa's figure in his banner."]}], "ಗರುಡಧ್ವನಿ": [{"type": "noun", "defs": ["(mus.) a mode, derived from the main mode Dhīra Śankarābharaṇa, having only five notes in the descending order."]}], "ಗರುಡಪಂಚಮಿ": [{"type": "noun", "defs": ["the fifth day of Śrāvaṇa, the fifth month in Hindu lunar calendar.", "a festival observed on this day."]}], "ಗರುಡಪಕ್ಷ": [{"type": "noun", "defs": ["(dance.) one of the hand gestures."]}], "ಗರುಡಪಚ್ಚೆ": [{"type": "noun", "defs": ["a bright-green, transparent precious stone (beryllium aluminium silicate); emerald, green variety of beryl."]}], "ಗರುಡಪತತ್ರಿ": [{"type": "noun", "defs": ["a Garuḍa, Brahminee kite.", "an arrow shot with a mystic hymns that was believed to counteract the effect of an arrow shot by one's enemy, that would inflict the snake venom."]}], "ಗರುಡಪಾತಾಳ": [{"type": "noun", "defs": ["the plant Rauwolfia serpentina ( = Ophioxylon serpentinum) of Apocynaceae family, the reserpine, an alkaloid extracted from the roots of which is used as a sedative in treating hypochondria, insomnia, insanity.", "the plant Ophiorrhiza mungos of Rubiaceae family; Indian snake root plant.", "a hook used to catch and pick up things from under water, that is deep."]}], "ಗರುಡಪಾತಾಳಿ": [{"type": "noun", "defs": ["= ಗರುಡಪಾತಾಳ - 3."]}], "ಗರುಡಪಾಳಿ": [{"type": "noun", "defs": ["= ಗರುಡಧ್ವಜ- 1."]}], "ಗರುಡಪೀಠ": [{"type": "noun", "defs": ["the base stone on which the Viṣṇu idol is installed in a temple."]}], "ಗರುಡಪುರಾಣ": [{"type": "noun", "defs": ["one of eighteen sacred scriptures (purāṇas) of Hindus, dealing with obsequies."]}], "ಗರುಡಪ್ಲುತ": [{"type": "noun", "defs": ["(dance.) a gesture in which both hands are brought near the respective flanks, one leg is bent backward, and chest is pushed forward."]}], "ಗರುಡಫಲ": [{"type": "noun", "defs": ["the tree Hydnocarpus venenata of Flacourticaceae family.", "another tree Hydnocarpus laurifolia ( = H. Wightiana) of the same family, yielding chaulmoogric acid; hydnocarpus."]}], "ಗರುಡಬಾಣ": [{"type": "noun", "defs": ["= ಗರುಡಪತತ್ರಿ - 2."]}], "ಗರುಡಬೇವು": [{"type": "noun", "defs": ["the deciduous tree Melia azedarach of Meliaceae family, that grows to medium size, the root of which is used as vermicide."]}], "ಗರುಡಮಂತ್ರ": [{"type": "noun", "defs": ["a hymn propitiating Garuḍa, the king of birds, which is believed to counteract a poison inflicted by a snake-bite."]}], "ಗರುಡಮಚ್ಚೆ": [{"type": "noun", "defs": ["a particular kind of mole on the skin (it is believed that snakes will never bite a person having such a mole)."]}], "ಗರುಡಮಣಿ": [{"type": "noun", "defs": ["a gem the touch of which is believed to act as a remedy for venomous snake-bites."]}], "ಗರುಡಮುದ್ರೆ": [{"type": "noun", "defs": ["a particular hand gesture made while worshipping Viṣṇu."]}], "ಗರುಡಮೂಗು": [{"type": "noun", "defs": ["a nose that is curved like a hook; aquiline nose.", "the plant Martynia annua of Martyniaceae family; tigeṛs nail plant.", "ಗರುಡಮೂಗಿನ ಆಮೆ garuḍa mūgina āme the turtle Eretmochelys imbricata of Cheloniidae family, of medium size, having a hawk-like beak and a horny shell; hawk's-bill turtle."]}], "ಗರುಡರಥ": [{"type": "noun", "defs": ["Viṣṇu, whose vehicle is Garuḍa, the king of birds."]}], "ಗರುಡರೇಖೆ": [{"type": "noun", "defs": ["a line of the palm which is believed to scare snakes."]}]}