{"ಜಾಱುವಲೆ": [{"type": "noun", "defs": ["a kind of net used by animal catchers."]}], "ಜಾಱುವೊಯ್ಲು": [{"type": "noun", "defs": ["a stroke with deflected impact; a glancing stroke."]}], "ಜಾಱುವೋಗು": [{"type": "verb", "defs": ["to run away; to go or ran back; to withdraw (oneself)."]}], "ಜಾೞಿಗೆ": [{"type": "noun", "defs": ["cloth articles, designed to cover, protect or adorn the body; wearing apparel; garments; clothes."]}], "ಜಿಂಕರ": [{"type": "noun", "defs": ["a kind of musical instrument, now extinct."]}], "ಜಿಂಕರಿಸು": [{"type": "verb", "defs": ["to praise; to laud; to extol."]}], "ಜಿಂಕುವರಿ": [{"type": "verb", "defs": ["(said of flies) to gather and fly off in a swarm with a continuous murmuring sound."]}], "ಜಿಂಕೆ": [{"type": "noun", "defs": ["any of ruminants of Corvidae family, as Axis axis (spotted deer), mule deer, etc."]}], "ಜಿಂಗಿ": [{"type": "noun", "defs": ["the plant Oldenlandia biflora of Rubiaceae family.", "the plant Rubia cordifolia (= R. munjista) of Rubiaceae familly; Indian madder."]}, {"type": "noun", "defs": ["(dial.) a feeling of wild excitement caused by consumption of alcoholic drinks; intoxication."]}], "ಜಿಂಗಿಸಿ": [{"type": "noun", "defs": ["the tree Lannea coromandelica (= Odina woodier) of Anacardiaceae family; Indian ash tree."]}], "ಜಿಂಜರಗಿ": [{"type": "noun", "defs": ["a kind of plant ."]}], "ಜಿಂಜಿಣಿ": [{"type": "noun", "defs": ["great warmth; heat; hotness."]}], "ಜಿಂಜಿತ": [{"type": "noun", "defs": ["a gesture, deliberate or not, indicating one's sexual desire (to a person of the opposite sex)."]}], "ಜಿಂಜಿತಂಗೆಯ್": [{"type": "verb", "defs": ["to make a gesture indicating, expressing one's sexual desire."]}], "ಜಿಂಜಿರ": [{"type": "noun", "defs": ["a very thin, emaciated man."]}], "ಜಿಂಜಿರಿ": [{"type": "noun", "defs": ["a fetter or shackle for the hands or feet.", "a complicated situation getting out of from which is difficult."]}], "ಜಿಂಜಿರಿಸಂಕಲೆ": [{"type": "noun", "defs": ["a pair of fetters or shackles that is connected by a chain."]}], "ಜಿಂದಗಾನಿ": [{"type": "noun", "defs": ["= ಜಿಂದಗಿ."]}], "ಜಿಂದಗಿ": [{"type": "noun", "defs": ["a thing or things owned (by a person); possessions collectively; property.", "the life of a person.", "its duration."]}], "ಜಿಂದಾಬಾದ್": [{"type": "noun", "defs": ["a hailing."]}, {"type": "interjection", "defs": ["a hailing cry 'victory unto thee!."]}], "ಜಿಂದಿಗಿ": [{"type": "noun", "defs": ["= ಜಿಂದಗಿ."]}], "ಜಿಂದಿಗೆ": [{"type": "noun", "defs": ["= ಜಿಂದಗಿ."]}], "ಜಿಂಹ": [{"type": "noun", "defs": ["disinclination to activity or exertion; laziness; indolence."]}], "ಜಿಂಹಭಾವ": [{"type": "noun", "defs": ["the attitude of a person who is lazy or indolence."]}], "ಜಿಕಿಜಿಕಿ": [{"type": "noun", "defs": ["(dial.) the quality or tendency of a person who gives or spends grudgingly or only through necessity; a miserliness; stinginess."]}], "ಜಿಕೀರಿ": [{"type": "noun", "defs": ["a persistence or haggling by a buyer for reduction of price or for additional quantities for the same price."]}], "ಜಿಕೇರಿ": [{"type": "noun", "defs": ["= ಜಿಕೀರಿ."]}], "ಜಿಕ್ಕಿಣಿ": [{"type": "noun", "defs": ["the ghost of a woman who died while her husband was alive."]}], "ಜಿಕ್ಕು": [{"type": "noun", "defs": ["that which is very young or immature."]}], "ಜಿಖೀರಿ": [{"type": "noun", "defs": ["= ಜಿಕೀರಿ."]}], "ಜಿಗಟ": [{"type": "noun", "defs": ["one who clings to or follows persistently another (for something).", "a stingy man; a miser."]}], "ಜಿಗಟು": [{"type": "verb", "defs": ["= ಜಿಗುಟು1."]}, {"type": "noun", "defs": ["= ಜಿಗುಟು2."]}], "ಜಿಗಟುಮಣ್ಣು": [{"type": "noun", "defs": ["a firm, fine-grained earth, plastic when wet, composed chiefly of hydrous aluminium silicate minerals; clay."]}], "ಜಿಗಣ": [{"type": "noun", "defs": ["a dancing to the rhythm of drum-beatings."]}], "ಜಿಗಣೆ": [{"type": "noun", "defs": ["any of annelid, bloodsucking worms of Hirudinea subclass, living in water or wet earth and having a well-developed sucker at each end, and one species of which (Hirudo medicinalis) has been used in medicine, esp. in former times, to bleed patients; a leech.", "(fig.) an irritatingly persistent person.", "(fig.) a person who extorts ruthlessly as much as possible from another."]}, {"type": "noun", "defs": ["a kind of powder, that gives a sparkling effect when sprinkled on a surface."]}], "ಜಿಗಳಿ": [{"type": "noun", "defs": ["= ಜಿಗಣೆ1."]}], "ಜಿಗಳು": [{"type": "noun", "defs": ["a narrow water-passage; a channel."]}], "ಜಿಗಳೆ": [{"type": "noun", "defs": ["= ಜಿಗಣೆ1."]}], "ಜಿಗಿ": [{"type": "verb", "defs": ["to spring clear of the ground or other support by a sudden muscular effort; to leap; to jump."]}, {"type": "noun", "defs": ["any of various adhesives, made from casein, resin, etc. or obtained from the acacia trees.", "a plant disease affecting cotton plants, characterised by the appearance of masses of black spores which usu. break up into a fine powder; smut disease.", "ಜಿಗಿ ಬೀಳು jigi bīḷu to remain persistently attached or in close association; to cling to."]}], "ಜಿಗಿತ": [{"type": "noun", "defs": ["an act of jumping; a jump.", "a descent by parachute from an airplane.", "any of several sports competitions featuring a leap, spring or bound.", "a sudden rise in amount, price, etc.", "an abrupt transition from one point or thing to another, with omission of what intervenes."]}], "ಜಿಗಿದೋಱು": [{"type": "verb", "defs": ["to become adhesive, sticky."]}], "ಜಿಗಿಬಾಲ": [{"type": "noun", "defs": ["any of an order (Collembola) of small, primitive, wingless insects, able to leap great distances by the sudden release of a forklike, abdominal appendage; a spring-tail."]}], "ಜಿಗಿಲ್": [{"type": "verb", "defs": ["to become sticky, viscous.", "to stick (oneself) to; to adhere to.", "to become compassionate, sympathising, pitying.", "to be stuck in a problem; to entangle oneself in."]}], "ಜಿಗಿಲು": [{"type": "noun", "defs": ["the quality or fact of being viscous, adhesive.", "the relation between two persons that is firm and cohesive."]}], "ಜಿಗೀಷು": [{"type": "adjective", "defs": ["having desire to win."]}, {"type": "noun", "defs": ["a man having desire to win."]}], "ಜಿಗೀಷೆ": [{"type": "noun", "defs": ["a desire to win.", "a vocation or occupation of one's life."]}], "ಜಿಗುಟು": [{"type": "verb", "defs": ["to squeeze or compress tightly between the thumb, and a finger (to inflict pain); to nip; to pinch.", "to cut, take off by nipping with one's nails."]}, {"type": "noun", "defs": ["an adhesive substance; a glue.", "a kind of glue used to catch birds.", "the quality of being adhesive; adhesiveness.", "the attitude of facing and dealing with anything recognised as dangerous, difficult or painful, instead of withdrawing from it; braveness; courage; fearlessness."]}], "ಜಿಗುಟುತನ": [{"type": "noun", "defs": ["the quality of being adhesive, cohesive; adhesiveness; cohesiveness.", "the quality of being stingy, miserly; stinginess; close-fistedness."]}], "ಜಿಗುಡು": [{"type": "noun", "defs": ["= ಜಿಗುಟು2."]}], "ಜಿಗುಣೆ": [{"type": "noun", "defs": ["= ಜಿಗಣೆ1."]}], "ಜಿಗುಪ್ಸೆ": [{"type": "noun", "defs": ["(correctly, ಜುಗುಪ್ಸೆ) 1. a shrinking from disgust; intense dislike or hatred; loathing; abhorrence.", "(rhet. & dance.) one of the main sentiments expressing this feeling."]}], "ಜಿಗುಪ್ಸೆಪಡು": [{"type": "verb", "defs": ["(correctly, ಜುಗುಪ್ಸೆಪಡು) to regard with extreme repugnance or aversion; to detest utterly; to loathe; to abominate; to abhor."]}], "ಜಿಗುರ್": [{"type": "verb", "defs": ["to be stuck to; to adhere oneself to; to be fastened by or as by gluing."]}], "ಜಿಗುರು": [{"type": "noun", "defs": ["a kind of glue applied on the branches of a tree, to catch birds."]}], "ಜಿಗುಳಿಗಂಟು": [{"type": "noun", "defs": ["= ಜಿಗುಳುಗಂಟು."]}], "ಜಿಗುಳು": [{"type": "noun", "defs": ["= ಜಿಗಳು."]}], "ಜಿಗುಳುಗಂಟು": [{"type": "noun", "defs": ["a knot made so that it will slip along the rope, etc. around which it is tied; a slip-knot."]}], "ಜಿಗುಳೆ": [{"type": "noun", "defs": ["= ಜಿಗಣೆ1."]}], "ಜಿಗುಱು": [{"type": "verb", "defs": ["to rub or scrape slightly, as with the fingernails, to relieve itching; to scratch."]}], "ಜಿಗುೞೆ": [{"type": "noun", "defs": ["= ಜಿಗಣೆ1."]}], "ಜಿಗ್ಗು": [{"type": "noun", "defs": ["a small, dry, woody piece fallen from a branch of a plant; a twig."]}], "ಜಿಘತ್ಸು": [{"type": "noun", "defs": ["a hungry person."]}], "ಜಿಘತ್ಸೆ": [{"type": "noun", "defs": ["the discomfort, pain or weakness caused by a compelling need for food; the need itself; hunger."]}], "ಜಿಘಾಂಸು": [{"type": "adjective", "defs": ["tending or desiring to kill.", "feeling or showing hate; hateful; vengeful; vindictive."]}, {"type": "noun", "defs": ["a person who hates another, and wishes or tries to injure him; an enemy."]}], "ಜಿಜಿಯಾ": [{"type": "noun", "defs": ["(hist.) an archaic tax levied by Muslim kings on their subjects, esp. on each Hindu individual."]}], "ಜಿಜ್ಞಾಸನ": [{"type": "noun", "defs": ["= ಜಿಜ್ಞಾಸೆ."]}], "ಜಿಜ್ಞಾಸು": [{"type": "noun", "defs": ["a man desirous of knowing by investigating, testing."]}], "ಜಿಜ್ಞಾಸೆ": [{"type": "noun", "defs": ["a strong desire for knowing; eagerness to learn; inquisitiveness.", "an investigation, examination to get information; a striving for knowledge."]}], "ಜಿಜ್ಞಾಸ್ಯ": [{"type": "noun", "defs": ["that which is fit to be known, investigated to know."]}], "ಜಿಟಿಜಿಟಿ": [{"type": "noun", "defs": ["the sound of rain drops falling continuously.", "a sound imitating it."]}], "ಜಿಟ್ಟಿ": [{"type": "noun", "defs": ["= ಜಿಟ್ಟೆ."]}, {"type": "noun", "defs": ["a small, inflamed swelling on the skin, with pus formed inside; a sty; an abscess."]}], "ಜಿಟ್ಟೆ": [{"type": "noun", "defs": ["any of numerous diurnal insects of the order Lepidoptera, characterised by clubbed antennae, a slender body, and large, broad, often conspicuously marked wings; a butterfly.", "any of various families (esp. Acrididae) of leaping, plant-eating orthopteran insects with powerful hind legs adapted for jumping; a grasshopper; a locust.", "(fig.) a person who flits aimlessly from one interest or group to another."]}], "ಜಿಡಿ": [{"type": "noun", "defs": ["a continuous drizzling of rain.", "the condition of a place being covered with clouds; cloudiness."]}, {"type": "noun", "defs": ["the tree anacardium occidentale of Anacardiaceae family; cashew tree.", "its fruit attached with the nut."]}], "ಜಿಡಿಮಳೆ": [{"type": "noun", "defs": ["a continuous drizzling of rain."]}], "ಜಿಡುಕು": [{"type": "noun", "defs": ["unpleasantness; mental irritation.", "annoyance caused by a repeated action; nuisance.", "a screaming from pain.", "a feeling of embarrassment."]}], "ಜಿಡ್ಡಿ": [{"type": "noun", "defs": ["a pair of coconuts tied together with their coir."]}], "ಜಿಡ್ಡು": [{"type": "noun", "defs": ["the quality of being sticky; stickiness (as of an oil, grease, etc.).", "the bad smell of stale fats or oils; rancid smell.", "(fig.) too high an opinion of oneself; self-conceit."]}], "ಜಿಡ್ಡುಗಂಬ": [{"type": "noun", "defs": ["a pole smeared with grease or oil, used in gymnastics; a greasy pole."]}], "ಜಿಡ್ಡುಗಟ್ಟು": [{"type": "verb", "defs": ["to become oily, greasy or be stuck with stubborn dirt."]}], "ಜಿಡ್ಡುಬ್ಬು": [{"type": "verb", "defs": ["to behave overbearingly or conceitedly."]}], "ಜಿಡ್ಡುಮುಳ್ಳು": [{"type": "noun", "defs": ["the small thorny plant Ziziphus horrida of Rhamnaceae family."]}], "ಜಿಡ್ಡೆಣ್ಣೆ": [{"type": "noun", "defs": ["any oil in its crude form; unrefined oil; crude oil."]}], "ಜಿಣುಗು": [{"type": "adjective", "defs": ["thin; slender; fine; tenuous; subtle.", "of the lowest degree; miserable; wretched; abject."]}], "ಜಿತ": [{"type": "noun", "defs": ["that which is conquered, subdued.", "that which is gained, acquired; a gain; an acquisition.", "that which is firm, stable."]}], "ಜಿತಕರ್ಮ": [{"type": "noun", "defs": ["a man who is not subject to or is above, the compulsion of Karma, the doctrine of action and its consequences."]}], "ಜಿತಕಾಮ": [{"type": "noun", "defs": ["one who has subdued Manmatha, the Love-God or passion, lust etc., referred to various gods or persons as Śiva, the Buddha, the Jaina spiritual teacher, a true ascetic, etc."]}], "ಜಿತಕಾಮೆ": [{"type": "noun", "defs": ["a woman who has subdued her passions, lust, etc.; a chaste, virtuous woman."]}], "ಜಿತಕಾಶಿ": [{"type": "noun", "defs": ["a man who has won, conquered; a conqueror."]}], "ಜಿತತ್ರಿತಾಪ": [{"type": "noun", "defs": ["he who has overcome or not subject to, any of the three kinds miseries, caused by the gods, physical world or practical situations and digression in the path of self-development, which the human beings have to suffer generally in this world."]}], "ಜಿತಪಡಿಸು": [{"type": "verb", "defs": ["to make (something) to be or become firm, stable; to fix firmly.", "to memorise (something) thoroughly."]}], "ಜಿತಪಡು": [{"type": "verb", "defs": ["to be or become firm or stable; to be fixed."]}], "ಜಿತಬುದ್ಧಿ": [{"type": "noun", "defs": ["the firm, unwavering mind.", "a resolute, determined person."]}], "ಜಿತಮನಸ್ಕ": [{"type": "noun", "defs": ["a man who has subdued his passions and has perfect control over his thoughts."]}], "ಜಿತಮನಸ್ಕೆ": [{"type": "noun", "defs": ["a woman who has subdued his passions and has perfect control over his thoughts."]}], "ಜಿತಮಾಯ": [{"type": "noun", "defs": ["he who has transcended the divine illusion."]}], "ಜಿತಸಂಸಾರಿ": [{"type": "noun", "defs": ["a person who has transcended the botherations of worldly life."]}], "ಜಿತಾಕ್ಷ": [{"type": "noun", "defs": ["= ಜಿತೇಂದ್ರಿಯ."]}], "ಜಿತಾಕ್ಷರ": [{"type": "noun", "defs": ["a man liberated from the worldly bonds; a sage."]}], "ಜಿತಾತ್ಮ": [{"type": "noun", "defs": ["a man who has restrained his passions, compelling emotions, excitements, etc. and has acquired the spiritual knowledge."]}], "ಜಿತೇಂದ್ರಿಯ": [{"type": "noun", "defs": ["a man who has restrained his passions, compelling emotions, excitements, etc."]}], "ಜಿತೇಂದ್ರಿಯತ್ವ": [{"type": "noun", "defs": ["the quality or fact of restraining one's passion, compelling emotions, excitements etc."]}], "ಜಿತ್ಯ": [{"type": "noun", "defs": ["the part of a plough or other agricultural tool that cuts the soil; a plough-share."]}], "ಜಿತ್ವರ": [{"type": "noun", "defs": ["a victorious man."]}], "ಜಿದ್ದು": [{"type": "noun", "defs": ["the return of an injury for an injury, in punishment or retribution; avenging of an injury or offence; revenge; vengeance.", "the desire to make such a return.", "a struggling for superiority with another; competition; vying.", "something, esp. money, bet as in a wager, game or contest; a stake.", "ಜಿದ್ದಾಜಿದ್ದಿ jiddājiddi an intense competition; ಜಿದ್ದಿಗೆ ಬೀಳು jiddige bīḷu to intensely work for returning an injury for an injury; ಜಿದ್ದು ಮಾಡು jiddu māḍu to work with a vengeful, vindictive attitude."]}], "ಜಿದ್ದುಕಟ್ಟು": [{"type": "verb", "defs": ["to declare something in or as in a bet; to bet."]}], "ಜಿದ್ದುತೀರಿಸು": [{"type": "verb", "defs": ["to inflict damage, injury or punishment in return for (an injury, insult, etc.); to take revenge; to retaliate for."]}], "ಜಿನ": [{"type": "adjective", "defs": ["of limited size; of comparatively restricted dimensions; not big; little; small."]}, {"type": "noun", "defs": ["that which is small in size; a little thing.", "a male child; a boy."]}, {"type": "adjective", "defs": ["won; victorious; triumphed.", "firmly established; not changing or fluctuating; fixed; stable."]}, {"type": "noun", "defs": ["a Buddhist or Jaina spiritual teacher.", "(Jain.) any of the twenty four recognised spiritual teachers.", "(Buddh.) Gautama Buddha, the founder of Buddhism.", "he who has subdued his worldly passions.", "Viṣṇu.", "a symbol for the number twenty-four."]}], "ಜಿನಂಗಿ": [{"type": "noun", "defs": ["the tree Sesbania paludosa of Papilonaceae family.", "the tree Sesbania sesban (=S. aegyptiaca) of the same family."]}], "ಜಿನಕ": [{"type": "noun", "defs": ["a kind of medicinal substance."]}], "ಜಿನಗಹಳೆ": [{"type": "noun", "defs": ["a kind of double-tube air horn used to make a long sound by blowing; a double-bugle."]}], "ಜಿನಗಾಳೆ": [{"type": "noun", "defs": ["= ಜಿನಗಹಳೆ."]}], "ಜಿನಗೇಹ": [{"type": "noun", "defs": ["a temple of a Jaina deity."]}], "ಜಿನಚೈತ್ಯ": [{"type": "noun", "defs": ["= ಜಿನಗೇಹ."]}], "ಜಿನಧರ್ಮ": [{"type": "noun", "defs": ["a religion founded in the 6th century B.C. as a revolt against the then prevelent Hinduism and emphasising the perfectibility of human nature and liberation of the soul, esp. through asceticism and non-violence toward all living creatures; Jainism."]}], "ಜಿನಮತ": [{"type": "noun", "defs": ["= ಜಿನಧರ್ಮ."]}], "ಜಿನಶಾಸನ": [{"type": "noun", "defs": ["the doctrines, tenets of Jainism; Jaina doctrine."]}], "ಜಿನಶಿ": [{"type": "noun", "defs": ["= ಜಿನಸು."]}], "ಜಿನಶಿಕಛೇರಿ": [{"type": "noun", "defs": ["the civil supplies department of the government."]}], "ಜಿನಸಮಯ": [{"type": "noun", "defs": ["= ಜಿನಧರ್ಮ.", "a follower of this religion."]}], "ಜಿನಸಮಯಿ": [{"type": "noun", "defs": ["= ಜಿನಸಮಯ - 2."]}], "ಜಿನಸಿ": [{"type": "noun", "defs": ["= ಜಿನಸು."]}], "ಜಿನಸು": [{"type": "noun", "defs": ["a material or materials needed commonly by common people, as grains, other food items, etc. sold in a store; goods.", "the seed of food-plants; grain.", "a class or group of individual objects, people, animals, etc., of the same nature or character or classified together because they have traits in common; a kind; a category.", "manner of behaving or acting; behaviour."]}], "ಜಿನಾಗಮ": [{"type": "noun", "defs": ["= ಜಿನಧರ್ಮ."]}], "ಜಿನಿಗಿಸು": [{"type": "verb", "defs": ["= ಜಿನುಗಿಸು."]}], "ಜಿನಿಜಿನಿ": [{"type": "noun", "defs": ["a kind of herb; (details?)."]}], "ಜಿನಿಸು": [{"type": "noun", "defs": ["= ಜಿನಸು."]}], "ಜಿನುಂಗು": [{"type": "verb", "defs": ["= ಜಿನುಗು1."]}, {"type": "noun", "defs": ["= ಜಿನುಗು2."]}], "ಜಿನುಗಿಸು": [{"type": "verb", "defs": ["to cause (someone or something) unmovable; to make inactive."]}], "ಜಿನುಗು": [{"type": "verb", "defs": ["(water or any other liquid) to come out, leak in drops through or as through small openings; to ooze.", "to rain in fine drops.", "to utter indistinct sound.", "(jaggery) to melt (absorbing moisture from the atmosphere.", "to be spoiled.", "to keep repeating several times what is said.", "to whisper or talk in a very low tone."]}, {"type": "noun", "defs": ["a drizzling rain.", "an indistinct sound.", "(fig.) a complicated and difficult situation."]}, {"type": "adjective", "defs": ["thin; slender; fine; tenuous; subtle.", "of the lowest degree; miserable; wretched; abject."]}, {"type": "noun", "defs": ["that which is slender, fine or subtle.", "a delicate, artistic work."]}], "ಜಿನುಗುಮತಿ": [{"type": "noun", "defs": ["a man of mean mentality and behaviour."]}], "ಜಿನುಗುವಳೆ": [{"type": "noun", "defs": ["a drizzling rain."]}], "ಜಿನುಗುವಾತು": [{"type": "noun", "defs": ["a low, whispering speech."]}], "ಜಿನುಗುವಾಸನೆ": [{"type": "noun", "defs": ["an unpleasant, stale smell; rancid smell."]}], "ಜಿನುಮಿನುಗು": [{"type": "verb", "defs": ["to glow with low intensity."]}], "ಜಿನೆ": [{"type": "noun", "defs": ["(dial.) a flight of stairs; a stairway; a staircase."]}], "ಜಿನ್ನ": [{"type": "adjective", "defs": ["worn out; no longer effective, usable or serviceable."]}, {"type": "noun", "defs": ["the condition of being worn-out, unserviceable, useless."]}, {"type": "noun", "defs": ["(Jain.) any of the twenty four recognised spiritual teachers."]}], "ಜಿನ್ನುನ್ನು": [{"type": "noun", "defs": ["the plant Fabraea obovata of Loganiaceae family; bastard cape jasmine."]}], "ಜಿನ್ನಸು": [{"type": "noun", "defs": ["= ಜಿನಸು."]}], "ಜಿನ್ನೀವಾಸ": [{"type": "noun", "defs": ["a room, building, etc. provided as accommodation for the parents and relatives of a bride-groom, in a marriage."]}], "ಜಿನ್ನು": [{"type": "noun", "defs": ["a machine for separating cotton fibres from the seeds; a ginning machine.", "a factory for separating cotton fibres from the seeds; a ginning factory."]}], "ಜಿನ್ನೆ": [{"type": "noun", "defs": ["= ಜಿನ್ನ3."]}, {"type": "noun", "defs": ["= ಜಿನೆ."]}], "ಜಿಪರಿ": [{"type": "noun", "defs": ["deranged or uncombed hair."]}], "ಜಿಪುಣ": [{"type": "noun", "defs": ["a greedy, stingy man who hoards money for its own sake, even at the expense of personal comfort; a miser."]}], "ಜಿಪುಣತನ": [{"type": "noun", "defs": ["the quality of giving or spending grudgingly or only through necessity; stinginess; miserliness."]}], "ಜಿಪುಣತೆ": [{"type": "noun", "defs": ["= ಜಿಪುಣತನ."]}], "ಜಿಪುಣಾಗ್ರೇಸರ": [{"type": "noun", "defs": ["a very greedy, stingy man."]}], "ಜಿಪುಣಿ": [{"type": "noun", "defs": ["= ಜಿಪುಣೆ."]}], "ಜಿಪುಣೆ": [{"type": "noun", "defs": ["a greedy, stingy woman who hoards money for its own sake, even at the expense of personal comfort; a miser."]}], "ಜಿಪ್ಪು": [{"type": "noun", "defs": ["the bottom surface of the foot; the sole."]}], "ಜಿಬಟ": [{"type": "noun", "defs": ["= ಜಿಪುಣ."]}], "ಜಿಬಟಿಗ": [{"type": "noun", "defs": ["the grass Leptochloa calycina of Poaceae family."]}], "ಜಿಬಟು": [{"type": "noun", "defs": ["the quality of being adhesive, cohesive; adhesiveness; cohesiveness.", "the quality of being stingy, miserly; stinginess; close-fistedness."]}], "ಜಿಬಡ": [{"type": "noun", "defs": ["a selfish man who lives in wretched circumstances in order to save and hoard money and is reluctant to spend; a miser."]}], "ಜಿಬಡು": [{"type": "noun", "defs": ["= ಜಿಬಟು."]}], "ಜಿಬಡುತನ": [{"type": "noun", "defs": ["= ಜಿಬಟು."]}], "ಜಿಬರು": [{"type": "noun", "defs": ["the watery discharge from the mucous membranes of the eyes; the rheum."]}], "ಜಿಬರೆ": [{"type": "noun", "defs": ["= ಜಿಬರು."]}], "ಜಿಬಳ": [{"type": "noun", "defs": ["= ಜಿಬ್ಬು."]}], "ಜಿಬಿ": [{"type": "noun", "defs": ["= ಜಿಬ್ಬು."]}], "ಜಿಬಿಲಿ": [{"type": "noun", "defs": ["a children's game in which a player tosses a small, flat object, as a stone, into one section after another of a figure drawn on the ground, hopping from section to section; hopscotch."]}], "ಜಿಬುರು": [{"type": "noun", "defs": ["= ಜಿಬರು."]}], "ಜಿಬ್ಬಳ": [{"type": "noun", "defs": ["= ಜಿಬ್ಬು."]}], "ಜಿಬ್ಬಳಿಕೆ": [{"type": "noun", "defs": ["= ಜಿಬ್ಬು."]}], "ಜಿಬ್ಬಿ": [{"type": "noun", "defs": ["= ಜಿಬ್ಬು."]}], "ಜಿಬ್ಬು": [{"type": "noun", "defs": ["the quality or condition of being sticky, viscous; stickiness.", "the white, viscous liquid flowing out from the stalk of a mango fruit when it is cut from the tree.", "any soft, moist, slippery, sometimes sticky matter, as soft mud, the mucous coating on fish, etc.; slime.", "the condition of (a fruit) being ripe and very soft to handle.", "the condition of being soft and shapeless; plasticity."]}], "ಜಿಬ್ಬೆ": [{"type": "noun", "defs": ["= ಜಿಬ್ಬು."]}], "ಜಿಬ್ಲಿ": [{"type": "noun", "defs": ["= ಜಿಬಿಲಿ."]}], "ಜಿಮಕಿ": [{"type": "noun", "defs": ["an earring with a hanging."]}], "ಜಿಮಿಗುಡು": [{"type": "verb", "defs": ["to become thoroughly wet, soft, and a shapeless mass (as the soft earth mixed with water)."]}], "ಜಿಮ್ಮಂಡೆ": [{"type": "noun", "defs": ["any of several jumping orthopterous insects of the family Gryllidae, commonly found in places where plants are thickly grown, and which make continuous jarring sound during night."]}], "ಜಿಮ್ಮಿ": [{"type": "noun", "defs": ["the tree Zanthoxylum armatum(= Z. alatum) of Rutaceae family."]}], "ಜಿಮ್ಮೆ": [{"type": "noun", "defs": ["the state of being under (another's) control or having (another or something) under one's control."]}], "ಜಿರಗುಟ್ಟು": [{"type": "verb", "defs": ["to make a creaking, grating or squeaking sound, as rusted hinges."]}], "ಜಿರಲೆ": [{"type": "noun", "defs": ["any of elongated, many-segmented, insect-eating arthropods of Chilopoda class, with a pair of legs to each segment; a centipede.", "any of an order (Blattaria) of insects with long antennae and a flat, soft body, some species of which are common h."]}], "ಜಿರಳೆ": [{"type": "noun", "defs": ["= ಜಿರಲೆ."]}], "ಜಿರಾ": [{"type": "noun", "defs": ["a defensive covering, usu. of metal, formerly worn by soldiers to protect the body in fighting; a body-armour."]}], "ಜಿರಾತಿ": [{"type": "noun", "defs": ["= ಜಿರಾಯಿತು."]}], "ಜಿರಾಪತಿ": [{"type": "adjective", "defs": ["= ಜಿರಾವರ್ತಿ."]}], "ಜಿರಾಫೆ": [{"type": "noun", "defs": ["either of two of existing animals species (genus Giraffa, family Giraffidae) of African ruminants, with a very long neck and legs, the tallest; giraffe."]}], "ಜಿರಾಯತ": [{"type": "noun", "defs": ["= ಜಿರಾಯಿತು."]}], "ಜಿರಾಯತಿ": [{"type": "noun", "defs": ["= ಜಿರಾಯಿತು."]}], "ಜಿರಾಯಿತ": [{"type": "noun", "defs": ["= ಜಿರಾಯಿತು."]}], "ಜಿರಾಯಿತದಾರ": [{"type": "noun", "defs": ["= ಜಿರಾಯಿತುದಾರ."]}], "ಜಿರಾಯಿತಿ": [{"type": "noun", "defs": ["= ಜಿರಾಯಿತು."]}], "ಜಿರಾಯಿತು": [{"type": "noun", "defs": ["work of cultivating the soil, producing crops; farming; agriculture; cultivation.", "a tract of land suitable for cultivation; arable land."]}], "ಜಿರಾಯಿತುದಾರ": [{"type": "noun", "defs": ["a man who farms or operates a farm or cultivates land; a farmer; an agriculturist."]}], "ಜಿರಾಯ್ತಿ": [{"type": "noun", "defs": ["= ಜಿರಾಯಿತು."]}], "ಜಿರಾವರ್ತಿ": [{"type": "adjective", "defs": ["full of force; powerful, vigorous, effective, etc. ."]}], "ಜಿರಿ": [{"type": "noun", "defs": ["that which is reduced to or fallen into partial ruin or decay, as from age, wear or neglect."]}], "ಜಿರಿಕೆ": [{"type": "noun", "defs": ["the act or an instance of making a creaking, grating or squeaking sound, as by rusted hinges."]}], "ಜಿರುದುಂಬಿ": [{"type": "noun", "defs": ["a kind of bee that makes continuous jarring sound."]}], "ಜಿರ್ಕರೆ": [{"type": "verb", "defs": ["(some kinds of bees) to make a jarring sound."]}], "ಜಿಲಿಬಿಲಿ": [{"type": "noun", "defs": ["= ಜಿಲೇಬಿ."]}], "ಜಿಲಿಬಿಲಿಗ": [{"type": "noun", "defs": ["any of several birds of the family Coraciidae, that tumble or roll over in flight as Coracias indica, Boracus Indica the flight of which is consulted as an omen or Coracias benghalensis, etc.; the Indian roller."]}], "ಜಿಲಿಬಿಲ್ಲಿ": [{"type": "noun", "defs": ["a children's play."]}], "ಜಿಲೀಪು": [{"type": "noun", "defs": ["= ಜಿಲೀಬಿ."]}], "ಜಿಲೀಬಿ": [{"type": "noun", "defs": ["the occupation or condition of a servant; service."]}], "ಜಿಲೀಬಿದಾರ": [{"type": "noun", "defs": ["a man employed to perform services, esp. household duties, for another; a servant."]}], "ಜಿಲೆಯ": [{"type": "noun", "defs": ["a defensive covering, usu. of metal, formerly worn by soldiers to protect the body in fighting; a body-armour."]}], "ಜಿಲೇಬಿ": [{"type": "noun", "defs": ["a kind of sweet-meat made of fine flour of wheat, fried in oil and soaked in sugar syrup."]}], "ಜಿಲೇವು": [{"type": "noun", "defs": ["brilliant or gorgeous appearance, brilliance; splendour."]}], "ಜಿಲ್ಲಡಿ": [{"type": "noun", "defs": ["the plant Calotropis gigantea (= C. procera) of Asclepiadaceae family; the sun plant."]}], "ಜಿಲ್ಲಬಿ": [{"type": "noun", "defs": ["= ಜಿಲೇಬಿ."]}], "ಜಿಲ್ಲಾ": [{"type": "noun", "defs": ["= ಜಿಲ್ಲೆ."]}], "ಜಿಲ್ಲಾಧಿಕಾರಿ": [{"type": "noun", "defs": ["the chief revenue officer of a district empowered to administer the law; the magistrate or commissioner of a district."]}], "ಜಿಲ್ಲಾಪರಿಷತ್ತು": [{"type": "noun", "defs": ["a body governing a district; a district council."]}], "ಜಿಲ್ಲಾಮಂಡಲಿ": [{"type": "noun", "defs": ["= ಜಿಲ್ಲಾಪರಿಷತ್ತು."]}], "ಜಿಲ್ಲಿ": [{"type": "noun", "defs": ["a small hole in an earthen vessel."]}], "ಜಿಲ್ಲಿಱಿ": [{"type": "verb", "defs": ["to make a sound similar to the one made by a gush of water."]}], "ಜಿಲ್ಲು": [{"type": "verb", "defs": ["(a liquid, mud etc.) to scatter or dash on; to splash."]}], "ಜಿಲ್ಲೆ": [{"type": "noun", "defs": ["an administrative division of a state; a district."]}], "ಜಿಲ್ಲೆದಾರ": [{"type": "noun", "defs": ["a town or village officer."]}], "ಜಿಲ್ಹೆ": [{"type": "noun", "defs": ["ಜಿಲ್ಲೆ."]}], "ಜಿವಿ": [{"type": "noun", "defs": ["the condition of a limb being weakened in or deprived of the power of feeling or moving; numbness."]}, {"type": "noun", "defs": ["the large-sized, evergreen tree Ficus retusa of Moraceae family."]}], "ಜಿವಿರು": [{"type": "verb", "defs": ["to rub or scrape slightly, as with the fingernails, to relieve itching; to scratch."]}], "ಜಿವಿಹಿಡಿ": [{"type": "verb", "defs": ["to make numb physically; to benumb."]}], "ಜಿವುಳಿ": [{"type": "noun", "defs": ["a sweetmeat made of fried sesame seeds with dry coconut kernel and jaggery."]}], "ಜಿವುಳಿದುೞಿ": [{"type": "verb", "defs": ["to trample with the foot or feet as to crush (something) and make it a shapeless mass."]}], "ಜಿಷ್ಣು": [{"type": "noun", "defs": ["a man who has won, conquered; a victor.", "a man who has subdued or has mastery over, his passions, as a Jaina spiritual teacher.", "Indra, the lord of heaven.", "Křṣṇa.", "Śiva.", "Arjuna, the hero of Mahābhārata, the Epic of India."]}], "ಜಿಷ್ಣುಚಾಪ": [{"type": "noun", "defs": ["an arc or circle that exhibits in concentric bands the colours of the spectrum and that is formed opposite the sun by the refraction and reflection of the suṇs rays in raindrops, spray or mist; a rain-bow."]}], "ಜಿಹಾಸೆ": [{"type": "noun", "defs": ["desire of abandoning or giving up.", "an intense or definite dislike; antipathy; aversion; repugnance."]}], "ಜಿಹ್ಮ": [{"type": "noun", "defs": ["a crooked thing.", "a lazy, indolent man."]}], "ಜಿಹ್ಮಗ": [{"type": "noun", "defs": ["a snake, which moves crookedly."]}], "ಜಿಹ್ಮೆ": [{"type": "noun", "defs": ["the act or an instance of cheating; deception; fraud.", "(dance.) a side glance with half-closed eyes, expressing weariness, inertia, etc."]}, {"type": "noun", "defs": ["one of the fourteen main veins of the body."]}], "ಜಿಹ್ವ": [{"type": "noun", "defs": ["= ಜಿಹ್ವೆ - 1."]}], "ಜಿಹ್ವಕ": [{"type": "noun", "defs": ["a kind of delirium characterised by inflammation of the body, the tongue becoming rough, temporary loss of consciousness, etc.", "one of the twelve kinds in kissing, touching the tongues mutually."]}], "ಜಿಹ್ವಾಚಾಪಲ್ಯ": [{"type": "noun", "defs": ["desire for eating with no restraint or restriction.", "desire or tendency of telling whatever one knows about a thing, event, etc."]}], "ಜಿಹ್ವಾಪ": [{"type": "noun", "defs": ["any of the animals that drink water by licking (as tiger, cat, dog, etc.)."]}], "ಜಿಹ್ವಾಪ್ರತ್ಯಕ್ಷ": [{"type": "noun", "defs": ["ascertaining of taste using one's tongue, as in licking, chewing, etc."]}], "ಜಿಹ್ವಾಬಂಧ": [{"type": "noun", "defs": ["the root of the tongue."]}], "ಜಿಹ್ವಾಮೂಲ": [{"type": "noun", "defs": ["= ಜಿಹ್ವಾಬಂಧ."]}], "ಜಿಹ್ವಾಮೂಲೀಯ": [{"type": "noun", "defs": ["(gram.) the aspirate that occurs before the consonant ಕ, ಖ, and the guttural class of consonants (the usage both in pronunciation and writing of which is now extinct)."]}], "ಜಿಹ್ವಾಮೇಳನಕ": [{"type": "noun", "defs": ["one of the twelve kinds in kissing, twisting mutually the tongues while kissing."]}], "ಜಿಹ್ವಾಲಸ": [{"type": "noun", "defs": ["a kind of tongue disease characterised by swelling."]}], "ಜಿಹ್ವಸ್ತಂಭ": [{"type": "noun", "defs": ["the impairment of the tongue, reducing it unable to utter any speech."]}], "ಜಿಹ್ವೆ": [{"type": "noun", "defs": ["the movable muscular structure attached to the floor of the mouth which is an important organ in the ingestion of food, the perception of taste, and the articulation of speech sounds, in human; the tongue.", "similar organ in some other animals.", "the flame of fire.", "the feeling of something( esp. of eatables) sensed by the taste buds of the tongue; taste."]}], "ಜಿಱಲೆ": [{"type": "noun", "defs": ["= ಜಿರಲೆ."]}], "ಜಿಱಿಲೆ": [{"type": "noun", "defs": ["= ಜಿರಲೆ."]}], "ಜೀ": [{"type": "noun", "defs": ["an owner of a slave; an employer of workers or servants; a master; a boss.", "a term used to convey the sense of agreement, consent, affirmation to one's master, elder, etc.; (equivalent to English words 'yeś 'okay', etc.).", "a speech lauding, praising another."]}], "ಜೀಂಕರಿಸು": [{"type": "verb", "defs": ["to praise; to laud; to extol."]}], "ಜೀಂಗರೆ": [{"type": "verb", "defs": ["to make a long, loud cry from joy."]}], "ಜೀಕ": [{"type": "noun", "defs": ["= ಜೀಕು3."]}], "ಜೀಕಹೊಡೆ": [{"type": "verb", "defs": ["to swing back and forth."]}], "ಜೀಕಳಿ": [{"type": "noun", "defs": ["= ಜೀಕೊಳವೆ."]}], "ಜೀಕು": [{"type": "verb", "defs": ["to move or sway back and forth or from side to side gently (a cradle); to rock.", "to swing oneself back and forth."]}, {"type": "noun", "defs": ["the creaking, grating sound as of rusted hinges or of a footwear."]}, {"type": "noun", "defs": ["a frequent, regular movement backward to forward; a swaying or being swayed; a swinging.", "a wavering of the mind.", "a circular, revolving contrivance with forms of animals to sit on, used as an amusement device for children.", "ಜೀಕಾಡು jīkāḍu to move oneself to and fro regularly; to sway; to swing."]}], "ಜೀಕುಳಿ": [{"type": "noun", "defs": ["= ಜೀಕೊಳವೆ."]}], "ಜೀಕೊಳವಿ": [{"type": "noun", "defs": ["= (correctly, ಜೀರ್ಕೊಳವಿ) ಜೀಕೊಳವೆ."]}], "ಜೀಕೊಳವೆ": [{"type": "noun", "defs": ["(correctly, ಜೀರ್ಕೊಳವೆ)a device to eject liquid in a jet from a narrow orifice; a syringe; a squirt."]}], "ಜೀಗು": [{"type": "noun", "defs": ["= ಜೀಕು2."]}], "ಜೀಟು": [{"type": "noun", "defs": ["a rigid support, as a beam, stake or pole, placed under or against a structure or part; a prop."]}], "ಜೀಟುಗಾಲು": [{"type": "noun", "defs": ["an aid for walking."]}], "ಜೀಟುಗೋಲು": [{"type": "verb", "defs": ["a stick, staff used as prop."]}], "ಜೀಣ": [{"type": "noun", "defs": ["= ಜೀನ1."]}], "ಜೀತ": [{"type": "noun", "defs": ["a living; life.", "money received for work done, and usu. figured on an hourly, daily or piecework basis; wages.", "service under feudalism; feudal service.", "ಜೀತಕ್ಕಿರು jītakkiru = ಜೀತಮಾಡು; ಜೀತದಾಳು jītadāḷu = ಜೀತಗಾರ; ಜೀತಮಾಡು jītamāḍu to work as a servant under feudalism."]}], "ಜೀತಕಾರ": [{"type": "noun", "defs": ["= ಜೀತಗಾರ."]}], "ಜೀತಗಾರ": [{"type": "noun", "defs": ["a servant working under feudalism."]}], "ಜೀನ": [{"type": "noun", "defs": ["a greedy, stingy man who hoards money for its own sake, even at the expense of personal comfort; a miser."]}, {"type": "noun", "defs": ["an old man."]}, {"type": "noun", "defs": ["= ಜೀನು1."]}, {"type": "noun", "defs": ["a religion founded in the 6th century B.C. as a revolt against the then prevalent Hinduism and emphasising the perfectibility of human nature and liberation of the soul, esp. through asceticism and non-violence toward all living creatures; Jainism."]}], "ಜೀನಂಗಿ": [{"type": "noun", "defs": ["the tree Sesbania paludosa of Papilonaceae family.", "the tree Sesbania sesban (=S. aegyptiaca) of the same family."]}], "ಜೀನಗ": [{"type": "noun", "defs": ["= ಜೀನ1."]}], "ಜೀನಗಾರ": [{"type": "noun", "defs": ["a man who makes articles using, leather; a man who tans hide into leather.", "a servant whose duty is to prepare his master's horse for riding."]}, {"type": "noun", "defs": ["a man who paints pictures or paints idols; a painter."]}], "ಜೀನಗೆಲಸ": [{"type": "noun", "defs": ["delicate artistic work."]}], "ಜೀನತನ": [{"type": "noun", "defs": ["the quality of giving or spending grudgingly or only through necessity; stinginess; miserliness."]}], "ಜೀನವೆಸ": [{"type": "noun", "defs": ["= ಜೀನಗೆಲಸ."]}], "ಜೀನಶಾಲೆ": [{"type": "noun", "defs": ["a place storing weapons and other munitions; a weapon store; an arsenal."]}], "ಜೀನಸು": [{"type": "noun", "defs": ["a material or materials needed commonly by common people, as grains, other food items, etc. sold in a store; goods.", "the seed of food-plants; grain.", "a class or group of individual objects, people, animals, etc., of the same nature or character or classified together because they have traits in common; a kind; a category.", "manner of behaving or acting; behaviour."]}], "ಜೀನಹಂಕ": [{"type": "noun", "defs": ["a very stingy, miserly man."]}], "ಜೀನಹಂಕತನ": [{"type": "noun", "defs": ["= ಜೀನತನ."]}], "ಜೀನಿ": [{"type": "noun", "defs": ["a greedy, stingy woman who hoards money for its own sake, even at the expense of personal comfort; a miser."]}], "ಜೀನಿಸು": [{"type": "noun", "defs": ["= ಜೀನಸು."]}], "ಜೀನು": [{"type": "noun", "defs": ["an animal skin or pelt, either raw or tanned; hide.", "a seat of leather for a rider on a horse, usu. padded.", "a kind of percussion instrument with a leather membrane."]}, {"type": "noun", "defs": ["a machine for separating cotton fibres from the seeds; a ginning machine.", "a factory for separating cotton fibres from the seeds; a ginning factory."]}], "ಜೀನುಗಾರ": [{"type": "noun", "defs": ["= ಜೀನಗಾರ1."]}, {"type": "noun", "defs": ["= ಜೀನಗಾರ2."]}], "ಜೀನುಹಂಕ": [{"type": "noun", "defs": ["= ಜೀನಹಂಕ."]}], "ಜೀಪು": [{"type": "noun", "defs": ["the space, amount or degree to which a thing extends; extent.", "a small, flat piece of stone, used in games by children.", "a relatively longer step or stride.", "the act of leaping; a jumping.", "a unit of linear measure, equal to the length of a relatively longer step or stride of a person [this unit is subjective and not a standard one].", "the pushing of a marble, in a children's play, with the back of the palm, with fingers bent."]}, {"type": "noun", "defs": ["a small, rugged automotive vehicle with a one fourth (1/4) ton capacity and a four-wheel drive, chiefly used by military forces and policemen."]}], "ಜೀಪುಕೊಡು": [{"type": "verb", "defs": ["= ಜೀಪುಗೊಡು."]}], "ಜೀಪುಗಾಲು": [{"type": "noun", "defs": ["a long stride or step, in walking."]}], "ಜೀಪುಗೊಡು": [{"type": "verb", "defs": ["to jump; to leap."]}], "ಜೀಬಿ": [{"type": "noun", "defs": ["a kind of cloth ."]}, {"type": "noun", "defs": ["the area between the inner and outer walls surrounding a town, city, etc.", "the area between two gates of the entrance of a town."]}], "ಜೀಬ್ರ": [{"type": "noun", "defs": ["any of several swift African perissodactylous mammals (family Equidae) of the genus Equus (same as the horse and ass), having dark stripes on a white or tawny body; zebra."]}], "ಜೀಮತಿ": [{"type": "noun", "defs": ["a kind of medicinal substance ."]}], "ಜೀಮುೂತ": [{"type": "noun", "defs": ["a cloud.", "a mountain.", "an elephant.", "the black colour.", "the grass Cyperus rotundus (= C. hexastachyus) of Cyperaceae family; sedge."]}], "ಜೀಮೂತಪಥ": [{"type": "noun", "defs": ["sky as the path of clouds."]}], "ಜೀಮೂತವಾಹನ": [{"type": "noun", "defs": ["Indra, who moves on the clouds."]}], "ಜೀಯ": [{"type": "noun", "defs": ["an owner of a slave; an employer of workers or servants; a master; a boss.", "a term used to convey the sense of agreement, consent, affirmation to one's master, elder, etc.; (equivalent to English words 'yeś 'okay', etc.).", "a speech lauding, praising another."]}], "ಜೀಯ್ಯ": [{"type": "noun", "defs": ["= ಜೀಯ."]}], "ಜೀರ್": [{"type": "verb", "defs": ["= ಜೀರು1."]}, {"type": "verb", "defs": ["= ಜೀರು2."]}], "ಜೀರ": [{"type": "noun", "defs": ["= ಜೀರಿಗೆ.", "fast movement.", "a weapon with a long blade for cutting or thrusting used in fighting and also as a symbol of honour or authority; a sword."]}, {"type": "noun", "defs": ["a man who sells flowers and garlands."]}], "ಜೀರಂಗಿ": [{"type": "noun", "defs": ["any of several jumping orthopterous insects of the family Gryllidae, commonly found in places where plants are thickly grown, and which make continuous jarring sound during night."]}], "ಜೀರಕ": [{"type": "noun", "defs": ["= ಜೀರಿಗೆ."]}], "ಜೀರಗಂಡಿ": [{"type": "noun", "defs": ["a narrow opening through which bullets are shot from within.", "a small opening in the top covering or in a wall of a building letting light in."]}], "ಜೀರಗೆ": [{"type": "noun", "defs": ["= ಜೀರಿಗೆ."]}], "ಜೀರಗೆಯೊಕ್ಕಲಿಕ್ಕು": [{"type": "verb", "defs": ["(fig.) to beat soundly in punishment; to thrash heavily."]}], "ಜೀರಣ": [{"type": "adjective", "defs": ["worn out; no longer effective, usable or serviceable."]}, {"type": "noun", "defs": ["the condition of being worn-out, unserviceable, useless."]}, {"type": "noun", "defs": ["= ಜೀರಿಗೆ."]}], "ಜೀರದಂಡ": [{"type": "noun", "defs": ["a kind of sīre (sari, worn by women)."]}], "ಜೀರಿಗೆ": [{"type": "noun", "defs": ["the small herb Cuminum cyminum of Apiaceae family; cumin.", "its seed used as a spice; cumin seed."]}], "ಜೀರಿಗೆಗೆಣಸು": [{"type": "noun", "defs": ["the yam plant Dioscorea sativa (var. pulchella); cumin yam plant.", "its yam."]}], "ಜೀರಿಗೆಬೆಲ್ಲ": [{"type": "noun", "defs": ["a religious observation in marriages, in which the bride and the groom pour cumin seeds and pieces of jaggery on each other."]}], "ಜೀರಿಗೆಮಾವು": [{"type": "noun", "defs": ["a variety in Mango trees.", "its fruit, smelling cumin seeds."]}], "ಜೀರಿಗೆರಾಜಾನ್ನ": [{"type": "noun", "defs": ["a variety of fragrant rice."]}], "ಜೀರಿಗೆಸಣ್ಣ": [{"type": "noun", "defs": ["= ಜೀರಿಗೆರಾಜಾನ್ನ."]}], "ಜೀರಿಗೆಸಣ್ಣಕ್ಕಿ": [{"type": "noun", "defs": ["= ಜೀರಿಗೆರಾಜಾನ್ನ."]}]}