{"ಕಾಡುಸೂರಣ": [{"type": "noun", "defs": ["= ಕಾಡುಸುವರ್ಣಗಡ್ಡೆ."]}], "ಕಾಡುಸೆಂಬೆ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಕಾಡುಸೆಣಬು": [{"type": "noun", "defs": ["the plant Azanza lampas (= Thespesia lampas, = Hibiscus lampas) of Malvaceae family.", "the plant Corchorus olitorius of Tiliaceae family."]}], "ಕಾಡುಸೇಬು": [{"type": "noun", "defs": ["any of several species of small, very sour apples (genus Malus), growing wild or cultivated and used for making jellies and preserves; crab apple.", "the tree bearing it."]}], "ಕಾಡುಸೊಂಡೆ": [{"type": "noun", "defs": ["the plant Solanum torvum of Solanaceae family.", "its fruit."]}], "ಕಾಡುಸೊಳ್ಳೆ": [{"type": "noun", "defs": ["an insect, wild variety of mosquito, of the family Culicidae; a wild mosquito."]}], "ಕಾಡುಸೋಂಪು": [{"type": "noun", "defs": ["the plant Pimpinella monoica of Apiaceae family; anise."]}], "ಕಾಡುಸೋನಾಮುಖಿ": [{"type": "noun", "defs": ["the plant Cassia obtusa of Caesalpiniaceae family; wild senna."]}], "ಕಾಡುಸೌತೆ": [{"type": "noun", "defs": ["a variety in cucumber; a wild cucumber.", "its fruit."]}], "ಕಾಡುಸ್ಥಿತಿ": [{"type": "noun", "defs": ["the state of being unrefined, premitive; absence of culture or civilisation."]}], "ಕಾಡುಹ": [{"type": "noun", "defs": ["the act or an instance of troubling, vexing; harassment; annoyance."]}], "ಕಾಡುಹಂಚಿಕಡ್ಡಿ": [{"type": "noun", "defs": ["= ಕಾಡುಹಂಚಿಹುಲ್ಲು."]}], "ಕಾಡುಹಂಚಿಹುಲ್ಲು": [{"type": "noun", "defs": ["the grass Aristida hystrix of Poaceae family.", "the grass Apluda mutica (= A. aristata) of the same family.", "another grass Eragrostis riparia of the same family."]}], "ಕಾಡುಹಂದಿ": [{"type": "noun", "defs": ["a wild boar or swine (Sus scrofa)."]}], "ಕಾಡುಹಂಬು": [{"type": "noun", "defs": ["the plant Smilax zeylanica (= S. macrophylla) of Liliaceae family; prickly sarsaparilla."]}], "ಕಾಡುಹಂಬುತಾವರೆ": [{"type": "noun", "defs": ["= ಕಾಡುಹಂಬು."]}], "ಕಾಡುಹತ್ತಿ": [{"type": "noun", "defs": ["the plant Gossypium indicum (= G. neglectum) of Malvaceae; wild cotton plant.", "cotton obtained from it."]}], "ಕಾಡುಹರಟೆ": [{"type": "noun", "defs": ["useless talk; idle gossip; tittle-tattle."]}], "ಕಾಡುಹರಳು": [{"type": "noun", "defs": ["the plant Jatropha curcas of Euphorbiaceae family.", "its seed.", "the plant Baliospermum montanum (= B. axillare, = Croton polyandrus) of the same family; wild croton.", "its plant."]}], "ಕಾಡುಹಲಸು": [{"type": "noun", "defs": ["the tree Artocarpus hirsuta of Moraceae family; wild-jack.", "its fruit; wild-jack fruit."]}], "ಕಾಡುಹಳ್ಳಿ": [{"type": "noun", "defs": ["a remote village lacking in minimum civic amenities."]}], "ಕಾಡುಹಾಕುಕಾರೆ": [{"type": "noun", "defs": ["the plant Toddalia asiatica (= T. aculeata) of Rutaceae family; wild orange."]}], "ಕಾಡುಹಾಗಲ": [{"type": "noun", "defs": ["a vine of Cucurbitaceae family, akin to bitter gourd; wild bitter gourd."]}], "ಕಾಡುಹಾಗಲು": [{"type": "noun", "defs": ["= ಕಾಡುಹಾಗಲ."]}], "ಕಾಡುಹಾರಕಹುಲ್ಲು": [{"type": "noun", "defs": ["the grass Echinochloa colonum (var. frumentaceae) of Poaceae family."]}], "ಕಾಡುಹಾಲುಬಳ್ಳಿ": [{"type": "noun", "defs": ["the plant Dregea volubilis (= Marsdenia volubilis) of Asclepiadaceae family."]}], "ಕಾಡುಹಿಪ್ಪೆ": [{"type": "noun", "defs": ["the tree Madhuca indica (= Bassia latifolia) of Sapotaceae family; Indian butter tree.", "another tree, Madhuca longifolia (= Bassia longifolia) of the same family; honey tree."]}], "ಕಾಡುಹೀರೆ": [{"type": "noun", "defs": ["the creeper Luffa acutangula (var. amara) of Cucurbitaceae family.", "its gourd."]}], "ಕಾಡುಹುರುಳಿ": [{"type": "noun", "defs": ["the plant Desmodium motorium (= D. gyrans) of Papilionaceae family; telegraph plant.", "its fruit.", "the plant Dolichos falcatus of Papilionaceae family; wild horse gram.", "the bean of that plant.", "the plant Vicia faba (= Faba vulgaris) of Papilionaceae; broad bean.", "its bean.", "the plant Mundulina sericea (= M. suberosa) of Papilionaceae family.", "the leguminous twining shrub Clitoria ternatea of Papilionaceae family with blue flowers, the root of which is used as a dieretic and demulcent; butterfly-pea.", "the seed of that plant."]}], "ಕಾಡುಹುಲಿಗ": [{"type": "noun", "defs": ["the plant Cassia absus of Caesalpiniaceae family."]}], "ಕಾಡುಹುಲ್ಲು": [{"type": "noun", "defs": ["the plant Ipomoea coccinea of Convolvulaceae family."]}], "ಕಾಡುಹುಳಿಹೀರೆ": [{"type": "noun", "defs": ["the creeper Luffa acutangula (var. amara) of Cucurbitaceae family; bitter luffa.", "its gourd; bitter luffa gourd."]}], "ಕಾಡುಹುಳ್ಳಿ": [{"type": "noun", "defs": ["= ಕಾಡುಹುರುಳಿ."]}], "ಕಾಡುಹೂವರಸಿ": [{"type": "noun", "defs": ["the tree Rhododendron nilagiricum of Ericaceae family.", "its flower."]}], "ಕಾಡುಹೆಸರು": [{"type": "noun", "defs": ["the plant Phaseolus adenanthus of Papilionaceae family.", "its bean."]}], "ಕಾಡುಹೊಗೆಸೊಪ್ಪು": [{"type": "noun", "defs": ["the plant Lobelia nicotianaefolia of Companulaceae family; wild tobacco.", "its leaf.", "the plant Verbascum thapsus of Scrophulariaceae family.", "the plant Vernonia cinerea of Asteraceae family."]}], "ಕಾಡುಹೋರೆ": [{"type": "noun", "defs": ["any work done in a forest.", "(fig.) a work done in a rough, unrefined or barbarian manner."]}], "ಕಾಡುಳ್ಳಿ": [{"type": "noun", "defs": ["the plant Crinum defixum of Liliaceae family.", "its bulb; poison bulb.", "the plant Urginia indica (= Scilla indica) of Liliaceae family.", "its bulb; white squill."]}], "ಕಾಡೆ": [{"type": "noun", "defs": ["a thin food made by cooking the flour of jowar, rāgi, etc. in water; gruel."]}, {"type": "noun", "defs": ["a small, short-tailed gallinaceous bird (family: Phasianidae); a kind of partridge; quail."]}, {"type": "noun", "defs": ["the plant Ocium sanctum of Lamiaceae family.", "the plant Ocium canum of the same family."]}, {"type": "noun", "defs": ["the main axis of a plant, having nodes and bearing leaves, usu. extending in a direction opposite to that of the root and above the ground, and helping to transport and store food materials; the main stalk; the stem."]}, {"type": "noun", "defs": ["an extract of plants got by boiling, for making medicines; a vegetable decoction."]}], "ಕಾಡೆತ್ತು": [{"type": "noun", "defs": ["an undomesticated, wild ox."]}], "ಕಾಡೆಮ್ಮೆ": [{"type": "noun", "defs": ["a wild she-buffalo."]}], "ಕಾಡೆಮ್ಮೆವೋರಿ": [{"type": "noun", "defs": ["an undomesticated buffalo; a wild bison."]}], "ಕಾಡೆರಳೆ": [{"type": "noun", "defs": ["any of the wild deers."]}], "ಕಾಡೆರ್ಮೆ": [{"type": "noun", "defs": ["= ಕಾಡೆಮ್ಮೆ."]}], "ಕಾಡೆಹಕ್ಕಿ": [{"type": "noun", "defs": ["= ಕಾಡೆ2."]}], "ಕಾಡೆಳ್": [{"type": "noun", "defs": ["= ಕಾಡೆಳ್ಳು."]}], "ಕಾಡೆಳ್ಳು": [{"type": "noun", "defs": ["the plant Sesamum indicum of Pedaliaceae family.", "its seed."]}], "ಕಾಡೊಡಮೆ": [{"type": "noun", "defs": ["any valuable thing got from the forest; forest-wealth; any forest product."]}], "ಕಾಡೊಡೆತನ": [{"type": "noun", "defs": ["the ownership of a forest."]}], "ಕಾಡೊಡೆಯ": [{"type": "noun", "defs": ["a king or owner of a forest.", "a chief of the fowler community.", "lion, regarded as the king of wild animals."]}], "ಕಾಡೊಳ್ಪು": [{"type": "noun", "defs": ["the natural beauty of a forest."]}], "ಕಾಡೋಜೆ": [{"type": "noun", "defs": ["rudeness of manners; absence of civility or culture; barbarism."]}], "ಕಾಡ್ಕೋಣ": [{"type": "noun", "defs": ["a wild bison (Bibos gaurus)."]}], "ಕಾಡ್ಗಿಚ್ಚು": [{"type": "noun", "defs": ["a great forest fire; conflagration."]}], "ಕಾಡ್ಗೋಣ": [{"type": "noun", "defs": ["ಕಾಡ್ಕೋಣ."]}], "ಕಾಡ್ಹಳ್ಳಿ": [{"type": "noun", "defs": ["a remote village lacking in minimum civic amenities."]}], "ಕಾಢೆ": [{"type": "noun", "defs": ["= ಕಾಡೆ5."]}], "ಕಾಣ್": [{"type": "verb", "defs": ["= ಕಾಣು."]}], "ಕಾಣ": [{"type": "noun", "defs": ["coarse food for cattle, horses, sheep, etc., as cornstalks, hay, and straw; fodder.", "a tax levied on cattle-feed (now obs.)."]}, {"type": "noun", "defs": ["a man with one eye; a monocular man.", "a man deprived of sight; a blind man.", "a perforated or broken thing.", "the glossy black bird of moderate size; crow."]}, {"type": "noun", "defs": ["(dial.) a depositing of a valuable item as security for performance of a contract or payment of a loan; pledge."]}], "ಕಾಣಒತ್ತೆ": [{"type": "noun", "defs": ["= ಕಾಣ3."]}], "ಕಾಣಭುಜ": [{"type": "noun", "defs": ["a follower of Indian doctrine of atoms, known as 'vaiśeṣika' propounded by the philosopher Kaṇā da."]}], "ಕಾಣಯ": [{"type": "noun", "defs": ["a thick, heavy stick; a staff."]}], "ಕಾಣಾಂಚಿ": [{"type": "noun", "defs": ["= ಕಾಣಾಚಿ."]}], "ಕಾಣಕಾಣ": [{"type": "adverb", "defs": ["conspicuously; strikingly; pre-eminently."]}], "ಕಾಣಾಚಿ": [{"type": "noun", "defs": ["an estate passed down by, inheritance from an ancestor to a legal heir; hereditary property.", "hereditary right to lands, fees of office, etc."]}], "ಕಾಣಿ": [{"type": "noun", "defs": ["an old coin of very small value (one-sixty forth of a paṇa, now obs.).", "(obs.) a tax levied (on transfer of rights of property hereditarily ?).", "something given to show friendship, affection, suport or allegiance.", "an old measure of land.", "the right of a person for hereditary property as lands, fees of office, etc.", "property owned hereditarily.", "evenness of both the pans of a weighing scale.", "a weight used to to balance both the pans of a weighing scale; equipoise; counterweight.", "a person hired to guard a property; a watchman.", "(gen.) wealth.", "ಕಾಣಿಕಟ್ಟು kāṇi kaṭṭu to balance both the pans of a scale, using the differential weight."]}, {"type": "noun", "defs": ["the plant Grangea maderaspatana (= Artemisia maderaspatana) of Asteraceae family."]}], "ಕಾಣಿಕಾಱ": [{"type": "noun", "defs": ["a man who is eligible, by virtue of his being a member of a family, for a property passed down by heredity."]}], "ಕಾಣಿಕೆ": [{"type": "noun", "defs": ["vision - a) the act or power of seeing with the eye; sense of sight; b) the object seen; c) something supposedly seen by other than normal sight; something perceived in a dream, trance, etc. or supernaturally revealed, as to a prophet; d) the experience of having such a perception or revelation; e) the act or power of anticipating that which will or may happen; anticipation.", "something given to show respect, friendship, affection, support, etc.; a present; a gift.", "a tribute under feudalism, - a) a tax paid by a vassal to an overlord, king etc.", "a general contribution to the society, for a cause etc."]}], "ಕಾಣಿಕೆಗೊಡು": [{"type": "verb", "defs": ["to present a gift to another to show respect, friendship, affection, support, allegiance, etc."]}], "ಕಾಣಿಕೆಗೊಳ್": [{"type": "verb", "defs": ["to receive a presentation, gift."]}], "ಕಾಣಿಕೆಯ": [{"type": "noun", "defs": ["in a feudal system, an official whose duty is to collect tax to be paid to the overlord, king, etc."]}], "ಕಾಣಿಕೆಯಿಕ್ಕು": [{"type": "verb", "defs": ["= ಕಾಣಿಕೆಗೊಡು."]}], "ಕಾಣಿಕೆಯೀ": [{"type": "verb", "defs": ["= ಕಾಣಿಕೆಗೊಡು."]}], "ಕಾಣಿಕೆವರದ": [{"type": "noun", "defs": ["a seller of precious articles."]}], "ಕಾಣಿಕೆವಿಡಿ": [{"type": "verb", "defs": ["= ಕಾಣಿಕೆಗೊಳ್."]}], "ಕಾಣಿಕೊಂಕು": [{"type": "noun", "defs": ["unevenness, disparity between the two pans of a weighing scale."]}], "ಕಾಣಿತೂಕ": [{"type": "noun", "defs": ["a weight used to balance both the pans of a weighing scale; equipoise; counterweight."]}], "ಕಾಣಿಪೇರು": [{"type": "noun", "defs": ["= ಕಾಣಿತೂಕ."]}], "ಕಾಣಿಯಾಚಿ": [{"type": "noun", "defs": ["= ಕಾಣಾಚಿ."]}], "ಕಾಣಿಯಾಚಿಕಾಱ": [{"type": "noun", "defs": ["= ಕಾಣಿಕಾಱ."]}], "ಕಾಣಿಯಾಲ": [{"type": "noun", "defs": ["a person who earns a living by farming; esp., one who manages or operates a farm; a farmer."]}], "ಕಾಣಿಲ್ಲಮೆ": [{"type": "noun", "defs": ["the state, condition or fact of being invisible; disappearance."]}], "ಕಾಣಿಸು": [{"type": "verb", "defs": ["to cause to be seen; to allow to appear; to make visible; to show.", "to come to be; to happen; to become.", "to cause to come together, meet.", "to be seen; to appear; to become visible.", "to come or pass in the mind swiftly and suddenly; to be realised for an instant like a flash of light.", "to know; to have clear perception or understanding of.", "ಕಾಣಿಸಿಕೊಡು kāṇisikoḍu to show; to cause to be shown; 2. to bring (something) to the notice of another or others; 3. to cause to come together, meet. ಕಾಣಿಸಿಕೊಳ್ kāṇisikoḷ to be seen; to appear; to be found; to manifest.", "to crop up (as a disease, problem, etc.).", "(a boil, erruption etc.) to appear on the skin; to break out.", "to meet; to come face to face.", "to make something explicit, clear or distinct."]}], "ಕಾಣು": [{"type": "verb", "defs": ["to perceive an object through the sense of the eye.", "to perceive mentally; to understand; to logically judge and apprehend.", "to see as a vision; to imagine (such as a thing to happen in future or the reality which otherwise not seen or perceived).", "to meet a person; to visit; to call on; to receive as a visitor.", "to get; to obtain; to secure; to attain.", "to become visible or to be seen; to appear.", "ಕಂಡವರು kaṇḍavaru (pl.) persons seen (casually); 2. not related persons; unconcerned persons; outsiders; 3. persons who witnessed (an event, etc.); ಕಂಡುಬರು kaṇḍu baru to be seen; to become visible; to appear; 2. to become known; to be perceived or be perceivable; ಕಂಡುಹಿಡಿ kaṇḍu hiḍi to determine after a probe or judicial enquiry; 2. to find out (a lost thing or fact); 3. to discover ( a thing, way, etc.); 4. to design for the first time (as a scientific invention); ಕಂಡೆಗೊಳ್ k aṇḍegoḷto see; to look at; ಕಾಣಬರು kāṇabaru = ಕಂಡುಬರು; ಕಾಣಗೊಡಿಸು kāṇagoḍisu to cause to be seen; 2. to enable to see; ಕಾಣಗೊಡು kāṇagoḍu to allow to be seen; 2. to allow to see; ಕಂಡವರ ಮಕ್ಕಳನ್ನು ಬಾವೀಲಿ ದೂಡಿ ಆಳ ನೋಡು kaṇḍavara makkaḷannu bāvīli dūḍI āḷa nōḍu for one's benefit, employ another on a dangerous job; the barber learns to shave on the orphaṇs face; ಕಾಣೆಅರ್ಜಿ kāṇe arji a petition made to concerned authorities regarding loss, disappearance, theft, etc, of a thing; ಕಾಣೆಯಾಗು kāṇeyāgu to go out of sight; to disappear; to cease to be seen."]}], "ಕಾಣುಹ": [{"type": "noun", "defs": ["the act, process or fact of seeing with the eye; vision."]}], "ಕಾಣೆ": [{"type": "noun", "defs": ["the fact or an instance of disappearing; disappearance; a going out of sight."]}, {"type": "noun", "defs": ["a kind of fish."]}, {"type": "noun", "defs": ["= ಕಾಣಿ1."]}], "ಕಾಣ್ಕೆ": [{"type": "noun", "defs": ["= ಕಾಣಿಕೆ.", "ಕಾಣ್ಕೆಮಾಡಿಸು kāṇke māḍisu to cause to meet (as two or more persons); ಕಾಣ್ಕೆಮಾಡು kāṇke māḍu to show; to exhibit; to display."]}], "ಕಾಣ್ಕೆಗೈ": [{"type": "verb", "defs": ["= ಕಾಣಿಕೆಗೊಡು."]}], "ಕಾಣ್ಕೆಗೊಡು": [{"type": "verb", "defs": ["= ಕಾಣಿಕೆಗೊಡು."]}], "ಕಾಣ್ಕೆಯೀ": [{"type": "verb", "defs": ["= ಕಾಣಿಕೆಗೊಡು."]}], "ಕಾಣ್ಕೆವೊಲ": [{"type": "noun", "defs": ["the range of one's sight.", "the extent of one's imagination, perception or revelation."]}], "ಕಾಣ್ಣವ": [{"type": "adjective", "defs": ["= ಕಾಣ್ವ1."]}, {"type": "noun", "defs": ["= ಕಾಣ್ವ2."]}], "ಕಾಣ್ಪಡಿಸು": [{"type": "verb", "defs": ["= ಕಾಣ್ಬಡಿಸು."]}], "ಕಾಣ್ಬಟ್ಟೆ": [{"type": "noun", "defs": ["the path, way, that is or can be seen.", "an opportunity, chance of seeing, imagining, perceiving etc."]}], "ಕಾಣ್ಬಟ್ಟೆಗೆಡು": [{"type": "verb", "defs": ["to be unable to see the path, way that is ahead or to be taken; to become incompetent in taking up or continuing one's course of action.", "to miss or lose one's opportunity, chance of seeing, imagining, realising or perceiving."]}], "ಕಾಣ್ಬಡಿಸು": [{"type": "verb", "defs": ["to cause to be seen; to allow to appear; to make visible; to show."]}], "ಕಾಣ್ಮೆ": [{"type": "noun", "defs": ["the act or power of sensing with the eyes; sight; vision.", "the act opr powerof anticipating that which will or may come to be; foresight.", "something seen in or as if in a dream or trance, attributed to divine agency.", "such an experience.", "(gen.) anything that is physically seen; the object of sight."]}, {"type": "noun", "defs": ["determination or boldness in facing danger; marked courage; valour."]}], "ಕಾಣ್ವ": [{"type": "adjective", "defs": ["of, belonging or relating to, Kaṇva, a vedic sage and author of several hymns of Řgvēda or to his school, tradition, etc."]}, {"type": "noun", "defs": ["a descendent, follower or a man belonging to the tradition, of the vedic sage Kaṇva."]}], "ಕಾಣ್ವಶಾಖೆ": [{"type": "noun", "defs": ["a phylosophical school of the vedic sage Kaṇva.", "a branch or division of Śukla Yajurvēda ascribed to the sage Kaṇva."]}], "ಕಾಣ್ವಿಕೆ": [{"type": "noun", "defs": ["the act or an instance of seeing."]}], "ಕಾತ": [{"type": "noun", "defs": ["the supposed disembodied spirit of a person who was murdered."]}], "ಕಾತಕರಿ": [{"type": "noun", "defs": ["a community or caste of people engaged in dealing with catechu, charcoal, etc.", "a member of that community or caste."]}], "ಕಾತಘಾತ": [{"type": "noun", "defs": ["a blow that causes death; a fatal stroke; a death-blow."]}], "ಕಾತರ": [{"type": "adjective", "defs": ["(emotionally) disturbed; perturbed; agitated.", "put out of order; disordered.", "frightened; scared.", "eagerly wishing; anxious; ಕಾತರವಾಗು kātaravāgu to become eaer; to be driven by zeal,enthusiasm."]}, {"type": "noun", "defs": ["fearful uncertainty, anxiety, etc.; apprehension; trepidation.", "keen desire; eagerness; ardent longing.", "a man driven by desire, eagerness or impetuous impulsion.", "a man who is scared or frightened.", "(dance.) a moving of a foot or feet backwards without lifting off the ground; such a gait."]}], "ಕಾತರಗೊಳ್ಳು": [{"type": "verb", "defs": ["to become eager, deeply interested (to have, to do, etc.).", "to be afraid of; to be apprehensive, perturbed, agitated; to become anxious."]}], "ಕಾತರತೆ": [{"type": "noun", "defs": ["keen desire; eagerness.", "the state of being anxious, apprehensive,etc.; anxiety.", "fear; panic."]}], "ಕಾತರಪಡು": [{"type": "verb", "defs": ["to have or show strong desire, eagerness."]}], "ಕಾತರಿಕೆ": [{"type": "noun", "defs": ["= ಕಾತರತೆ."]}, {"type": "noun", "defs": ["[rightly - ಕಾಸರ್ಕ]the tree Strychnos nux-vomica of Loganiaceae family.", "its poisonous nut containing strychnine, brucine and other alkaloids; nux-vomica."]}], "ಕಾತರಿಕ್ಕೆ": [{"type": "noun", "defs": ["= ಕಾತರತೆ."]}], "ಕಾತರಿಗ": [{"type": "noun", "defs": ["an axious man; he who is keenly eager.", "a man whose actions are characterised by suddennes or rashness, often lacking reasoning.", "a man who is greatly disturbed or disquiet in mind."]}], "ಕಾತರಿಗತನ": [{"type": "noun", "defs": ["keen desire; eagerness.", "the quality of person who is impetuous, irrational; impetuousness.", "the condition or state of being anxious, apprehensive, etc.; anxiety."]}], "ಕಾತರಿತ": [{"type": "adjective", "defs": ["keenly eager; desirous; anxious.", "perturbed, agitated or disquiet in mind."]}], "ಕಾತರಿಸು": [{"type": "verb", "defs": ["to long for; to be keenly desirous of; to be or become anxious.", "to be irritated; to be excited to impatience or anger; to be tensed with.", "to worry (oneself or within) about.", "to be afraid of; to fear; to be scared.", "to flow over the bounds (as tears); to overflow.", "to frighten; to fill with fear; to scare."]}], "ಕಾತರೆ": [{"type": "noun", "defs": ["an axious woman; she who is keenly eager.", "a woman whose actions are characterised by suddennes or rashness, often lacking reasoning.", "a woman who is greatly disturbed or disquiet in mind."]}], "ಕಾತಲಾ": [{"type": "noun", "defs": ["a kind of fish."]}], "ಕಾತಲಿಸು": [{"type": "verb", "defs": ["= ಕಾತರಿಸು."]}], "ಕಾತಳ": [{"type": "noun", "defs": ["fearful uncertainty, anxiety, etc.; apprehension; trepidation.", "fear; fright.", "keen desire; eagerness; ardent longing.", "irritation of the mind; anger."]}], "ಕಾತಳಿ": [{"type": "noun", "defs": ["= ಕಾತಳ."]}], "ಕಾತಳಿಗ": [{"type": "noun", "defs": ["= ಕಾತರಿಗ."]}], "ಕಾತಳಿಗತನ": [{"type": "noun", "defs": ["= ಕಾತರಿಗತನ."]}], "ಕಾತಳಿಸು": [{"type": "verb", "defs": ["= ಕಾತರಿಸು."]}], "ಕಾತಾಳ": [{"type": "noun", "defs": ["= ಕಾತಳ."]}], "ಕಾತಿ": [{"type": "noun", "defs": ["extreme anger; wrath; fury; rage."]}, {"type": "noun", "defs": ["the prepared fiber of the husks of coconuts, used to make matting and rope; coir.", "a rope or a piece of rope made of this."]}, {"type": "noun", "defs": ["a house-wife; the mistress of a house."]}], "ಕಾತಿಕೆ": [{"type": "noun", "defs": ["(dial.) the rain during the period when the moon is closer to the Pleiades, the third of the twnety seven asterisms."]}], "ಕಾತುರ": [{"type": "noun", "defs": ["= ಕಾತರ2."]}], "ಕಾತುರತೆ": [{"type": "noun", "defs": ["= ಕಾತರತೆ."]}], "ಕಾತೆ": [{"type": "noun", "defs": ["a kind of farm land."]}], "ಕಾತ್ಯಾಯನಿ": [{"type": "noun", "defs": ["the Goddess Pārvati.", "an elderly or middle-aged widow (dressed in red clothes).", "a wife of celebrated sage Yājñvalkya."]}], "ಕಾತ್ಯಾಯನಿಕೆ": [{"type": "noun", "defs": ["a middle-aged woman."]}], "ಕಾದಂಬ": [{"type": "noun", "defs": ["a waterfowl with long neck, and gray feathers.", "the tree Anthocephalus indicus (= A. cadamba, = Nauclea cadamba) of Rubiaceae family; cadamba tree.", "the flower of that tree.", "the plant Viburnum hebanthum of Caprifoliaceae family.", "its yellow flower.", "an arrow."]}], "ಕಾದಂಬರಿ": [{"type": "noun", "defs": ["a spirituous liquor distilled from the flowers of the tree Anthocephalus indicus (cadamba tree).", "in gen. any spirituous liquor.", "a relatively long fictional prose narrative with a more or less complex plot or pattern of events, about actions, feelings, motives, etc. of a group of characters; a novel.", "the type or form of literature represented by such narratives; the novel."]}], "ಕಾದಂಬರಿಕಾರ": [{"type": "noun", "defs": ["a man who writes novels; a novelist."]}], "ಕಾದಂಬರಿಕಾರ್ತಿ": [{"type": "noun", "defs": ["a woman who writes novels; a novelist."]}], "ಕಾದಂಬಿನಿ": [{"type": "noun", "defs": ["a row, long line, of clouds."]}], "ಕಾದಂಬಿನೀನಾಥ": [{"type": "noun", "defs": ["Indra, the lord of clouds (hence of rains)."]}], "ಕಾದಂಬು": [{"type": "noun", "defs": ["the plant Viburnum hebanthum of Caprifoliaceae family.", "its yellow flower."]}], "ಕಾದಕರೆ": [{"type": "noun", "defs": ["the plant Mucuna prurita (= M. Puriens) of Papilionaceae family; cat bean plant.", "its bean."]}], "ಕಾದಗ": [{"type": "noun", "defs": ["a thin, flexible material made usu. in sheets from a pulp prepared from rags, wood or other fibrous material, and used for writing or printing on, for packaging, as wrapping material, structural material, etc.; a paper.", "a single sheet or piece of paper.", "a written or printed message; a letter.", "a card, folded and gummed or not, for writing or printing a message; a letter-card."]}], "ಕಾದರಾಯಿ": [{"type": "noun", "defs": ["a heavy cotton fabric with a piled, velvety surface, ribbed vertically; corduroy."]}], "ಕಾದಲ್": [{"type": "noun", "defs": ["profoundly tender, passionate affection for another person based on sexual attraction."]}, {"type": "noun", "defs": ["a kind of plant.", "its bulbous root."]}], "ಕಾದಲ": [{"type": "noun", "defs": ["a man as related to a woman, with whom he has a sexual or romantic relationship; a lover.", "a man as related to a woman whom he is married to; a husband.", "ಕಾದಲಳ್ kādalaḷ= ಕಾದಲೆ2."]}], "ಕಾದಲಿಸು": [{"type": "verb", "defs": ["to have love for a person of other sex; to love; ಕಾದಲಿಸೆವಡು kādalisevaḍu to be loved."]}], "ಕಾದಲುಗೋಪುಕೋಲು": [{"type": "noun", "defs": ["a game played beating short sticks rhythmically and dancing to that rhythm."]}], "ಕಾದಲೆ": [{"type": "noun", "defs": ["= ಕಾದಲ್1."]}, {"type": "noun", "defs": ["a woman as related to a man with whom she has a sexual or romantic relationship; a lover.", "a woman as related with a man whom she is married to; a wife."]}], "ಕಾದಲ್ಮೆ": [{"type": "noun", "defs": ["love - a) a deep and tender feeling of affection for or attachment or devotion to a person or persons; b) such a devoted feeling for a person of opposite sex with who he or she has a sexual or romantic relationship."]}], "ಕಾದಳಕಾಂಡ": [{"type": "noun", "defs": ["the main stem of a plantain plant."]}], "ಕಾದಾಟ": [{"type": "noun", "defs": ["active, armed fighting with enemy forces.", "a hand to hand fighting between two persons.", "a fight, struggle or controversy as between two persons, teams or ideas."]}], "ಕಾದಾಡು": [{"type": "verb", "defs": ["to fight actively with enemy forces; to combat.", "to fight hand to hand with another.", "to fight, struggle with another to uphold one's view, idea or interest."]}], "ಕಾದಾಳಿ": [{"type": "noun", "defs": ["a man who is inclined to quarrel with another.", "a man whose profession is to fight with enemies; a soldier."]}], "ಕಾದಾಳು": [{"type": "noun", "defs": ["a brave fighter, soldier."]}], "ಕಾದಾಳ್ತನ": [{"type": "noun", "defs": ["the valour, temperment or tendency, of a soldier to fight bravely."]}], "ಕಾದಿ": [{"type": "noun", "defs": ["homespun cotton cloth made in India."]}], "ಕಾದಿಗೆ": [{"type": "noun", "defs": ["a deep and wide trench, usu. filled with water, surrounding the rampart of a fortfied place, as a town or castle; a moat.", "a small waterway for the excess rain water in a farm to flow out."]}, {"type": "noun", "defs": ["(dial.) the rain during the period when the moon is closer to the Pleiades, the third of the twnety seven asterisms."]}], "ಕಾದಿಸು": [{"type": "verb", "defs": ["to cause to fight; to make two or more persons engage in a war."]}], "ಕಾದು": [{"type": "verb", "defs": ["to contend with in battle or combat; to war against; to fight with."]}, {"type": "noun", "defs": ["a fight between two armed forces; a war."]}], "ಕಾದುಹ": [{"type": "noun", "defs": ["the act of fighting with another; a fighting of two armed forces."]}], "ಕಾದ್ರವೇಯ": [{"type": "noun", "defs": ["any of the descendants of Kadru, the mythological mother of serpents.", "a kind of snake."]}], "ಕಾನ್": [{"type": "noun", "defs": ["a thick forest by the side of a mountain.", "the state of being crowded with, filled with or densed with."]}], "ಕಾನ್‍ಮಿಗ": [{"type": "noun", "defs": ["any of the animals living or growing in a forest in its original, natural manner without being domesticated; a wild animal; a beast."]}], "ಕಾನ": [{"type": "noun", "defs": ["= ಕಾನ್."]}, {"type": "noun", "defs": ["the organ of hearing; the ear."]}], "ಕಾನಕ": [{"type": "adjective", "defs": ["made of, containing, yielding or having the colour or lustre of, gold; golden."]}], "ಕಾನಕಲ್ಲಟೆ": [{"type": "noun", "defs": ["(dial.) a vine.", "its fruit used as vegetable."]}], "ಕಾನಕಾನಉತ್ತತ್ತಿ": [{"type": "noun", "defs": ["(dial.) a play of boys in which one is to jump over another's feet."]}], "ಕಾನಕೆಂಟಾಲಿ": [{"type": "noun", "defs": ["the tree Euphoria longana (= Nephelium longana) of Sapindaceae family."]}], "ಕಾನಗ": [{"type": "noun", "defs": ["the tree Dalbergia paniculata of Papilionaceae family."]}], "ಕಾನಗು": [{"type": "noun", "defs": ["= ಕಾನಗ."]}], "ಕಾನಗೆ": [{"type": "noun", "defs": ["the tree Myristica malabarica of Myristicaceae family; Malbar nutmeg tree.", "its hard seed."]}], "ಕಾನಡಾ": [{"type": "noun", "defs": ["(mus.) a mode, in Karnaṭaka system, having all the seven notes in both ascending and discending orders, but having a mutative course while descending, derived from Kharaharapriya."]}], "ಕಾನತೇರು": [{"type": "noun", "defs": ["the plant Curcuma longa of Zingiberaceae family.", "its rhizome.", "the yellow powder made from this rhizome."]}], "ಕಾನನ": [{"type": "noun", "defs": ["a large tract of land covered with trees and underbush; a forest; woodland.", "ಧ್ಯಾನವಿಲ್ಲದವ ಕಾನನಕ್ಕೆ ಹೋದರೇನು dhyānavilladava kānanakke hōdarēnu a person pretending to be a saint can never achieve sainthood even standing in the sanctum sanctorum of a temple."]}, {"type": "noun", "defs": ["a building in which a person or persons normally live; a house."]}], "ಕಾನನಕೊಂಬು": [{"type": "noun", "defs": ["the tree Radermachera xylocarpa (= Stereospermum xylocarpum) of Bigoniaceae family."]}], "ಕಾನನಚರ": [{"type": "noun", "defs": ["a man who wanders, lives in a forest, (as a fowler, huntsman, etc.).", "an animal that lives in a forest; a forest animal."]}], "ಕಾನನವಚನ": [{"type": "noun", "defs": ["useless talk; idle gossip; tittle-tattle."]}], "ಕಾನನಾಂತಕ": [{"type": "noun", "defs": ["one who spoils a forest, as a person clearing the land of forests or trees or fire that consumes the forest."]}, {"type": "noun", "defs": ["Śiva, who nipped one head of Brahma."]}], "ಕಾನನಾಂತರ": [{"type": "noun", "defs": ["the portion of a forest that deep and dense with trees and other vegetation."]}], "ಕಾನನಾನುಭವ": [{"type": "noun", "defs": ["the state or experience of living in a forest."]}], "ಕಾನನಾರಿ": [{"type": "noun", "defs": ["= ಕಾನನಾಂತಕ1."]}], "ಕಾನಬಾವಲಿ": [{"type": "noun", "defs": ["the wild-bat, a fury, nocturnal flying mammal of Chiroptera order, navigating by echolocation, feeds on flesh and blood, and lives in forest."]}, {"type": "noun", "defs": ["an ornament for the ear."]}], "ಕಾನಮರ": [{"type": "noun", "defs": ["= ಕಾನರ್ಕ."]}], "ಕಾನರ್ಕ": [{"type": "noun", "defs": ["[rightly - ಕಾಸರ್ಕ] the tree Strychnos nux-vomica of Loganiaceae family.", "its poisonous nut containing strychnine, brucine and other alkaloids; nux-vomica."]}], "ಕಾನಲ್": [{"type": "noun", "defs": ["= ಕಾನನ1."]}], "ಕಾನಶಿರಿಕುಚ್ಚು": [{"type": "noun", "defs": ["an ornamental tuft of threads, cords, etc. of equal length, of different colours, used to hang loosely from the horns of oxen; a tassel."]}], "ಕಾನಶಿಲ್‍ಕುಚ್ಚು": [{"type": "noun", "defs": ["= ಕಾನಶಿರಿಕುಚ್ಚು."]}], "ಕಾನಸೊಪ್ಪು": [{"type": "noun", "defs": ["a tax levied on the plants brought from a forest."]}], "ಕಾನಿ": [{"type": "noun", "defs": ["= ಕಾನ್."]}], "ಕಾನಿಡು": [{"type": "verb", "defs": ["to become dense; to be or become crowded."]}], "ಕಾನೀನ": [{"type": "noun", "defs": ["a son of a woman who is not married.", "(in the same sense, chiefly referred to - a) Karṇa, the son of Kunti, b) Vyāsa, the son of Satyavati, characters in the epic Mahābhārata).", "a son of a whore."]}], "ಕಾನು": [{"type": "noun", "defs": ["= ಕಾನ್.", "ಕಾನುಕಡಿ kānu kaḍi (said in anger or sarcasticaly) to achieve something that is great or difficult; 'you have done a tremendous job'."]}], "ಕಾನುಡಿ": [{"type": "noun", "defs": ["unrefined, coarse or vulgar speech."]}], "ಕಾನುತೋಟ": [{"type": "noun", "defs": ["a farm, agricultural estate situated close or adjacent to a forest."]}], "ಕಾನು ಸುರಗಿ": [{"type": "noun", "defs": ["the tree Ixora arborea (= I. Parviflora) of Rubiaceae family; jungle geranium."]}], "ಕಾನೂ": [{"type": "noun", "defs": ["= ಕಾನೂನು."]}], "ಕಾನೂನು": [{"type": "noun", "defs": ["law - a) all the rules of conduct established and enforced by the authority, legislation or custom of a given community, state or other group b) any one of such rules.", "the condition existing when obedience to such rules is general (as in kānūnu mattu suvyavaste).", "the branch of knowledge dealing with such rules; jurisprudence.", "the system of dispensation of justice as per the llaws of the land (as in 'kānūnannu ninna kaige ettikoḷḷabēḍa); ಕಾನೂನನ್ನು ಕೈಗೆ ತೆಗೆದುಕೊ kanūnannu kaige tegeduko (fig.) to resort to get justice by using force, and not involving the police or judicial system of the state."]}], "ಕಾನೂನುತಜ್ಞ": [{"type": "noun", "defs": ["a man who is well trained in the law; an expert in advising others in matters of law."]}], "ಕಾನೂನುತಜ್ಞೆ": [{"type": "noun", "defs": ["a woman who is well trained in the law; an expert in advising others in matters of law."]}], "ಕಾನೂನುದಾರ": [{"type": "noun", "defs": ["a person who has been trained in the law."]}], "ಕಾನೂನುಬದ್ಧ": [{"type": "adjective", "defs": ["as per, in conformity with or obeying the law or laws of the land.", "that can be enforced in a court of law."]}], "ಕಾನೂನುಬದ್ಧತೆ": [{"type": "noun", "defs": ["the quality, condition or an instance of being legal or lawful; legality.", "the eligibility (of a case, instance, etc.) being enforceable in a court of law."]}], "ಕಾನೂನುಬಾಹಿರ": [{"type": "noun", "defs": ["not authorised or sanctioned, as by rules; prohibited by law; against the law; unlawful; illicit; illegal."]}], "ಕಾನೂನುಭ್ರಷ್ಟ": [{"type": "noun", "defs": ["a man who acts beyond the limits permitted by law; a man engaged in illegal, unlawful activity."]}], "ಕಾನೂನುಭ್ರಷ್ಟೆ": [{"type": "noun", "defs": ["a woman who acts beyond the limits permitted by law; a woman engaged in illegal, unlawful activity."]}], "ಕಾನೂನುಮದುವೆ": [{"type": "noun", "defs": ["a marriage performed as per or as acceptable by concerned law of the land, though not as per the religious customs; a civil marriage."]}], "ಕಾನೂನುಮುರುಕ": [{"type": "noun", "defs": ["a man who violates the laws or rules thereof."]}], "ಕಾನೂನುಮುರುಕಿ": [{"type": "noun", "defs": ["a woman who violates the laws or rules thereof."]}], "ಕಾನೆ": [{"type": "noun", "defs": ["a house; a place.", "a sliding box in a table, bureau, chest, etc., that can be drawn out and then pushed back into place; a drawer.", "a small rectangualur mould for moulding bricks."]}], "ಕಾನೋಲೆ": [{"type": "noun", "defs": ["a kind of sweet pancake made of sesame seeds, jaggery."]}], "ಕಾಪಟಿಕ": [{"type": "noun", "defs": ["a person who cheats; a cheat; a swindler; a deceiver; an impostor.", "one who praises another usu. unduly.", "a man in a royal court whose profession is to praise his master formally or elaboratly; a panegyrist."]}], "ಕಾಪಟಿಗ": [{"type": "noun", "defs": ["= ಕಾಪಟಿಕ - 1."]}], "ಕಾಪಟ್ಯ": [{"type": "noun", "defs": ["the quality or an instance of cheating others; a dishonest action; deceit."]}], "ಕಾಪಥ": [{"type": "noun", "defs": ["a road that is rough, uneven, and tiresome to walk on; a bad path.", "(fig.) an illegal, immoral way, manner, etc.", "the grass Sorghum nitidum (=Andropogon sorghum) of Poaceae family.", "its fragrant root."]}], "ಕಾಪಥೆ": [{"type": "noun", "defs": ["an unchaste woman."]}], "ಕಾಪೞಿ": [{"type": "verb", "defs": ["(one's guard or protecting system) to be destroyed or broken.", "to break another's guard or protecting system."]}], "ಕಾಪಾಟಿಕ": [{"type": "noun", "defs": ["= ಕಾಪಟಿಕ."]}], "ಕಾಪಾಡಿಸು": [{"type": "verb", "defs": ["to cause to save, protect from danger, destruction, etc."]}], "ಕಾಪಾಡು": [{"type": "verb", "defs": ["to keep another safe from harm or danger; to protect; to guard; to save."]}], "ಕಾಪಾಲ": [{"type": "adjective", "defs": ["of or relating to the skul.", "made of a skull.", "of or relating to alms-bowl."]}, {"type": "noun", "defs": ["= ಕಾಪಾಲಿಕ.", "the entire bony or cartilaginous framework of the head of a human, enclosing and protecting the brain; the skull.", "a beggaṛs bowl.", "the vine Cucumis utilissimus of Cucurbitaceae family.", "a tribe that is notified as backward by the government.", "a man belonging to that tribe."]}], "ಕಾಪಾಲಧರ": [{"type": "noun", "defs": ["Śiva, who holds a skull and wears a garland of skulls."]}], "ಕಾಪಾಲಮಾರ್ಗ": [{"type": "noun", "defs": ["the sect of certain Śiva followers who wear garlands of human skulls and use skulls as the vessel for eating and drinking."]}], "ಕಾಪಾಲಿ": [{"type": "noun", "defs": ["= ಕಾಪಾಲಧರ."]}], "ಕಾಪಾಲಿಕ": [{"type": "noun", "defs": ["a south Indian sect of strong followers of Śiva with tantric connotations, and who carry a skull as a bowl for food.", "a follower of that sect."]}], "ಕಾಪಾಳ": [{"type": "adjective", "defs": ["= ಕಾಪಾಲ1."]}, {"type": "noun", "defs": ["= ಕಾಪಾಲ2."]}], "ಕಾಪಾಳಿಕ": [{"type": "noun", "defs": ["= ಕಾಪಾಲಿಕ."]}], "ಕಾಪಿ": [{"type": "noun", "defs": ["(mus.) a mode (more popularly called as Karnāṭaka kāpi), in Karnāṭaka system, having all the seven notes in both ascending and discending orders, but having a mutative course while ascending, derived from Kharaharapriya."]}, {"type": "noun", "defs": ["= ಕಾಫಿ2."]}, {"type": "noun", "defs": ["a thing made just like another; imitation of an original; full reproduction or transcription; a copy.", "a method of learning alphabets using a book containing models of handwriting.", "ಕಾಪಿಮಾಡು kāpi māḍu to copy - a) to make a copy or copies of (a piece of writing, etc.); reproduce; transcribe; b) to make or do something in imitation of (some thing or person); imitate; ಕಾಪಿ ಹೊಡೆ kāpi hoḍe (esp. in school examination) to copy the answers from another's papers or from a book, notes, etc.", "(gen.) to copy illegaly or unethically, to imitate."]}], "ಕಾಪಿಕ್ಕು": [{"type": "verb", "defs": ["to engage a guard or guards to watch, protect someone or something."]}], "ಕಾಪಿಗ": [{"type": "noun", "defs": ["a man who watches, guards or protects another person or his property, etc."]}], "ಕಾಪಿಚಟ್ಟು": [{"type": "noun", "defs": ["a copying of what another has already done, written, said, etc.", "ಕಾಪಿಚಟ್ಟು ಮಾಡು/ಹೊಡೆ kāpi caṭṭu māḍu/hoḍe to copy what another has made, written, said, etc."]}], "ಕಾಪಿಚ್ಚೆ": [{"type": "noun", "defs": ["the tree Garcinia xanthochymus (=G. pictoria, = G. tinctoria) of Guttiferae family; Mysore Gamboge."]}], "ಕಾಪಿಡು": [{"type": "verb", "defs": ["to keep unto keep safe from harm or danger; to protect; to guard; to save.", "to engage a guard or guards to watch, protect someone or something.", "to put a mark on the forehead of cheek of a child with some ointment, ashes, etc. which is supposed to protect the child against injury or evil."]}], "ಕಾಪಿನಾರಾಯಣಿ": [{"type": "noun", "defs": ["(mus.) a mode, in Karnāṭaka system, derived from the main mode Harikāmbhoji."]}], "ಕಾಪಿರಿಸು": [{"type": "verb", "defs": ["to cause someone or something to be watched, guarded against damage, danger, attack, pilferage, etc.; to engage someone for that puirpose."]}], "ಕಾಪಿಲ": [{"type": "adjective", "defs": ["peculiar, particular, belonging, taught, propounded by to sage Kapila the propounder of Sānkhya system of philosophy.", "of or related to, derived from the Sānkhya system of philosophy."]}, {"type": "noun", "defs": ["one of the six major systems of Hindu philosophy, involving two ultimate, completely distinct, principles of matter and spirit, but not recognising any god or lord, mainly propounded by the sage Kapila of about 500B.C.", "a follower of that system.", "the orange or yellow brown colour."]}], "ಕಾಪಿಲಸಿದ್ಧಾಂತ": [{"type": "noun", "defs": ["the philosophy of Sānkhya system that recognises spirit and nature (or matter) as two eternal principles but does not recognise any god or lord."]}], "ಕಾಪಿಲಸ್ನಾನ": [{"type": "noun", "defs": ["a bath taken by using a wet cloth without getting into or pouring on, water or standing under a shower."]}], "ಕಾಪಿಶಾಯನ": [{"type": "noun", "defs": ["any spirituous liquor.", "a thick, sweet, syrupy substance that bees make as food from the nectar of flowers and store in honeycombs; honey.", "a deity."]}], "ಕಾಪಿಷ್ಠ": [{"type": "noun", "defs": ["(Jain.) the eighth of the sixteen heavens."]}], "ಕಾಪಿಳಸಿದ್ಧಾಂತ": [{"type": "noun", "defs": ["= ಕಾಪಿಲಸಿದ್ಧಾಂತ."]}], "ಕಾಪು": [{"type": "noun", "defs": ["the act, fact or an instance of guarding, protecting; protection.", "a cermony performed on the seventh day from the day of birth of a baby to protect the baby from possible danger, evil spirits, etc.", "a protective wall or hedge around something.", "an armlet worn to protect against danger or harm.", "the state of being under the custody of another; imprisonment.", "a mark made with a lamp black on the chin, cheek or forehead either to protect against evil spirits, bad look, etc or for good luck.", "a stuffed scarecrow kept in a rice field to scare birds.", "ಕಾಪಿನವರ್ kāpinavar (pl.) people who guard; watchmen; ಕಾಪಿನಾಳ್ kāpināḷa man employed for guarding a building or other property; a watchman."]}], "ಕಾಪುಕಲಿ": [{"type": "noun", "defs": ["a brave guard; an undaunted watchman."]}], "ಕಾಪುಗಾಡು": [{"type": "noun", "defs": ["a forest protected from tree cutters, and in which wild animals are prohibited from being hunted."]}], "ಕಾಪುಗೊಡು": [{"type": "verb", "defs": ["to entrust the work of watching, guarding to someone."]}], "ಕಾಪುಗೊಳ್": [{"type": "verb", "defs": ["to guard; to watch; to patrol."]}], "ಕಾಪುಗೊಳಿಸು": [{"type": "verb", "defs": ["to save, guard from danger, harm, etc.; to protect."]}], "ಕಾಪುತಡೆ": [{"type": "noun", "defs": ["a check that protects againt injury, loss, mud, soil, etc; a guard-ring, handle-guard of a sword, mud-guard of a vehicle, etc.", "a wall, stacked up sand bags, etc. made to protect something from flood, wind,enemy attack, etc."]}], "ಕಾಪುತ್ರ": [{"type": "noun", "defs": ["an unworthy son."]}], "ಕಾಪುರ": [{"type": "noun", "defs": ["a setting up of a house (as by a man with his family in a new place)."]}], "ಕಾಪುರಾಪು": [{"type": "noun", "defs": ["a protective wearing of a soldier against weapons; an armour."]}], "ಕಾಪುರುಷ": [{"type": "noun", "defs": ["a man of low moral or social standard; a mean fellow.", "a timid, easily frightened or very hesitant man."]}], "ಕಾಪುರುಷತನ": [{"type": "noun", "defs": ["the quality of lacking merit or value; worthlessness; unworthiness; dishonorableness."]}], "ಕಾಪುವಡೆ": [{"type": "verb", "defs": ["to be seized or taken into custody by another; to be arrested.", "to be under or to get protection."]}], "ಕಾಪುವೆರಸು": [{"type": "adverb", "defs": ["accompanied by guards."]}], "ಕಾಪುಹಲಸು": [{"type": "noun", "defs": ["the tree Artocarpus hirsuta of Moraceae family; wild-jack(?).", "its fruit; wild-jack fruit(?)."]}], "ಕಾಪೇಯ": [{"type": "adjective", "defs": ["of or relating to a monkey.", "being like a monkey i.e. as mischievous, imitative, empty gesticulative."]}, {"type": "noun", "defs": ["= ಕಾಪೇಯತನ.", "the family or any of several families of monkeys."]}], "ಕಾಪೇಯತನ": [{"type": "noun", "defs": ["indecent, unmannerly gesture or gestures.", "the conduct which is troublesome, but not malicious, esp. in children; a mischief."]}], "ಕಾಪೋತ": [{"type": "noun", "defs": ["the colour made by blending black and white; gray.", "hydrated sodium carbonate, Na2CO3.10H2O; narton.", "a silvery-white, brittle, nonmetallic chemical element of crystalline structure, found only in combination; antimony.", "a flock of pigeons.", "a collyrum made of antimony."]}], "ಕಾಪೋತಲೇಶ್ಯೆ": [{"type": "noun", "defs": ["the effect of a cause or causes, which is supposed to be of reddish brown colour, (one of the six such effects of different colour)."]}], "ಕಾಪೋತಿ": [{"type": "noun", "defs": ["a sari of gray colour."]}], "ಕಾಪ್ಸಿ": [{"type": "noun", "defs": ["= ಕಾಫ್ಸಿ."]}], "ಕಾಫರ": [{"type": "noun", "defs": ["a person who does not believe in God, the Allah; (a gen. term used by muslims for persons of other religions)."]}], "ಕಾಫಿ": [{"type": "noun", "defs": ["(mus.) a mode (more popularly called as Karnāṭaka kāpi), in Karnāṭaka system, having all the seven notes in both ascending and discending orders, but having a mutative course while ascending, derived from the main mode Kharaharapriya."]}, {"type": "noun", "defs": ["any of the shrubby plants as Coffea arabica, coffea robusta etc. of Rubiaceae family.", "the bean found in the red berries of the shrub; coffee seed.", "powder made of its bean; coffee powder.", "a drink made from brewing these seeds, and adding milk, sugar etc. to it; coffee."]}], "ಕಾಫಿದಾನಿ": [{"type": "noun", "defs": ["a utensil for making, holding coffee."]}], "ಕಾಫಿರ": [{"type": "noun", "defs": ["= ಕಾಫರ."]}], "ಕಾಬ": [{"type": "noun", "defs": ["a holy-stone in the holy mosque in Mecca."]}], "ಕಾಫ್ಸಿ": [{"type": "noun", "defs": ["the plant Debregeasia longifolia (= D. uelutina) of Urticaceae family."]}], "ಕಾಬನ್ನಿ": [{"type": "noun", "defs": ["the tree Prosopis cineraria (= P. spicigera) of Mimosaceae family."]}], "ಕಾಬಳ್ಳಿ": [{"type": "noun", "defs": ["formation and graphic representation of a consonant combined with a vowel, as a single unit."]}], "ಕಾಬಾ": [{"type": "noun", "defs": ["= ಕಾಬ."]}], "ಕಾಬಾಳೆ": [{"type": "noun", "defs": ["the tree Musa superba of Musaceae family; wild plantain.", "its fruit.", "the plant Canna indica of Cannaceae family; liquorice plantain.", "the tree Euodia roxburghiana (= E. lunu-ankenda) of Rutaceae family."]}], "ಕಾಬು": [{"type": "noun", "defs": ["a combination of circumstances favorable for the purpose; fit time; an opportunity.", "the act or fact of controlling; power to direct or regulate."]}, {"type": "verb", "defs": ["to see; to look at."]}], "ಕಾಬುಱಲೆ": [{"type": "noun", "defs": ["a kind of bird."]}], "ಕಾಬೆಕ್ಕು": [{"type": "noun", "defs": ["the undomesticated cat Felis chaus, a forest-inhabitant; wild-cat."]}], "ಕಾಬ್ಯ": [{"type": "noun", "defs": ["poems; poetical works; poetry."]}], "ಕಾಮ": [{"type": "noun", "defs": ["a strong wish or craving; desire.", "sexual appetite; lust; concupiscence.", "the quality of behaving unrestrainedly; capriciousness; fancifulness.", "a healthy sexual life, without violating the other social, moral norms, regarded as one of the four personal aims to be realised or striven for.", "(myth.) the god of love, son of Křṣṇa.", "Balarāma, the elder brother of Křṣṇa.", "the Supreme Being.", "the plant Ammania baccifera of Lythraceae family.", "ಕಾಮನ ಕರಿ kāmana kari the young leaves or flowers of neem tree; ಕಾಮನ ಬಿಲ್ಲು kāmana billu an arc or ring containing the colours of the spectrum in consecutive bands, formed in the sky by the refraction, reflection, and dispersion of light in rain or fog; a rain-bow; ಕಾಮನ ಬಿಲ್ಲು ಬಳ್ಳಿ kāmana billu baḷḷi the creeper Thunbergia mysorensis of Acanthaceae family; rainbow creeper; ಕಾಮನ ಹಬ್ಬ kāmana habba the festival observed on the last full moon-day of the Hindu calendar year; ಕಾಮನ ಹುಣ್ಣಿಮೆ kāmana huṇṇime the last full moon-day of the Hindu calendar year; 2. the festival observed on that day; ಕಾಮನ ಹುಣ್ಣಿವೆ kāmana huṇṇive = ಕಾಮನ ಹುಣ್ಣಿಮೆ; ಕಾಮನ ಹೂ kāmana hū the flower of neem tree; ಕಾಮಕ್ಕೆ ಕಣ್ಣಿಲ್ಲ kāmakke kaṇṇilla lust renders a person blind; love is blind."]}], "ಕಾಮಂಚ": [{"type": "noun", "defs": ["the grass Cymbopogon caesius of Poaceae family; ginger grass.", "the plant Solanum indicum of Solanaceae family; wild Indian brinjal.", "its fruit."]}], "ಕಾಮಂಚಿ": [{"type": "noun", "defs": ["= ಕಾಮಂಚ - 1."]}], "ಕಾಮಂಡಲಿ": [{"type": "noun", "defs": ["a person carrying a small water container which has a handle and snout or nozzle.", "a religious mendicant."]}], "ಕಾಮಕಥೆ": [{"type": "noun", "defs": ["a story of or characterised by romance; a romantic story."]}], "ಕಾಮಕರ": [{"type": "noun", "defs": ["the quality of behaviour of a person characterised by whim; whimsicalness.", "offensive display of superiority or self-importance; overbearing pride; haughtiness; arrogance.", "bravery; valour; prowess."]}], "ಕಾಮಕಲೆ": [{"type": "noun", "defs": ["the skill in and understanding of erotic matters."]}], "ಕಾಮಕಸ್ತೂರಿ": [{"type": "noun", "defs": ["the plant Ocimum basilicum of Lamiaceae family; sweet basil.", "the plant Viola odorata of Violaceae family; sweet violet."]}], "ಕಾಮಕಾತರ": [{"type": "noun", "defs": ["a man having strong sexual desire."]}], "ಕಾಮಕಾತರತೆ": [{"type": "noun", "defs": ["strong sexual appetate; sexual desire."]}], "ಕಾಮಕಾತರೆ": [{"type": "noun", "defs": ["a woman having strong sexual desire."]}], "ಕಾಮಕಾಮಿನಿ": [{"type": "noun", "defs": ["= ಕಾಮಕಾತರೆ.", "(myth.) Rati, the wife of Love God Manmatha."]}], "ಕಾಮಕಾರ": [{"type": "noun", "defs": ["= ಕಾಮಕರ - 1 & 2."]}], "ಕಾಮಕಾರಿಕೆ": [{"type": "noun", "defs": ["= ಕಾಮಕರ - 1 & 2."]}], "ಕಾಮಕೂಟ": [{"type": "noun", "defs": ["the act or practice of prostituting or the fact of being prostituted, esp., the trade of a prostitute; prostitution.", "a man engaged in or helping that practice or trade."]}], "ಕಾಮಕೇರಿ": [{"type": "noun", "defs": ["a road or area where prostitutes live."]}], "ಕಾಮಕೇಲಿ": [{"type": "noun", "defs": ["= ಕಾಮಕೇಳಿ."]}], "ಕಾಮಕೇಳಿ": [{"type": "noun", "defs": ["sexual intercourse preceded by mutual sexual stimulation etc."]}], "ಕಾಮಕೊಣತಿ": [{"type": "noun", "defs": ["a wooden hammer."]}], "ಕಾಮಕೋಳಾಹಳ": [{"type": "noun", "defs": ["Śiva, who annihilated the Love-God Manmatha."]}], "ಕಾಮಕೌಶಲಿ": [{"type": "noun", "defs": ["a person who is adept in love-making."]}], "ಕಾಮಕ್ಲಿಷ್ಟೆ": [{"type": "noun", "defs": ["a woman yearning for her lover and pining from love."]}], "ಕಾಮಗಣ": [{"type": "noun", "defs": ["the group of persons or things that excite and intensify the desire for sexual intercourse."]}], "ಕಾಮಗಾಮಿ": [{"type": "noun", "defs": ["a whimsical man."]}], "ಕಾಮಗಾರ": [{"type": "noun", "defs": ["a person who is employed to do physical or mental work for wages, esp. in order to earn a living, as in a trade, industry, business, office, etc. or on a farm, etc. a worker."]}], "ಕಾಮಗಾರಿ": [{"type": "noun", "defs": ["work done by workers, esp. the work of construction of highways, bridges, tunnels, tanks, buildings, etc."]}], "ಕಾಮಗಾರಿ ಶಿಕ್ಷೆ": [{"type": "noun", "defs": ["imprisonment characterised by the condition that the prisoner must work rigorously in the prison; rigorous imprisonment."]}], "ಕಾಮಗಿರಿ": [{"type": "noun", "defs": ["= ಕಾಮಗಾರಿ."]}], "ಕಾಮಗೀತೆ": [{"type": "noun", "defs": ["a song having love as its theme; a love-song."]}]}