{"ಅರದಾಲಿ": [{"type": "noun", "defs": ["a person assigned to perform personal services of an officer or officers or to carry out a specific task; an orderly."]}], "ಅರದಾಳ": [{"type": "noun", "defs": ["the tree Garcinia cambogia of Guttiferae family; Malabar tamarind."]}], "ಅರದೇಗು": [{"type": "noun", "defs": ["a variety in teak."]}], "ಅರದೇಶಿ": [{"type": "noun", "defs": ["a wanderer who has no fixed home or purpose; a wandering monk."]}], "ಅರದೇಶಿಪರದೇಶಿ": [{"type": "noun", "defs": ["dupl. with an echo word of ಅರದೇಶಿ."]}], "ಅರದೇಸಿ": [{"type": "noun", "defs": ["= ಅರದೇಶಿ."]}], "ಅರನ": [{"type": "noun", "defs": ["(dial.) a steel tool with a rough, ridged surface for smoothing, grinding down; a file."]}], "ಅರನಟ್ಟು": [{"type": "noun", "defs": ["name of a tree."]}], "ಅರನಡೆ": [{"type": "noun", "defs": ["a following of cosmic order or law, including the natural and moral principles that apply to all beings and things; dutiful observance of this law in one's life; right conduct; dharma."]}], "ಅರನಾಭಿದೃಷ್ಟಾಂತ": [{"type": "noun", "defs": ["(phil.) a simile of the spokes and the nave of a wheel itself to bring out that all manifestations emanate from the same source."]}], "ಅರನಾರಿ": [{"type": "noun", "defs": ["partial or complete loss or temporary interruption, of a function, esp. of voluntary motion or of sensation in some part of or the entire, body; paralysis.", "the state or condition of being on to one side of an object only."]}], "ಅರನಾರಿ ಅಂಚು": [{"type": "noun", "defs": ["the fact of having two different colours on either hems of a cloth, esp. a dhoti or a sari."]}], "ಅರನಿದ್ದೆ": [{"type": "noun", "defs": ["disturbed sleep; a waking up before having one's full sleep."]}], "ಅರನಿರಿ": [{"type": "noun", "defs": ["the act, method, manner to be observed, course of action to be followed, prescribed by the established moral, religious or social systems."]}, {"type": "noun", "defs": ["a half-fold of a woman's sari."]}], "ಅರನೆಲೆ": [{"type": "noun", "defs": ["an auxiliary force, supporting that part of the army which goes ahead of it.", "In a battlefield, the place where the king is, and is guarded well."]}], "ಅರನೆಲ್ಲಿ": [{"type": "noun", "defs": ["the tree Cicca disticha ( = C. acida) of Euphorbiaceae family.", "its berry; the country gooseberry.", "the tree Garuga pinnata of Burseraceae family; grey downy balsam.", "a sal tree, Phyllanthus acidus, of Euphorbiaceae family.", "its berry."]}], "ಅರನೇಱಿಲ": [{"type": "noun", "defs": ["a tropical tree Syzigium jambolana of Myrtaceae family.", "its fruit.", "the tree Syzigium operculatum of Myrtaceae family."]}], "ಅರಪಕ್ಷಿ": [{"type": "noun", "defs": ["any bird considered as excellent, luck or auspicious."]}], "ಅರಪಟ್ಟ": [{"type": "noun", "defs": ["the position, rank, dignity or dominion of a king; kingship."]}], "ಅರಪಟ್ಟಂಗಟ್ಟು": [{"type": "verb", "defs": ["to invest with regal dignity and power; to make (another man) a king."]}], "ಅರಪಣ": [{"type": "noun", "defs": ["a man lacking material possessions; he who is not having little or no means to support oneself; a poor man."]}], "ಅರಪಾವು": [{"type": "noun", "defs": ["an old measure of quantity; eight part of a seer."]}], "ಅರಪಿಚ್ಚಗೆ": [{"type": "noun", "defs": ["the flowering plant Jasminum grandiflorum ( = J. officinale) of Oleaceae family."]}], "ಅರಪು": [{"type": "noun", "defs": ["drought - a) a prolonged period of dry weather; lack of rain; b) a prolonged or serious shortage or deficiency, esp. of food."]}, {"type": "noun", "defs": ["= ಅರಪುಕನ್ನೆ."]}], "ಅರಪುಕನ್ನೆ": [{"type": "noun", "defs": ["the tree Vernonia indica of Asteraceae family."]}], "ಅರಪುಡಿ": [{"type": "noun", "defs": ["a small pieces, as of metal, scraped off with a file; filings."]}], "ಅರಪ್ಪು": [{"type": "noun", "defs": ["(dial.) that which is ground into paste, esp. coconut, chillies, etc."]}], "ಅರಬ": [{"type": "noun", "defs": ["an Arab - a) a native or inhabitant of Arabia; b) any of a Semitic people native to Arabia but now widely scattered in other countries.", "ಅರಬರೆರೆಯ arabarereya Mohammed, the Arab prophet who founded Islam."]}, {"type": "noun", "defs": ["a big, usu. two-wheeled cart drawn by a horse, ox, etc."]}], "ಅರಬಕ್ಷಿಪರಬಕ್ಷಿ": [{"type": "adjective", "defs": ["(dial.) lacking intellect or emotional maturity or sense of responsibility."]}], "ಅರಬದ್ದಗಿ": [{"type": "noun", "defs": ["a carpenter working in a palace."]}], "ಅರಬಸ್ಥಾನ": [{"type": "noun", "defs": ["peninsula in South West Asia, between the Red Sea and the Persian Gulf, largely an arid desert plateau; Arabia."]}], "ಅರಬಿ": [{"type": "noun", "defs": ["= ಅರಬಸ್ಥಾನ."]}], "ಅರಬಿದೇಶ": [{"type": "noun", "defs": ["= ಅರಬಸ್ಥಾನ."]}], "ಅರಬೀದಿ": [{"type": "noun", "defs": ["the royal highway in a city.", "any important, main and strategic road."]}], "ಅರಬು": [{"type": "noun", "defs": ["drought - a) a prolonged period of dry weather; lack of rain; b) a prolonged or serious shortage or deficiency, esp. of food.", "(fig.) deficiency or absence of something needed, desirable (as lack of knowledge)."]}], "ಅರಬುಗಾಡು": [{"type": "noun", "defs": ["a dry, barren, sandy region, naturally incapable of supporting almost any life; a desert."]}], "ಅರಬೂತ": [{"type": "noun", "defs": ["the supposed disembodied spirit of a dead person, conceived of as appearing to the living as a pale, shadowy apparition, but horrific."]}], "ಅರಬೇವು": [{"type": "noun", "defs": ["a tree akin to neem."]}], "ಅರಬೊಜಂಗ": [{"type": "noun", "defs": ["a kingly paramour."]}], "ಅರಬ್ಬಿ": [{"type": "noun", "defs": ["= ಅರಬಸ್ಥಾನ.", "= ಅರಬ.", "the Semitic language of the Arabs, spoken in Arabia, syria, Jordan, Iraq, North Africa, etc."]}], "ಅರಬ್ಬಿಸ್ತಾನ್": [{"type": "noun", "defs": ["= ಅರಬಸ್ಥಾನ."]}], "ಅರಬ್ಬೆ": [{"type": "noun", "defs": ["= ಅರಬ್ಬಿ."]}], "ಅರಮ": [{"type": "noun", "defs": ["an ophthalmic disease."]}], "ಅರಮಗ": [{"type": "noun", "defs": ["a male offspring of a king."]}], "ಅರಮಗಳ್": [{"type": "noun", "defs": ["a king's daughter."]}], "ಅರಮಣ್": [{"type": "noun", "defs": ["(obs.) a kind of tax levied by the state."]}], "ಅರಮಣೆ": [{"type": "noun", "defs": ["the chair on which a king sits on formal or ceremonial occasions; a throne."]}], "ಅರಮನೆ": [{"type": "noun", "defs": ["the official residence of a king; a palace.", "any large, magnificent house or building.", "the building or a room in which the affairs of a government department are carried on.", "an established system of political administration by which a nation, state, district, etc. is governed; a government.", "ಅರಮನೆಯ ಮುಂದಿರಬೇಡ, ಕುದುರೆಯ ಹಿಂದಿರಬೇಡ aramaneya mundirabēḍa, kudugeya hindirabēḍa (prov.) a great man and a great river are often ill neighbours; ಅರೆಮನೆಯಿದ್ದರೂ ನೆರೆಮನೆಯಿರಬೇಕು arrmaneyiddarū nere maneyirbēku (prov.) however great one is, he or she, in life, needs association of others."]}], "ಅರಮನೆಕಾಱ": [{"type": "noun", "defs": ["one who is in the service of a king; a palace servant."]}], "ಅರಮರಲು": [{"type": "noun", "defs": ["the tree Triphasia aurantiola of Rutaceae family; the mask lime."]}], "ಅರಮರಳು": [{"type": "noun", "defs": ["= ಅರಮರಲು."]}], "ಅರಮರಿಕೆ": [{"type": "noun", "defs": ["the act or an instance of suspecting guilt, a wrong, harmfulness, etc. with little or no supporting evidence; a suspicion.", "disagreement; a dissidence; disapproval; unwillingness.", "a temporary or imperfect cover."]}], "ಅರಮರೆ": [{"type": "noun", "defs": ["a hesitating or feeling hesitant; hesitation; reluctance."]}], "ಅರಮರೆಮಾಡು": [{"type": "verb", "defs": ["to cover incompletely.", "to reveal (a fact) only partially.", "to hesitate; to show reluctance."]}], "ಅರಮರ್ದ": [{"type": "noun", "defs": ["a disordered or incomplete state or condition."]}], "ಅರಮಾದಲ": [{"type": "noun", "defs": ["= ಅರಮಾದಳ."]}], "ಅರಮಾದಳ": [{"type": "noun", "defs": ["the tree Zanthoxylum rhetsa of Rutaceae family, and its fruit."]}], "ಅರಮಾಯಿಷಿಪರಮಾಯಿಷಿ": [{"type": "noun", "defs": ["(dial.) a very precious thing."]}], "ಅರಮಾವು": [{"type": "noun", "defs": ["a hand tool with a sharp, wedge-shaped, blade for cutting or shaping stone; a chisel.", "a short, pointed cutting tool with a round handle, used by engravers; a burin."]}], "ಅರಮಾಸಿಪರಮಾಸಿ": [{"type": "noun", "defs": ["= ಅರಮಾಯಿಷಿಪರಮಾಯಿಷಿ."]}], "ಅರಮುಡಿ": [{"type": "noun", "defs": ["the hair on the head of a king."]}], "ಅರಮೆ": [{"type": "adjective", "defs": ["to some extent; in a small degree; to a slight extent; only slightly; not much.", "at some places; under some circumstances; not everywhere; somewhere."]}, {"type": "noun", "defs": ["an area in or near a city, usually laid out with walks, drives, playgrounds, etc., for public recreation; a park; a pleasure-grove."]}, {"type": "noun", "defs": ["a cuddling; affection; fondness."]}], "ಅರಮ್ಮನೆ": [{"type": "noun", "defs": ["= ಅರಮನೆ."]}], "ಅರರ": [{"type": "noun", "defs": ["any piece of cloth used as a concealing or separating screen or curtain.", "a movable structure for opening or closing an entrance, as to a building or room or giving access to a closet, cupboard, etc.; a door."]}, {"type": "interjection", "defs": ["an interjection used to express grief, compassion, pity; etc."]}], "ಅರರಿ": [{"type": "noun", "defs": ["= ಅರರ1 - 2."]}], "ಅರರಿಪುಟ": [{"type": "noun", "defs": ["a flat piece, usu. rectangular, forming a part of a door, window, etc.; a panel."]}], "ಅರರೆ": [{"type": "interjection", "defs": ["an interjection used to express wonder, appreciation, etc."]}], "ಅರರೇ": [{"type": "interjection", "defs": ["= ಅರರೆ."]}], "ಅರಲ್": [{"type": "verb", "defs": ["(flower) to open into blossoms; to bloom.", "(skin, as from cold) to crack."]}, {"type": "noun", "defs": ["in a plant, the seed-producing structure of an angiosperm, consisting of colourful petals, and pollen-bearing stamens unfolding around the pistils; a flower."]}], "ಅರಲಂಬ": [{"type": "noun", "defs": ["Manmatha, the Love-God, whose five arrows are made of different flowers."]}], "ಅರಲಂಬು": [{"type": "noun", "defs": ["the flower-arrow of the Love God, Manmatha."]}], "ಅರಲಪೊಡೆಯ": [{"type": "noun", "defs": ["= ಅರಲ್ಪೊಡೆಯ."]}], "ಅರಲಸರಲ": [{"type": "noun", "defs": ["= ಅರಲಂಬ."]}], "ಅರಲಾನ್": [{"type": "verb", "defs": ["to produce blossoms; to bloom."]}], "ಅರಲಿಚ": [{"type": "noun", "defs": ["Brahma, as born from a flower."]}], "ಅರಲಿಸು": [{"type": "verb", "defs": ["to cause (a flower) to bloom.", "(fig.) to cause to reach a prime condition as in health, vigour, perfection, beauty, etc.; to cause to flourish."]}], "ಅರಲು": [{"type": "verb", "defs": ["= ಅರಲ್¹."]}, {"type": "noun", "defs": ["= ಅರಲ್²."]}, {"type": "noun", "defs": ["a thick mixture of clay, and sometimes sand, with water; puddle.", "a small pool of stagnant, spilled or muddy water."]}, {"type": "noun", "defs": ["the tree Anogeissus latifolia ( = Conocorpus latifolia) of Combretaceae family; axle wood.", "the tree Ailanthus excelsa of Simaroubaceae family."]}], "ಅರಲುಗುಂದು": [{"type": "verb", "defs": ["(the flowering of a plant) to become less; to flower less."]}], "ಅರಲುಗೆಂಡ": [{"type": "noun", "defs": ["a piece of coal glowing brilliantly"]}], "ಅರಲುಣಿ": [{"type": "noun", "defs": ["the bee, that feeds on nectar from the flowers."]}], "ಅರಲುಮಂದಾರ": [{"type": "noun", "defs": ["the plant Bauhinia acuminata of Caesalpiniaceae family."]}], "ಅರಲೆ": [{"type": "noun", "defs": ["cotton fibre separated from the seeds; ginned cotton."]}], "ಅರಲೆಲೆ": [{"type": "noun", "defs": ["an ornament in the shape of peepul tree (Ficus religiosa) leave for children to be worn on the forehead or around the waist."]}], "ಅರಲೇಱಿ": [{"type": "noun", "defs": ["an insect of a large super-family (Apoidea) of broad-bodied, four-winged, hairy hymenopteran, that gather pollen and nectar, have biting as well as sucking mouthparts, and often live in organised colonies; the honeybee."]}], "ಅರಲ್ಕೆ": [{"type": "noun", "defs": ["the act or process of a flower expanding; a blooming."]}], "ಅರಲ್ಗುಂದಿಸು": [{"type": "verb", "defs": ["to cause to flower less."]}], "ಅರಲ್ಗೊಳ": [{"type": "noun", "defs": ["the lake abounding in (lotus) flowers."]}], "ಅರಲ್ಚು": [{"type": "verb", "defs": ["to cause to bloom; to cause a flower to open."]}, {"type": "noun", "defs": ["the act of a flower blooming."]}], "ಅರಲ್ತರ್": [{"type": "verb", "defs": ["to bloom; to flower; to produce flower."]}], "ಅರಲ್ತೊಡಂಬೆ": [{"type": "noun", "defs": ["a cluster or bunch of flowers."]}], "ಅರಲ್ದಂಡೆ": [{"type": "noun", "defs": ["a wreath or woven chain of flowers; a garland."]}], "ಅರಲ್ದುಱುಗಲ್": [{"type": "noun", "defs": ["a cluster or bunch of flowers."]}], "ಅರಲ್ದೊಂಗಲ್": [{"type": "noun", "defs": ["= ಅರಲ್ದುಱುಗಲ್."]}], "ಅರಲ್ದೋಂಟ": [{"type": "noun", "defs": ["a garden of flowering plants."]}], "ಅರಲ್ನನೆ": [{"type": "noun", "defs": ["a small swelling or projection on a plant, from which a flower develops; a flower-bud."]}], "ಅರಲ್ಪೊಡೆಯ": [{"type": "noun", "defs": ["Viṣṇu, who has a flower in his navel."]}], "ಅರಲ್ಮಳೆ": [{"type": "noun", "defs": ["= ಅರಲ್ವಳೆ."]}], "ಅರಲ್ಮೊಲೆ": [{"type": "noun", "defs": ["a woman's breast in the development stage.", "a woman's breast in the shape of a flower bud."]}], "ಅರಲ್ವಕ್ಕಿ": [{"type": "noun", "defs": ["= ಅರಲೇಱಿ."]}], "ಅರಲ್ವಡಿಗ": [{"type": "noun", "defs": ["a man who sells flowers, garlands, etc."]}], "ಅರಲ್ವಸೆ": [{"type": "noun", "defs": ["a seat decorated with flowers.", "a bed made of flowers."]}], "ಅರಲ್ವಳೆ": [{"type": "noun", "defs": ["a rain of flowers; a down pour of flowers."]}], "ಅರಲ್ವಳೆಗಱೆ": [{"type": "verb", "defs": ["to pour flowers ( on the idol of a deity or a person)."]}], "ಅರಲ್ವೞೆ": [{"type": "noun", "defs": ["= ಅರಲ್ವಳೆ."]}], "ಅರಲ್ವಾಸು": [{"type": "noun", "defs": ["a bed made of flowers."]}], "ಅರಲ್ವೊಡೆಯ": [{"type": "noun", "defs": ["= ಅರಲ್ಪೊಡೆಯ."]}], "ಅರಲ್ವೋಗು": [{"type": "verb", "defs": ["to open wide (usu. with a short, light explosive sound) from heat; to be popped."]}], "ಅರವ": [{"type": "noun", "defs": ["one of the major Indian languages, belonging to Dravidian family, spoken chiefly in Tamil Nadu in South India and in Sri Lanka; the official Language of Tamil Nadu; Tamil language.", "a Tamil-speaking man.", "the state of Tamil Nadu, in South India."]}, {"type": "noun", "defs": ["a village priest of Todava community in South India."]}], "ಅರವಂಟಿಗೆ": [{"type": "noun", "defs": ["a shed on the roadside in which water, butter-milk etc. are distributed gratis."]}], "ಅರವಗಿತ್ತಿ": [{"type": "noun", "defs": ["a Tamil speaking woman."]}], "ಅರವಟಿಗೆ": [{"type": "noun", "defs": ["= ಅರವಂಟಿಗೆ."]}], "ಅರವಟೆ": [{"type": "noun", "defs": ["a heart disease."]}], "ಅರವಟ್ಟಿಗೆ": [{"type": "noun", "defs": ["= ಅರವಂಟಿಗೆ."]}], "ಅರವಟ್ಟು": [{"type": "noun", "defs": ["= ಅರವಂಟಿಗೆ."]}], "ಅರವಡ್ಡಗಿ": [{"type": "noun", "defs": ["a carpenter working in a palace."]}], "ಅರವತ್ತು": [{"type": "adjective", "defs": ["amounting to sixty."]}, {"type": "noun", "defs": ["the cardinal number between sixty; 60.", "ಅರವತ್ತು ಗಳಿಗೆ ಪ್ರಸವವೇದನೆ, ಹೆತ್ತದ್ದು ಸುಂಡಿಲಿ aravatu gaḷige prasavavēdane, hettaddu suṇḍili (prov.) a mountain in labour brought forth a mouse."]}, {"type": "noun", "defs": ["(dial.) the process or an instance of mixing cow-dung and seeds meant for sowing.", "(dial.) the process or an instance of mixing the entire pulse, before splitting, with wet red-soil."]}], "ಅರವರಿಸು": [{"type": "verb", "defs": ["to think about; to determine, resolve, work out, etc. by reasoning.", "to ignore or disregard; to neglect."]}], "ಅರವಲ": [{"type": "noun", "defs": ["a measure of capacity; fourth part of a seer."]}], "ಅರವಸಿರು": [{"type": "noun", "defs": ["the birth in a royal family."]}], "ಅರವೞಿ": [{"type": "noun", "defs": ["a royal family."]}], "ಅರವಾವು": [{"type": "noun", "defs": ["a variety of large snakes that eats small snakes."]}], "ಅರವಿಂದ": [{"type": "noun", "defs": ["any of various water lilies, esp. the pink or white Asian lotus (Nelumbo nucifera), used as a religious symbol in Hinduism and Buddhism; the lotus plant and its flower.", "(pros.) name of a meter.", "the Indian crane, a bird of the family Gruidae, of usu. large gruiform wading birds with very long legs and neck and a long, straight bill."]}], "ಅರವಿಂದಗಂಧಿ": [{"type": "noun", "defs": ["a woman of Padmini class, whose body's odour is supposed to be like that of a lotus (as per the writers of the science of erotics)."]}], "ಅರವಿಂದಗರ್ಭ": [{"type": "noun", "defs": ["Bramha, born from the lotus."]}], "ಅರವಿಂದನಾಭ": [{"type": "noun", "defs": ["Viṣṇu, who has a lotus flower in his navel."]}], "ಅರವಿಂದನೇತ್ರ": [{"type": "noun", "defs": ["Viṣṇu, who has a lotus petal like wide and beautiful eyes."]}], "ಅರವಿಂದನೇತ್ರೆ": [{"type": "noun", "defs": ["a woman whose eyes are as wide and beautiful as lotus petals."]}], "ಅರವಿಂದಪ್ರಿಯ": [{"type": "noun", "defs": ["the sun, as a lover of lotus flower."]}], "ಅರವಿಂದಬಂಧು": [{"type": "noun", "defs": ["the sun, as a well-wisher of lotus flower."]}], "ಅರವಿಂದಭವ": [{"type": "noun", "defs": ["= ಅರವಿಂದಗರ್ಭ."]}], "ಅರವಿಂದಮಿತ್ರ": [{"type": "noun", "defs": ["= ಅರವಿಂದಪ್ರಿಯ."]}], "ಅರವಿಂದಮುಖಿ": [{"type": "noun", "defs": ["a woman with lotus-like beautiful face."]}], "ಅರವಿಂದವನ": [{"type": "noun", "defs": ["a multitude of lotus plants."]}], "ಅರವಿಂದಸಖ": [{"type": "noun", "defs": ["= ಅರವಿಂದಪ್ರಿಯ."]}], "ಅರವಿಂದಾಕರ": [{"type": "noun", "defs": ["a lake, as an abode of lotus plants."]}], "ಅರವಿಂದಾಕ್ಷ": [{"type": "noun", "defs": ["= ಅರವಿಂದನೇತ್ರ."]}], "ಅರವಿಂದಾಸ್ಯೆ": [{"type": "noun", "defs": ["= ಅರವಿಂದಮುಖಿ."]}], "ಅರವಿಂದಿನಿ": [{"type": "noun", "defs": ["the lotus plant."]}], "ಅರವಿವರ": [{"type": "noun", "defs": ["the space between two spokes of a wheel."]}], "ಅರವೀಸ": [{"type": "noun", "defs": ["a measure of capacity; half of a vīsa (now obs.).", "a monetary unit, half of haṇa, now obs.)."]}], "ಅರವು": [{"type": "noun", "defs": ["= ಅರವ1 - 1 & 2."]}], "ಅರವುಡಿ": [{"type": "noun", "defs": ["small pieces, as of metal, scraped off with a file; filings."]}], "ಅರವುಮರವು": [{"type": "noun", "defs": ["the loss of one's ability to think, form judgments, draw conclusions, etc."]}], "ಅರವುರನೆ": [{"type": "adverb", "defs": ["hastily; in haste."]}], "ಅರವೆಂಡಿರ್": [{"type": "noun", "defs": ["pl. of ಅರವೆಣ್."]}], "ಅರವೆಣ್": [{"type": "noun", "defs": ["a woman belonging to a royal family."]}], "ಅರವೆಱೆ": [{"type": "noun", "defs": ["the moon, as it appears in waxing or waning, having one concave edge and one convex edge; the crescent moon."]}], "ಅರವೊಱಸು": [{"type": "noun", "defs": ["a variety in pigeon (of Columbidae family)."]}], "ಅರಶ": [{"type": "noun", "defs": ["= ಅರಸ1."]}], "ಅರಶಿ": [{"type": "noun", "defs": ["the plant Thespesia populnea ( = Hibiscus populnea) of Malvaceae family; Indian Tulip)."]}], "ಅರಸ": [{"type": "noun", "defs": ["a male ruler of a nation or state usually called a kingdom; male sovereign, limited or absolute; a monarch; a king.", "a respectable, elderly man.", "a man in relation to his wife; a husband.", "ಅರಸನ ಅಂಕೆಯಿಲ್ಲ, ದೈವದ (ದಯ್ಯದ) ಕಾಟವಿಲ್ಲ arasana aŋkeyilla, daivada(dayyada) kāṭavilla (prov.) the state of being absolutely free or unrestrained; ಅರಸ ಆರು ಮೊಳ, ಬಂಟ ಎಂಟು ಮೊಳ arasu āru moḷa, baṇṭa eṇṭu moḷa (prov.) often lower officers tend to wield more powers than their superior; ಅರಸನ ಮಾನ ಅರಸನಿಗೆ, ಅಗಸನ ಮಾನ ಅಗಸನಿಗೆ arasana māna arasanige, agasana māna agasanige (prov.) for each person his/her prestige is important and one need not sell one's self-pride to save another's; ಅರಸರ ಕರಗಸ arasara karagasa a title 'he who cuts rival kings into pieces'; ಅರಸರ ಕಾಣಿಕೆ arasara kāṇike a tax levied by the king; ಅರಸನ ಕಂಡಹಾಗಾಯಿತು. ಬಿಟ್ಟಿಮಾಡಿದ ಹಾಗೂ ಆಯಿತು arasana kaṇḍahāgāyitu, biṭṭimāḍida hāgū āyitu (prov.) to kill two birds with one stone; ಅರಸನ ಕುದುರ ಲಾಯದಲ್ಲೆ ಮುಪ್ಪಾಯಿತು arasana kudure lāyadalle muppāyitu (prov.) the best medals lose their lustre unless brightened by use."]}, {"type": "adjective", "defs": ["having no water, dampness or moisture; not having essential fluid; sapless.", "wanting sentiment; lacking spirit or interest; boring; dull."]}, {"type": "noun", "defs": ["one who cannot, does not have the tendency to, enjoy the poetical, musical or aesthetic sentiments."]}], "ಅರಸಂಕ": [{"type": "noun", "defs": ["a king of fame.", "a wrestler in the service of a palace;", "ಅರಸಂಕಕರಗಸ arasaŋka karagasa a title 'he who cuts famous kings or the best wrestlers into pieces'; ಅರಸಂಕಗಾಳ arasaŋka gāḷa a title 'he who is the personified death to famous kings or the best wrestlers'; ಅರಸಂಕಭೀಮ arasaŋka bhīma a title 'he who is the wrestler of best wrestlers'; ಅರಸಂಕಮೊನೆಗಾಱ arasaŋka monegāṛa a title 'he who is the wrestler of best wrestlers'. ಅರಸಂಕಸೂನೆಗಾಱ arasaŋka sūnegāṛa a title 'he who is the wrestler of best wrestlers'."]}], "ಅರಸಂಚೆ": [{"type": "noun", "defs": ["the tropical white swan with long red neck and red legs; royal-swan."]}], "ಅರಸಂಚೆಗಮನೆ": [{"type": "noun", "defs": ["a woman whose gait is beautiful like that of a royal-swan."]}], "ಅರಸಗಿಳಿ": [{"type": "noun", "defs": ["a variety in parrots, known for its imitation of human speech; a royal parrot; a kingly-parrot.", "(fig.) a loveable, cute child."]}], "ಅರಸತೂಕ": [{"type": "noun", "defs": ["the grater importance or consequence, influence, as of a king."]}], "ಅರಸರಿಕೆ": [{"type": "noun", "defs": ["the fact of having fame in a royal court."]}], "ಅರಸರಿಕೆಯ ಬಿಜ್ಜೆವಳಂ": [{"type": "noun", "defs": ["a scholar of fame in a royal court."]}], "ಅರಸಾಂಗ": [{"type": "noun", "defs": ["an administrative division in a princely state."]}], "ಅರಸಾಟ": [{"type": "noun", "defs": ["the act of searching; a search."]}], "ಅರಸಾಣೆ": [{"type": "noun", "defs": ["the order of a king or a ruler."]}], "ಅರಸಾನಿ": [{"type": "noun", "defs": ["a wife of a king."]}], "ಅರಸಾಳ್": [{"type": "noun", "defs": ["= ಅರಸಾಳು."]}], "ಅರಸಾಳಿಕೆ": [{"type": "noun", "defs": ["a governing by a king; a king's rule."]}], "ಅರಸಾಳು": [{"type": "noun", "defs": ["a servant employed to perform services of a king."]}], "ಅರಸಾಳ್ಕೆ": [{"type": "noun", "defs": ["= ಅರಸಾಳಿಕೆ."]}], "ಅರಸಾಳ್ತನ": [{"type": "noun", "defs": ["the code, principles governing the service of a king's servants.", "the office and authority of a king's servant.", "the state of being a king's servant."]}], "ಅರಸಿ": [{"type": "noun", "defs": ["the female ruler of a kingdom.", "a mistress of a big family.", "the wife of a king.", "a wife, in gen."]}], "ಅರಸಿಂಗ": [{"type": "noun", "defs": ["the best king among kings."]}], "ಅರಸಿಕ": [{"type": "adjective", "defs": ["having no taste to enjoy the poetical, musical sentiments."]}, {"type": "noun", "defs": ["a man who cannot, does not have the tendency to, enjoy the poetical, musical or aesthetic sentiments."]}], "ಅರಸಿಕತನ": [{"type": "noun", "defs": ["= ಅರಸಿಕತೆ."]}], "ಅರಸಿಕತೆ": [{"type": "noun", "defs": ["lack of taste for music, poetry or art, etc."]}], "ಅರಸಿಕೆ": [{"type": "noun", "defs": ["the position, rank, dignity, responsibility or dominion of a king; kingship."]}, {"type": "noun", "defs": ["a woman who cannot, does not have the tendency to, enjoy the poetical, musical or aesthetic sentiments."]}], "ಅರಸಿಗ": [{"type": "noun", "defs": ["(masc.) one who searches (for); searcher."]}], "ಅರಸಿಣ": [{"type": "noun", "defs": ["= ಅರಸಿನ."]}], "ಅರಸಿತನ": [{"type": "noun", "defs": ["the state, office or dignity of a queen; queenship."]}], "ಅರಸಿತಿ": [{"type": "noun", "defs": ["a queen - a) the wife of a king; b) the woman who rules over a kingdom in her own right."]}], "ಅರಸಿನ": [{"type": "noun", "defs": ["turmeric - a) the plant Curcuma longa of the ginger family, whose rhizome in powdered form is used as a yellow dye or a seasoning and in medicine; b) the aromatic rhizome or the powder made from it."]}], "ಅರಸಿನ ಉಮ್ಮತ್ತ": [{"type": "noun", "defs": ["the plant Argemone mexicana of Papaveraceae family; Mexican poppy."]}], "ಅರಸಿನ ಉಮ್ಮತ್ತಿ": [{"type": "noun", "defs": ["= ಅರಸಿನ ಉಮ್ಮತ್ತ."]}], "ಅರಸಿನ ಕಂಕಣ": [{"type": "noun", "defs": ["a piece of turmeric root tied on the wrist of the bride or bridegroom."]}], "ಅರಸಿನ ಕಮ್ಮಾಟ": [{"type": "noun", "defs": ["= ಅರಸಿನ ಉಮ್ಮತ್ತ."]}], "ಅರಸಿನ ಕೆಂಬಟ್ಟೆ": [{"type": "noun", "defs": ["a kind of bird."]}], "ಅರಸಿನ ಗುರುಗಿ": [{"type": "noun", "defs": ["the tree Garcenia morella of Guttiferae family; Mysore Gamboge."]}], "ಅರಸಿನ ಜೀನಂಗಿ": [{"type": "noun", "defs": ["the plant Sesbania grandiflora ( = S. Aegyptiaca) of Papilionaceae family."]}], "ಅರಸಿನ ತೇಗೆ": [{"type": "noun", "defs": ["the tree Dina cordifolia of Rubiaceae family; saffron teak; yellow teak of Mysore."]}], "ಅರಸಿನ ದತ್ತೂರ": [{"type": "noun", "defs": ["= ಅರಸಿನ ಉಮ್ಮತ್ತ."]}], "ಅರಸಿನ ಬೂರಗ": [{"type": "noun", "defs": ["the plant Cochlospermum religiosum ( = Cochlospermum gossypium) of Cochlospermaceae family; white silk cotton."]}], "ಅರಸಿನ ಸಾಸಿವೆ": [{"type": "noun", "defs": ["the plant Polycarpaea aurea of Caryophyllaceae family."]}], "ಅರಸಿನ ಹೂ": [{"type": "noun", "defs": ["the plant Allamanda Cathartica of Apocynaceae family."]}], "ಅರಸಿವಟ್ಟ": [{"type": "noun", "defs": ["the state, office or dignity of a queen; queenship.", "the crown of a queen."]}], "ಅರಸು": [{"type": "verb", "defs": ["to go over or look through for the purpose of finding something; a searching.", "ಅರಸುತ್ತಿರುವ ಬಳ್ಳಿ ಕಾಲಿಗೆ ತೊಡರಿದಂತೆ arasuttiruva baḷḷi kālige todaridante (prov.) (simile) like the most wanted thing to come to the doorstep on its own."]}, {"type": "noun", "defs": ["a male ruler of a nation or state usu. called a kingdom; a male sovereign, limited or absolute; a monarch; a king.", "a woman who rules over a kingdom in her own right; a queen.", "a) (previously) a caste, members of which were mostly taken to military profession; b) (now) a class notified by the government as one of the economically backward classes.", "any member of this caste.", "the position, rank, dignity or dominion of a king; kingship.", "the rule of a king.", "the qualities a king is required to have."]}], "ಅರಸುಕುಮಾರ": [{"type": "noun", "defs": ["= ಅರಸುಗುವರ."]}], "ಅರಸುಕುಮಾರಕ": [{"type": "noun", "defs": ["= ಅರಸುಗುವರ."]}], "ಅರಸುಕುಮಾರಿ": [{"type": "noun", "defs": ["= ಅರಸುಗುವರಿ."]}], "ಅರಸುಕುವರ": [{"type": "noun", "defs": ["= ಅರಸುಗುವರ."]}], "ಅರಸುಕುವರಿ": [{"type": "noun", "defs": ["= ಅರಸುಗುವರಿ."]}], "ಅರಸುಗಾಣ್": [{"type": "verb", "defs": ["to get the powers of a king; to become a king."]}], "ಅರಸುಗಾದೆ": [{"type": "noun", "defs": ["the science and art of political government; political science."]}], "ಅರಸುಗಾವಲು": [{"type": "noun", "defs": ["the profession of the bodyguard of a king."]}], "ಅರಸುಗಿಡು": [{"type": "verb", "defs": ["to lose one's kingship."]}], "ಅರಸುಗಿಳಿ": [{"type": "noun", "defs": ["a variety in parrots, known for its fine imitation of human speech; a royal parrot; a kingly-parrot.", "(fig.) a loveable, cute child."]}], "ಅರಸುಗುಣ": [{"type": "noun", "defs": ["the necessary quality, character of a king."]}], "ಅರಸುಗುಲ": [{"type": "noun", "defs": ["the royal family."]}], "ಅರಸುಗುವರ": [{"type": "noun", "defs": ["the son of a king; a prince."]}], "ಅರಸುಗುವರಿ": [{"type": "noun", "defs": ["the daughter of a king; a princess."]}], "ಅರಸುಗೆಯ್": [{"type": "verb", "defs": ["to rule with authority; to administer the affairs of a state; to govern; to be the king."]}], "ಅರಸುಗೆಯ್ತ": [{"type": "noun", "defs": ["= ಅರಸುಗೆಯ್ಮೆ."]}], "ಅರಸುಗೆಯ್ಮೆ": [{"type": "noun", "defs": ["the act, process or manner of governing a state."]}], "ಅರಸುಗೊಡು": [{"type": "verb", "defs": ["to bestow kingship on."]}], "ಅರಸುಚಾವಡಿ": [{"type": "noun", "defs": ["a royal court - a) a sovereign together with counsellors, ministers, etc. as a governing body; b) any formal gathering, reception, etc. held by a sovereign."]}], "ಅರಸುಠೀವಿ": [{"type": "noun", "defs": ["the dignity and style of a sovereign."]}], "ಅರಸುತಕ್ಕು": [{"type": "noun", "defs": ["the plant, Xylia xylocarpa of Dacaceae family."]}], "ಅರಸುತನ": [{"type": "noun", "defs": ["the position, rank, dignity or dominion of a king."]}], "ಅರಸುತನಂಗೆಯ್": [{"type": "verb", "defs": ["= ಅರಸುಗೆಯ್."]}], "ಅರಸುತೂಕ": [{"type": "noun", "defs": ["importance , consequence or influence a person or his words carry."]}], "ಅರಸುತೋಟ": [{"type": "noun", "defs": ["a beautiful, prime garden or park of a city.", "a plesure grove of a king."]}], "ಅರಸುನರಕ": [{"type": "noun", "defs": ["a horrible hell."]}], "ಅರಸುನೇಱಿಲ್": [{"type": "noun", "defs": ["a tropical tree Syzigium jambolana of Myrtaceae family, and its fruit.", "the tree Syzigium operculatum of Myrtaceae family."]}], "ಅರಸುಪೆಂಡಿ": [{"type": "noun", "defs": ["a descendant of a royal family."]}], "ಅರಸುಬೀದಿ": [{"type": "noun", "defs": ["a main road of a city.", "a highway that connects major cities of a nation."]}], "ಅರಸುಬ್ಬು": [{"type": "verb", "defs": ["to feel high emotional excitement from joy."]}], "ಅರಸುಮಗ": [{"type": "noun", "defs": ["= ಅರಸುಗುವರ."]}], "ಅರಸುಮಗಳ್": [{"type": "noun", "defs": ["= ಅರಸುಗುವರಿ."]}], "ಅರಸುಮರ್ಜಿ": [{"type": "noun", "defs": ["excessive arrogance; haughty snobbishness."]}], "ಅರಸುಮಿಗ": [{"type": "noun", "defs": ["a best variety among deers."]}], "ಅರಸುಮೋಹರ": [{"type": "noun", "defs": ["a multitude or assemblage of kings.", "a royal army."]}], "ಅರಸುವಣ್ಣು": [{"type": "noun", "defs": ["a best variety among any fruits."]}], "ಅರಸುಹುಣ್ಣು": [{"type": "noun", "defs": ["a painful bacterial infection (esp. Staphylococcus aureus) deep beneath the skin, having a network of pus-filled boils; carbuncle."]}], "ಅರಸೂಳಿಗ": [{"type": "noun", "defs": ["the service of a king's servant."]}], "ಅರಸೆ": [{"type": "noun", "defs": ["the large tree Ficus religiosa of Moraceae family; peepul; bo-tree."]}], "ಅರಸೆಕ್ಕೆ": [{"type": "noun", "defs": ["the plant Calotropis gigantea (var. alb flora) of Asclepiadaceae family."]}], "ಅರಸೇರು": [{"type": "noun", "defs": ["an old unit of measure of capacity; half a seer.", "an old unit of measurement of weight; half a seer."]}], "ಅರಸೊಡವೆ": [{"type": "noun", "defs": ["a royal ornament.", "a very precious ornament."]}], "ಅರಸೊತ್ತಿಗೆ": [{"type": "noun", "defs": ["the kingship; the government of a monarch or his family."]}], "ಅರಸೊಲ್ಲಗೆ": [{"type": "noun", "defs": ["a measure of capacity; eighth part of a seer."]}], "ಅರಸ್ಥಾನ": [{"type": "noun", "defs": ["the official residence of a monarch, king; a palace.", "the royal court, where regular counsel or meetings are held."]}], "ಅರಹಂತ": [{"type": "noun", "defs": ["(Jain.) a spiritual teacher."]}], "ಅರಹಾವು": [{"type": "noun", "defs": ["a variety of large snakes that eats small snakes."]}], "ಅರಹೀರೆ": [{"type": "noun", "defs": ["the plant, Luffa cylindica ( = L. aegiptica) of Cucurbitaceae family.", "its gourd."]}], "ಅರಹುಚ್ಚ": [{"type": "noun", "defs": ["a partially insane man."]}], "ಅರಹುಚ್ಚಿ": [{"type": "noun", "defs": ["a partially insane woman."]}], "ಅರಹುಡಿ": [{"type": "noun", "defs": ["small pieces, as of metal, scraped off with a file; filings."]}], "ಅರಹೊಟ್ಟೆ": [{"type": "noun", "defs": ["the state or condition of having food very much less than one's requirement as from poverty."]}], "ಅರಹೊಱಸು": [{"type": "noun", "defs": ["a variety in pigeon (of Columbidae family)."]}], "ಅರಳ್": [{"type": "noun", "defs": ["= ಅರಳು1."]}, {"type": "noun", "defs": ["= ಅರಳು2."]}, {"type": "noun", "defs": ["paddy, maize kernels, etc. burst and puffed up by heating; popcorn."]}], "ಅರಳಂಬ": [{"type": "noun", "defs": ["Manmatha, the Love God, whose arrows are made of flowers."]}], "ಅರಳಂಬು": [{"type": "noun", "defs": ["the flower-arrow of the Love God, Manmatha."]}], "ಅರಳಲರ್": [{"type": "noun", "defs": ["a well blown flower."]}], "ಅರಳಸರಳ": [{"type": "noun", "defs": ["Manmatha, the Love-God, whose five arrows are made of different flowers."]}], "ಅರಳಿ": [{"type": "noun", "defs": ["the large tree Ficus religiosa of Moraceae family; peepul; bo-tree."]}, {"type": "noun", "defs": ["a member of the Lacertilia, having four legs, green body, moveable eyelids; lacerta interpunctula."]}], "ಅರಳಿಗ": [{"type": "noun", "defs": ["the illicit sexual partner of a woman not married to him."]}, {"type": "noun", "defs": ["a variety of bird."]}], "ಅರಳಿಚು": [{"type": "verb", "defs": ["to cause to expand or to blossom."]}], "ಅರಳಿಟ್ಟು": [{"type": "noun", "defs": ["popped corn ground and mixed with milk (used as a food); pinole."]}], "ಅರಳಿಯೆಲೆ": [{"type": "noun", "defs": ["= ಅರಳೆಲೆ."]}], "ಅರಳಿಸು": [{"type": "verb", "defs": ["to cause to expand or to blossom."]}], "ಅರಳು": [{"type": "verb", "defs": ["(said of flowers) to open into blossoms; to bloom."]}, {"type": "noun", "defs": ["in a plant, the seed-producing structure of an angiosperm, consisting of colourful petals, and pollen-bearing stamens unfolding around the pistils; a flower."]}, {"type": "noun", "defs": ["a popped grain (of paddy, millet) or corn.", "ಅರಳು ಹುರಿದಂತೆ ಮಾತನಾಡು araḷuhuridante mātanāḍu to talk continuously and fluently (like the continuous mild explosive sound produced when grains or corn are popped)."]}], "ಅರಳುಂಡೆ": [{"type": "noun", "defs": ["a sweet ball-like eatable, made of popped paddy."]}], "ಅರಳುಗಣ್": [{"type": "noun", "defs": ["= ಅರಳುಗಣ್ಣು."]}], "ಅರಳುಗಣ್ಣು": [{"type": "noun", "defs": ["a large, round eye; a saucer-eye."]}], "ಅರಳುಣ್ಣು": [{"type": "verb", "defs": ["to drink nectar from the flowers."]}], "ಅರಳುದದ್ದು": [{"type": "noun", "defs": ["a skin eruption esp. accompanied by fever; the disease so characterised; exanthem."]}], "ಅರಳುಮಲ್ಲಿಗೆ": [{"type": "noun", "defs": ["an expanded jasmine flower."]}], "ಅರಳುವಾಸು": [{"type": "noun", "defs": ["a bed of flowers."]}], "ಅರಳೆ": [{"type": "noun", "defs": ["cotton fibre separated from the seeds; ginned cotton.", "the plant Gossypium herbaceum (=G. obtusifolium) of Malvaceae family."]}, {"type": "noun", "defs": ["a post; a pillar."]}], "ಅರಳೆಬಾತು": [{"type": "noun", "defs": ["a variety in goose."]}], "ಅರಳೆಬೇನೆ": [{"type": "noun", "defs": ["a lung disease caused by continuous inhaling of cotton dust."]}], "ಅರಳೆಲೆ": [{"type": "noun", "defs": ["an ornament, in the shape of peepul (Ficus religiosa) leaf, worn by young children on the forehead or waist."]}], "ಅರಳೆಲೆಮಾಲೆ": [{"type": "noun", "defs": ["an ornamental chain of small golden or silver plates in the shape of peepul leaf."]}], "ಅರಳೇಳ್": [{"type": "verb", "defs": ["to pop - a) (a grain or corn) to burst with a short, light, and explosive sound from heating; b) to move, go, come, etc. suddenly and quickly, and usually unexpectedly."]}], "ಅರಳ್ಕೆ": [{"type": "noun", "defs": ["the act or process of a flower expanding; a blooming."]}], "ಅರಳ್ಗಣ್": [{"type": "noun", "defs": ["= ಅರಳುಗಣ್ಣು."]}], "ಅರಳ್ಗಣ್ಣು": [{"type": "noun", "defs": ["= ಅರಳುಗಣ್ಣು."]}], "ಅರಳ್ಗಱೆ": [{"type": "verb", "defs": ["to pour flowers ( on the idol of a deity or a person), like rain."]}], "ಅರಳ್ಗೂಡು": [{"type": "verb", "defs": ["to mix flower with.", "to mix with flower."]}], "ಅರಳ್ಚು": [{"type": "verb", "defs": ["to cause to bloom; to cause a flower to open."]}], "ಅರಳ್ಬಿಲ್ಲು": [{"type": "noun", "defs": ["a bow made of flowers; the bow of Manmatha, the Love-God."]}], "ಅರಳ್ಮಲರು": [{"type": "noun", "defs": ["a blown up, expanded flower."]}], "ಅರಳ್ಮಳೆ": [{"type": "noun", "defs": ["a shower or down pour, of flowers."]}], "ಅರಳ್ಮುಡಿ": [{"type": "noun", "defs": ["a knot or a braid of hair dressed with flowers."]}, {"type": "verb", "defs": ["to dress oneself the knot or braid of hair with flowers."]}], "ಅರಳ್ವಾಸು": [{"type": "noun", "defs": ["a bed made of flowers."]}], "ಅರಾಕು": [{"type": "noun", "defs": ["a product of distillation; liquid obtained by distilling; esp. strong alcoholic drink, esp. that distilled from rice, molasses or coconut milk."]}], "ಅರಾಜಕ": [{"type": "adjective", "defs": ["wanting law and order or government; anarchic."]}, {"type": "noun", "defs": ["anarchy - a) the complete absence of government; b) political disorder and violence; lawlessness; c) disorder in any sphere of activity; chaos."]}], "ಅರಾಜಕತಾವಾದ": [{"type": "noun", "defs": ["the theory that all forms of government interfere unjustly with individual liberty and should be replaced by the voluntary association of cooperative groups; anarchism."]}], "ಅರಾಜಕತಾವಾದಿ": [{"type": "noun", "defs": ["a person who believes in or advocates anarchism; anarchist."]}], "ಅರಾಜಕತೆ": [{"type": "noun", "defs": ["= ಅರಾಜಕ2."]}], "ಅರಾಜಿಕ": [{"type": "noun", "defs": ["= ಅರಾಜಕ2."]}], "ಅರಾಡಮುರಾಡ": [{"type": "noun", "defs": ["the state or quality of being obstinate; specif., a) stubbornness b) resistance to treatment; obstinacy.", "a man of such qualities."]}], "ಅರಾತಿ": [{"type": "noun", "defs": ["a person who hates another, and wishes or tries to injure him; a foe; an enemy.", "(astrol.) (in the horoscope) sixth house from the first place."]}], "ಅರಾತಿದಲ್ಲಣ": [{"type": "noun", "defs": ["a person causing intense fear to his enemies."]}], "ಅರಾತಿನಿಕರ": [{"type": "noun", "defs": ["a multitude or group of enemies."]}], "ಅರಾತಿಸ್ಥಾನ": [{"type": "noun", "defs": ["a place, town or abode of the enemy.", "(astrol.) (in the horoscope) sixth house from the first place."]}], "ಅರಾತಿಹರ": [{"type": "noun", "defs": ["(masc.) one who destroys his enemies."]}], "ಅರಾಬಿ": [{"type": "noun", "defs": ["the fact of having or being extended over, large area; wideness."]}], "ಅರಾಬಿಗೋಡೆ": [{"type": "noun", "defs": ["the huge wall surrounding the town or city."]}], "ಅರಾಬು": [{"type": "noun", "defs": ["violent disturbance or commotion, esp. one accompanied by loud, confused noise, as of shouting; tumult; uproar."]}], "ಅರಾಲ": [{"type": "adjective", "defs": ["made curved or crooked; bent; not straight.", "textured close; woven firmly together."]}, {"type": "noun", "defs": ["the tree Shorea robusta ( = S. talura, - Vatica robusta) of Dipterocarpaceae family; the Sal tree.", "the resinous exudation of this tree.", "(dance) a single hand-gesture, in which the forefinger is curved like a bow, the thumb also curved and the other fingers are kept one behind the other."]}], "ಅರಾಲು": [{"type": "noun", "defs": ["the sandy sea-shore."]}], "ಅರಾಷ್ಟ್ರಕ": [{"type": "adjective", "defs": ["not belonging to a nation; not having the citizenship of a particular nation; non-national."]}, {"type": "noun", "defs": ["a person not belonging to or not having citizenship of, a particular country; a non-national; a foreigner."]}], "ಅರಾಷ್ಟ್ರಕತೆ": [{"type": "noun", "defs": ["the state or condition of not belonging to, not having citizenship of, a particular country; non-citizenship; want of nationality.", "the state or condition of having no state or nationality; statelessness."]}]}