{"ಚೇಗೊಡತಿಸೊಪ್ಪು": [{"type": "noun", "defs": ["a kind of plant ."]}], "ಚೇಟ": [{"type": "noun", "defs": ["a man employed for personal or menial work; a servant."]}], "ಚೇಟಕ": [{"type": "noun", "defs": ["= ಚೇಟ."]}], "ಚೇಟಿ": [{"type": "noun", "defs": ["a woman employed for personal or menial work; a maid-servant."]}], "ಚೇಟಿಕೆ": [{"type": "noun", "defs": ["= ಚೇಟಿ."]}], "ಚೇಡಿ": [{"type": "noun", "defs": ["= ಚೇಡೆ."]}], "ಚೇಡಿಸು": [{"type": "verb", "defs": ["to provoke or enrage with a stinging, pungent remark.", "to annoy, tease or rag for fun."]}], "ಚೇಡುಬೀರ": [{"type": "noun", "defs": ["the plant Cipadessa baccifera (= C. fruticosa) of Meliaceae family."]}], "ಚೇಡೆ": [{"type": "noun", "defs": ["an evil or mischievous spirit, worshipped by people practicing black magic.", "magic with an evil purpose; black magic; sorcery."]}], "ಚೇಣ": [{"type": "noun", "defs": ["a wedge-shaped hand tool with a sharp blade for cutting or shaping stone; a chisel."]}], "ಚೇಣಿ": [{"type": "noun", "defs": ["a kind of grass, straws of which are used to weave mats.", "a variety in sugarcane."]}, {"type": "noun", "defs": ["the act or process of buying or selling.", "a contract by which one party (landlord or lessor) gives to another (tenant or lessee) the use and possession of lands, buildings, property, etc. for a specified time and for fixed payments; lease.", "a part or portion of a whole.", "a particular test conducted for testing the genuineness of a pearl."]}], "ಚೇಣಿಕಬ್ಬು": [{"type": "noun", "defs": ["= ಚೇಣಿ1 - 2."]}], "ಚೇಣಿಮಂದಲಿಗೆ": [{"type": "noun", "defs": ["a mat made by interweaving the straws of cēṇi grass."]}], "ಚೇತ": [{"type": "noun", "defs": ["= ಚೇತನ2 - 1."]}], "ಚೇತಕಿ": [{"type": "noun", "defs": ["the nut of the plant Terminalia chebula of Combretaceae family; chebulic myrobalan."]}], "ಚೇತನ": [{"type": "adjective", "defs": ["having a feeling or knowledge (of one's own sensations, feelings, etc. or of external things; conscious.", "having life; not dead; live.", "that can be seen, observed or felt."]}, {"type": "noun", "defs": ["the state of being conscious; awareness of one's own feelings, what is happening around one, etc. consciousness.", "the totality of one's thoughts, feelings, and impressions; conscious mind.", "an entity which is regarded as being the immortal or spiritual part of the person and, though having no physical or material reality, is credited with the functions of thinking and willing.", "the Supreme Being; the God.", "any thing that is living, as an animal.", "the quality that makes a person active, energetic, etc."]}], "ಚೇತನಂಗುಂದು": [{"type": "verb", "defs": ["= ಚೇತನಗುಂದು."]}], "ಚೇತನಂಗೆಡು": [{"type": "verb", "defs": ["= ಚೇತನಗುಂದು -2."]}], "ಚೇತನಂಬಡೆ": [{"type": "verb", "defs": ["= ಚೇತನವಡೆ."]}], "ಚೇತನಗಿಡಿಸು": [{"type": "verb", "defs": ["to cause to lose consciousness.", "to make a person feeble; to weaken."]}], "ಚೇತನಗಿಡು": [{"type": "verb", "defs": ["= ಚೇತನಗುಂದು -2."]}], "ಚೇತನಗುಂದು": [{"type": "verb", "defs": ["(one's consciousness, energy or strength) to dwindle or to be lost.", "to lose one's consciousness, energy or strength."]}], "ಚೇತನತ್ವ": [{"type": "noun", "defs": ["= ಚೇತನ2."]}], "ಚೇತನದಪ್ಪು": [{"type": "verb", "defs": ["= ಚೇತನಗುಂದು -2."]}], "ಚೇತನದಾಯಕ": [{"type": "adjective", "defs": ["that gives energy or helps one recover consciousness, energy, strength, etc."]}, {"type": "noun", "defs": ["that which gives energy or helps one recover consciousness, energy, strength, etc."]}], "ಚೇತನಧರ್ಮ": [{"type": "noun", "defs": ["(collectively) the natural qualities, properties of a living being."]}], "ಚೇತನಪ್ರತಿಮೆ": [{"type": "noun", "defs": ["(fig.) a living being considered as or behaving as, a doll; a person whose actions, ideas, etc. are controlled by another; a puppet."]}], "ಚೇತನಭಾವ": [{"type": "noun", "defs": ["the quality or state of having consciousness or being energetic and lively."]}], "ಚೇತನವಡೆ": [{"type": "verb", "defs": ["to regain consciousness, recover vigour, energy or strength."]}], "ಚೇತನಾಚೇತನ": [{"type": "noun", "defs": ["the totality of animate and inanimate things."]}], "ಚೇತನಿಸು": [{"type": "verb", "defs": ["= ಚೇತನವಡೆ."]}], "ಚೇತನೆ": [{"type": "noun", "defs": ["= ಚೇತನ2."]}], "ಚೇತನೆಗೊಳ್": [{"type": "verb", "defs": ["= ಚೇತನವಡೆ."]}], "ಚೇತನೆವಡೆ": [{"type": "verb", "defs": ["= ಚೇತನವಡೆ."]}], "ಚೇತರಣೆ": [{"type": "noun", "defs": ["= ಚೇತನ2 - 1&2."]}], "ಚೇತರಾಶಿ": [{"type": "noun", "defs": ["the plant Fumaria indica (= F. parviflora) of Fumariaceae family; fumitory."]}], "ಚೇತರಿಕೆ": [{"type": "noun", "defs": ["an act of recovering; recovery.", "the regaining of or possibility of regaining something lost or taken away; recovery.", "restoration or return to health from sickness; recovery.", "restoration or return to any former and better state or condition; recovery.", "an improvement in the economy marking the end of a recession or decline; recovery."]}], "ಚೇತರಿಸು": [{"type": "verb", "defs": ["to regain (health, consciousness, etc.); to recover.", "to cause to regain (health, consciousness, etc.)."]}], "ಚೇತಸ್ಸು": [{"type": "noun", "defs": ["the state of being conscious; awareness of one's own feelings, what is happening around one, etc. consciousness.", "the totality of one's thoughts, feelings, and impressions; conscious mind.", "an entity which is regarded as being the immortal and spiritual part of the person; soul."]}], "ಚೇತೋಜಾತ": [{"type": "noun", "defs": ["Manmatha, the Love-God, whose influence comes from within."]}], "ಚೇತೋನಂದನ": [{"type": "noun", "defs": ["that which gives pleasure, delight to the mind."]}], "ಚೇತೋರಥ": [{"type": "noun", "defs": ["wish; desire; yearning."]}], "ಚೇತೋವೃತ್ತಿ": [{"type": "noun", "defs": ["the normal, natural function or functions of the mind including inclinations, tendencies, etc."]}], "ಚೇತೋಹಾರಿ": [{"type": "adjective", "defs": ["that holds, captivates or charms the attention of by being very interesting or delightful; fascinating; charming."]}], "ಚೇತ್ರ": [{"type": "noun", "defs": ["a holy place, usu. having a shrine, river, etc., where people go on pilgrimage; a pilgrimage centre."]}], "ಚೇದಿಯ": [{"type": "noun", "defs": ["a place of worship for Buddhists or Jainas; a building containing some relics of Buddha or Jaina."]}], "ಚೇಪರಿಸಿನ": [{"type": "noun", "defs": ["= ಚೇಪು2."]}], "ಚೇಪರ್ದು": [{"type": "noun", "defs": ["a kind of eagle that is reddish in colour."]}], "ಚೇಪಿಡು": [{"type": "verb", "defs": ["to mark with or smear reddish turmeric."]}], "ಚೇಪು": [{"type": "verb", "defs": ["to throw, scatter or dash a liquid in small particles or drops; to spatter.", "to move two things over each other with pressure; to rub."]}, {"type": "noun", "defs": ["an instance of (a cow, buffalo) letting the milk flow out of its udder."]}, {"type": "noun", "defs": ["reddish yellow powder of a particular kind of turmeric.", "red or reddish colour."]}], "ಚೇಪುಬಿಡು": [{"type": "verb", "defs": ["(a milch cow or buffalo) to let the milk flow out of its udder."]}], "ಚೇಪೆ": [{"type": "noun", "defs": ["a flat, coarse fabric made of woven or plaited hemp, straw, rope, etc., used to sit on and occasionally as a screen."]}, {"type": "noun", "defs": ["the tree Psidium guajava (= P. pyriferum) of Myrtaceae family; guava tree.", "its round or pear-shaped, yellowish edible fruit; guava."]}], "ಚೇರ": [{"type": "noun", "defs": ["the Malabar region of south west India.", "people of that region.", "a variety of horse, usu. Of dull reddish-brown colour, bred in that region."]}, {"type": "noun", "defs": ["the middle-sized small tree Erinocarpus nimmoanus of Tiliaceae family, with fibrous bark."]}], "ಚೇರಟೆ": [{"type": "noun", "defs": ["a kind of articulate worm of Chilopoda class, having an elongated, flattened body composed of from 15 to 173 segments, each with a pair of legs, and which rolls itself firmly up into a coil when touched."]}], "ಚೇರಡಿ": [{"type": "noun", "defs": ["the upper portion of a pillar of a building."]}], "ಚೇರಣಿಗ": [{"type": "noun", "defs": ["a man originally belonging to, living in Malabar region in south west of India."]}], "ಚೇರಮಾನಿ": [{"type": "noun", "defs": ["a horse, usu. of dull, of reddish-brown colour, bred in Malabar region."]}], "ಚೇರಿ": [{"type": "noun", "defs": ["a narrow way between hedges, walls, buildings, etc.; narrow country road or city street; a lane.", "a number of people or things arranged so as to form a line, esp. a straight line; a row.", "any of the four coloured stripes on the chequered cloth used in the game of dice."]}], "ಚೇರಿಸು": [{"type": "verb", "defs": ["to carry and deliver (something) to; to reach.", "to put or blend something with another or two or more things together in a single mass or compound; to join, combine or mix.", "to adjust or arrange rightly; to settle.", "to give out as a task; to allot; to assign.", "to admit to or cause (someone) to join, etc."]}], "ಚೇರು": [{"type": "noun", "defs": ["a disease transmitted by sexual intercourse, characterised by swollen testicles."]}, {"type": "noun", "defs": ["an ornamental metal cone, used to decorate the horns of oxen."]}], "ಚೇರುಕುಟಿ": [{"type": "noun", "defs": ["an inflamed, painful, pus-filled swelling around the genitals caused by a venereal disease."]}], "ಚೇರುನಾರಂಗ": [{"type": "noun", "defs": ["the tree Citrus aurantium (= C. bergamia) of Rutaceae family having white, fragrant blossoms and hard, yellow wood; orange tree.", "its reddish-yellow, round, edible fruit, with a sweet, juicy pulp; orange."]}], "ಚೇರೆ": [{"type": "noun", "defs": ["the make, shape, form or appearance of a person or thing; personal features."]}], "ಚೇಲ": [{"type": "noun", "defs": ["a woven fabric of fibrous material (as cotton, wool, silk, etc.); a piece of cloth.", "a thing that is of low, mean or disagreeable quality or standard."]}, {"type": "noun", "defs": ["a pupil, student or follower of a teacher.", "a follower - a) a man who follows another; b) a servant or attendant.", "a man who has been converted into Muslim religion by force in his boyhood."]}, {"type": "noun", "defs": ["= ಚೇಲಬಾಗೆ."]}], "ಚೇಲಬಾಗೆ": [{"type": "noun", "defs": ["the tree Albizzia julibrissin of Mimosae family."]}], "ಚೇಲವಾಡಿ": [{"type": "noun", "defs": ["a building or system where lodging, usu. with boarding, facilities for students is provided; a student-hostel."]}], "ಚೇಲಾ": [{"type": "noun", "defs": ["= ಚೇಲ2."]}], "ಚೇಲಾಚಾರ": [{"type": "noun", "defs": ["one's behaviour that is wicked, immoral, mischievous or harmful."]}], "ಚೇಲಿ": [{"type": "noun", "defs": ["a wicked, immoral, unchaste or quarrelsome woman."]}, {"type": "noun", "defs": ["= ಚೇಲ2."]}], "ಚೇಲಿಕ": [{"type": "noun", "defs": ["a man who stitches, repairs or alters clothes; a tailor."]}], "ಚೇಲಿಕೆ": [{"type": "noun", "defs": ["a substance secreted in a glandular sac under the skin of the abdomen of the male musk deer, having a strong odour, and used in perfumery; musk."]}], "ಚೇಲೆ": [{"type": "noun", "defs": ["= ಚೇಲ2."]}], "ಚೇಷ್ಟಾಕೃತ": [{"type": "noun", "defs": ["(dance.) gesticulatory movement or movements."]}], "ಚೇಷ್ಟಾಲು": [{"type": "noun", "defs": ["a man who has the tendency to play mischief or who habitually causes annoyance with playful tricks."]}], "ಚೇಷ್ಟಿತ": [{"type": "adjective", "defs": ["done; performed; completed; worked.", "moved; stirred (from one's place); shaken.", "tried; attempted; endeavoured.", "disturbed, affected (as by a evil spirit)."]}, {"type": "noun", "defs": ["a work that is done, performed, completed.", "the act, process or result of moving; movement.", "a man disturbed, affected or possessed (by an evil spirit)."]}], "ಚೇಷ್ಟಿಸು": [{"type": "verb", "defs": ["to move slightly from one's place of being; to stir oneself.", "to act, do, perform.", "to cause to move, act, perform, etc.", "to recover from a condition of ill-health, inertia, etc.", "to play fun with; to play for fun, recreation."]}], "ಚೇಷ್ಟೆ": [{"type": "noun", "defs": ["a movement of the body or of part of the body.", "the doing of something; state of working.", "the result of working; a work.", "the way a person behaves or acts; conduct; behaviour; manners.", "that which urges a person work, to be or become active.", "fun; joking.", "a playing or jumping in joy; a lively play.", "an act or instance of teasing or ragging; an annoying or vexing with playful trick; mischief."]}], "ಚೇಷ್ಟೆಕೋರ": [{"type": "noun", "defs": ["a man who habitually causes amusement, merriment.", "a man inclined to annoy or vex with playful tricks; a naughty fellow."]}], "ಚೇಷ್ಟೆಖೋರ": [{"type": "noun", "defs": ["= ಚೇಷ್ಟೆಕೋರ."]}], "ಚೇಷ್ಟೆಗಾರ": [{"type": "noun", "defs": ["= ಚೇಷ್ಟೆಕೋರ."]}], "ಚೇಷ್ಟೆಗೆಡು": [{"type": "verb", "defs": ["(movement, ) to be stopped; (one's ability to move) to be lost.", "to lose this ability."]}], "ಚೇಹರಾ": [{"type": "noun", "defs": ["= ಚೇರೆ."]}], "ಚೇಳ್": [{"type": "noun", "defs": ["the edible, freshwater cyprinoid fish Carnatic carp."]}], "ಚೇಳ": [{"type": "noun", "defs": ["= ಚೇಲ1."]}], "ಚೇಳಕಡೆ": [{"type": "noun", "defs": ["= ಚೇಳುಮಣಿ."]}], "ಚೇಳಿಕ": [{"type": "noun", "defs": ["= ಚೇಲಿಕ."]}], "ಚೇಳಿಕೆ": [{"type": "noun", "defs": ["= ಚೇಲಿಕೆ."]}], "ಚೇಳು": [{"type": "noun", "defs": ["any of numerous arachnids of the order Scorpionida, widely distributed in warmer parts of the world, having a long, narrow, segmented tail that terminates in a venomous sting; a scorpion."]}, {"type": "noun", "defs": ["a kind of plant."]}], "ಚೇಳುಕೊಂಡಿ": [{"type": "noun", "defs": ["= ಚೇಳುಮಣಿ.", "the flowering plant Impatiens mysorensis of Balsaminaceae family."]}], "ಚೇಳುಬಾಣ": [{"type": "noun", "defs": ["a fire-cracker which resembles a scorpion in its movements."]}], "ಚೇಳುಬಾಲ": [{"type": "noun", "defs": ["= ಚೇಳುಮಣಿ."]}], "ಚೇಳುಮಣಿ": [{"type": "noun", "defs": ["the plant Heliotropium indicum of Boraginaceae family."]}], "ಚೇಳುರಿಗಿಡ": [{"type": "noun", "defs": ["the nettle plant Tragia hispida of Euphorbiaceae family."]}], "ಚೇಳುವಾಲ": [{"type": "noun", "defs": ["= ಚೇಳುಮಣಿ."]}], "ಚೇಳುವಾಲಿ": [{"type": "noun", "defs": ["= ಚೇಳುಮಣಿ."]}], "ಚೇಳುವಾಳಿ": [{"type": "noun", "defs": ["= ಚೇಳುಮಣಿ."]}], "ಚೇೞ್": [{"type": "noun", "defs": ["= ಚೇಳು1."]}], "ಚೈ": [{"type": "noun", "defs": ["the act of caressing, fondling or playing affectionately; a mutual merrymaking."]}], "ಚೈಗುಡು": [{"type": "verb", "defs": ["to play, with love , with a child, the loved one or one's sexual partner."]}], "ಚೈತ": [{"type": "adjective", "defs": ["relating to the pyre."]}], "ಚೈತನ್ಯ": [{"type": "noun", "defs": ["the life principle; the state or property of a living being that distinguishes it from inorganic matter or dead organisms.", "consciousness - a) the state of being conscious; awareness of one's own feelings, what is happening around one, etc.; b) the totality of one's thoughts, feelings, and impressions.", "an entity which is regarded as being the immortal or spiritual part of the person and, though having no physical or material reality, which thinks, wills.", "energetic action; liveliness; activity.", "the state or quality of being strong or having power; vigour."]}], "ಚೈತನ್ಯಂಬಡೆ": [{"type": "verb", "defs": ["= ಚೈತನ್ಯವಡೆ."]}], "ಚೈತನ್ಯಗೆಡು": [{"type": "verb", "defs": ["to lose one's consciousness or strength (physical or mental)."]}], "ಚೈತನ್ಯದಾಯಕ": [{"type": "adjective", "defs": ["that infuses strength, enthusiasm; that makes ardent, vigorous, active, etc."]}], "ಚೈತನ್ಯದಾಯಿ": [{"type": "adjective", "defs": ["= ಚೈತನ್ಯದಾಯಕ."]}], "ಚೈತನ್ಯಭಾವಿ": [{"type": "noun", "defs": ["a thing that is in the form of pure consciousness.", "a person who is intelligent, perceptive, wise, clever, etc."]}], "ಚೈತನ್ಯವಡೆ": [{"type": "verb", "defs": ["to gain or regain life or consciousness.", "to become active, vivacious or cheerful."]}], "ಚೈತನ್ಯವಡೆಸು": [{"type": "verb", "defs": ["to fill with life and energy; to make vigorous, active or enthusiastic; to enliven; to invigorate."]}], "ಚೈತನ್ಯವಾದ": [{"type": "noun", "defs": ["(phil.) idealism - any of various theories which hold that - a) things exist only as ideas in the mind rather than as material objects independent of the mind; b) things in the material world are actually manifestations of an independent realm of unchanging, immaterial models or forms."]}], "ಚೈತನ್ಯಸ್ಥ": [{"type": "noun", "defs": ["a man having the faculty of reasoning and understanding, possessing intelligence.", "a man with relatively much wealth or rich resources; a wealthy man."]}], "ಚೈತನ್ಯಾತುಮ": [{"type": "noun", "defs": ["= ಚೈತನ್ಯಾತ್ಮ."]}], "ಚೈತನ್ಯಾತ್ಮ": [{"type": "noun", "defs": ["the absolute consciousness; the Supreme Soul."]}], "ಚೈತನ್ಯಾರೋಪಣೆ": [{"type": "noun", "defs": ["the act of superimposing of life and intelligence on an inanimate thing or things; personification."]}], "ಚೈತಾಗ್ನಿ": [{"type": "noun", "defs": ["the funeral fire."]}], "ಚೈತ್ತ": [{"type": "adjective", "defs": ["relating to the mind or consciousness."]}], "ಚೈತ್ಯ": [{"type": "adjective", "defs": ["relating to the pyre."]}, {"type": "noun", "defs": ["a monument erected at a place where the ashes of a corpse burn, is buried.", "a sacrificial shed.", "a place of worship for Buddhists or Jainas; a building containing some relic¸À of Buddha or Jaina.", "the individual soul.", "the fig tree Ficus religiosa of Moraceae family; peepul; bo-tree."]}], "ಚೈತ್ಯಕ": [{"type": "noun", "defs": ["something set up to keep alive the memory of a person; monument."]}], "ಚೈತ್ಯಗೃಹ": [{"type": "noun", "defs": ["= ಚೈತ್ಯ2 - 3."]}], "ಚೈತ್ಯಗೇಹ": [{"type": "noun", "defs": ["= ಚೈತ್ಯ2 - 3."]}], "ಚೈತ್ಯಪುರುಷ": [{"type": "noun", "defs": ["the human soul; the psyche."]}], "ಚೈತ್ಯಾಲಯ": [{"type": "noun", "defs": ["= ಚೈತ್ಯ2 - 3."]}], "ಚೈತ್ಯಾವಸಥ": [{"type": "noun", "defs": ["= ಚೈತ್ಯ2 - 3."]}], "ಚೈತ್ಯಾವಾಸ": [{"type": "noun", "defs": ["= ಚೈತ್ಯ2 - 3."]}], "ಚೈತ್ಯಾಳಯ": [{"type": "noun", "defs": ["= ಚೈತ್ಯ2 - 3."]}], "ಚೈತ್ಯೇಶ": [{"type": "noun", "defs": ["= ಚೈತ್ಯಪುರುಷ."]}], "ಚೈತ್ರ": [{"type": "noun", "defs": ["the first month in the Hindu and Indian national calendars (approx. corresponding to March-April period)."]}], "ಚೈತ್ರದೂತ": [{"type": "noun", "defs": ["the Indian cuckoo that heralds the onset of spring season."]}], "ಚೈತ್ರದೂತಿ": [{"type": "noun", "defs": ["the creeper Hiptage madablota of Malpighiaceae family, with white fragrant flowers; spring creeper."]}], "ಚೈತ್ರ್ರಪವಿತ್ರ": [{"type": "noun", "defs": ["a festival observed during Caitra, the first month in the Hindu calendar."]}], "ಚೈತ್ರರಥ": [{"type": "noun", "defs": ["(myth.) the garden of Kubēra, the regent of wealth."]}], "ಚೈತ್ರಾಗಮ": [{"type": "noun", "defs": ["the onset of spring season."]}], "ಚೈತ್ರಿ": [{"type": "noun", "defs": ["= ಚೈತ್ರ."]}], "ಚೈತ್ರಿಕ": [{"type": "noun", "defs": ["= ಚೈತ್ರ."]}], "ಚೈನಿ": [{"type": "noun", "defs": ["the habitual act of making merry, taking much pleasure, engaging in gratifying oneself.", "ಚೈನಿ ಹೊಡೆ caini hoḍe to spend money and time on pleasure, gratification."]}], "ಚೈನು": [{"type": "noun", "defs": ["= ಚೈನಿ."]}, {"type": "noun", "defs": ["a flexible series of joined links, usu. in the form of rings of metal passing through one another, used to pull, confine, support, measure or transmit power; a chain.", "a chain of gold, silver, etc., worn around the neck as an ornament; a necklace."]}], "ಚೈಮುಂಡಾಡು": [{"type": "verb", "defs": ["to fondle; to touch caressingly, kiss affectionately."]}], "ಚೈರಂತನ": [{"type": "adjective", "defs": ["existing through all time or from a very long time."]}], "ಚೈರಂತನಕ್ರಮ": [{"type": "noun", "defs": ["a long-established custom or practice that has the effect of an unwritten law, in a society."]}], "ಚೊಂಗೆ": [{"type": "noun", "defs": ["a kind of sweet cake."]}], "ಚೊಂಚ": [{"type": "noun", "defs": ["a man with a crooked hand or hands."]}], "ಚೊಂಚು": [{"type": "noun", "defs": ["the quality, condition or fact of being crooked; crookedness."]}], "ಚೊಂಟ": [{"type": "adjective", "defs": ["not straight; bent; curved; crooked.", "(fig.) not serving one's original or main purpose; useless; worthless."]}, {"type": "noun", "defs": ["the quality, condition or fact of being crooked; crookedness.", "a man with crooked limbs; a crippled man."]}], "ಚೊಂದಕಪ್ಪೆ": [{"type": "noun", "defs": ["the larva of certain amphibians, as frogs, having gills and a tail and living in water; a tadpole."]}], "ಚೊಂಬು": [{"type": "noun", "defs": ["a small, round water container with a slightly narrow neck, made of metal, usu. copper.", "the globular metal cover for the pyramidal tower of a temple.", "the reddish-brown, malleable, ductile, metal that is corrosion-resistant and an excellent conductor of electricity and heat; copper; symbol, Cu."]}], "ಚೊಕ್ಕ": [{"type": "adjective", "defs": ["not adulterated; unmixed; pure; unimpaired; untainted.", "morally upright."]}, {"type": "noun", "defs": ["any thing that is beautiful, charming.", "a pure, unadulterated, spotless thing.", "an upright, excellent man.", "the quality or state of being pure.", "beauty; attractiveness; grace; prettiness."]}], "ಚೊಕ್ಕಟ": [{"type": "noun", "defs": ["the quality that attracts the mind; such a state; attractiveness; beauty.", "a pure, unadulterated thing.", "the state or quality of being clean, neat orderly; tidiness; neatness; cleanliness.", "a man having true spiritual knowledge.", "ಚೊಕ್ಕಟಮಾಡು cokkaṭa māḍu to remove impurities, dirt, etc.; to clean; 5. (fig.) to spoil completely."]}], "ಚೊಕ್ಕಟಂಬಡೆ": [{"type": "verb", "defs": ["to be cleaned; to become clean."]}], "ಚೊಕ್ಕಟಗೊಳಿಸು": [{"type": "verb", "defs": ["= ಚೊಕ್ಕಟಮಾಡು- 1."]}], "ಚೊಕ್ಕಟ್ಟ": [{"type": "noun", "defs": ["= ಚೊಕ್ಕಟ."]}], "ಚೊಕ್ಕಣ": [{"type": "noun", "defs": ["= ಚೊಕ್ಕಟ."]}], "ಚೊಕ್ಕಣಿಕೆ": [{"type": "noun", "defs": ["a kind of plant ."]}], "ಚೊಕ್ಕತನ": [{"type": "noun", "defs": ["the quality or state of being tidy; the quality of doing in an orderly, tidy manner; tidiness; orderliness."]}], "ಚೊಕ್ಕನೆ": [{"type": "adverb", "defs": ["in a tidy orderly manner; tidily; orderly; neatly."]}], "ಚೊಕ್ಕರೆಯ": [{"type": "noun", "defs": ["youth characterised by vigour, liveliness."]}], "ಚೊಕ್ಕಳ": [{"type": "noun", "defs": ["= ಚೊಕ್ಕಟ."]}], "ಚೊಕ್ಕಳಕಾತಿ": [{"type": "noun", "defs": ["a woman who gives much attention to tidiness orderliness, neatness etc."]}], "ಚೊಕ್ಕಳತನ": [{"type": "noun", "defs": ["= ಚೊಕ್ಕತನ."]}], "ಚೊಕ್ಕಳಿಕೆ": [{"type": "noun", "defs": ["= ಚೊಕ್ಕತನ.", "good reputation; fame; renown."]}], "ಚೊಕ್ಕಳಿಕೆವಡೆ": [{"type": "verb", "defs": ["to become neat, tidy."]}], "ಚೊಕ್ಕಳಿಕ್ಕೆ": [{"type": "noun", "defs": ["= ಚೊಕ್ಕತನ."]}], "ಚೊಕ್ಕಳೆ": [{"type": "noun", "defs": ["= ಚೊಕ್ಕಳಕಾತಿ."]}], "ಚೊಕ್ಕು": [{"type": "verb", "defs": ["to hesitate, shrink from shyness, embarrassment."]}, {"type": "noun", "defs": ["= ಚೊಕ್ಕ2."]}], "ಚೊಕ್ಕುತನ": [{"type": "noun", "defs": ["= ಚೊಕ್ಕತನ."]}], "ಚೊಕ್ಕೆಯ": [{"type": "noun", "defs": ["skill in using one's hands or mind; cleverness; dexterity."]}], "ಚೊಕ್ಕೆಯತನ": [{"type": "noun", "defs": ["the quality or fact of having skill in the use of hands or having mental skill; dexterousness."]}], "ಚೊಕ್ಕೆಹ": [{"type": "noun", "defs": ["= ಚೊಕ್ಕೆಯ."]}], "ಚೊಗಚೆ": [{"type": "noun", "defs": ["the cassia plant Cassia tora of Caesalpiniaceae family; foetid cassia.", "another plant of the same family Cassia occidentalis; wild cassia."]}], "ಚೊಗಟೆ": [{"type": "noun", "defs": ["= ಚೊಗಚೆ."]}], "ಚೊಗರು": [{"type": "noun", "defs": ["the astringent taste."]}, {"type": "noun", "defs": ["the colour which varies in shade from that of blood to pale rose; red colour.", "a kind of mixture, red in colour, made of the barks of certain plants, added while cooking areca nut, to make it red."]}], "ಚೊಗೆ": [{"type": "noun", "defs": ["a kind of loose shirt covering from the shoulders to the feet."]}], "ಚೊಚ್ಚ": [{"type": "adjective", "defs": ["clear; pure; limpid."]}], "ಚೊಚ್ಚಲ್": [{"type": "adjective", "defs": ["= ಚೊಚ್ಚಲು1."]}, {"type": "noun", "defs": ["= ಚೊಚ್ಚಲು2."]}], "ಚೊಚ್ಚಲು": [{"type": "adjective", "defs": ["preceding all others in a series; coming, happening before all others; first."]}, {"type": "noun", "defs": ["the first pregnancy (of a woman)."]}], "ಚೊಚ್ಚಿಲ್": [{"type": "adjective", "defs": ["= ಚೊಚ್ಚಲು1."]}, {"type": "noun", "defs": ["= ಚೊಚ್ಚಲು2."]}], "ಚೊಚ್ಚಿಲು": [{"type": "adjective", "defs": ["= ಚೊಚ್ಚಲು1."]}, {"type": "noun", "defs": ["= ಚೊಚ್ಚಲು2."]}], "ಚೊಚ್ಚುಲ್": [{"type": "adjective", "defs": ["= ಚೊಚ್ಚಲು1."]}, {"type": "noun", "defs": ["= ಚೊಚ್ಚಲು2."]}], "ಚೊಟ್ಟ": [{"type": "adjective", "defs": ["not straight; bent; curved; crooked.", "(fig.) not serving one's original or main purpose; useless; worthless."]}, {"type": "noun", "defs": ["the quality, condition or fact of being crooked; crookedness.", "a man with crooked limbs; a crippled man."]}], "ಚೊಟ್ಟಿ": [{"type": "adjective", "defs": ["= ಚೊಟ್ಟ1."]}, {"type": "noun", "defs": ["= ಚೊಟ್ಟ2."]}, {"type": "noun", "defs": ["a woman with crooked limbs; a crippled woman."]}, {"type": "noun", "defs": ["the red comb on the head of a rooster."]}], "ಚೊಟ್ಟಿಗೆಯ್ಯ": [{"type": "noun", "defs": ["a man with a crooked hand or hands."]}], "ಚೊಟ್ಟು": [{"type": "noun", "defs": ["the quality or state of being crooked; crookedness; a bend.", "(fig.) a fault, a defect; a failing."]}], "ಚೊಟ್ಟೆ": [{"type": "noun", "defs": ["a garment usu. worn by an European or the one similar in fashion."]}, {"type": "noun", "defs": ["a man of low, mean mentality."]}, {"type": "noun", "defs": ["the part of a fruit left after the juice has been extracted.", "the husk that forms a cover over coconuts.", "the big, dried, hollowed-out shell of a gourd plant; a thing similar in shape to it."]}, {"type": "noun", "defs": ["the tree Cordia dichotoma (= C. myxa) of Boraginaceae family.", "its plum used in making pickles.", "another tree of the same family, Cordia obliqua.", "its plum.", "the plant Ziziphus rugosa of Rhamnaceae family."]}], "ಚೊಟ್ಯಾಲುಗುಬ್ಬಿ": [{"type": "noun", "defs": ["an ornament for the neck of a horse."]}], "ಚೊಣ್ಣ": [{"type": "noun", "defs": ["= ಚೊಲ್ಲಣ."]}], "ಚೊತ್ತ": [{"type": "noun", "defs": ["a man with a crooked hand or leg."]}], "ಚೊತ್ತಿ": [{"type": "noun", "defs": ["a woman with a crooked hand or leg."]}], "ಚೊತ್ತಿಗೆ": [{"type": "noun", "defs": ["a short rope to tie a yoke (of a cart or plough) on to the back of the neck of an ox."]}], "ಚೊತ್ತು": [{"type": "noun", "defs": ["the condition or fact of (a limb or limbs of one's body) being crooked; crookedness."]}], "ಚೊಪ್ಪಟೆ": [{"type": "noun", "defs": ["the red cedar tree Erythroxylon monogynum of Erythroxylaceae family; Indian red cedar."]}], "ಚೊಬ್ಬೆ": [{"type": "noun", "defs": ["a portable container made of interwoven cane, strips of wood, etc. and having a handle; a basket."]}], "ಚೊಮ್ಮನೆ": [{"type": "noun", "defs": ["having been exhausted, tired; wearily; tiredly."]}], "ಚೊಲ್ಲಣ": [{"type": "noun", "defs": ["short, loose trousers reaching partway to the knees; shorts.", "an outer garment, esp. for men or boys, extending from the waist gen. to the ankles, and divided into separate coverings for the legs; pants; trousers."]}], "ಚೊಲ್ಲೆಯ": [{"type": "noun", "defs": ["the pointed end of a woman's hair.", "a bunch of flowers or a piece of garland worn on the hair by women.", "a bunch of flowers."]}, {"type": "noun", "defs": ["a man guarding the entrance of a house, palace, etc.; a door-keeper."]}], "ಚೊಲ್ಲೆಯಂಗೆಯ್": [{"type": "verb", "defs": ["to tie the hair into a knot or lump on the back of the head."]}], "ಚೊಲ್ಲೆಹ": [{"type": "noun", "defs": ["= ಚೊಲ್ಲೆಯ1."]}], "ಚೊಲ್ಲೆಹಗಾರ": [{"type": "noun", "defs": ["a man who has tied his (long) hair into a knot on the back of the head or having a tuft on the head or headgear."]}], "ಚೊಳ್ಳೆ": [{"type": "noun", "defs": ["the tree Cordia dichotoma (= C. myxa) of Boraginaceae family.", "its plum used in making pickles."]}], "ಚೊಱ": [{"type": "noun", "defs": ["a kind of cartilaginous marine fish; a shark.", "the large, marine fish, Xiphias gladius of Xiphiidae family."]}], "ಚೋಕು": [{"type": "adjective", "defs": ["being thin and flat.", "of weak physique.", "ಚೋಕಾಗು cōkāgu to become weak (as from old age)."]}], "ಚೋಕುಮರ": [{"type": "noun", "defs": ["an old tree that has stopped putting forth fruits."]}], "ಚೋಕ್ಷ": [{"type": "adjective", "defs": ["clear; pure; limpid.", "attractive; beautiful.", "honest; truthful; trustworthy.", "clever, intelligent.", "capable of acting fast or effectively; active."]}], "ಚೋಖು": [{"type": "noun", "defs": ["a pure, unadulterated, spotless thing."]}], "ಚೋಗೆ": [{"type": "noun", "defs": ["a kind of loose shirt cocvering from the shoulders to the feet."]}], "ಚೋಚ": [{"type": "noun", "defs": ["the external covering of the woody stems and branches of plants, that is separable from the wood; bark.", "the bark of the tree Cinnamomum zeylanicum of Lauraceae family, which is used as spice; common cinnamon.", "the fruit of the coconut palm; coconut.", "the fruit of the plantain (banana) tree; plantain."]}], "ಚೋಜಿಗ": [{"type": "noun", "defs": ["the feeling of surprise, admiration, and awe aroused by something strange, unexpected, incredible, etc.", "a thing or event that causes astonishment and admiration."]}], "ಚೋಜಿಗಂಬಡು": [{"type": "verb", "defs": ["to feel wonder at; to be seized or filled with wonder; to feel amazement; to wonder."]}], "ಚೋಟು": [{"type": "adjective", "defs": ["small; tiny.", "ಚೋಟುದ್ದ ಮಗುವಿಗೆ ಗೇಣುದ್ದ ಕುಲಾವಿ cōṭudda maguvige gēṇudda kulāvi (prov.) a great ceremony for a small saint."]}, {"type": "noun", "defs": ["distance between the tips of the thumb and forefinger when stretched apart, used as a unit of linear measure; (a little less than span)."]}], "ಚೋಡಿ": [{"type": "noun", "defs": ["a feeling of displeasure that prompts a desire to fight back at its cause; anger.", "a feeling of discontent and ill will because of another's advantages, possessions, etc.; envy."]}], "ಚೋದಕ": [{"type": "adjective", "defs": ["that urges, provokes or prompts (someone or something) into action."]}, {"type": "noun", "defs": ["that which urges, provokes or prompts (someone or something) into action or accelerates the process; an impelling or influencing person, thing of force; a driving agent.", "a substance formed in an organ of the body, as in the adrenal glands, the pituitary, etc., and carried by a body fluid to another organ or tissue, where it has a specific effect; a hormone.", "the indoleacetic acid, produced in fruits, seeds, leaves or stem tips, to promote longitudinal growth and to control bud growth, root formation, leaf abscission, etc., auxin.", "a synthetically produced thing which acts similar to a hormone."]}], "ಚೋದನ": [{"type": "noun", "defs": ["= ಚೋದನೆ."]}], "ಚೋದನಾತ್ಮಕ": [{"type": "adjective", "defs": ["of the nature of driving, impelling, urging, stimulating or provocating; stimulative; provocative."]}], "ಚೋದನೆ": [{"type": "noun", "defs": ["the act or an instance of driving or impelling forward.", "the act of urging (another) into action.", "(psych.) an inner urge that stimulates activity or inhibition; a basic or instinctive need.", "(phil.) a sentence or statement that initiates, reinforces one's faith or serves as a fundamental principle."]}], "ಚೋದಹಲಸು": [{"type": "noun", "defs": ["a variety in jackfruit tree.", "its fruit."]}], "ಚೋದಿಗ": [{"type": "noun", "defs": ["= ಚೋಜಿಗ."]}], "ಚೋದಿಗಂಬಡು": [{"type": "verb", "defs": ["= ಚೋಜಿಗಂಬಡು."]}], "ಚೋದಿಗಗೊಳ್": [{"type": "verb", "defs": ["= ಚೋಜಿಗಂಬಡು."]}], "ಚೋದಿಗವಡು": [{"type": "verb", "defs": ["= ಚೋಜಿಗಂಬಡು."]}], "ಚೋದಿಸು": [{"type": "verb", "defs": ["to force to go; urge onward; push forward; to drive; to impel.", "to force into or from a state or act.", "to impel or propel as motive power; set or keep going; cause to function."]}], "ಚೋದ್ಯ": [{"type": "adjective", "defs": ["that is to be, fit to be driven forward, away or out.", "subject to such an action.", "fit to be motivated, impelled into an action."]}, {"type": "noun", "defs": ["the act or an instance of raising an objection.", "the feeling of astonishment, surprise, admiration accompanied by the sense of awe; wonder.", "a wonderful or astonishing thing; a marvel.", "a type or system of medical treatment to counteract a poison."]}], "ಚೋದ್ಯಂದಳೆ": [{"type": "verb", "defs": ["= ಚೋಜಿಗಂಬಡು."]}], "ಚೋದ್ಯಂಬಡು": [{"type": "verb", "defs": ["= ಚೋಜಿಗಂಬಡು."]}], "ಚೋದ್ಯಕರ": [{"type": "adjective", "defs": ["that is amazing or that which causes wonder; marvellous; wonderful."]}, {"type": "noun", "defs": ["that which is amazing or causes wonder; a marvel; a wonderful thing."]}], "ಚೋದ್ಯಪಡು": [{"type": "verb", "defs": ["= ಚೋಜಿಗಂಬಡು."]}], "ಚೋದ್ಯಮಯ": [{"type": "adjective", "defs": ["causing wonder, surprise; wonderful; marvellous."]}], "ಚೋದ್ಯವಡು": [{"type": "verb", "defs": ["= ಚೋಜಿಗಂಬಡು."]}], "ಚೋದ್ಯವಡೆ": [{"type": "verb", "defs": ["to become wonderful, marvellous."]}], "ಚೋದ್ಯಾವಹ": [{"type": "noun", "defs": ["= ಚೋದ್ಯಕರ2."]}], "ಚೋಪದಾರ": [{"type": "noun", "defs": ["a man who carries a club, staff, etc. in a royal court, high office, etc.; a mace-bearer."]}], "ಚೋಪಾರ": [{"type": "noun", "defs": ["(dial.) the condition of a miserable, wretched person; misery; wretchedness; distress."]}, {"type": "noun", "defs": ["the dried, aromatic stigmas of the perennial plant Crocus sativus of Iridaceae family, used in flavouring and colouring foods, and formerly in medicine; saffron powder.", "the plant Trachyspermum ammi (= Carum cpiticum) of Apiaceae family; Bishop's weed."]}], "ಚೋಪುದಾರ": [{"type": "noun", "defs": ["= ಚೋಪದಾರ."]}], "ಚೋರ": [{"type": "noun", "defs": ["a man who steals or commits burglary secretly; one guilty of theft or larceny; a thief; a burglar."]}], "ಚೋರಕ": [{"type": "noun", "defs": ["= ಚೋರ."]}], "ಚೋರಕಂಡಿ": [{"type": "noun", "defs": ["= ಚೋರಗಂಡಿ."]}], "ಚೋರಕಂಡಿಕ": [{"type": "noun", "defs": ["= ಚೋರಖಂಡಿಕ."]}], "ಚೋರಕವೃತ್ತಿ": [{"type": "noun", "defs": ["= ಚೋರತನ."]}], "ಚೋರಖಂಡಿಕ": [{"type": "noun", "defs": ["a kind of plant ."]}], "ಚೋರಗಂಡಿ": [{"type": "noun", "defs": ["a breach (as in a fort) used as a secret passage by a certain person or persons either to get into or run away."]}], "ಚೋರತನ": [{"type": "noun", "defs": ["the habit of stealing, committing burglary regularly."]}], "ಚೋರತ್ವ": [{"type": "noun", "defs": ["= ಚೋರತನ."]}], "ಚೋರದಿಡ್ಡಿ": [{"type": "noun", "defs": ["= ಚೋರಗಂಡಿ."]}], "ಚೋರಪಹರೆ": [{"type": "noun", "defs": ["the gathering of secret information; secret intelligence; b) (collectively) persons or agency employed at this."]}], "ಚೋರಪುಷ್ಪಿ": [{"type": "noun", "defs": ["the grass Chrysopogon aciculatus (= Andropogon aciculatus) of Poaceae family."]}], "ಚೋರಮಾಳಿಗೆ": [{"type": "noun", "defs": ["a room or group of rooms below the ground level and usu. under a building, often used for storing something or to carry on a business in secret."]}], "ಚೋರವಿದ್ಯೆ": [{"type": "noun", "defs": ["the art and practice of stealing."]}], "ಚೋರಿ": [{"type": "noun", "defs": ["the act or an instance of stealing; larceny; theft."]}], "ಚೋರಿಸು": [{"type": "verb", "defs": ["to take (the property of another or others) without permission or right, secretly or by force; to take by theft; to steal."]}], "ಚೋರುಪಹರೆ": [{"type": "noun", "defs": ["= ಚೋರಪಹರೆ."]}], "ಚೋರೆ": [{"type": "noun", "defs": ["the forest-dwelling pigeon, Columba livia; wild-pigeon; rock pigeon; rock dove."]}, {"type": "noun", "defs": ["the red fluid in the body that carries oxygen, hormones, cell-building material, etc. to and carbon dioxide and waste matter away from the body tissues; blood."]}], "ಚೋರೆಕುರಿ": [{"type": "noun", "defs": ["a mark with blood put on the centre of the forehead (usu. While sending off a soldier to a battle field)."]}], "ಚೋರ್ಗಂಡಿ": [{"type": "noun", "defs": ["= ಚೋರಗಂಡಿ."]}], "ಚೋಲ": [{"type": "noun", "defs": ["the spirit of a person conceived as wandering among or haunting living persons occupying another dead person's body; a kind of ghost."]}, {"type": "noun", "defs": ["= ಚೋಲಿ.", "a short, defensive jacket."]}], "ಚೋಲಕ": [{"type": "noun", "defs": ["= ಚೋಲಿ."]}], "ಚೋಲಿ": [{"type": "noun", "defs": ["the upper part of a woman's dress; a bodice; a blouse."]}], "ಚೋವು": [{"type": "noun", "defs": ["the tree Hopea parviflora of Dipterocarpaceae family; iron wood of Malabar."]}], "ಚೋಷಣ": [{"type": "noun", "defs": ["the act or an instance of a liquid in or into; a sucking up; suction; absorption."]}], "ಚೋಷಿತ": [{"type": "adjective", "defs": ["sucked in; absorbed."]}], "ಚೋಷ್ಯ": [{"type": "noun", "defs": ["that which can be tasted, consumed (as a food) by way of sucking."]}], "ಚೋಹ": [{"type": "noun", "defs": ["outward form or appearance; aspect; semblance; guise.", "a man who acts in plays, movies, etc.; an actor.", "the shape, outline of something (as seen from outside)."]}], "ಚೋಳ": [{"type": "noun", "defs": ["one of the erstwhile Tamil countries, now a part of Tamil Nadu, in South India; the Coromandel coast.", "any of the kings of that country.", "a horse bred in that country."]}, {"type": "noun", "defs": ["= ಚೋಲ2."]}], "ಚೋಳಂಗಿ": [{"type": "noun", "defs": ["a rite performed at the first pregnancy of a Hindu woman."]}], "ಚೋಳಕ": [{"type": "noun", "defs": ["= ಚೋಲಿ."]}], "ಚೋಳಿ": [{"type": "noun", "defs": ["= ಚೋಲಿ."]}], "ಚೋಳಿಕ": [{"type": "noun", "defs": ["= ಚೋಳ1 - 2."]}], "ಚೋಳಿತಿ": [{"type": "noun", "defs": ["a woman originally belonging to, residing in the Coromondel coast (Cōḷa country)."]}], "ಚೋಳು": [{"type": "noun", "defs": ["any of numerous arachnids of the order Scorpionida, widely distributed in warmer parts of the world, having a long, narrow, segmented tail that terminates in a venomous sting; a scorpion."]}], "ಚೋಳ್ನೆಲ": [{"type": "noun", "defs": ["= ಚೋಳ1 - 1."]}], "ಚೋೞ": [{"type": "noun", "defs": ["= ಚೋಳ1."]}], "ಚೌ": [{"type": "noun", "defs": ["a cardinal number four.", "a kind of game played with four cowries and four pawns.", "the score of four in that game."]}, {"type": "noun", "defs": ["the quality of a thing that is perceived through the sense of taste; flavour; savour; taste.", "the state of being or doing well; comfortable condition."]}], "ಚೌಕ": [{"type": "noun", "defs": ["the fact of (something) being low in price or not expensive."]}, {"type": "noun", "defs": ["(gem.) a plain figure having four equal straight lines, making four angles each equal to 900 inside; a square.", "a square or rectangle area (covered on all four sides by buildings or fence).", "an ornamented seat for the bride and groom.", "a place where four roads meet or two roads intersect each other.", "a score of four indicated by dice.", "a small casket for carrying the idol of Śiva, hung round the neck with a thread tied to it.", "an oblong, unsewn cloth used to wipe the hands, (or the body after bath), and also used as an upper garment; a towel.", "a piece of land used for some particular purpose; a field.", "(mus.) the medium pace.", "a clever, deceptive, witty talk.", "the last part of anything; end.", "an amount of four rupees.", "a set or group of four persons, thing, etc.", "the fastest gait of a horse; a galloping.", "a bundle of one hundred leaves (as of betel, tobacco leaves)."]}], "ಚೌಕಂಗೊಳ್ಳು": [{"type": "verb", "defs": ["to get, have or be set in, four lines, feet (as a verse)."]}], "ಚೌಕಂಡ": [{"type": "noun", "defs": ["a structure that has a square base, with a roof standing on four poles or pillars of equal length, usu. of temporary nature."]}], "ಚೌಕಟ್ಟು": [{"type": "noun", "defs": ["a frame - a) the case or border into which a window, door, etc. is set and which serves as a structural support; d) a border, often ornamental, surrounding a picture, photo, painting, etc.", "a framework - a) basic or skeletal structure around which a thing is built and that gives the thing its shape; framework; b) the way that anything is constructed or put together.", "a set of circumstances that serve as background to an event.", "that which indicates or limits the area of work, thought or thought process, etc.", "a style, design, pattern etc. of a thing; construction.", "a number of people or things grouped together because of certain likenesses or common traits; class; category."]}], "ಚೌಕಡಿ": [{"type": "noun", "defs": ["a set or group of four things, persons, etc.", "a small square on a chequered cloth."]}], "ಚೌಕಡೆ": [{"type": "noun", "defs": ["(pl.) four places or four directions."]}], "ಚೌಕದಾಯ": [{"type": "noun", "defs": ["in the game of dice, any score that is a multiple of four."]}], "ಚೌಕದುಗ": [{"type": "noun", "defs": ["in the game of dice, a score of two got four times consecutively."]}], "ಚೌಕಬಂಧ": [{"type": "noun", "defs": ["a set of words arranged one below the other as to form a square, in which the letters read alike horizontally and vertically; a word-square."]}], "ಚೌಕಲಾಣಿ": [{"type": "noun", "defs": ["a stopping of a woman's vow of not wearing green sīre (a woman's long, unsewn cloth covering the body from neck to the feet) etc., during the marriage of her first son."]}], "ಚೌಕವರ್ಣ": [{"type": "noun", "defs": ["a kind of musical composition usu. meant for dancing."]}], "ಚೌಕಶಿ": [{"type": "noun", "defs": ["= ಚೌಕಾಸಿ."]}], "ಚೌಕಸ": [{"type": "noun", "defs": ["the quality of being astute or sharp in practical matters; shrewdness."]}], "ಚೌಕಸತ್ತಿಗೆ": [{"type": "noun", "defs": ["a flat and square shade, held like an umbrella, used as a symbol of honour."]}], "ಚೌಕಸಿ": [{"type": "noun", "defs": ["= ಚೌಕಾಸಿ."]}], "ಚೌಕಸುದ್ದ": [{"type": "noun", "defs": ["a geometrically perfect square."]}], "ಚೌಕಳಿ": [{"type": "noun", "defs": ["a kind of ear-ornament, with four pearls embedded in it.", "a small square (esp. as a design on a cloth)."]}], "ಚೌಕಳಿಸು": [{"type": "verb", "defs": ["to surround from all the four sides."]}], "ಚೌಕಾಬಾರ": [{"type": "noun", "defs": ["a game played on a board having twenty-five or thirty-nine small squares, with cowries."]}], "ಚೌಕಾಬಾರಾ": [{"type": "noun", "defs": ["= ಚೌಕಾಬಾರ."]}], "ಚೌಕಾಶಿ": [{"type": "noun", "defs": ["= ಚೌಕಾಸಿ."]}], "ಚೌಕಾಸಿ": [{"type": "noun", "defs": ["an analysis, enquiry or examination, in detail, of information on facts for arriving at a conclusion.", "a persistence or haggling by a buyer for reduction of price or for additional quantities for the same price.", "the habit or an instance of being reluctant to give or spend or giving or spending less than required or necessary; close-fistedness."]}], "ಚೌಕಿ": [{"type": "noun", "defs": ["a piece of furniture with a flat, square or rectangular wooden plank with four legs, to sit on.", "a complete horizontal section of a building, separated from other sections of the same building, by a continuous floor or a continuous roof.", "a set of four buildings, in the same premises, having (usu. a narrow), common passage in between, leading to their entrance.", "the central space of a building, usu. without covered by the roof.", "(in a yakṣagāna theatre) a side room or a room behind the screen used by the actors for dressing and making up themselves.", "a small building (away from the main police station) where policemen or guards are placed.", "a patrolling or guarding (of a town, city etc.).", "a temporary stage, pandal constructed in a square shape.", "ಚೌಕಿ ಊಟ cauki ūṭa a special dining row for special visitors or invitees, in a religious monastery."]}], "ಚೌಕಿಂಗೆ": [{"type": "noun", "defs": ["= ಚೌಕಿಗೆ."]}], "ಚೌಕಿಗೆ": [{"type": "noun", "defs": ["the central space of a building, usu. without a roof.", "a piece of rectangular furniture of moderate height to spread the bed and lie on; a cot.", "the front, open space on the upper storey of a building."]}], "ಚೌಕಿದಾರ": [{"type": "noun", "defs": ["= ಚೌಕೀದಾರ."]}], "ಚೌಕಿಮನೆ": [{"type": "noun", "defs": ["a big house with a open space with no covering on top at the centre."]}], "ಚೌಕೀದಾರ": [{"type": "noun", "defs": ["a man who keeps guard over a building to protect it from vandals, thieves, etc.; a watchman; a guard."]}], "ಚೌಕೀದಾರಿ": [{"type": "noun", "defs": ["the act and duty of a person watching, guarding a building."]}], "ಚೌಕು": [{"type": "noun", "defs": ["= ಚೌಕ2."]}, {"type": "adjective", "defs": ["being thin and flat.", "of weak physique."]}], "ಚೌಕುಳಿ": [{"type": "noun", "defs": ["= ಚೌಕಳಿ."]}], "ಚೌಕೋಣ": [{"type": "noun", "defs": ["a plane figure having four angles and four sides, as a square, rectangle, trapezium; a quadrilateral."]}], "ಚೌಕೋನ": [{"type": "noun", "defs": ["= ಚೌಕೋಣ."]}]}