{"ಆದಿಪುರುಷ": [{"type": "noun", "defs": ["the first person or primeval being - a) Viṣṇu or Křṣṇa, b) Śiva, c) (Jain.) Ādijina.."]}], "ಆದಿಪ್ರರೂಪ": [{"type": "noun", "defs": ["the first or original type or model from which anything is copied; a prototype."]}], "ಆದಿಪ್ರಸಾದಿ": [{"type": "noun", "defs": ["(vīr.) a devotee who has received or eligible for receiving, the divine kindness or favour from Śiva."]}], "ಆದಿಪ್ರಾಸ": [{"type": "noun", "defs": ["a kind of alliteration in which a sound, usu. of a consonant or a cluster of consonants, repeats at the beginning of each line of a poem or clause."]}], "ಆದಿಬ್ರಹ್ಮ": [{"type": "noun", "defs": ["= ಆದಿಜಿನ."]}], "ಆದಿಭಟ್ಟಾರಕ": [{"type": "noun", "defs": ["= ಆದಿಜಿನ."]}], "ಆದಿಭೈರವ": [{"type": "noun", "defs": ["(myth.) Rudra, a Śaiva deity."]}], "ಆದಿಮ": [{"type": "adjective", "defs": ["of or existing in or from the beginning or the earliest times or ages; original.", "primitive - a) (biol.) designating or of an organism organ, etc. at the starting point of its evolutionary development or very little evolved from early ancestral types; b) (biol.) earliest formed in the development of an organism organ, structure, etc.; primordial."]}, {"type": "noun", "defs": ["he who belongs to the primitive age or early stages."]}], "ಆದಿಮಾನವ": [{"type": "noun", "defs": ["a man belonging to the earliest period of the history of mankind (i.e. of pre-historic period)."]}], "ಆದಿಮಾರ್ಗ": [{"type": "noun", "defs": ["the time-tested way or manner of the wise-men of olden days."]}], "ಆದಿಮುಕ್ತ": [{"type": "noun", "defs": ["(Śaiva) a person relieved from the burden of bondage of the soul in the mundane world."]}], "ಆದಿಮುನಿಪತಿ": [{"type": "noun", "defs": ["= ಆದಿಜಿನ."]}], "ಆದಿಮೂರುತಿ": [{"type": "noun", "defs": ["= ಆದಿಪುರುಷ."]}], "ಆದಿಮೂರ್ತಿ": [{"type": "noun", "defs": ["= ಆದಿಪುರುಷ."]}], "ಆದಿಮೂಲ": [{"type": "noun", "defs": ["that which is the cause for everything; first foundation; primeval cause.", "the Supreme, as the first cause of the universe."]}], "ಆದಿಯ": [{"type": "noun", "defs": ["one of the scheduled castes."]}], "ಆದಿಯಮಕ": [{"type": "noun", "defs": ["(rhet.) yamaka (repetition of the same word or sound, having different meaning) that occurs at the beginning of a foot."]}], "ಆದಿಯುಗ": [{"type": "noun", "defs": ["(geol.) the first geologic period in the Paleozoic Era, marked by a profusion of marine animals, esp. trilobites and brachiopods; the Cambrian era.", "the first of the four ages of the world (lasting 17,28,000 years) (also called Křta or Satya yuga)."]}], "ಆದಿರಂಗ": [{"type": "noun", "defs": ["Sri Rangapaṭṭaṇa in Maṇḍya District of Karnāṭaka, the first of the three towns in the course of the river Kāvēri, which have Ranganātha shrines."]}], "ಆದಿರಾಜ": [{"type": "noun", "defs": ["the first king - a) Přthu Manu; b) name of a king in Jaina mythology.", "the plant Crataeva marmelos ( = Aegle marmelos) of Capparaceae family."]}], "ಆದಿರಾಜಮಾವು": [{"type": "noun", "defs": ["a variety in mango.", "its fruit."]}], "ಆದಿರುದ್ರ": [{"type": "noun", "defs": ["(vīr.) Rudra, considered to be the prime cause for the Trinities."]}], "ಆದಿಲಕ್ಷ್ಮಿ": [{"type": "noun", "defs": ["an epithet of Goddess Lakṣmi, the consort of Viṣṇu."]}], "ಆದಿಲಿಂಗ": [{"type": "noun", "defs": ["(vīr.) the Liŋga (the phallus-like form of Śiva) believed to be the prime cause for the birth, maintenance and destruction of the universe."]}], "ಆದಿವರಾಳಿ": [{"type": "noun", "defs": ["(mus.) a mode derivative of the main mode Simhēndramadhyama."]}], "ಆದಿವಸು": [{"type": "noun", "defs": ["(mus.) a mode derivative of the main mode Pavani."]}], "ಆದಿವಸ್ತು": [{"type": "noun", "defs": ["the Supreme Being."]}], "ಆದಿವಾರ": [{"type": "noun", "defs": ["the first day of the week; Sunday."]}], "ಆದಿವಾಸರ": [{"type": "noun", "defs": ["= ಆದಿವಾರ."]}], "ಆದಿವಾಸಿ": [{"type": "noun", "defs": ["one of the original inhabitants (animal or plant) of a country; an aboriginal."]}], "ಆದಿವಾಸಿತ್ವ": [{"type": "noun", "defs": ["the fact or state of being aboriginal; aboriginality."]}], "ಆದಿವಿಭಕ್ತಿ": [{"type": "noun", "defs": ["(gram.) the first of the nine cases; nominative case."]}], "ಆದಿಶಕ್ತಿ": [{"type": "noun", "defs": ["the original divine power of the cosmos; the primeval spiritual energy; Goddess Durga."]}], "ಆದಿಶೇಷ": [{"type": "noun", "defs": ["(myth.) the serpent-king.", "ಆದಿಶೇಷನಿಗೂ ಅಸಾಧ್ಯವಾಗಿರು ādiśeṣanigū asādhyavāgiru (fig.) to be very difficult or almost impossible to describe."]}], "ಆದಿಶೈವ": [{"type": "noun", "defs": ["a sect among Śaivas."]}], "ಆದಿಷ್ಟ": [{"type": "adjective", "defs": ["imparted with the sacred or mystical hymns.", "directed; commanded.", "(gram) substituted (as in composition)."]}], "ಆದಿಷ್ಟಣ": [{"type": "noun", "defs": ["the foundation stone of a building."]}], "ಆದಿಸ್ವರಾಗಮ": [{"type": "noun", "defs": ["an adding of a vowel as a prefix (usu. in pronunciation of a few non-Kannaḍa words e.g. iskūlu for skūlu, isṭāṇḍu for stāṇḍu, etc."]}], "ಆದೀಕ": [{"type": "noun", "defs": ["excess of income over expenditure; profit; gain."]}], "ಆದೀನವ": [{"type": "noun", "defs": ["distress; pain; uneasiness.", "a fault; transgression."]}], "ಅದೀಶ್ವರ": [{"type": "noun", "defs": ["(Jain.) Vřṣabha Dēva, the first spiritual teacher."]}], "ಆದುಣಿಗ": [{"type": "noun", "defs": ["(masc.) one lives by begging."]}], "ಆದುದರಿಂದ": [{"type": "adverb", "defs": ["as a result of this or that; for this or that reason; consequently; hence; therefore."]}], "ಆದೃತ": [{"type": "adjective", "defs": ["treated respectfully or courteously.", "having interest; zealous; earnest."]}], "ಆದೃಪ್ತ": [{"type": "adjective", "defs": ["behaving arrogantly; having the superiority complex; haughty."]}], "ಆದೆ": [{"type": "noun", "defs": ["the small screech-owl, that makes the short, deep, hoarse sound of a hog."]}], "ಆದೇಯ": [{"type": "adjective", "defs": ["worthy of being taken (as gift); receivable; acceptable."]}, {"type": "noun", "defs": ["a free gift; a largess; a present."]}], "ಆದೇಯರೂಪ": [{"type": "noun", "defs": ["a handsome man."]}], "ಆದೇಶ": [{"type": "noun", "defs": ["an order; a command; a behest.", "a predicting of the future; the thing predicted; prediction.", "an advice or instruction.", "(gram.) a substituting of a consonant or an vowel for another consonant or vowel.", "that which is substituted for another; a substitute."]}], "ಆದೇಶಂಗೆಯ್": [{"type": "verb", "defs": ["to instruct; to command; to order.", "to predict an event of the future; to foretell."]}], "ಆದೇಶಗಣ": [{"type": "noun", "defs": ["(log.) a set whose elements replace a variable in a predicate; replacement set."]}], "ಆದೇಶತೆ": [{"type": "noun", "defs": ["(gram.) the fact or an instance of substituting."]}], "ಆದೇಶತ್ವ": [{"type": "noun", "defs": ["= ಆದೇಶತೆ."]}], "ಆದೇಶನ": [{"type": "noun", "defs": ["an ordering; commanding.", "reading of another's mind; knowing of another intentions that are not expressed.", "the act of substituting; an instance of it.", "the act of advising or instructing."]}], "ಆದೇಶಪತ್ರ": [{"type": "noun", "defs": ["a written order or command.", "a written request."]}], "ಆದೇಶಪುರುಷ": [{"type": "noun", "defs": ["a man referred to by a foreteller in his prophecy."]}], "ಆದೇಶವಚನ": [{"type": "noun", "defs": ["a predicting of the future."]}], "ಆದೇಶಸಂಧಿ": [{"type": "noun", "defs": ["an euphonic junction of final and initial letters of two words in which a new consonant is substituted for the existing ones."]}], "ಆದೇಶಸಿದ್ಧಾಂತ": [{"type": "noun", "defs": ["(econ.) the principle of substitution."]}], "ಆದೇಶಾನುಸಾರ": [{"type": "adverb", "defs": ["as per order; as instructed."]}], "ಆದೇಶಿ": [{"type": "adjective", "defs": ["of the nature of instructing; of the nature of advising; of the nature of substituting or tending to substitute."]}, {"type": "noun", "defs": ["one who commands, directs or instructs; a commander; a director.", "one who suggests or advises.", "a fortune teller; an astrologer."]}], "ಆದೇಶಿಕೆ": [{"type": "noun", "defs": ["an instruction, direction or command, (whether oral or written)."]}], "ಆದೇಶಿಸು": [{"type": "verb", "defs": ["to give an order or orders to; to direct with authority; to command; to order.", "to give advice or an opinion to; to counsel; to advise.", "to put or use in place of another; to substitute."]}], "ಆದೇಷ್ಟೃ": [{"type": "noun", "defs": ["one who orders; an authority; a director; a commander.", "one who performs a religious sacrifice.", "an adviser."]}], "ಆದೊಡೆ": [{"type": "preposition", "defs": ["if it is so; if so, if it happens (so).", "on the other hand; on the contrary; but.", "at the very lowest figure or amount; at least."]}, {"type": "noun", "defs": ["a word expressing objection or a doubt."]}], "ಆದೊರೆತು": [{"type": "noun", "defs": ["that which is equal or similar to or on par with, that."]}], "ಆದೊರೆಯ": [{"type": "adjective", "defs": ["that is similar or equal to, of on par with, that."]}, {"type": "noun", "defs": ["a man of that sort, character etc."]}], "ಆದೋಹಳ": [{"type": "noun", "defs": ["an intense desire; an irrepressible longing."]}], "ಆದ್ದರಿಂ": [{"type": "adverb", "defs": ["= ಆದ್ದರಿಂದ."]}], "ಆದ್ದರಿಂದ": [{"type": "adverb", "defs": ["as a result of this or that; for this or that reason; consequently; hence; therefore."]}], "ಆದ್ಮಿ": [{"type": "noun", "defs": ["(generally) a man."]}], "ಆದ್ಯ": [{"type": "adjective", "defs": ["most ancient; primary; initial; primitive."]}, {"type": "noun", "defs": ["he who belongs to, was in, the ancient times; the most ancient.", "he who is first in the order or lineage or in the new fields; a pioneer.", "(in pl. only) (in composition, referring to men of a class) 'and others'.", "the syllable occurring in the beginning."]}], "ಆದ್ಯಂತ": [{"type": "noun", "defs": ["(pl.) the beginning and the end.", "the whole; the entire; entirety."]}, {"type": "adverb", "defs": ["from beginning to the end; from a to z; including all the facts or details about a subject."]}], "ಆದ್ಯಂತಪ್ರಾಸ": [{"type": "noun", "defs": ["a kind of alliteration in which a sound, usu. of a consonant or cluster, occurring at the beginning of all the lines of a stanza being the same, and the sound occurring at the end of all the lines being same."]}], "ಆದ್ಯಂತರಹಿತ": [{"type": "noun", "defs": ["that or he who has no beginning or end.", "the Supreme being."]}], "ಆದ್ಯಂ ಪುರುಷ": [{"type": "noun", "defs": ["the first person or primeval being; Viṣṇu."]}], "ಆದ್ಯಕರ್ತವ್ಯ": [{"type": "noun", "defs": ["the first, essential, action or task that is to be done; a basic duty."]}], "ಆದ್ಯಕವಿ": [{"type": "noun", "defs": ["the first poet - a) Brahma, who is supposed to have produced and promulgated the Vedas; b) Vālmīki, considered as the first to show other Samskřta poets, 'the path of poetry', c) Pampa, the first recognised poet, with his immortal and unsurpassed Kannaḍa classical works 'Vikramārjuna Vijaya' and ' Ādipurāṇa'."]}], "ಆದ್ಯಕಾವ್ಯ": [{"type": "noun", "defs": ["Rāmāyaṇa, by Vālmīki, acknowledged as the first poem in Samskřta language.", "Vikramārjuna Vijaya of Pampa which is the first Kannaḍa classical work."]}], "ಆದ್ಯಕ್ಷರ": [{"type": "noun", "defs": ["the first letter of a name or a word; an initial."]}], "ಆದ್ಯತನ": [{"type": "noun", "defs": ["the state, condition or fact of being modern.", "ಆದ್ಯತನಗೊಳಿಸು ādyatanagoḷisu to make modern; bring up to date in style, design, methods, etc.; to modernise."]}], "ಆದ್ಯತೆ": [{"type": "noun", "defs": ["the state of being first in time, place or rank.", "a preferring or being preferred preference; priority.", "the privilege of preferential treatment; relatively more importance."]}], "ಆದ್ಯನುಪ್ರಾಸ": [{"type": "noun", "defs": ["(pros.) a kind of alliteration."]}], "ಆದ್ಯಪುರುಷ": [{"type": "noun", "defs": ["= ಆದ್ಯಂಪುರುಷ.", "ಆದ್ಯಮನುಷ್ಯ."]}], "ಆದ್ಯಮನುಷ್ಯ": [{"type": "noun", "defs": ["a person going before to set the way for others or for something to follow; a fore-runner; a pioneer."]}], "ಆದ್ಯಮಾಷಕ": [{"type": "noun", "defs": ["a measure of five gunjas (about 17.5 grains troy)."]}], "ಆದ್ಯಮೃದ್ವಸ್ತಿಪಟ್ಟೆ": [{"type": "noun", "defs": ["an elongated, rod-shaped structure composed of cells, forming the primitive supporting axis of the body in the lowest chordates and lying between the digestive tract and the central nervous system; notochord."]}], "ಆದ್ಯಶ್ರಾದ್ಧ": [{"type": "noun", "defs": ["a substitute funerary rite performed during one's lifetime for oneself, usu. by a person who has no male offspring."]}], "ಆದ್ಯೂನ": [{"type": "noun", "defs": ["a person who greedily eats too much; a glutton."]}], "ಆದ್ಯೆ": [{"type": "noun", "defs": ["she who belongs to, was in, the ancient times; the most ancient woman in a clan or family.", "she who is first in the order or lineage or in the new fields; a pioneer."]}], "ಆದ್ಯೋತ": [{"type": "noun", "defs": ["light; brilliance; lustre."]}], "ಆದ್ಯೋಪಾಂತ": [{"type": "adverb", "defs": ["from the beginning to the end; entire; throughout."]}], "ಆದ್ರಿ": [{"type": "noun", "defs": ["name of a plant."]}], "ಆದ್ರಿಹೂ": [{"type": "noun", "defs": ["the flower of the ಆದ್ರಿ plant."]}], "ಆದ್ರೆ": [{"type": "noun", "defs": ["a reddish, first magnitude star in Orion's shoulder.", "the rains during the period in which this star is apparently in association with the moon."]}], "ಆಧರ": [{"type": "noun", "defs": ["one who tells about his own failure or defeat."]}], "ಆಧರಣೆ": [{"type": "noun", "defs": ["a place or power of protection; a resort."]}], "ಆಧರಿಸು": [{"type": "verb", "defs": ["to use a thing, argument, resource as a support; to base upon; to have as the source; to found upon.", "to support - a) to carry or bear the weight of; to keep from falling, slipping or sinking; to hold up; b) to carry or bear (a specified weight, strain, pressure, etc.).", "to provide sustenance or nourishment for; to sustain."]}], "ಆಧಾನ": [{"type": "noun", "defs": ["the act of placing (an object) (on or at so and so place etc.); a depositing (of something).", "the act or an instance of receiving.", "the act of consisting or involving or the state of being consisted of, (something).", "a thing deposited with one as a deposit for safe custody; a pledge.", "an assurance, as against loss, damage or default; security; guarantee; a surety.", "an appointing, designating or assigning.", "a container or a vessel (with reference to something it contains or holds in); 8) the act or fact of bearing; a conceiving; conception."]}], "ಆಧಾರ": [{"type": "noun", "defs": ["a place or power of protection; a resort; a patronage.", "a support, a person or thing that supports; esp. - a) a prop, base, brace, etc.; b) a means of subsistence; c) an elastic, girdlelike device to support or bind a part of the body.", "an authoritative reference in support of one's statement or argument; a base; a basis.", "the foundation or lower part of a wall or structure; basement.", "a current or flow of water or other liquid, esp. one running along the surface of the earth; a stream.", "that which holds water (esp. in great quantity); a reservoir of water.", "(gram.) the sense of locative sense.", "(myst.) a mystical point in the human body that gives the power of sustaining.", "a property or an estate mortgaged for repayment of a loan; a pledge; a security."]}], "ಆಧಾರಕ": [{"type": "noun", "defs": ["the lowest part, that supports the superstructure of a wall; a foundation."]}], "ಆಧಾರಕಲ್ಪನೆ": [{"type": "noun", "defs": ["something that is supposed; a supposition.", "an unproved theory, proposition, supposition, etc. tentatively accepted to explain certain facts or (working hypothesis) to provide a basis for further investigation, argument, etc."]}], "ಆಧಾರಗೆಯ್": [{"type": "verb", "defs": ["to make a thing, argument, as a basis.", "to provide a seat to sit on."]}], "ಆಧಾರಚಕ್ರ": [{"type": "noun", "defs": ["= ಆಧಾರ - 8."]}], "ಆಧಾರಪತ್ರ": [{"type": "noun", "defs": ["a document executed by a person mortgaging his property for the repayment of a loan; a mortgage deed."]}], "ಆಧಾರಪ್ರತಿಜ್ಞೆ": [{"type": "noun", "defs": ["that which is assumed without proof or as self-evident esp. as a basis for argument; a postulate."]}], "ಆಧಾರಭೂತ": [{"type": "adjective", "defs": ["forming or being a basis; basic."]}], "ಆಧಾರರಹಿತ": [{"type": "adjective", "defs": ["having no support or basis in fact; unfounded; baseless."]}], "ಆಧಾರರೇಖೆ": [{"type": "noun", "defs": ["a base line - a) a line serving as a base; b) (in surveying) a horizontal line measured with special accuracy to provide a base for survey by triangulation."]}], "ಆಧಾರಲಿಂಗ": [{"type": "noun", "defs": ["(vīr.) the deity presiding over the mystical point in human body which is supposed to be giving the sustaining power."]}], "ಆಧಾರವರ್ಷ": [{"type": "noun", "defs": ["a year that is taken as the base, as for calculating indices or comparison of performance, achievements in different years; base-year."]}], "ಆಧಾರವಾಕ್ಯ": [{"type": "noun", "defs": ["a premise - a) a previous statement or assertion that serves as the basis for an argument; b) (logic) either of the two propositions of a syllogism from which the conclusion is drawn."]}], "ಆಧಾರಷಡ್ಜ": [{"type": "noun", "defs": ["(mus.) the base pitch as in Karnāṭaka system, (as against the variable one of the western system) from which the middle octave begins."]}], "ಆಧಾರಸ್ತಂಭ": [{"type": "noun", "defs": ["the main pillar bearing the burden.", "(fig.) a principal support; a person of cardinal importance; a pivot."]}], "ಆಧಾರಸ್ಥ": [{"type": "noun", "defs": ["a man having substantial income from his estate."]}], "ಆಧಾರಾಧೇಯ ಭಾವ": [{"type": "noun", "defs": ["the relation that exists between the support and the supported."]}], "ಆಧಾರಿ": [{"type": "noun", "defs": ["= ಆಧಾರಸ್ಥ."]}], "ಆಧಾರಿತ": [{"type": "adjective", "defs": ["based on; drawn support from; leaning on; relying on; dependent."]}], "ಆಧಿ": [{"type": "noun", "defs": ["mental (as opp. to bodily) pain or anguish; agony; anxiety; misery.", "a charge created on an estate, property, etc. by depositing, mortgaging, for repayment of a loan or for accomplishing a condition.", "the condition of being addicted (to a habit such as playing cards, dice for a stake, etc.); addiction.", "a place of protection; a resort."]}], "ಆಧಿಕಾರಿಕ": [{"type": "adjective", "defs": ["official - a) of or holding an office or position of authority; b) by, from or with the proper authority; authorised or authoritative; c) in a formal or ceremonious manner, often involving persons of authority."]}, {"type": "noun", "defs": ["the main story or theme (as opp. to incidental anecdotes) of a literary work."]}], "ಆಧಿಕ್ಯ": [{"type": "noun", "defs": ["the state of being, available in, the condition of having (something) in, abundance; excess; plentifulness; preponderance.", "the state or quality of being superior or higher, greater, better, etc.; superiority; supremacy."]}], "ಆಧಿದೈವಿಕ": [{"type": "adjective", "defs": ["relating to the deity that watches over or protects or serves as a guardian (as a hymn).", "relating to or caused by a god or fate."]}, {"type": "noun", "defs": ["a distressing condition, calamity, caused by a god."]}], "ಆಧಿಪತ್ಯ": [{"type": "noun", "defs": ["the status, dominion, rule or power of a sovereign; sovereignty; supremacy of power.", "the state, area or jurisdiction under one's administration or rule."]}], "ಆಧಿಭೌತಿಕ": [{"type": "adjective", "defs": ["that is caused by or relating to material world, physical world or animals.", "derived from the primitive elements; elementary; material."]}, {"type": "noun", "defs": ["a damage, harm, calamity caused by animals.", "a distressing situation, calamity, etc. caused by the basic elements of the material world."]}], "ಆಧಿರಾಜ್ಯ": [{"type": "noun", "defs": ["the supreme sway; the ultimate sovereign power."]}], "ಆಧಿವ್ಯಾಧಿ": [{"type": "noun", "defs": ["mental agony or disease."]}], "ಆಧಿವ್ಯಾಧಿಪ್ರದ": [{"type": "noun", "defs": ["that which or he who causes mental distress or illness."]}], "ಆಧಿವ್ಯಾಧಿಹರ": [{"type": "noun", "defs": ["that which or he who cures mental distress or illness."]}], "ಆಧಿಹೇತು": [{"type": "noun", "defs": ["the cause of mental distress or illness."]}], "ಆಧೀನ": [{"type": "noun", "defs": ["the state of being under (one's) control."]}], "ಆಧೀನಚಿತ್ತ": [{"type": "adjective", "defs": ["having control over one's wishes, desires or wants."]}, {"type": "noun", "defs": ["a man who has subdued his passions."]}], "ಆಧೀನಚಿತ್ತೆ": [{"type": "noun", "defs": ["a woman who has subdued her passions."]}], "ಆಧುನಿಕ": [{"type": "adjective", "defs": ["of recent time; relating to the present time; modern; present."]}, {"type": "noun", "defs": ["a man of recent or present time.", "one who is abreast with the knowledge, information or fashion."]}], "ಆಧುನಿಕತೆ": [{"type": "noun", "defs": ["modern usage, trends, expression or trait; modern spirit of character; modernism.", "sympathy with these or any of these.", "the quality of being against traditional values and character.", "newness; novelty."]}], "ಆಧುನಿಕೀಕರಣ": [{"type": "noun", "defs": ["modernisation - a) an act or process of adopting modern ways; b) a becoming modern; modernisation."]}], "ಆಧುನೀಕೀಕರಿಸು": [{"type": "verb", "defs": ["to adopt modern ways; to make modern (as in taste, style or usage).", "to replace old machinery with the new and upgraded one."]}], "ಆಧುನೀಕರಣ": [{"type": "noun", "defs": ["a wrong form of ಆಧುನಿಕೀಕರಣ."]}], "ಆಧೂತ": [{"type": "adjective", "defs": ["shaken; stirred; agitated; perturbed."]}, {"type": "noun", "defs": ["(dance) the lifting up of the head obliquely and keeping it in that position for a moment to show one's body with pride, self-adulation, etc."]}], "ಆಧೃತ": [{"type": "adjective", "defs": ["kept; placed; deposited.", "brought.", "supported.", "contained."]}], "ಆಧೇಯ": [{"type": "adjective", "defs": ["depending upon; relying on; dependent."]}, {"type": "noun", "defs": ["a place of protection; a resort.", "the state or condition of being protected.", "a place of origin; a source.", "a piece of land, a real estate mortgaged for the repayment of a loan."]}], "ಆಧೇಯವಚನ": [{"type": "noun", "defs": ["a man having good command over spoken language; an eloquent speaker; a good orator."]}], "ಆಧೋರಣ": [{"type": "noun", "defs": ["a driver of an elephant.", "a male elephant (wandering alone)."]}], "ಆಧ್ಮಾನ": [{"type": "noun", "defs": ["an abnormal accumulation of fluid in cells, tissues or cavities of the body, resulting in swelling; oedema; dropsy."]}], "ಆಧ್ಮಾನಿಸು": [{"type": "verb", "defs": ["(the belly) to swell as a result of abnormal accumulation of fluid in cells, tissues etc."]}], "ಆಧ್ಯಾತ್ಮಿಕ": [{"type": "adjective", "defs": ["relating to the Supreme Spirit.", "of the spirit or the soul as distinguished from the body or material matters; spiritual.", "of, connected with or having the nature of, metaphysics; metaphysical.", "of or according to philosophy or philosophers; philosophical."]}, {"type": "noun", "defs": ["a disease, distressed condition, etc. caused by those related to or generated within, the body."]}], "ಆಧ್ಯಾತ್ಮಿಕತೆ": [{"type": "noun", "defs": ["the quality or state of being a) spiritual; b) metaphysical; or c) philosophical."]}], "ಆಧ್ಯಾನ": [{"type": "noun", "defs": ["a remembrance that comes with a sense of regret or repentance.", "a very great mental pain; agony; distress."]}], "ಆನ್": [{"type": "verb", "defs": ["to face or act in opposition; to oppose.", "to have on the body (as a dress); to wear; to have, possess afresh a new form.", "to receive; to take.", "to seize in the hands; to hold; to catch; to grasp.", "to stretch forward (as a hand in begging).", "to stop oneself from moving.", "to tolerate; to put up with (someone or something not especially liked).", "to take shelter in or under.", "to recline on or against.", "to give shelter, protection; to support or act as a prop; to bear the burden; ಆಂತವನ್ āntavan he who has opposed.", "he who has borne the burden.", "ಆತು ಉಣ್ಣು ātu uṇṇu to eat, have food, slowly (i.e. with no hurry); ಆತುಕೊ ātuko = ಆತುಕೊಳ್ಳು. ಆತುಕೊಳ್ಳು ātukoḷḷu to seize and hold; to catch; 2. to act in opposition; to oppose; ಆತುಹೋಗು ātuhōgu to go unhurriedly."]}, {"type": "pronoun", "defs": ["the nominative singular of the first personal pronoun; the word mentioning oneself; the one who is speaking or writing; \"I\"."]}, {"type": "adverb", "defs": ["(expressing uncertainty, probability, etc.) so ever; even."]}], "ಆನಂತ್ಯ": [{"type": "noun", "defs": ["the quality of being endless (in time, space or quantity) or infinite; infinity; endlessness.", "anything infinite as endless or unlimited space, time, distance, quantity, etc.", "the state of being not bound; boundlessness; limitlessness.", "the quality, state or fact of being eternal; eternal existence or duration; continuance without end; eternity; immortality."]}], "ಆನಂದ": [{"type": "noun", "defs": ["great joy or pleasure; delight; happiness.", "everlasting happiness; happiness of the highest kind; perfect blessedness; beatitude.", "(vīr.) one of the six kinds of devotion.", "name of a year in the Hindu cycle of sixty years.", "5) (phil.) the ultimate reality in the Advaita system of Indian philosophy."]}], "ಆನಂದಂಗಿಡು": [{"type": "verb", "defs": ["(one's pleasure, joy, happiness) to get lost or spoiled."]}], "ಆನಂದಂಬಡು": [{"type": "verb", "defs": ["= ಆನಂದಪಡು."]}], "ಆನಂದಂಬೆಱು": [{"type": "verb", "defs": ["= ಆನಂದಪಡು."]}], "ಆನಂದಕರ": [{"type": "adjective", "defs": ["that causes joy; giving pleasure; pleasant."]}], "ಆನಂದಕಾರಕ": [{"type": "adjective", "defs": ["= ಆನಂದಕರ."]}], "ಆನಂದಗೊಳಿಸು": [{"type": "verb", "defs": ["to give pleasure to; to please."]}], "ಆನಂದಜಲ": [{"type": "noun", "defs": ["= ಆನಂದಭಾಷ್ಪ."]}], "ಆನಂದಜಳ": [{"type": "noun", "defs": ["= ಆನಂದಭಾಷ್ಪ."]}], "ಆನಂದತುಂದಿಲ": [{"type": "adjective", "defs": ["excessively pleased, happy; delighted; glad."]}], "ಆನಂದದಾಯಕ": [{"type": "adjective", "defs": ["giving or causing pleasure; pleasing."]}], "ಆನಂದನ": [{"type": "adjective", "defs": ["causing happiness; gladdening; pleasing."]}, {"type": "noun", "defs": ["the feeling characterised by pleasure, happiness or joy.", "a treating and pleasing of guests or friends courteously."]}], "ಆನಂದನಟನಿ": [{"type": "noun", "defs": ["(mus.) a mode derived from the main mode Ratnāngi, in Karnāṭaka system."]}], "ಆನಂದನಾಟಕ": [{"type": "noun", "defs": ["a joyous or merry-making dancing.", "a drama that brings happiness or meant for exciting laughter."]}], "ಆನಂದನೃತ್ಯ": [{"type": "noun", "defs": ["= ಆನಂದನಾಟಕ - 1."]}], "ಆನಂದಪಡು": [{"type": "verb", "defs": ["to have or experience joy; to be delighted; to get pleasure from; to rejoice."]}], "ಆನಂದಪುರ": [{"type": "noun", "defs": ["(myth.) Vaikuṇṭha, the abode of Viṣṇu."]}], "ಆನಂದಭಾಷ್ಪ": [{"type": "noun", "defs": ["tears secreted from excessive joy; tears of joy."]}], "ಆನಂದಭಕ್ತಿ": [{"type": "noun", "defs": ["(vīr.) the devotion characterised by the divine bliss."]}], "ಆನಂದಭೇರಿ": [{"type": "noun", "defs": ["a kind of big drum, played to publish a king's joy."]}], "ಆನಂದಭೈರವಿ": [{"type": "noun", "defs": ["(mus.) one of the famous modes in Karnāṭaka system; a mode derived from the main mode Naṭhabhairavi."]}], "ಆನಂದಮಣಿ": [{"type": "noun", "defs": ["a mystical gem believed to bring joy and comfort by warding off distress."]}], "ಆನಂದಮಯ": [{"type": "adjective", "defs": ["filled with delight; delightful; blissful."]}, {"type": "noun", "defs": ["= ಆನಂದಮಯಕೋಶ."]}], "ಆನಂದಮಯಕೋಶ": [{"type": "noun", "defs": ["(myst.) the fifth of the five sheaths or vestures of the soul; the causal frame enshrining the soul; bliss-made sheath."]}], "ಆನಂದಮಾರ್ಗ": [{"type": "noun", "defs": ["an order of mendicants, founded in 1955 by Prahbāt Ranjan Sarkār, later alleged to have become guilty of inhuman practices."]}], "ಆನಂದಮಾರ್ಗಿ": [{"type": "noun", "defs": ["a member of or a believer in the order ಆನಂದಮಾರ್ಗ."]}], "ಆನಂದಮುಖಿ": [{"type": "noun", "defs": ["(mus.) a mode in Karnāṭaka system, derived from the main mode Dhīra Śaŋkarābharaṇa."]}], "ಆನಂದಮೂರ್ತಿ": [{"type": "noun", "defs": ["he who is bliss personified.", "Viṣṇu, who himself is the Bliss."]}], "ಆನಂದಲೀಲ": [{"type": "noun", "defs": ["(mus.) a mode in Karnāṭaka system, derived from the main mode Gāngēyabhūshaṇi."]}], "ಆನಂದವಡೆ": [{"type": "verb", "defs": ["to have or experience joy; to be delighted; to get pleasure from; to rejoice."]}], "ಆನಂದವರಣ": [{"type": "noun", "defs": ["a soliciting of bliss."]}], "ಆನಂದವಸ್ತ್ರ": [{"type": "noun", "defs": ["a woman's cloth that has become red with her menses."]}], "ಆನಂದವಾಡು": [{"type": "verb", "defs": ["to be full of joy; to rejoice."]}], "ಆನಂದವಾದ": [{"type": "noun", "defs": ["the doctrine that the pleasure or happiness is the sole or chief good in life; hedonism.", "a way of life based on or suggesting the principles of hedonism."]}], "ಆನಂದವಾದಿ": [{"type": "noun", "defs": ["a person who follows, suggests or believes in the doctrine that the pleasure or happiness is the sole or chief good in life; a hedonist."]}], "ಆನಂದವಾರಿಧಿ": [{"type": "noun", "defs": ["the state of having endless joy.", "Viṣṇu, as the abode of bliss.", "(mus.) a mode in Karnāṭaka system, derived from the main mode Kharaharapriya."]}], "ಆನಂದವಿಡಿ": [{"type": "verb", "defs": ["to be glad."]}], "ಆನಂದವೃಕ್ಷ": [{"type": "noun", "defs": ["the tree Saraca indica of Caesalpiniaceae family."]}], "ಆನಂದವೇಱು": [{"type": "verb", "defs": ["(the pleasure) to happen or to become more."]}], "ಆನಂದಸ್ವರೂಪ": [{"type": "noun", "defs": ["he who is bliss personified.", "Viṣṇu, who himself is the Bliss."]}], "ಆನಂದಾಗರ": [{"type": "noun", "defs": ["an abode for happiness; a bliss-home."]}], "ಆನಂದಾಶ್ರು": [{"type": "noun", "defs": ["tears secreted from extreme joy; tears of joy."]}], "ಆನಂದಾಶ್ರುಜಲ": [{"type": "noun", "defs": ["= ಆನಂದಾಶ್ರು."]}], "ಆನಂದಿ": [{"type": "noun", "defs": ["a happy and satisfied person."]}], "ಆನಂದಿತ": [{"type": "adjective", "defs": ["(highly) pleased; delighted."]}], "ಆನಂದಿನಿ": [{"type": "noun", "defs": ["(myst.) the fifth of the seven stages in attaining the perfect union with the Supreme; the state which is filled with nothing but perfect happiness."]}], "ಆನಂದಿಸು": [{"type": "verb", "defs": ["to feel or perceive the pleasure; to enjoy; to delight in."]}], "ಆನಂದೋನ್ಮತ್ತ": [{"type": "adjective", "defs": ["excited to a point beyond self-control, caused by ecstasy of joy."]}, {"type": "noun", "defs": ["a man excited to a point beyond self-control, caused by ecstasy of joy."]}], "ಆನಂದೋನ್ಮತ್ತತೆ": [{"type": "noun", "defs": ["the state of being excited by ecstasy of joy."]}], "ಆನಂದೋನ್ಮತ್ತೆ": [{"type": "noun", "defs": ["a woman excited to a point beyond self-control, caused by ecstasy of joy."]}], "ಆನಕ": [{"type": "noun", "defs": ["a large military drum.", "the sound that follows a flash of lightning, caused by the sudden heating and expansion of air by electrical discharge; the thunder."]}], "ಆನಕಧ್ವನಿ": [{"type": "noun", "defs": ["the sound of the large military drum ಆನಕ."]}], "ಆನಕಧ್ವಾನ": [{"type": "noun", "defs": ["= ಆನಕಧ್ವನಿ."]}], "ಆನಕರವ": [{"type": "noun", "defs": ["= ಆನಕಧ್ವನಿ."]}], "ಆನತ": [{"type": "adjective", "defs": ["bent; bent downwards; stooped.", "prostrated; bent in reverence; humble."]}, {"type": "noun", "defs": ["one who is bowed, bent in reverence or surrendered; he who is yielded.", "(Jain.) thirteenth of the sixteen heavens.", "a particular kind of erotic lock in copulation, the man copulating with the woman from behind when she bends her body on her knees."]}], "ಆನತಜನ": [{"type": "noun", "defs": ["(pl.) they who are bowed, prostrated as a mark of respect or reverence."]}], "ಆನತಭುವನ": [{"type": "noun", "defs": ["a widely revered man."]}], "ಆನತಭುವನೆ": [{"type": "noun", "defs": ["a woman commanding respect all over."]}], "ಆನತಮಸ್ತಕ": [{"type": "noun", "defs": ["he who has bowed or touched his head to the ground or to another's feet, in reverence."]}], "ಆನತಮುಖಿ": [{"type": "noun", "defs": ["a woman who has bowed her head in reverence or from shame etc."]}], "ಆನತಮೂರ್ಧ": [{"type": "noun", "defs": ["= ಆನತಮಸ್ತಕ."]}], "ಆನತವದನೆ": [{"type": "noun", "defs": ["= ಆನತಮುಖಿ."]}], "ಆನತಾರ್ತಿಹರ": [{"type": "noun", "defs": ["he who wards off the difficulties, distress of those who seek shelter from him."]}], "ಆನತಿ": [{"type": "noun", "defs": ["the state of being bent, stooped, inclined.", "a respectful bending; a reverential bow."]}], "ಆನತೆ": [{"type": "noun", "defs": ["a woman who is bent or has stooped."]}], "ಆನದ್ಧ": [{"type": "adjective", "defs": ["bound to or together; tied."]}, {"type": "noun", "defs": ["a drum, percussion instrument, in general."]}], "ಆನನ": [{"type": "noun", "defs": ["the front of the head from the top of the forehead to the bottom of the chin, and from ear to ear; the face.", "the opening through which an animal takes in food, including the teeth, tongue etc.; the mouth."]}], "ಆನನುಕೂಲ್ಯ": [{"type": "noun", "defs": ["absence of comforts; discomfort."]}], "ಆನಮಿಸು": [{"type": "verb", "defs": ["to show respect to another by bending oneself humbly."]}], "ಆನಮ್ರ": [{"type": "adjective", "defs": ["= ಆನತ1."]}], "ಆನಮ್ರಾಮರ": [{"type": "noun", "defs": ["he who is revered even by the gods."]}], "ಆನಯ": [{"type": "noun", "defs": ["= ಆನಯನ."]}], "ಆನಯನ": [{"type": "noun", "defs": ["the act of conveying inwards; a bringing.", "investitute with the sacred thread."]}], "ಆನರ್ತ": [{"type": "noun", "defs": ["an elevated platform for acting on; a stage.", "a building where a drama is exhibited; a theatre.", "open armed conflict between countries or between factions within the same country.", "name of a state, now a part of Gujarāt, in western India; Saurāṣṭra.", "an inhabitant or a person belonging to this state."]}], "ಆನರ್ಥಕ್ಯ": [{"type": "noun", "defs": ["absence of meaning; meaninglessness.", "the quality of being useless; uselessness; unprofitableness."]}], "ಆನವು": [{"type": "noun", "defs": ["the plant Nauclea missionis of Rubiaceae family."]}], "ಆನಾಯ": [{"type": "noun", "defs": ["a fabric made from string, cord, etc., loosely knotted or woven in an openwork pattern and used to trap or snare birds, fish, etc.; a net."]}], "ಆನಾಯ್ಯ": [{"type": "adjective", "defs": ["that is to be brought in or near."]}, {"type": "noun", "defs": ["consecrated fire taken from household fire and placed on the south side."]}], "ಆನಾವು": [{"type": "noun", "defs": ["the tree Adina cardifolia of Rubiaceae family; saffron teak."]}], "ಆನಾಹ": [{"type": "noun", "defs": ["a binding of oneself to.", "irregular and insufficient action of the bowels; constipation; suppression of urine.", "the extent from end to end; length."]}], "ಆನಿ": [{"type": "noun", "defs": ["a wound having puss, caused by a thorn-pricking.", "a small hard, thick, painful growth chiefly on the toe or foot, resulting from an increase in the thickness of cuticle, caused by pressure or friction; a corn."]}], "ಆನಿಕೆ": [{"type": "noun", "defs": ["an act or instance of facing defiantly; confrontation.", "that which is of the same rank or status.", "an act of wearing, putting on a dress etc.; an assuming of a form.", "a rigid support; a timber supporting the roof; a prop.", "the fixed point of support on which a lever moves in raising or moving something; a fulcrum."]}, {"type": "noun", "defs": ["money paid in advance by a merchant to a farmer for future sale of latter's produce."]}], "ಆನಿಕೆಗಂಭ": [{"type": "noun", "defs": ["a timber supporting a roof; a beam or pole placed against a structure or part; a prop."]}], "ಆನಿಲ": [{"type": "adjective", "defs": ["proceeding from or produced by wind; characterised or accompanied by wind; windy."]}, {"type": "noun", "defs": ["(myth.) a son of Wind-God - a) Ānjanēya, an important character in the epic Rāmāyaṇa; b) Bhīmasēna, an important character in the epic Mahābhārata."]}], "ಆನಿಲಿ": [{"type": "noun", "defs": ["a rodent (family Cricetidae) living in water and having glossy brown fur, a long tail, webbed hind feet, and a musklike odour; musk-rat.", "a small, hornless deer, Moschus moschiferus of the uplands of central Asia, the male of which secretes musk and has tusk-like upper canines; musk deer."]}], "ಆನಿಸು": [{"type": "verb", "defs": ["to cause to rest sideways against something; to make (something) lean against.", "to support (as with a pillar or wooden post).", "(fig.) to support (in any way); to sustain; to prop up; ಆನಿಸಿಕೊಳ್ ānīsikoḷto cause something to rest sideways against oneself."]}], "ಆನಿಸಿಡು": [{"type": "verb", "defs": ["to cause something to rest sideways against another."]}], "ಆನೀಕ": [{"type": "noun", "defs": ["an army of soldiers.", "a collection of people; a crowd."]}], "ಆನೀಕಿನಿ": [{"type": "noun", "defs": ["a battalion consisting of 2187 elephants, 2187 chariots, 6561 horses and 10,925 foot-soldiers."]}], "ಆನೀತ": [{"type": "adjective", "defs": ["conveyed inwards; brought in."]}], "ಆನು": [{"type": "verb", "defs": ["to face or act in opposition; to oppose.", "to have on the body (as a dress); to wear.", "to have, possess afresh a new form.", "to receive; to take.", "to seize in the hands; to hold; to catch; to grasp.", "to stretch forward (as a hand in begging).", "to stop oneself from moving.", "to tolerate; to put up with (someone or something not especially liked).", "to take shelter in or under.", "10 to recline on or against.", "to give shelter, protection.", "to support or act as a prop; to bear the burden."]}, {"type": "pronoun", "defs": ["the nominative singular of the first personal pronoun; the word mentioning oneself; the one who is speaking or writing; \"I\"."]}, {"type": "noun", "defs": ["= ಆನುಂ."]}], "ಆನುಂ": [{"type": "adverb", "defs": ["(expressing uncertainty, probability, etc.) so ever; even."]}], "ಆನುಂ ಪಾಸಱೆ": [{"type": "noun", "defs": ["a stone slab to recline on."]}], "ಆನುಕೂಲಿಕ": [{"type": "adjective", "defs": ["being advantageous; favourable; helping."]}, {"type": "noun", "defs": ["a man with good sources of income or much wealth."]}], "ಆನುಕೂಲ್ಯ": [{"type": "noun", "defs": ["the means by which something can be done; a circumstance, resource that helps or is being favourable (for a person); necessary arrangement or comforts."]}], "ಆನುಕ್ರಮಿಕ": [{"type": "adjective", "defs": ["consecutive - a) following in order, without interruption; successive; sequential; b) proceeding from one part or idea to the next in logical order, as a story, reasoning, etc. ."]}], "ಆನುಗುಣ್ಯ": [{"type": "noun", "defs": ["the state of a) living together harmoniously, b) getting along well together or mixing without adverse reaction, with another, c) being capable of working with another system or discipline; compatibleness; agreeableness; congruity; correspondency of features."]}], "ಆನುಗೋಲು": [{"type": "noun", "defs": ["an aluminium or wooden rod with a curved handle, used for support in walking; a walking stick."]}], "ಆನುಪಾತಿಕ": [{"type": "adjective", "defs": ["proportional - a) of or determined by proportion; relative; b) having or being in, proportion; c) (math.) having the same or a constant ratio."]}], "ಆನುಪು": [{"type": "noun", "defs": ["a tax (now obsolete) levied on persons, vehicles or goods on entering into a city, town or an administrative jurisdiction."]}], "ಆನುಪೂರ್ವಕ": [{"type": "noun", "defs": ["= ಆನುಪೂರ್ವಿ."]}], "ಆನುಪೂರ್ವಿ": [{"type": "noun", "defs": ["a regular order; consecutive succession.", "the relation of a thing, event etc. with others in the same order or series.", "(log.) a conclusion regularly or syllogistically drawn."]}], "ಆನುಪೂರ್ವ್ಯ": [{"type": "noun", "defs": ["a regular order; consecutive succession.", "the fact of being or that which is, handed down, as beliefs, customs, etc., from generation to generation; a tradition."]}], "ಆನುಭವವೇದ": [{"type": "noun", "defs": ["the knowledge got from one's experience; practical knowledge."]}], "ಆನುಭಾವಿಕ": [{"type": "adjective", "defs": ["relating to mystery or mysticism; sacredly obscure or secret; involving a sacred or secret meaning hidden from the eyes of the ordinary person; that is revealed to a spiritually enlightened mind; mystic."]}], "ಆನುಭಾವಿಕತೆ": [{"type": "noun", "defs": ["mysticism - a) the state or power of being a mystic; the quality of a mystic; b) the experience or knowledge of a mystic."]}], "ಆನುಮಾನಿಕ": [{"type": "adjective", "defs": ["relating to a conclusion; conjectural.", "derived from or subject to an inference; inferential."]}], "ಆನುಲೋಮಿಕ": [{"type": "noun", "defs": ["coming or happening in an orderly manner; regular."]}], "ಆನುಲೋಮಿಕತೆ": [{"type": "noun", "defs": ["the quality or fact of coming or happening in or following an orderly manner; regularity; succession; consecutiveness."]}], "ಆನುವಂಶ": [{"type": "adjective", "defs": ["hereditary - a) of or passed down by, heredity; designating or of a characteristic transmitted genetically from generation to generation; b) of or passed down by, inheritance from an ancestor to a legal heir; ancestral; or having title, right, etc. by inheritance."]}], "ಆನುವಂಶಿಕ": [{"type": "adjective", "defs": ["= ಆನುವಂಶ."]}], "ಆನುವಂಶಿಕತೆ": [{"type": "noun", "defs": ["heredity - a) the transmission of characteristics from parent to offspring by means of genes in the chromosomes b) the tendency of offspring to resemble parents or ancestors through such transmission.", "(biol.) the evolutionary development of a species or other group of organisms through a succession of forms; phylogenesis.", "the evolutionary development of a particular (esp. anatomical) feature of an organism; phylogenesis."]}], "ಆನುವಂಶಿಕೆ": [{"type": "noun", "defs": ["that which has been handed down form generation to generation; a tradition."]}], "ಆನುವಂಶೀಯ": [{"type": "adjective", "defs": ["= ಆನುವಂಶ."]}], "ಆನುವಂಶೀಯತೆ": [{"type": "noun", "defs": ["= ಆನುವಂಶಿಕತೆ."]}], "ಆನುಶ್ರಾವಿಕ": [{"type": "adjective", "defs": ["according to hearing or resting on, tradition."]}, {"type": "noun", "defs": ["that which is performed as a traditional ritual, believed to be a means of obtaining heaven or absolution."]}], "ಆನುಶ್ರಾವಿಕಕರ್ಮಿ": [{"type": "noun", "defs": ["he who performs the rituals, including sacrifices, as per the Vēdas."]}], "ಆನುಷಂಗಿಕ": [{"type": "adjective", "defs": ["incidental; concomitant - a) liable to happen to; naturally attaching to; b) occurring as something casual or of secondary importance; not directly relevant to; following (up)on as a subordinate circumstance; c) of an expense or charge: incurred apart from the main sum disbursed.", "following as an effect or inference; consequential."]}], "ಆನುಷಂಗಿಕಖನಿಜ": [{"type": "noun", "defs": ["(usu. in pl.) those minerals whose presence or absence is not regarded in naming a rock; accessory minerals."]}], "ಆನುಷಂಗಿಕತೆ": [{"type": "noun", "defs": ["the quality or fact of being incidental or concomitant."]}], "ಆನುಷಂಗಿಕಫಲ": [{"type": "noun", "defs": ["a benefit derived incidentally, which was not aimed at."]}], "ಆನುಷಂಗಿಕಲಾಭ": [{"type": "noun", "defs": ["something additional to regular profit or pay, resulting from one's position or employment, esp. something customary or expected; perquisite."]}], "ಆನೂಪ": [{"type": "adjective", "defs": ["containing or full of water; watery; marshy; wet."]}, {"type": "noun", "defs": ["any animal that frequents marshy places, (such as a buffalo)."]}], "ಆನೂಪಕ್ಷೇತ್ರ": [{"type": "noun", "defs": ["a watery or marshy place."]}], "ಆನೃಣ್ಯ": [{"type": "noun", "defs": ["a watery or marshy place."]}], "ಆನೃಶಂಸ": [{"type": "noun", "defs": ["absence of cruelty or atrociousness; hence a) mildness; b) kindness; c) compassion; pity; mercy."]}], "ಆನೆ": [{"type": "noun", "defs": ["any of the huge, thick-skinned, almost hairless mammals of Proboscidea order, being the largest of extant four-footed animals, having a long, flexible snout (called a trunk) and, usually, two ivory tusks growing out of the upper jaw, of which Alphas maximus, theIndian elephant is commonly domesticated the other being Loxodonta africana, the African elephant.", "(used fig.) the quality or state of being large; largeness; something huge.", "ಬಿಳಿ ಆನೆ biḷi āne something from which little profit or use is derived but which needs to be maintained at much expense; a white elephant; ಆನೆ ಇದ್ದರೂ ಸಾವಿರ, ಸತ್ತರೂ ಸಾವಿರ āne iddarū sāvira, sattarū sāvira great things have value always, i.e. both during their life time and after death too; ಆನೆಯ ಕೈಲಿ ಕಬ್ಬುಕೊಟ್ಟ ಹಾಗೆ āneya kaili kabbukoṭṭa hāge as irrecoverable as a lump of butter in a greyhound's mouth; ಆನೆ ಕೆಳಗೆ ಬಿದ್ದರೂ ಆಳುದ್ದ āne kēḷage biddarū āḷudda do not take the great man lightly even when he has fallen down; ಆನೆಗೂ ಅಡಿ ತಪ್ಪೀತು ānegū aḍi tappītu even great men falter; ಆನೆ ತಿಂಬೋದು ಸೊಪ್ಪು, ಇರುವೆ ತಿಂಬೋದು ಸಕ್ಕರೆ āne timbōdu soppu, iruve timbōdu sakkare what one enjoys depends on his or her ability to digest, rather than on his or her social status; ಆನೆ ನುಂಗಿದ ಬೇಲದ ಕಾಯಿಯ ಹಾಗೆ āne nuŋgida bēlada kāyiya hāge that which is consumed or wasted without being seen outwardly so; ಆನೆ ಬೆಂಡಾದರೆ ಕೊಟ್ಟಿಗೆ ಹೊಕ್ಕೀತೆ āne beṇḍādare koṭṭige hokkīte? a person of dignity, may lose his wealth, but not his respect; ಆನೆ ಭಾರ ಆನೆಗೆ, ಇರುವೆ ಭಾರ ಇರುವೆಗೆ āne bhāra ānege, iruve bhāra iruvege no one knows the weight of another's burden; ಆನೆ ಮೇಲೆ ಹೋಗುವವನನ್ನು ಸುಣ್ಣ ಕೇಳಿದ ಹಾಗೆ āne mēle hōguvanannu suṇṇa kēḷida hāge (simile) it is like begging a worthless needle from an emperor;ಆನೆಯ ಗರ್ಭ āneya garbha the pregnancy of an elephant; 2. (fig.) any development, plan, implementation of which takes unduly long time; a tediously long period of endeavour before actual realisation; ಆನೆ ಸಾಧುವಾದರೆ ಅಗಸ ಮೈಲಿಗೆ ಹೇರಿದ āne sādhuvādare agasa maīlige hērida the willing horse is always worked to death; ಆನೆಬಿಟ್ಟು ಅಂಕುಶಕ್ಕೆ ಹೊಡೆದಾಡಿದ ಹಾಗೆ āne biṭṭu aŋkuśakke hoḍedāḍidaru to be extremely careful about small amounts of money and not careful enough about larger amounts of money; to be penny-wise and pound foolish; ಆನೆಯೇ ಹೋಗುವಾಗ ಬಾಲಕ್ಕೆ ಬಡಿದಾಡಿದರು ānēyē hōguvāga bālakke baḍidāḍidaru = ಆನೆ ಬಿಟ್ಟು ಅಂಕುಶಕ್ಕೆ ಹೊಡೆದಾಡಿದ ಹಾಗೆ; ಆನೆಯಾದರೂ ಸೊಪ್ಪು ಮೇಯೋದು ತಪ್ಪಲಿಲ್ಲ āneyādaru soppu mēyōdu tappalilla one can have only that which he is destined, irrespective of his rank or status; ಆನೆಯನ್ನು ನುಂಗುವವನಿಗೆ ಆಳು ಯಾವ ಲೆಕ್ಕ āneyannu nuŋguvavanige āḷu yāva lekka does he, who can move the mountain, care a fly; ಆನೆಯ ಮೇಲೆ ಕೂತವನನ್ನು ನಾಯಿ ಏನುಮಾಡುತ್ತದೆ? āneya mēle kūtavanannu nāyi ēnu māḍuttade? bark not when you cannot bite; ಆನೆಹೋದ ದಾರಿಯಲ್ಲಿ ಇರುವೆ ಹೋಗಬಲ್ಲುದು, ಇರುವೆ ಹೋದ ದಾರಿಯಲ್ಲಿ ಇರುವೆ ಹೋಗಲಾಗದು āne hōda dāriyalli iruve hōgabahudu, iruve hōda dāriyalli āne hōgalāgadu humility survives all odds."]}], "ಆನೆಕಂಭ": [{"type": "noun", "defs": ["= ಆನೆಗಂಭ."]}], "ಆನೆಕಜ್ಜಿ": [{"type": "noun", "defs": ["a kind of scab, a contagious skin disease, characterised by large, inflamed, painful, pus-filled swellings or boils."]}], "ಆನೆಕತ್ತಾಳೆ": [{"type": "noun", "defs": ["the plant Agave americana of Agavaceae family; demon aloe; century plant.", "the plant Agave sisalana of Agavaceae family; sisal hemp."]}], "ಆನೆಕಲ್ಲು": [{"type": "noun", "defs": ["(pl.) rounded pieces of ice that are larger than 5 mm and sometimes fall during thunderstorms; frozen raindrops; hailstones."]}, {"type": "noun", "defs": ["a small stone pieces with round, and smooth surface, tossed from the back of, and held by the palm, in a children's play."]}], "ಆನೆಕಾಲು": [{"type": "noun", "defs": ["a chronic disease characterised by the enlargement of the legs, and by the hardening and ulceration of the surrounding skin, caused by obstruction of the lymphatic vessels, often due to infestation by filarial worms; elephantiasis."]}], "ಆನೆಕಾಲುಗಿಡ": [{"type": "noun", "defs": ["the composite plant, Elephantopus scaber of Asteraceae family; elephant's foot."]}], "ಆನೆಕಾಸು": [{"type": "noun", "defs": ["(obs.) an ancient copper coin of very small value, bearing the figure of an elephant."]}], "ಆನೆಕಿವಿ": [{"type": "noun", "defs": ["a tropical plant, Begonia cardifolia of Begoniaceae family, cultivated for their remarkable leaves; elephant's ear; begonia."]}], "ಆನೆಕುಷ್ಟ": [{"type": "noun", "defs": ["= ಆನೆಕಾಲು."]}], "ಆನೆಕೊಂಬು": [{"type": "noun", "defs": ["a variety in paddy, that yields relatively longer rice."]}, {"type": "noun", "defs": ["a pest, silver shoot fly, destructive of paddy plant."]}], "ಆನೆಗ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಆನೆಗಂಭ": [{"type": "noun", "defs": ["a post for tethering the elephants.", "a stout and heavy wooden pole used as a prop for supporting a wall."]}], "ಆನೆಗಜ್ಜಿ": [{"type": "noun", "defs": ["= ಆನೆಕಜ್ಜಿ."]}, {"type": "noun", "defs": ["the plant Urtica parviflora of Urticaceae family."]}], "ಆನೆಗದಗು": [{"type": "noun", "defs": ["= ಆನೆಗದುಗು."]}], "ಆನೆಗದುಗ": [{"type": "noun", "defs": ["= ಆನೆಗದುಗು."]}], "ಆನೆಗದುಗು": [{"type": "noun", "defs": ["the plant, Cassia tora of Caesalpiniaceae family; ring worm plant."]}], "ಆನೆಗದುಪು": [{"type": "noun", "defs": ["a herd of elephants."]}], "ಆನೆಗಲ್": [{"type": "noun", "defs": ["= ಆನೆಗಲ್ಲು."]}], "ಆನೆಗಲ್ಲು": [{"type": "noun", "defs": ["a large boulder."]}], "ಆನೆಗವರ್ತೆ": [{"type": "noun", "defs": ["a catching of an elephant (for purpose of domesticating).", "the destruction caused by an elephant (as in a sugar-cane field or in a potter's workshop).", "any catch of high value or importance.", "a ruthless robbing of helpless by a heinous ruler or invader."]}], "ಆನೆಗವರ್ತೆಗೊಳ್": [{"type": "verb", "defs": ["to catch a person or a thing, by trapping, like catching an elephant by making him fall into a trench.", "to rob or plunder ruthlessly."]}], "ಆನೆಗಾಱ": [{"type": "noun", "defs": ["an elephant driver.", "a trainer of elephants."]}], "ಆನೆಗುಲಗಂಜಿ": [{"type": "noun", "defs": ["the plant, Adenanthera pavonia of Caesalpinaceae family; red-wood tree; coral pea; bead tree."]}], "ಆನೆಗುಲಿ": [{"type": "noun", "defs": ["an elephant-killer.", "the lion, as the destroyer of elephants."]}]}