{"ಕಂದುರಿ": [{"type": "noun", "defs": ["a kind of thick liquid made by boiling sugar in water."]}], "ಕಂದುವೆಳ್ಳಿ": [{"type": "noun", "defs": ["the silver that is adulterated; impure silver."]}], "ಕಂದುಹೃದಯ": [{"type": "noun", "defs": ["(fig.) the quality of a mean person or a cheat; a dishonest mind.", "a treacherous or deceitful man."]}], "ಕಂದುಹೃದಯೆ": [{"type": "noun", "defs": ["(fig.) a treacherous or deceitful woman."]}], "ಕಂದುಳಿ": [{"type": "noun", "defs": ["a cutting tool consisting of a crescent-shaped wide blade with a short handle, used for cutting heavy objects."]}], "ಕಂದೂರಿ": [{"type": "noun", "defs": ["a Muslim festival."]}], "ಕಂದೆ": [{"type": "noun", "defs": ["the creeper Momordica dioica of Cucurbitaceae family and its gourd; small bitter gourd."]}], "ಕಂದೆದೆ": [{"type": "noun", "defs": ["= ಕಂದುಹೃದಯ."]}], "ಕಂದೆರವಿ": [{"type": "noun", "defs": ["the act of opening one's eyes.", "the act of carving eyes in sculpturing an idol.", "the act or an instance of realising the fact."]}], "ಕಂದೆರೆ": [{"type": "verb", "defs": ["to open one's eyes; to see.", "(fig.) to come into existence; to be born; to be in the very initial stage.", "(fig.) to realise the fact."]}], "ಕಂದೆಱಪು": [{"type": "noun", "defs": ["the act of opening one's eyes.", "the act or an instance of realising the fact."]}], "ಕಂದೆಱಪುಗೈ": [{"type": "verb", "defs": ["to cause to be seen; to publish; to cause to manifest."]}], "ಕಂದೆಱವಿ": [{"type": "noun", "defs": ["= ಕಂದೆರವಿ."]}], "ಕಂದೆಱವು": [{"type": "noun", "defs": ["= ಕಂದೆಱಪು."]}], "ಕಂದೆಱವೆ": [{"type": "noun", "defs": ["the act of opening one's eyes.", "the act or an instance of realising the fact.", "(fig.) favour; kind regard; bestowal of mercy (as by a god or a religious person)."]}], "ಕಂದೆಱಸು": [{"type": "verb", "defs": ["to carve an eye or eyes in sculpturing an idol.", "(fig.) to cause to see or realist the fact; to open (another's) eyes."]}], "ಕಂದೆಱೆ": [{"type": "verb", "defs": ["= ಕಂದೆರೆ."]}], "ಕಂದೊಡಿ": [{"type": "noun", "defs": ["the climber Rhapidophora pertusa of Araceae family; Indian ivy."]}], "ಕಂದೊಡೆ": [{"type": "verb", "defs": ["to begin to grow or germinate; to give off shoots or buds; to sprout."]}], "ಕಂದೊಳಲ್": [{"type": "verb", "defs": ["= ಕಂದೊಳಲು1."]}, {"type": "noun", "defs": ["= ಕಂದೊಳಲು2."]}], "ಕಂದೊಳಲಿ": [{"type": "noun", "defs": ["a small insect that flies very close to th eyes during mango-fruit seasons; mango-gnat."]}], "ಕಂದೊಳಲು": [{"type": "verb", "defs": ["(one's eye, ability to see) to become weak, to get puzzled (as from weariness, fear, sudden mental shock, etc.); (bewilderment) to happen."]}, {"type": "noun", "defs": ["loss of vision or of ability to think (from weariness, fear, psychological shock, etc.); bewilderment."]}], "ಕಂದೊಳಲುಗೊಳ್": [{"type": "verb", "defs": ["to be bewildered; to get confused hopelessly."]}], "ಕಂದೊಳಸು": [{"type": "noun", "defs": ["the fact or condition of being bewildered; perplexity of the mind."]}], "ಕಂದೊಳಸುಗೊಳ್": [{"type": "verb", "defs": ["to get utterly perplexed or confused."]}], "ಕಂದೋಟಿ": [{"type": "noun", "defs": ["a small box for keeping money; a small bag or pouch for carrying money."]}], "ಕಂದೋಡಿ": [{"type": "noun", "defs": ["the very poisonous viper of India, Dabola russellii, with a very shining body."]}], "ಕಂದೋಲಿ": [{"type": "noun", "defs": ["the deciduous tree Sterculia urens of Sterculiaceae family."]}], "ಕಂದ್ಲಿ": [{"type": "noun", "defs": ["a kind of fish."]}], "ಕಂಧ": [{"type": "noun", "defs": ["= ಕಂಧರ."]}], "ಕಂಧರ": [{"type": "noun", "defs": ["a visible mass of condensed watery vapour floating in the atmosphere high above the general level of the ground; cloud.", "a kind of grass.", "the part of the body connecting the head to the shoulders; the neck."]}], "ಕಂಧರದ್ವಯಸ": [{"type": "adjective", "defs": ["raising upto the level of one's neck; neck-deep or neck-high."]}], "ಕಂಧರಬಂಧ": [{"type": "noun", "defs": ["that part of the body from the joint connecting the right arm with the body to such joint on the left and including the base of the neck in between; shoulder."]}], "ಕಂಧಾಯ": [{"type": "noun", "defs": ["[rightly, ಕಂದಾಯ ]a compulsory payment, usu. a percentage, levied on property value for the support of a government; land or property tax."]}], "ಕಂಪ": [{"type": "noun", "defs": ["a firm, fine-grained earth, plastic when wet, composed chiefly of hydrous aluminium silicate minerals, which is produced by the chemical decomposition of rocks or the deposit of fine rock particles in water and is used in the manufacture of bricks, pottery, and other ceramics; clay."]}, {"type": "noun", "defs": ["the act, condition or an instance of trembling; a trembling, shaking or shivering."]}], "ಕಂಪಂಗೊಳ್": [{"type": "verb", "defs": ["= ಕಂಪನಗೊಳ್."]}], "ಕಂಪಕಾರಿ": [{"type": "noun", "defs": ["something that causes vibration, esp. a device used in a mechanical sieve or for agitating something; a vibrator."]}], "ಕಂಪಣ": [{"type": "noun", "defs": ["a territory marked off for special administrative etc. purposes; a district."]}, {"type": "noun", "defs": ["a bundle of hay, harvested crop, etc."]}, {"type": "noun", "defs": ["a kind of military weapon."]}], "ಕಂಪಣಿಗ": [{"type": "noun", "defs": ["a man who makes a stack of hay."]}], "ಕಂಪನ": [{"type": "noun", "defs": ["the act or condition of trembling; a trembling, shaking or shivering.", "a kind of weapon.", "one of the six seasons of a year, that corresponds to November and December months.", "a temporary state of extreme mental excitement, marked by restlessness, confused speech, and hallucinations; delirium."]}], "ಕಂಪನಗೊಳ್": [{"type": "verb", "defs": ["to tremble - a) to shake involuntarily from cold, fear, excitement, fatigue, etc.; to shiver; b) to feel great fear or anxiety; c) to quiver, quake, totter, vibrate, etc."]}], "ಕಂಪನಗೊಳಿಸು": [{"type": "verb", "defs": ["= ಕಂಪಿಸು2- 2"]}], "ಕಂಪನತರಂಗ": [{"type": "noun", "defs": ["wave or waves caused by the vibration of something."]}], "ಕಂಪನವಿಸ್ತಾರ": [{"type": "noun", "defs": ["(phys.) the extreme range of a fluctuating quantity, as the swing of a pendulum."]}], "ಕಂಪನಾಂಕ": [{"type": "noun", "defs": ["(phys.) the number of periodic oscillations, vibrations or waves per unit of time; frequency."]}], "ಕಂಪನಾವರ್ತ": [{"type": "noun", "defs": ["(phys.) the cycle of oscillations, vibrations or waves."]}], "ಕಂಪನಿ": [{"type": "noun", "defs": ["a group associated for some purpose, as to form a commercial or industrial firm.", "all that contingent in an army that comes under the control of a captain.", "East India Company, that was carrying on trade in, and later ruled, India for several years."]}], "ಕಂಪಲ್": [{"type": "noun", "defs": ["soft mud; soggy earth; mire; slush."]}], "ಕಂಪಲರ್": [{"type": "verb", "defs": ["(good odour, perfume) to spread, pervade a particular space, as a room etc."]}, {"type": "noun", "defs": ["a flower having good scent."]}], "ಕಂಪಲ್ಮಸಗಿಸು": [{"type": "verb", "defs": ["to splash slush; to cause the muddy sediments to come up."]}], "ಕಂಪಲ್ಮಸಗು": [{"type": "verb", "defs": ["to become muddy; to be full of or spattered with mud."]}], "ಕಂಪವಾತ": [{"type": "noun", "defs": ["a disorder of the nervous system, esp. of children, characterised by irregular, jerking movements, chiefly of the face and extremities, caused by involuntary muscular contractions; chorea; St. Vitus dance."]}], "ಕಂಪವೇಱು": [{"type": "verb", "defs": ["(a trembling) to become excessive."]}], "ಕಂಪಳ": [{"type": "noun", "defs": ["any collection of articles, usu. those which are used in some activity; equipment; paraphernalia."]}, {"type": "noun", "defs": ["a territory marked off for special administrative etc. purposes; a district.", "all the people living in a particular district, city, etc.; a community."]}, {"type": "noun", "defs": ["a cluster of plantain fruits."]}], "ಕಂಪಾಡಗ": [{"type": "noun", "defs": ["a large East Indian tree, Tectona grandis of the Verbenaceae family, with white flowers and hard, yellowish-brown wood used for shipbuilding, furniture, etc. teak."]}], "ಕಂಪಾತ್ರ": [{"type": "noun", "defs": ["Śiva, whose bowl is made of a skull."]}], "ಕಂಪಾಯಮಾನ": [{"type": "adjective", "defs": ["trembling; shaking; quivering."]}], "ಕಂಪಾರ": [{"type": "noun", "defs": ["the plant Viburnum hebanthum of Caprifoliaceae family."]}], "ಕಂಪಾಲೆ": [{"type": "noun", "defs": ["the tree Xantolis tomentosa (=Sideroxylon tomentosum) of Sapotaceae family."]}], "ಕಂಪಾಸು": [{"type": "noun", "defs": ["an instrument consisting of two pointed legs connected at one end by a pivot, used for drawing arcs or circles or for taking measurements; a pair of compasses.", "an instrument consisting of a magnetic needle swinging freely on a pivot and pointing to the magnetic north used to determine the direction or directions; a compass."]}], "ಕಂಪಿ": [{"type": "noun", "defs": ["any of the two flat, thin wooden pieces used as a protective cover on either side of a palmyra leaves on which something is written."]}], "ಕಂಪಿಡಿ": [{"type": "verb", "defs": ["to fill with a fragrant or pleasing odour."]}], "ಕಂಪಿಡಿಗು": [{"type": "verb", "defs": ["to tremble, shake or quiver."]}], "ಕಂಪಿಡು": [{"type": "verb", "defs": ["to emit or spread sweet scent."]}], "ಕಂಪಿತ": [{"type": "adjective", "defs": ["shaken; trembled (as from cold).", "frightened; filled with fright; terrified."]}, {"type": "noun", "defs": ["the act of or fact of trembling; a trembling, shaking or shivering.", "(mus.) an instance of moving rapidly above and below a note in a very regulated manner.", "(dance) an act of shaking the head up and down in quick succession, to indicate recognition, perception, acceptance, provocation, enquiry, etc.", "(dance.) a shaking of the shank.", "unsteadiness of one's voice in singing (considered as a fault)."]}], "ಕಂಪಿಲ": [{"type": "noun", "defs": ["= ಕಂಪಿಲ್ಲ."]}], "ಕಂಪಿಲ್ಲ": [{"type": "noun", "defs": ["the plant Croton polyandrous of Euphorbiaceae family."]}], "ಕಂಪಿಸು": [{"type": "verb", "defs": ["to give good odour out; to impart a sweet scent to; to impregnate with a sweet smell."]}, {"type": "verb", "defs": ["to tremble - a) to shake involuntarily from cold, fear, excitement, fatigue, etc.; to shiver; b) to feel great fear or anxiety; c) to quiver, quake, totter, vibrate, etc.", "to cause to tremble - a) to cause to shake; b) to cause to feel great fear or anxiety; c) to cause to quiver, quake, totter, etc."]}], "ಕಂಪೀಳು": [{"type": "noun", "defs": ["all the people living in a particular district, city, etc. ; a community.", "a cluster of plantain fruits."]}], "ಕಂಪು": [{"type": "noun", "defs": ["odour - a) that characteristic of a substance which makes it perceptible to the sense of smell; b) a smell, whether pleasant or unpleasant; fragrance, stench, etc."]}], "ಕಂಪುಗಾರ್ತಿ": [{"type": "noun", "defs": ["a woman who has a fragrant smell."]}], "ಕಂಪುಗಾಳಿ": [{"type": "noun", "defs": ["the air that has a fragrant smell."]}], "ಕಂಪುಗಾಱ": [{"type": "noun", "defs": ["a man who has a fragrant smell.", "a man engaged in manufacturing or selling perfumes."]}], "ಕಂಪುಗು": [{"type": "verb", "defs": ["to give good odour out; to impart a sweet scent to; to impregnate with a sweet smell."]}], "ಕಂಪುಗೊಳ್": [{"type": "verb", "defs": ["to perceive the sweet scent."]}], "ಕಂಪುಗೋಲ್": [{"type": "noun", "defs": ["any of the five arrows of Manmata, the Love-God.", "mental agony, arising from unfulfilled sexual desire; pain suffered from longing for sexual union."]}], "ಕಂಪುಗೋಲ": [{"type": "noun", "defs": ["Manmatha, whose arrows are made of sweet smelling flowers."]}], "ಕಂಪುಗೋಲಾರಿ": [{"type": "noun", "defs": ["Śiva, as the enemy of Manmata, the Love-God."]}], "ಕಂಪುಜಿನಸು": [{"type": "noun", "defs": ["any substance used to give certain flavour; a flavouring."]}], "ಕಂಪುಣ್": [{"type": "verb", "defs": ["to perceive the sweet scent."]}], "ಕಂಪುಣಿ": [{"type": "noun", "defs": ["the honey bee, that enjoys the sweet scent of different flowers."]}], "ಕಂಪುಣುಬ": [{"type": "noun", "defs": ["Manmatha, whose arrows are made of sweet smelling flowers."]}], "ಕಂಪುದೀವು": [{"type": "verb", "defs": ["(perfume, sweet smell) to pervade certain space, a room etc."]}], "ಕಂಪುನೀರ್": [{"type": "noun", "defs": ["water mixed with perfume (usu. to sprinkle on)."]}], "ಕಂಪುವಡೆ": [{"type": "verb", "defs": ["to be scented; to get good perfume."]}], "ಕಂಪುವಳ": [{"type": "noun", "defs": ["air, that carries odour to different places."]}], "ಕಂಪುವಿಡಿ": [{"type": "verb", "defs": ["to detect, perceive or get a suspicion of by or as by sniffing: to sniff out."]}], "ಕಂಪುವೆಱು": [{"type": "verb", "defs": ["to have sweet scent (within)."]}], "ಕಂಪುವೇಱು": [{"type": "verb", "defs": ["= ಕಂಪುವಡೆ."]}], "ಕಂಪೂ": [{"type": "noun", "defs": ["a group of people living together as a smaller social unit within a larger one, and having interests, work, etc. in common."]}], "ಕಂಪೆ": [{"type": "noun", "defs": ["a load of earthen ware carried either on the head or the shoulder."]}], "ಕಂಪೇಱು": [{"type": "verb", "defs": ["= ಕಂಪುವೆಱು."]}], "ಕಂಪೊಗೆ": [{"type": "verb", "defs": ["to give good odour out; to impart a sweet scent to; to impregnate with a sweet smell."]}], "ಕಂಪೊರೆ": [{"type": "verb", "defs": ["= ಕಂಪೊಗೆ."]}], "ಕಂಪ್ರ": [{"type": "adjective", "defs": ["trembling, shaking or quivering (as from cold).", "unsteady; vacillating."]}], "ಕಂಪ್ರಿಸು": [{"type": "verb", "defs": ["to tremble - a) to shake involuntarily from cold, fear, excitement, fatigue, etc.; to shiver; b) to feel great fear or anxiety; c) to quiver, quake, totter, vibrate, etc."]}], "ಕಂಬ": [{"type": "noun", "defs": ["a long piece of wood, metal, etc. usu. rounded, used as a support from below; a pole; a pillar.", "an old unit of land measure (now obs.).", "ಕಂಬದ ಮರ kambada mara the ornamental tree Polyalthia longifolia of Annonaceae family; the Indian mast tree."]}, {"type": "noun", "defs": ["one of the sub-castes (social system)."]}, {"type": "noun", "defs": ["the tree Polyalthia longifolia of Annonaceae family; Indian mast tree."]}], "ಕಂಬಗಟ್ಟು": [{"type": "noun", "defs": ["a piece of long, colour cloth used to decorate the poles on festive occasions."]}], "ಕಂಬಚ್ಚಿ": [{"type": "noun", "defs": ["= ಕಂಬಚ್ಚು."]}], "ಕಂಬಚ್ಚು": [{"type": "noun", "defs": ["a metal device through which metal wires are drawn while being manufactured."]}], "ಕಂಬಚ್ಚುಗಜ್ಜ": [{"type": "noun", "defs": ["the work or process of manufacturing metal wires."]}], "ಕಂಬನಿ": [{"type": "noun", "defs": ["a drop of clear salty liquid secreted by glands, that serves to moisten and wash the eye and is shed from it in grief or other strong emotions; tear."]}], "ಕಂಬನಿಗಱೆ": [{"type": "verb", "defs": ["to drop, shed tears in grief, joy,pain, etc."]}], "ಕಂಬನಿಗಿಡಿ": [{"type": "noun", "defs": ["(fig.) tear that comes out from agony and anger caused by such agony."]}], "ಕಂಬನಿದುಂಬು": [{"type": "verb", "defs": ["(tear) to moisten or fill the eye."]}], "ಕಂಬನಿದುಳುಕು": [{"type": "verb", "defs": ["(tear) to roll out of the eye."]}], "ಕಂಬನಿದುಱುಗು": [{"type": "verb", "defs": ["= ಕಂಬನಿದುಂಬು."]}], "ಕಂಬನಿದೊಡೆ": [{"type": "verb", "defs": ["to wipe the tears.", "to console a person in distress."]}], "ಕಂಬನಿಯೊರೆ": [{"type": "verb", "defs": ["to shed tears; to weep."]}], "ಕಂಬಪೂಜೆ": [{"type": "noun", "defs": ["a worshipping of the first pole erected while constructing a building.", "a worshipping of the pandal raised in front the house on the occasion of a marriage."]}], "ಕಂಬರಾಜಗೀರೆ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಕಂಬರ್ತಿ": [{"type": "noun", "defs": ["a making good of a loss; a compensating for a damage caused."]}], "ಕಂಬಲ": [{"type": "noun", "defs": ["a large piece of cloth, often of soft wool, used to wrap up a person for warmth; a blanket.", "a loose fold of skin hanging from the throat of cattle the dewlap.", "a kind of deer.", "a piece of woollen fabric, usu. rectangular, worn over the shoulders or head; a woollen shawl.", "a continuous and usu. vertical structure of usu. brick or stone, having little width in proportion to its length and height and esp. enclosing, protecting or dividing a space or supporting a roof; a wall.", "a kind of small worm.", "a huge blanket for wrapping up an elephant.", "water.", "a two-wheeled vehicle drawn by an ox or oxen; a bullock-cart.", "(name of) one of the snakes which Śiva uses as his ear-ring."]}], "ಕಂಬಲವಾಹ್ಯ": [{"type": "noun", "defs": ["a two wheeler cart drawn by oxen that are wrapped up with woollen blankets."]}], "ಕಂಬಲಾಸನ": [{"type": "noun", "defs": ["a seat on which a woollen blanket is spread.", "the skin of a deer used to sit on."]}], "ಕಂಬಲಿ": [{"type": "noun", "defs": ["anything that is covered or wrapped up with a woollen blanket.", "the castrated male cattle used for drafting; an ox."]}], "ಕಂಬಲಿವಾಹ್ಯಕ": [{"type": "noun", "defs": ["= ಕಂಬಲವಾಹ್ಯ."]}], "ಕಂಬವಲಿ": [{"type": "noun", "defs": ["a worshipping of the pandal raised in front the house, after a marriage."]}], "ಕಂಬಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["a worshipping of poles of the pandal raised in front the house by the bride or the groom (as prevalent among fishermen community) before their marriage."]}], "ಕಂಬಳ": [{"type": "noun", "defs": ["an extent of agricultural field."]}, {"type": "noun", "defs": ["a musical instrument."]}, {"type": "noun", "defs": ["money paid to an employee for work done on a daily basis; daily wages."]}, {"type": "noun", "defs": ["a running contest of buffaloes, in pair, held in wet, slushy rice field, prevalent in the coastal districts of Karnāṭaka.", "a festival observed at the beginning of sowing season."]}, {"type": "noun", "defs": ["= ಕಂಬಲ."]}], "ಕಂಬಳಕೋರಿ": [{"type": "noun", "defs": ["= ಕಂಬಳ4 - 2."]}], "ಕಂಬಳಗದ್ದೆ": [{"type": "noun", "defs": ["a piece of irrigated agricultural field."]}], "ಕಂಬಳಗಾರ": [{"type": "noun", "defs": ["an unskilled native labourer; a coolie."]}], "ಕಂಬಳಪಱೆ": [{"type": "noun", "defs": ["a kind of drum or percussion instrument ."]}], "ಕಂಬಳವಂತ": [{"type": "noun", "defs": ["a farmer having his own agricultural lands."]}], "ಕಂಬಳಾಸನ": [{"type": "noun", "defs": ["= ಕಂಬಲಾಸನ."]}], "ಕಂಬಳಿ": [{"type": "noun", "defs": ["a large piece of cloth, often of soft wool, used to wrap up a person for warmth; a blanket."]}], "ಕಂಬಳಿಕರೀ ಮರ": [{"type": "noun", "defs": ["the tree Diospyros puriens of Ebenaceae family, leaves of which are used for making beedies (a kind of cigarette)."]}], "ಕಂಬಳಿಕುರುಬ": [{"type": "noun", "defs": ["a sub-caste among shepherds, usu. engaged in weaving woollen blankets."]}], "ಕಂಬಳಿಗಿಡ": [{"type": "noun", "defs": ["the plant Morus indica of Moraceae family; Indian mulberry plant; caterpillar tree."]}], "ಕಂಬಳಿಗೊಪ್ಪೆ": [{"type": "noun", "defs": ["a cover, made from woollen, to cover the back, head and also the side portions of the body, to protect from cold."]}], "ಕಂಬಳಿತಿಮಿರ": [{"type": "noun", "defs": ["pitch-darkness; absolute darkness."]}], "ಕಂಬಳಿಮರ": [{"type": "noun", "defs": ["the deciduous tree Morus alba (var. indica) of Moraceae family."]}], "ಕಂಬಳಿಯಳಿಗ": [{"type": "noun", "defs": ["a kind of insectivorous lizard Varanus dracaema of Varanidae family, that changes colour of its skin to adapt to the environment as a defence against enemies or to deceive its prey; Indian monitor."]}], "ಕಂಬಳಿಹುಳು": [{"type": "noun", "defs": ["the wormlike larva of a butterfly; a caterpillar."]}], "ಕಂಬಱ": [{"type": "noun", "defs": ["a smith who works in iron, a blacksmith."]}], "ಕಂಬೞಿ": [{"type": "noun", "defs": ["= ಕಂಬಳಿ."]}], "ಕಂಬಾರ": [{"type": "noun", "defs": ["= ಕಂಬಱ."]}], "ಕಂಬಾರಗಿತ್ತಿ": [{"type": "noun", "defs": ["a woman belonging to the community of blacksmiths.", "the wife of such a blacksmith."]}], "ಕಂಬಾರಿಕೆ": [{"type": "noun", "defs": ["the profession of a blacksmith.", "a tax levied on blacksmiths."]}], "ಕಂಬಾವತಿ": [{"type": "noun", "defs": ["a kind of sari with decorated with gold or silver thread or lace-work."]}], "ಕಂಬಾಱ": [{"type": "noun", "defs": ["= ಕಂಬಱ."]}], "ಕಂಬಿ": [{"type": "noun", "defs": ["metal drawn out into the form of a thread or thin flexible rod; a wire.", "a small iron rod put across a horse mouth and attached to the bridle; a bit.", "the hem of a sari sewn decoratively with gold or silver threads.", "an iron rod or staff.", "the upper, bony part of the nose; the bridge of the nose.", "a wooden stick, rod or staff.", "a bamboo split (to which burdens are attached to be carried on a shoulder or on the back of the neck across the shoulder).", "any of a series of parallel metal bars laid upon crossties or in the ground to make a track for railroad cars, streetcars, etc.; rail.", "ಕಂಬಿ ಎಣಿಸು kambi eṇisu (fig.) to be in prison; ಕಂಬಿಕಟ್ಟು kambi kaṭṭu to furnish with railings; ಕಂಬಿಕೀಳಿಸು kambi kīḷisu (fig.) to cause to leave the place; ಕಂಬಿಕೀಳು kambi kīḷu (fig.) to run away; to leave the place (hastily in order to escape); to flee; to absquatulate; ಕಂಬಿಯ ಅಯ್ಯ kambiya ayya a traditional devotee of Mallikārjuna (a form of Śiva) of Śrī Śaila or of Mādayya (Mahādēva, another form of Śiva) of Mūḍumale; ಕಂಬಿಯ ಪದ kambiya pada a kind of folk song sung by kambiaya ayyas in praise of Mallikārujuna (or Mādayya) on their way to Śrī Śaila or Mūḍumale; ಕಂಬಿಯವ kambiyava a man holding a staff; a guard; ಕಂಬಿಯಿಲ್ಲದೆ ರೈಲು ಬಿಡು kambiyillade railu biḍu (fig.) to tell lies freely."]}, {"type": "noun", "defs": ["a large long-handled spoon with a cup-shaped bowl used for serving liquid foods; a ladle.", "the joint on a bamboo stem.", "a young bamboo."]}, {"type": "noun", "defs": ["the plant Bauhinia vahilii of Caesalpiniaceae family.", "its flower.", "the tree Gardenia latifolia of Rubiaceae family."]}], "ಕಂಬಿಕಾತಿ": [{"type": "noun", "defs": ["a female guard (holding a staff) of the harem in a palace."]}], "ಕಂಬಿಕಾಱ": [{"type": "noun", "defs": ["a male guard (holding a staff) in a palace.", "he who carries the burden attached to both the ends of a long bamboo split, on the back of the neck or on a shoulder."]}], "ಕಂಬಿಗ": [{"type": "noun", "defs": ["(masc.) a person guarding the entrance of a building; a doorkeeper."]}, {"type": "noun", "defs": ["a man of low, mean or base quality.", "a man who has no money for his living; a broke."]}], "ಕಂಬಿಗಟ್ಟಿಸು": [{"type": "verb", "defs": ["to cause to tie with a wire or wires."]}], "ಕಂಬಿಡು": [{"type": "verb", "defs": ["to reinforce with metal rods and wires."]}], "ಕಂಬಿಪಂಚೆ": [{"type": "noun", "defs": ["a dhōti, a loose long garment to cover the lower portions of the body from the navel to the feet, hemmed decoratively with gold or silver threads."]}], "ಕಂಬಿಪೇಟ": [{"type": "noun", "defs": ["a headgear made of a long lose cloth hemmed decoratively with gold and silver threads."]}], "ಕಂಬಿಮೇಣ": [{"type": "noun", "defs": ["the tree Gardenia gummifera of Rubiaceae family; a kind of resin tree."]}], "ಕಂಬಿಯಚ್ಚು": [{"type": "noun", "defs": ["a metal device through which metal wires are drawn while being manufactured."]}], "ಕಂಬಿವಾರು": [{"type": "adverb", "defs": ["along the edge or border."]}], "ಕಂಬಿಸೀರೆ": [{"type": "noun", "defs": ["a sari decorated with gold or silver thread."]}], "ಕಂಬೀರ": [{"type": "noun", "defs": ["a valiant soldier."]}], "ಕಂಬು": [{"type": "noun", "defs": ["a thick heavy spiral shell, occasionally bearing long projections, of various marine gastropod molluscs of the family Strombidae; a conch.", "an ornamental band, hoop or chain worn on the wrist; a bracelet.", "an elephant.", "water.", "the white colour.", "that part of a human joining the head to the body; the neck.", "the grass Pennisetum typhoides (= Holcus spicata, = Panicum spicatum) of Poaceae family.", "its grain; spiked millet."]}], "ಕಂಬುಕ": [{"type": "noun", "defs": ["= ಕಂಬು - 1.", "= ಕಂಬಿಗ2 - 1."]}], "ಕಂಬುಕಂಠ": [{"type": "noun", "defs": ["the neck of a person resembling a conch.", "the voice of a person resembling the sound produced from a conch; a loud and clear voice."]}], "ಕಂಬುಕಂಠಿ": [{"type": "noun", "defs": ["a woman having a beautiful conch-like neck."]}], "ಕಂಬುಕಂಠೆ": [{"type": "noun", "defs": ["= ಕಂಬುಕಂಠಿ."]}], "ಕಂಬುಕಂಧರ": [{"type": "noun", "defs": ["a neck resembling a conch."]}], "ಕಂಬುಕಂಧರೆ": [{"type": "noun", "defs": ["= ಕಂಬುಕಂಠಿ."]}], "ಕಂಬುಗಲ": [{"type": "noun", "defs": ["= ಕಂಬುಕಂಠ."]}], "ಕಂಬುಗಳ": [{"type": "noun", "defs": ["= ಕಂಬುಗಲ."]}], "ಕಂಬುಗೆ": [{"type": "noun", "defs": ["a portion of a war-car (drawn by a horse or horses) for keeping military arms.", "any of the small poles of a war-car, that protect the person inside from outside attack or obstruct the arrow, spear etc. thrown at; a crash-guard of a war-chariot."]}], "ಕಂಬುಗ್ರೀವ": [{"type": "noun", "defs": ["a neck resembling a conch.", "a mythological tortoise."]}], "ಕಂಬುಗ್ರೀವೆ": [{"type": "noun", "defs": ["a woman having a beautiful conch-like neck."]}], "ಕಂಬುಜ": [{"type": "noun", "defs": ["that which is born in a conch, as a marine mollusc."]}], "ಕಂಬುಧರ": [{"type": "noun", "defs": ["Viṣṇu, who holds a conch in his hand."]}], "ಕಂಬುಳ": [{"type": "noun", "defs": ["a running contest of buffaloes, in pair, in wet, slushy field, prevalent in the coastal districts of Karnāṭaka."]}], "ಕಂಬೆಳಕು": [{"type": "noun", "defs": ["= ಕಂಬೆಳಗು."]}], "ಕಂಬೆಳಗು": [{"type": "noun", "defs": ["the lustre of the eye.", "that much light (usu. day-light) which is required for the eye to see the objects easily."]}, {"type": "noun", "defs": ["the plant Phaseolus adenanthus.", "its bean."]}], "ಕಂಬೇಟ": [{"type": "noun", "defs": ["sexual pleasure derived from looking at."]}], "ಕಂಬೊಣರ್": [{"type": "noun", "defs": ["a pair of eyes; both the eyes of a person."]}], "ಕಂಬೊಲ": [{"type": "noun", "defs": ["the extent of land or space that one can see (without extra assistance)."]}], "ಕಂಬೋಲಿ": [{"type": "noun", "defs": ["a worshipping of the pandal raised in front the house, after a marriage."]}], "ಕಂಭ": [{"type": "noun", "defs": ["a long piece of wood, metal, etc. usu. rounded, used as a support from below; a pole.", "an old unit of land measure (now obs.)."]}], "ಕಂಭಕುಂಭ": [{"type": "noun", "defs": ["a religious function during which women whose husbands are alive, are honoured."]}], "ಕಂಭಗಟ್ಟು": [{"type": "noun", "defs": ["a piece of long, colour cloth used to decorate the poles on festive occasions."]}], "ಕಂಭದೀವಿಗೆ": [{"type": "noun", "defs": ["a votive lamp placed on a pole."]}], "ಕಂಭನಿಱುಗೆ": [{"type": "noun", "defs": ["a planting of a pole."]}], "ಕಂಭಪೂಜೆ": [{"type": "noun", "defs": ["a worshipping of the first pole erected while constructing a building.", "a worshipping of the pandal raised in front the house on the occasion of marriages."]}], "ಕಂಭಮುಹೂರ್ತ": [{"type": "noun", "defs": ["= ಕಂಭಪೂಜೆ - 1."]}], "ಕಂಭರಾಜಗೀರೆ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಕಂಭವತಿ": [{"type": "noun", "defs": ["= ಕಂಭಾವತಿ."]}], "ಕಂಭವಲಿ": [{"type": "noun", "defs": ["a worshipping of the pandal raised in front the house after a marriage."]}], "ಕಂಭಶಕ್ತಿ": [{"type": "noun", "defs": ["the principal support or supporting person."]}], "ಕಂಭಾವತಿ": [{"type": "noun", "defs": ["a kind of sari decorated with gold or silver thread or lace-work."]}], "ಕಂಸ": [{"type": "noun", "defs": ["an alloy consisting chiefly of copper and tin; bronze.", "a small, metal, open container for beverages, usu. bowl-shaped and with a handle; a metal cup.", "either or both of the curved lines, '( )', used to mark off parenthetical words, etc. or to enclose mathematical or logical symbols that are to be treated as a single term; parenthesis.", "any part of a curve, esp. of a circle.", "(myth.) a demoniac king who was the maternal uncle of and slain by Křṣṇa."]}], "ಕಂಸತಾಲ": [{"type": "noun", "defs": ["a musical instrument, for keeping time, consisting of a pair of concave bronze plates, struck together to make a ringing sound; a pair of bronze cymbals."]}], "ಕಂಸತಾಳ": [{"type": "noun", "defs": ["= ಕಂಸತಾಲ."]}], "ಕಂಸಬೆ": [{"type": "noun", "defs": ["the headquarter or a principal town of an administrative sub-district (a taluk or hōbaḷi) made for taxation purposes, usu. comprising a number of villages."]}], "ಕಂಸಾರಕ": [{"type": "noun", "defs": ["a worker in bronze or brass metal."]}], "ಕಂಸಾರಿ": [{"type": "noun", "defs": ["Křṣṇa, as the enemy of his maternal uncle Kamsa."]}], "ಕಂಸಾಳ": [{"type": "noun", "defs": ["a slightly convex bronze disk that gives a loud, resonant tone when struck, used as a percussion instrument; one of a pair of large bronze cymbals; a gong."]}], "ಕಂಸಾಳಕ": [{"type": "noun", "defs": ["sexual pleasure derived from looking at."]}], "ಕಂಸಾಳಗಿತ್ತಿ": [{"type": "noun", "defs": ["a woman who keeps time with a pair of large bronze cymbals.", "a female worker in gold; a goldsmith."]}], "ಕಂಸಾಳೆ": [{"type": "noun", "defs": ["a pair of large bronze cymbals.", "a long bronze trumpet or clarion."]}, {"type": "noun", "defs": ["= ಕಂಸಾಳಕ."]}], "ಕಂಸಾಳೆಪದ": [{"type": "noun", "defs": ["any of the folk songs sung to the time of large bronze cymbals played with."]}], "ಕಂಸಿ": [{"type": "noun", "defs": ["a flat metallic disk that gives a loud, resonant tone when struck, usu. used at the time of waving lights before the deity either in a temple or at house; a gong."]}], "ಕಃಪದಾರ್ಥ": [{"type": "noun", "defs": ["a worthless thing."]}], "ಕಕಂಟಕ": [{"type": "noun", "defs": ["the lizard Calotes veriscolar (family Chamaeleontidae) with an angular head, prehensile tail, eyes that move independently of each other, the ability to change skin color rapidly, and a long, agile tongue for catching prey; common chameleon; the garden lizard."]}], "ಕಕಬಿಕ": [{"type": "noun", "defs": ["= ಕಕವಕ."]}], "ಕಕಬಿಕಗೊಳು": [{"type": "verb", "defs": ["to become bewildered and speak or say without perfect control, often with rapid repetitions of syllables or initial sounds, as temporarily from such bewilderment."]}], "ಕಕಮಕ": [{"type": "noun", "defs": ["= ಕಕವಕ."]}], "ಕಕಮುಖ": [{"type": "noun", "defs": ["= ಕಕವಕ."]}], "ಕಕರ": [{"type": "noun", "defs": ["(masc.) a brutal, violent, lawless person; a ruffian or hoodlum."]}], "ಕಕಲಾತಿ": [{"type": "noun", "defs": ["tender, sympathetic, compassionate feeling toward another."]}], "ಕಕಲಾತೆ": [{"type": "noun", "defs": ["= ಕಕಲಾತಿ."]}], "ಕಕವ": [{"type": "noun", "defs": ["an unintelligent, slow-witted, foolish man."]}], "ಕಕವಕ": [{"type": "noun", "defs": ["the state of being utterly perplexed or confused.", "frequent stoppages in speaking caused by excessive grief, joy, bewilderment, etc."]}], "ಕಕಾರ": [{"type": "noun", "defs": ["the letter or the sound of, 'ಕ'."]}], "ಕಕುಂದರ": [{"type": "noun", "defs": ["the cavity of the loins."]}], "ಕಕುಂದಱಿ": [{"type": "noun", "defs": ["a weapon with sharp tooth-like projections."]}], "ಕಕುತ್ಸ್ಥ": [{"type": "noun", "defs": ["(myth.) a king of solar race by whose name Rāma is known as Kākutsthya, i.e. a person belonging to his lineage."]}], "ಕಕುತ್ಸ್ಥಜ": [{"type": "noun", "defs": ["(myth.) Rāma, so known as a descendent of Kakutsthya, a king of solar race."]}], "ಕಕುದ": [{"type": "noun", "defs": ["the highest point, part or elevation of a mountain; the peak; the summit.", "the slope of a mountain.", "a rounded, protruding lump, as the fleshy mass on the back of a bull; the hump.", "a hard, hollow, bony, permanent projection that grows on the head of various hoofed animals, as of an ox; a horn.", "the face of a bull.", "a bull.", "an eminent man in his field of activity, knowledge, etc.", "a royal sign; a symbol of royalty.", "a long, sharp edged, pointed weapon to cut or pierce; a sword.", "the sky, the apparent canopy on our head.", "a species of snake."]}], "ಕಕುದಿ": [{"type": "noun", "defs": ["that which has a hump; a bull."]}], "ಕಕುದ್ಗಿರಿ": [{"type": "noun", "defs": ["the Śivagaŋgā hill, in Bengalūru (Bangalore) district of Karnāṭaka, that resembles a bull from one angle."]}], "ಕಕುದ್ಮ": [{"type": "noun", "defs": ["a humped bull.", "a buffalo with a hump.", "a mountain."]}], "ಕಕುದ್ಮತಿ": [{"type": "noun", "defs": ["the hip and the loins."]}], "ಕಕುದ್ಮಿ": [{"type": "noun", "defs": ["a mountain.", "a bull with a hump.", "Viṣṇu."]}], "ಕಕುಭ": [{"type": "noun", "defs": ["a direction, quarter of the compass.", "the sky, the apparent blue canopy on our heads.", "the tree Terminalia Arjuna (= T. glabra) of Combretaceae family.", "the pointed tip of a mountain; the peak or summit.", "the crooked end or the gourd-like wooden piece of a vīṇe, the Indian lute.", "name of a musical mode, now obs."]}], "ಕಕುಭದಂತಿ": [{"type": "noun", "defs": ["any of the eight mythological elephants that are supposed to bear the universe on their back."]}], "ಕಕುಭವಸನ": [{"type": "noun", "defs": ["a naked man.", "Śiva, as a naked person."]}], "ಕಕುಲತೆ": [{"type": "noun", "defs": ["a state of being uneasy, apprehensive or worried about what may happen; anxiety; worry.", "fond or tender feeling; warm liking; affectionate regard or attachment.", "sorrow felt for another's suffering or misfortune; pity; compassion; sympathy.", "the quality of a miser; miserliness; stinginess.", "a wish; a desire.", "a condition of uncertainty; a doubt.", "the quality of acting or moving with great force, violence; vehemence; impetuosity."]}], "ಕಕುಲಾತಿ": [{"type": "noun", "defs": ["= ಕಕುಲತೆ."]}], "ಕಕುಲಾತೆ": [{"type": "noun", "defs": ["= ಕಕುಲತೆ."]}], "ಕಕುಳತೆ": [{"type": "noun", "defs": ["= ಕಕುಲತೆ."]}], "ಕಕೂಟ": [{"type": "noun", "defs": ["the bird Turdus ginginianus."]}], "ಕಕೋಂಟಕಿ": [{"type": "noun", "defs": ["the vine, Momordica dioica of Cucurbitaceae family.", "its gourd; small bitter gourd."]}], "ಕಕೋಕಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["the science of erotics."]}], "ಕಕೋರ್ಲ": [{"type": "noun", "defs": ["the plant Plectronia didyma of Rubiaceae family."]}], "ಕಕ್ಕ": [{"type": "noun", "defs": ["the quality, state or fact of being crooked; crookedness."]}, {"type": "noun", "defs": ["one's father's younger brother."]}, {"type": "noun", "defs": ["(children's term) waste matter excreted from the bowels; faeces; excrement.", "(children's term) anything that is abominable hence, must not be touched.", "the particles of solid matter that settle at the bottom in an oil (esp. when heated and cooled).", "(dial.) the sediment, residue which settles at the bottom of any liquid."]}], "ಕಕ್ಕಂಬು": [{"type": "noun", "defs": ["an arrow having several thorn-like metal projections at the end."]}], "ಕಕ್ಕಟ": [{"type": "noun", "defs": ["= ಕಕ್ಕಡ1."]}, {"type": "adjective", "defs": ["in high degree; excessive; (taste, smell etc.) strong."]}], "ಕಕ್ಕಟೆ": [{"type": "noun", "defs": ["= ಕಕ್ಕಡ1."]}], "ಕಕ್ಕಡ": [{"type": "noun", "defs": ["a kind of weapon having metal projections."]}, {"type": "noun", "defs": ["a piece of cloth wrapped around a staff at one end and dipped in oil, lighted and used as a torch.", "a thick wick."]}, {"type": "noun", "defs": ["the surrounding place; proximity."]}, {"type": "adjective", "defs": ["that which is relatively large, big."]}], "ಕಕ್ಕಡವಂದಿ": [{"type": "noun", "defs": ["a large and strong pig."]}], "ಕಕ್ಕಡವೆಳಗು": [{"type": "noun", "defs": ["the light of a torch."]}], "ಕಕ್ಕಡಾರತಿ": [{"type": "noun", "defs": ["a waving of a lighted torch or torches before a deity."]}], "ಕಕ್ಕಡಿ": [{"type": "noun", "defs": ["the vine Cucumis sativus of Cucurbitaceae family.", "its edible gourd; cucumber."]}], "ಕಕ್ಕಡೆ": [{"type": "noun", "defs": ["= ಕಕ್ಕಡ1."]}], "ಕಕ್ಕಡೆವಲೆ": [{"type": "noun", "defs": ["a kind of net used by hunters of wild animals."]}], "ಕಕ್ಕಣೆ": [{"type": "noun", "defs": ["= ಕಕ್ಕಡ1."]}], "ಕಕ್ಕನೆ": [{"type": "adverb", "defs": ["suddenly; unexpectedly; all of a sudden."]}], "ಕಕ್ಕಬಿಕ್ಕರಿ": [{"type": "noun", "defs": ["= ಕಕ್ಕರಿಬಿಕ್ಕರಿ."]}], "ಕಕ್ಕರ": [{"type": "noun", "defs": ["a dim, not brilliant colour.", "a kind of liquor.", "the taste of or like that of, sugar; sweetness."]}, {"type": "noun", "defs": ["= ಕಕ್ಕಡ1."]}, {"type": "noun", "defs": ["a small crane (Anthropoides virgo) of Africa and Asia, demoiselle."]}], "ಕಕ್ಕರಗೆಯ್ತ": [{"type": "noun", "defs": ["the frenzy behaviour of a person who is intoxicated with the liquor ಕಕ್ಕರ."]}], "ಕಕ್ಕರನೆ": [{"type": "adverb", "defs": ["(frying, cooking, etc.) as to become parched from excess heating."]}], "ಕಕ್ಕರವಕ್ಕಿ": [{"type": "noun", "defs": ["= ಕಕ್ಕರ3."]}], "ಕಕ್ಕರಸಂಜೆ": [{"type": "noun", "defs": ["a dark evening (i.e. a dark night)."]}], "ಕಕ್ಕರಿ": [{"type": "noun", "defs": ["the quality or state of being deficient; absence of something essential; incompleteness; deficiency.", "the quality or condition of being crooked; crookedness."]}], "ಕಕ್ಕರಿಕೆ": [{"type": "noun", "defs": ["the vine Citrullus vulgaris of Cucurbitaceae family.", "its edible fruit; water melon.", "the plant Melastoma malabathricum of Melastomataceae family; Indian rhododendron."]}], "ಕಕ್ಕರಿಬಿಕ್ಕರಿ": [{"type": "noun", "defs": ["the quality, state or fact of being crooked; crookedness.", "the quality of being not straightforward; dishonesty."]}], "ಕಕ್ಕರುಮಕ್ಕರು": [{"type": "noun", "defs": ["the state or condition of being utterly confused; bewilderment."]}], "ಕಕ್ಕಲಾತಿ": [{"type": "noun", "defs": ["= ಕಕುಲತೆ."]}], "ಕಕ್ಕವಡ": [{"type": "noun", "defs": ["a kind of grip or hold in wrestling in which the waist of the opponent is locked between one's thighs and twisting one of his legs."]}], "ಕಕ್ಕವಿಕ್ಕಿ": [{"type": "noun", "defs": ["= ಕಕ್ಕಾಬಿಕ್ಕಿ."]}], "ಕಕ್ಕಶ": [{"type": "noun", "defs": ["= ಕಕ್ಕಸ."]}], "ಕಕ್ಕಸ": [{"type": "noun", "defs": ["difficulty - a) the condition or fact of being difficult; b) something that is difficult, as a hard problem, an obstacle or objection; trouble.", "the quality or condition of being severe, strict, harsh, trying etc.; severity.", "the quality of being unduly proud in oneself and being disdainful, contemptuous or scornful toward others; haughtiness.", "the quality of acting or moving with great force, violence; vehemence; impetuosity."]}], "ಕಕ್ಕಸಂಬಡು": [{"type": "verb", "defs": ["to make great efforts or attempts; to make one's way with difficulty; to strive; to labour; to struggle."]}], "ಕಕ್ಕಸಂಬೆಱು": [{"type": "verb", "defs": ["= ಕಕ್ಕಸಂಬಡು; 2) to suffer anguish; to undergo suffering.", "to behave overbearingly or arrogantly.", "to become hard or harsh."]}], "ಕಕ್ಕಸಗಾರ": [{"type": "noun", "defs": ["a man who is unpleasantly crude, rough or excessively cruel."]}], "ಕಕ್ಕಸಗಾರ್ತಿ": [{"type": "noun", "defs": ["a woman who is unpleasantly crude, rough or excessively cruel."]}], "ಕಕ್ಕಸಗೊಳ್": [{"type": "verb", "defs": ["to make one's way with difficulty; to strive; to struggle."]}], "ಕಕ್ಕಸಜವ್ವನ": [{"type": "noun", "defs": ["the state or quality of young, charaterised by vigour and rough behaviour."]}], "ಕಕ್ಕಸಜವ್ವನೆ": [{"type": "noun", "defs": ["a girl, who being in her blooming youth, lacks niceties."]}], "ಕಕ್ಕಸತೆ": [{"type": "noun", "defs": ["the quality of being harsh, rough, rude; harshness; rudeness.", "haughtiness; arrogance.", "vehemence; impetuosity."]}], "ಕಕ್ಕಸಬಡು": [{"type": "verb", "defs": ["= ಕಕ್ಕಸಂಬಡು."]}], "ಕಕ್ಕಸಮೂದಲೆ": [{"type": "noun", "defs": ["a very pungent, heart-pricking remark."]}], "ಕಕ್ಕಸವೆಱು": [{"type": "verb", "defs": ["= ಕಕ್ಕಸಂಬಡು."]}], "ಕಕ್ಕಸು": [{"type": "noun", "defs": ["a room or compartment containing a large receptacle for urinating or defecating into, usu. flushed and cleansed by water and connected to a sewage system; a lavatory.", "waste matter discharged from the bowels; faeces; excrement."]}], "ಕಕ್ಕಸ್ಸು": [{"type": "noun", "defs": ["= ಕಕ್ಕಸು."]}], "ಕಕ್ಕಾಬಿಕಿ": [{"type": "noun", "defs": ["= ಕಕ್ಕಾಬಿಕ್ಕಿ."]}], "ಕಕ್ಕಾಬಿಕ್ಕ": [{"type": "noun", "defs": ["an utterly perplexed or confused man."]}], "ಕಕ್ಕಾಬಿಕ್ಕಿ": [{"type": "noun", "defs": ["the state of being utterly perplexed or confused; bewilderment; perplexity; ಕಕ್ಕಾಬಿಕ್ಕಿಯಾಗು kakkābikkiyāgu to be in a perplexed state; to be puzzled; to be at a loss."]}], "ಕಕ್ಕಾಬಿಕ್ಕು": [{"type": "noun", "defs": ["= ಕಕ್ಕಾಬಿಕ್ಕಿ."]}], "ಕಕ್ಕಾವಾಡಿಕಾಯಿ": [{"type": "noun", "defs": ["the perennial vine Citrullus colocynthis of Cucurbitaceae family, whose small, dried fruits are used in making a strong cathartic; colocynth."]}], "ಕಕ್ಕಾವಾಡೆ": [{"type": "noun", "defs": ["= ಕಕ್ಕಾವಾಡಿಕಾಯಿ."]}], "ಕಕ್ಕಾವಿಕ್ಕಿ": [{"type": "noun", "defs": ["= ಕಕ್ಕಾಬಿಕ್ಕಿ."]}], "ಕಕ್ಕಿ": [{"type": "noun", "defs": ["one's father's younger brother's wife.", "one's mothers younger sister."]}, {"type": "noun", "defs": ["the tree Cassia fistula (= Carthartocarpus fistula) of Caesalpiniaceae family; Indian laburnum."]}], "ಕಕ್ಕಿಸು": [{"type": "verb", "defs": ["to make another person or animal eject the contents through the stomach by the mouth; to cause to vomit.", "(fig.) to force one to pay or pay back."]}], "ಕಕ್ಕು": [{"type": "verb", "defs": ["to empty the contents of the stomach through the mouth; to vomit.", "(fig.) to pay unwillingly or unnecessarily; to pay back (usu. under coercion or compulsion by law) money one has swindled.", "(fig.) to communicate freely to another without any inhibitions."]}, {"type": "noun", "defs": ["the act or process of ejecting the contents of the stomach through the mouth; a vomiting; vomit."]}, {"type": "noun", "defs": ["one of the series of tooth-like parts, as on a saw, fork, rake, gearwheel, etc. as a tine, prong, cog, etc.", "a thin, sharp piece of wood; a splint; a splinter; a sliver.", "that whose surface is rough.", "the quality or fact of having a very thin edge or fine point that could cut, severe an object with little or no effort; sharpness."]}, {"type": "noun", "defs": ["(dial.) (children's term) an eatable as beaten rice, puffed rice, green gram etc."]}], "ಕಕ್ಕುಂದಱಿ": [{"type": "noun", "defs": ["a weapon with sharp tooth-like projections."]}], "ಕಕ್ಕುಂಬಳ": [{"type": "noun", "defs": ["a plant of Cucurbitaceae family.", "its gourd; wild pumpkin."]}], "ಕಕ್ಕುಗಡಿ": [{"type": "noun", "defs": ["a particle got by grating or mincing; a very small piece."]}], "ಕಕ್ಕುಗತ್ತಿ": [{"type": "noun", "defs": ["a sword with tooth-like edge or mace-like weapon with hard metal projections."]}], "ಕಕ್ಕುಗುರು": [{"type": "noun", "defs": ["a sharp nail (of a finger or toe) or a sharp claw."]}], "ಕಕ್ಕುಚಂಡೆಲೆ": [{"type": "noun", "defs": ["the plant Phyllanthus lawii of Euphorbiaceae family."]}], "ಕಕ್ಕುದಱಿ": [{"type": "noun", "defs": ["= ಕಕ್ಕುಂದಱಿ."]}], "ಕಕ್ಕುಬಿಕ್ಕು": [{"type": "noun", "defs": ["= ಕಕ್ಕಾಬಿಕ್ಕಿ."]}], "ಕಕ್ಕುರಿ": [{"type": "noun", "defs": ["the quality or condition of being cruel; mercilessness; cruelty; brutality."]}], "ಕಕ್ಕುರಿಮಿಗು": [{"type": "verb", "defs": ["to be very cruel; to show no mercy."]}], "ಕಕ್ಕುರ್ತೆ": [{"type": "noun", "defs": ["= ಕಕ್ಕುಲತೆ."]}], "ಕಕ್ಕುಲತೆ": [{"type": "noun", "defs": ["a state of being uneasy, apprehensive or worried about what may happen; anxiety; worry.", "fond or tender feeling; warm liking; affectionate regard or attachment.", "sorrow felt for another's suffering or misfortune; pity; compassion; sympathy.", "the quality of a miser; miserliness; stinginess.", "a wish; a desire.", "a condition of uncertainty; a doubt.", "the quality of acting or moving with great force, violence; vehemence; impetuosity."]}], "ಕಕ್ಕುಲತೆಪಡು": [{"type": "verb", "defs": ["= ಕಕ್ಕುಲತೆಬಡು."]}], "ಕಕ್ಕುಲತೆಬಡು": [{"type": "verb", "defs": ["to ask or beg (a person) to do something; to entreat; to beseech; to implore humbly.", "to feel concern for; to think about others welfare."]}], "ಕಕ್ಕುಲಾತಿ": [{"type": "noun", "defs": ["= ಕಕ್ಕುಲತೆ."]}], "ಕಕ್ಕುಲಾತೆ": [{"type": "noun", "defs": ["= ಕಕ್ಕುಲತೆ."]}]}