{"ಕರುನಾಣ": [{"type": "noun", "defs": ["the tree Maba buxifolia of Ebenaceae family."]}], "ಕರುಬಿ": [{"type": "noun", "defs": ["a person who is intolerant of otheṛs wealth, well-being, status, happiness, etc."]}], "ಕರುಬು": [{"type": "verb", "defs": ["to have ill-will or intolerance at the superiority, success or good fortune of others; to envy."]}, {"type": "noun", "defs": ["a feeling of resentful or discontented longing aroused by or intolerance for another person's better fortune, situation, etc.", "a person having such a feeling or intolerance."]}], "ಕರುಬುತನ": [{"type": "noun", "defs": ["the quality of an envious person."]}], "ಕರುಮ": [{"type": "noun", "defs": ["action; work; deed.", "execution; performance.", "obligtory duty.", "the results of one's past action, deeds, etc.; the effect."]}], "ಕರುಮಗತಿ": [{"type": "noun", "defs": ["the supposed unchangeable course of life determined by one's past deeds."]}], "ಕರುಮಾಡ": [{"type": "noun", "defs": ["a many-storied building.", "any of the stories above the ground floor of a building."]}], "ಕರುಮ್ಮ": [{"type": "noun", "defs": ["= ಕರುಮ."]}], "ಕರುವ": [{"type": "noun", "defs": ["a point or place considerably above most others; eminence; elevation."]}], "ಕರುವಗೞ್ದೆ": [{"type": "noun", "defs": ["a irrigated farmland (esp. paddy land) that is higher than adjacent area."]}], "ಕರುವಗೆಯ್": [{"type": "noun", "defs": ["a non-irrigated farmland that is higher than adjacent area."]}], "ಕರುವಗೆಯಿ": [{"type": "noun", "defs": ["= ಕರುವಗೆಯ್."]}], "ಕರವವನೆ": [{"type": "noun", "defs": ["a house at a higher place than the houses nearby."]}], "ಕರುವಾಡ": [{"type": "noun", "defs": ["= ಕರುಮಾಡ."]}], "ಕರುವಾಡಿ": [{"type": "noun", "defs": ["the plant Alseodaphane semicarpifolia of Lauraceae family."]}], "ಕರುವಾಡು": [{"type": "noun", "defs": ["= ಕರುಮಾಡ."]}], "ಕರುವಿಕ್ಕಿಸು": [{"type": "verb", "defs": ["to cause to shape in a mould."]}], "ಕರುವಿಕ್ಕು": [{"type": "verb", "defs": ["to shape in a mould; to mould."]}], "ಕರುವಿಡಿಸು": [{"type": "verb", "defs": ["= ಕರುವಿಕ್ಕಿಸು."]}], "ಕರುವಿಡು": [{"type": "verb", "defs": ["= ಕರುವಿಕ್ಕು."]}], "ಕರುವೀನ್": [{"type": "verb", "defs": ["(an animal) to give birth to a young."]}], "ಕರುವೆಸ": [{"type": "noun", "defs": ["the work or profession of shaping objects in moulds."]}], "ಕರುವೆಱು": [{"type": "verb", "defs": ["to be moulded in a matrix."]}], "ಕರುಷ": [{"type": "noun", "defs": ["an old unit of weight used to express the weght of gold or silver in."]}], "ಕರುಷಕ": [{"type": "noun", "defs": ["one who ploughs the land; a farmer; a husbandman."]}], "ಕರುಷಿತ": [{"type": "adjective", "defs": ["drawn (toward); pulled; attracted."]}], "ಕರುಸೆ": [{"type": "noun", "defs": ["the red fluid, containing various suspended cells, circulating in the arteries and veins of the higher animals; blood."]}], "ಕರುಹಟ್ಟಿ": [{"type": "noun", "defs": ["an enclosure, shed for calves (or in gen. for cattle)."]}], "ಕರುಹಾಕು": [{"type": "verb", "defs": ["(an animal) to give birth to a young.", "(dial.) to fail; to be unsuccessful; to be unable to complete."]}], "ಕರುಹಾಲೆ": [{"type": "noun", "defs": ["the plant Trema orientalis (= Celtis orientalis) of Ulmaceae faly; oriental nettle."]}], "ಕರುಳ್": [{"type": "noun", "defs": ["= ಕರುಳು."]}], "ಕರುಳಿರಿ": [{"type": "verb", "defs": ["to pain deeply; to cause pain to."]}], "ಕರುಳಿಱಿ": [{"type": "verb", "defs": ["= ಕರುಳಿರಿ."]}], "ಕರುಳು": [{"type": "noun", "defs": ["the lower part of the alimentary canal, extending from the stomach to the anus and consisting of the small intestine and the large intestine; the intestine.", "the love or natural affection that one has for one's child or children, brother or sister, parents etc.", "ಕರುಳಕುಡಿ karuḷa kuḍi one's offspring; ಕರುಳಬಳ್ಳಿ karuḷa baḷḷi close connection of persons by blood; ಕರುಳ ಸಂಬಂಧ karuḷa sambandha relation by blood; blood relation; ಕರುಳಿನ ಕುಡಿ karuḷina kuḍi = ಕರುಳಕುಡಿ; ಕರುಳಿನವರು k aruḷinavaru (pl.) persons related to one by birth; ಕರುಳು ಕರಗಿಸು k aruḷu k aragisu to make one feel pity; to be pitiable; ಕರುಳು ಕರಗು karuḷu karagu (one's attitude, disposition) to become softened; to become gentle and tender; to melt; ಕರುಳು ಕೊರೆ karuḷu kore to pain emotionally and deeply; ಕರುಳು ಮಿಡಿ karuḷu miḍi to feel pained very much; ಕರುಳು ಹರಿದುಕೊಳ್ಳು karuḷu haridukoḷḷu to cut off one's (of a relative) relation."]}], "ಕರುಳುಗಡಿಕ": [{"type": "noun", "defs": ["(fig.) one who kills his own kinsmen."]}], "ಕರುಳುಹರಕ": [{"type": "noun", "defs": ["(fig.) one who exploits his own relative."]}], "ಕರುಳುಹುರಿ": [{"type": "noun", "defs": ["a tough string or thread usu. made from the dried intestines of sheep, horses, etc. and used for surgical sutures, for stringing tennis rackets, etc.; catgut."]}], "ಕರುಳ್ತೊಡಕು": [{"type": "noun", "defs": ["the twisting of the intestine (which rarely happens in babies in mother's womb)."]}], "ಕರುಳ್ವಿಣಿಲ್": [{"type": "noun", "defs": ["the intertwined intestines."]}], "ಕರೆ": [{"type": "verb", "defs": ["to call; to invite; to ask or request to come.", "to make a sound (as a bird).", "ಕರೆಕಳಿಸು kare kaḷisu to send an invitation to; to ask to come (through another); ಕರೆಕಳುಹು kare kaḷuhu = ಕರೆಕಳಿಸು; ಕರೆತರಿಸು kare tarisu to cause to come (through another); ಕರೆತರು kare taru to bring (a person, animal, etc.) along with oneself; to bring along; ಕರೆದುಕೊ kareduko = ಕರೆದುಕೊಳ್; ಕರೆದುಕೊಳ್ karedukoḷ to receive, welcome or accept (a guest); ಕರೆಯದವರ ಮನೆಗೆ ಕಳಸಗಿತ್ತಿಯಾಗಿ ಹೋಗು kareyadavara manege kaḷasagittiyāgi hōgu an unbidden guest must bring his own steel with him."]}, {"type": "verb", "defs": ["to draw milk (from a cow etc.).", "to pour down in shower.", "ಕರೆಯುವುದು ನೂರೆಮ್ಮೆ, ಕಡಿಯುವುದು ನೀರುಮಜ್ಜಿಗೆ kareyuvudu nūremme, kaḍiyuvudu nīrumajjige in a bid to accumalate money, starve amidst plenty; ಕರೆಯುವ ಹಸು ಕೊಟ್ಟು, ಒದೆಯುವ ಕತ್ತೆ ತರು kareyuva hasu koṭṭu odeyuva katte taru to sell one's advantage for bringing in a misfortune; ಕರೆದು ಉಣ್ಣುವ ಮೊಲೆಯ ಕುಯ್ಯಬಾರದು karedu uṇṇuva moleya kuyyabāradu (saying) do not be ungrateful to one from whom timely help was received."]}, {"type": "verb", "defs": ["to hide (oneself) to disappear."]}, {"type": "noun", "defs": ["land at or near the edge of a body of water, esp. along an ocean, large lake, etc.; a stretch of rising land at the edge of a body of a river; a bank; shore.", "the border on a garment or piece of cloth; hem; ಕರೆಗಣ್ಮಿಸು karegaṇmisu to cause to flow over the bank or boundaries; to cause to overflow; ಕರೆಗಣ್ಮು karegaṇmu to flow over the bank; to overflow."]}, {"type": "noun", "defs": ["an act or instance of calling; a call.", "the distinctive cry of an animal or bird.", "a summons to a meeting.", "an act or instance of telephoning; the duration of a telephone call.", "an invitation to accept a position.", "a calling into action."]}, {"type": "noun", "defs": ["the pungent condiment, black pepper (Piper nigrum).", "the stem of this plant."]}, {"type": "noun", "defs": ["a piece of meat (flesh of animals, used as food)."]}, {"type": "noun", "defs": ["the colour of charcoal; black colour.", "a color, discoloration, streak or spot resulting from or as from staining with dirt, etc.; a stain.", "a moral blemish; dishonor; guilt; taint.", "the liquid that comes out of a green mango fruit, green plantain, etc. which leaves hard stains on cloth."]}, {"type": "noun", "defs": ["that which is true; statement, etc. that accords with fact or reality; the truth."]}], "ಕರೆಕಟ್ಟು": [{"type": "verb", "defs": ["to fold back the edge of and sew down; to put a hem or hems on; to interwove the end-threads of a blanket, sheet, etc."]}], "ಕರೆಕರೆ": [{"type": "noun", "defs": ["the sound made by gnawing while biting with the teeth.", "the act of tormenting, as by inflicting constant pain or causing persistent fear, etc.; harassment."]}], "ಕರೆಕರೆಗ": [{"type": "noun", "defs": ["a man who torments, annoys or harasses."]}], "ಕರೆಕರೆಗೊಳ್": [{"type": "verb", "defs": ["to give way to anxiety or unease; to allow one's mind to dwell on difficulty or troubles; to worry.", "to get excited or stirred by zeal."]}], "ಕರೆಕಾಡು": [{"type": "noun", "defs": ["a stretch of a forest along a stretch of cultivated land."]}], "ಕರೆಗಂಟೆ": [{"type": "noun", "defs": ["an electric bell kept inside the house, operated at the entrance, used to call the persons from inside.", "a bell used to call a servant or assistant."]}], "ಕರೆಗಣ": [{"type": "noun", "defs": ["a threshing floor made by sprinkling water on, and ramming, the earth."]}], "ಕರೆಗಲ್ಲು": [{"type": "noun", "defs": ["a stone at the boundary or main entrnce of a village."]}], "ಕರೆಗಾರ": [{"type": "noun", "defs": ["a man who hems the border of a garment, dhōti or sari."]}], "ಕರೆಗೊಯ್": [{"type": "verb", "defs": ["to cut slightly the hem of a new garment, sari or dhōti, before wearing (as part of custom)."]}], "ಕರೆಚೆಂಡು": [{"type": "noun", "defs": ["a plant Aeschynomene aspera of Papilionaceae family; Indian Cork plant."]}], "ಕರೆತ": [{"type": "noun", "defs": ["the act or an instance of calling, inviting."]}, {"type": "noun", "defs": ["the act or an instance of drawing milk from a cow, buffalo etc."]}], "ಕರೆದುಡ್ಡು": [{"type": "noun", "defs": ["an old monetary coin."]}], "ಕರೆನಾಡು": [{"type": "noun", "defs": ["the region along the sea coast.", "a state or country that has a sea coast, usu. as its boarder on one side, at least."]}], "ಕರೆಪ": [{"type": "noun", "defs": ["= ಕರೆತ1."]}], "ಕರೆಬಂಟ": [{"type": "noun", "defs": ["the plant Anisomeles indica of Lamiaceae family.", "a small plant Ruellia prostrata with light blue flowers.", "a climber Cryptolepis buchanani, of Asclepiadaceae family; cork screw swallow wort."]}], "ಕರೆಬಯಲು": [{"type": "noun", "defs": ["a small island in a river or lake, that gets submerged in flood, near the mainland or a larger island; a holm."]}], "ಕರೆಬರೆ": [{"type": "noun", "defs": ["the border region or district (of a field, forest, lake etc.)."]}], "ಕರೆಮರ": [{"type": "noun", "defs": ["= ಕರೆಬರೆ."]}], "ಕರೆಮರೆ": [{"type": "noun", "defs": ["(pl.) deficiencies and lacunae.", "hypocrisy; pretension."]}, {"type": "noun", "defs": ["= ಕರೆಬರೆ."]}], "ಕರೆಮುರೆ": [{"type": "noun", "defs": ["= ಕರೆಬರೆ."]}], "ಕರೆಯ": [{"type": "noun", "defs": ["= ಕರೆತ1."]}], "ಕರೆಯಟ್ಟು": [{"type": "verb", "defs": ["to send an invitation; to send someone to bring another."]}], "ಕರೆಯಿಸು": [{"type": "verb", "defs": ["to cause to come; to invite to come."]}], "ಕರೆಯೋಲೆ": [{"type": "noun", "defs": ["a letter written inviting to come for some occasion."]}], "ಕರೆವಟ್ಟಣ": [{"type": "noun", "defs": ["a town near the border of a state or on the sea coast."]}], "ಕರೆವಿಡಿ": [{"type": "verb", "defs": ["to go or move alongside or towards the sea."]}], "ಕರೆವು": [{"type": "noun", "defs": ["= ಕರೆತ1."]}], "ಕರೆಶೂಲಿ": [{"type": "noun", "defs": ["the plant Phyllanthus polyphyllus of Euphorbiaceae family."]}], "ಕರೆಸು": [{"type": "verb", "defs": ["= ಕರೆಯಿಸು."]}], "ಕರೆಹ": [{"type": "noun", "defs": ["= ಕರೆತ1."]}], "ಕರೆಹಟ್ಟಿ": [{"type": "noun", "defs": ["a shed where milk is drawn from a cow or buffalo."]}], "ಕರೆಹಟ್ಟಿಗ": [{"type": "noun", "defs": ["a servant whose duty is to draw milk from cows or buffalos; a milker.", "a supervisor who superintends the milking operation."]}], "ಕರೇಟು": [{"type": "noun", "defs": ["any of a family (Gruidae) of usu. large gruiform wading white birds with very long legs and neck, and a long, straight bill; a crane."]}], "ಕರೇಣು": [{"type": "noun", "defs": ["a female elephant.", "a man who shows unworthy fear in the face of danger, pain or difficulty; a coward.", "powdery earth or other matter in bits fine enough to be easily suspended in air; dust.", "the tree Pterospermum acerifolium (= P. Aceroides) of Sterculiaceae family.", "its flower."]}], "ಕರೇತರ": [{"type": "noun", "defs": ["a physical struggle; a battle; a fight."]}], "ಕರೇವ್ಯಾಡಿ": [{"type": "noun", "defs": ["the tree Dalbergia latifolia (= D. emarginata) of Papilionaceae family; Indian rose wood."]}], "ಕರೋಟ": [{"type": "noun", "defs": ["the bony case of the brain of a vertebrate; the skull."]}], "ಕರೋಟಿ": [{"type": "noun", "defs": ["a building in which elephants are sheltered and fed."]}, {"type": "noun", "defs": ["= ಕರೋಟ."]}], "ಕರೋಟಿಮಾಲಿ": [{"type": "noun", "defs": ["Śiva, who wears a garland of skulls."]}], "ಕರೋಟಿಮಾಲೆ": [{"type": "noun", "defs": ["a garland of skulls (worn by Śiva, Kāḷi, etc.)."]}], "ಕರೋಡ": [{"type": "adjective", "defs": ["amounting to ten million in number."]}, {"type": "noun", "defs": ["a cardinal number, ten million; 1,00,00,000."]}], "ಕರೋಡಗಿರಿ": [{"type": "noun", "defs": ["a charge payable for permission to pass a barrier, to enter into a town etc. toll.", "a department of the government that collects toll."]}], "ಕರೋಬಾ": [{"type": "noun", "defs": ["a leguminous tree (Ceratonia siliqua) of the E Mediterranean, bearing long, flat, leathery, brown pods with a sweet pulp."]}], "ಕರೋಬಾಮಣಿ": [{"type": "noun", "defs": ["the seed of the tree Ceratonia siliqua."]}], "ಕರೋರ": [{"type": "adjective", "defs": ["= ಕರೋಡ1."]}, {"type": "noun", "defs": ["= ಕರೋಡ2."]}], "ಕರೋಲ": [{"type": "noun", "defs": ["a small hand-held firearm; a pistol."]}], "ಕರೋಲು": [{"type": "noun", "defs": ["= ಕರೋಲ."]}], "ಕರ್ಕ": [{"type": "noun", "defs": ["matter that settles to the bottom of a liquid; sediment; dregs."]}, {"type": "adjective", "defs": ["having the colour of pure snow or milk; white.", "morally or spiritually pure; spotless; innocent."]}, {"type": "noun", "defs": ["any of numerous ten-footed crustaceans having the first pair of legs modified as pincers; crab.", "a white horse.", "the state or process of combustion, in which substances using the oxygen available in the air, giving out bright light and heat; the substance so burning; fire.", "a water jar.", "an image-giving metal piece with a smooth surface or glass coated on the otherside as not to allow the light to pass through; a mirror.", "the fourth sign of the zodiac, entered by the sun about June 21; the Cancer.", "a malignant new growth anywhere in the body of a person or animal; malignant tumor: cancer."]}], "ಕರ್ಕಂಡ": [{"type": "noun", "defs": ["a large lobed glandular organ in the abdomen of vertebrates, functioning in many metabolic processes including the regulation of toxic materials in the blood, secreting bile, etc.; the liver."]}], "ಕರ್ಕಂಧು": [{"type": "noun", "defs": ["the tree Ziziphus mauritiana (= Z. jujuba) of Rhamnaceae family.", "its plum; Indian plum."]}], "ಕರ್ಕಂಬು": [{"type": "noun", "defs": ["a sharp arrow."]}], "ಕರ್ಕಟ": [{"type": "noun", "defs": ["= ಕರ್ಕ3 - 1 & 6.", "(myth.) name of a hell.", "(dance) a hand-gesture in which the stretched fingers of one hand passing through the fingers of the other hand, the palms being facing upward or inward.", "the root of a lotus plant.", "a hard or harsh substance.", "the vine Cucumis sativus of Cucurbitaceae family and its fruit; cucumber.", "any of a family (Gruidae) of usu. large gruiform wading white birds with very long legs and neck, and a long, straight bill; a crane.", "a very short, hard, leafless branch or stem with a sharp point; a thorn.", "a particular posture in coitus.", "any straight linedrawn from the centre of a circle to any point on its circumference; radius."]}], "ಕರ್ಕಟಕ": [{"type": "noun", "defs": ["= ಕರ್ಕ3 - 1 & 6; 3) a variety in sugar cane.", "a curved metal piece; a hook."]}], "ಕರ್ಕಟಕಶೃಂಗಿ": [{"type": "noun", "defs": ["= ಕರ್ಕಟಶೃಂಗಿ."]}], "ಕರ್ಕಟಶೃಂಗಿ": [{"type": "noun", "defs": ["the tree Pistacia khinjauk (= P. integerrima) of Anacardiaceae family.", "the tree Rhus succedanea of Anacardiaceae family."]}], "ಕರ್ಕಟಿ": [{"type": "noun", "defs": ["= ಕರ್ಕಟಕ - 4.", "the vine Cucumis sativus of Cucurbitaceae family.", "its fruit; cucumber.", "a female crab,", "ಕರ್ಕಟಿಯ ರಜ್ಜು karkaṭiya rajju a rope with a hook tied to its one end."]}], "ಕರ್ಕಟಿಕೆ": [{"type": "noun", "defs": ["the trailing vine, Cucumis melo (=C. aromaticus, = C. utilissinus) of Cucurbitaceae family.", "its fruit which has a thick ribbed rind, sweet, juicy flesh and a musky oduor; musk melon."]}], "ಕರ್ಕಡ": [{"type": "adjective", "defs": ["that is strong and rough."]}], "ಕರ್ಕಡವಂದಿ": [{"type": "noun", "defs": ["a large-sized, strong, ferocious pig."]}], "ಕರ್ಕಡೆ": [{"type": "noun", "defs": ["a weapon (sword ?) with sharp teeth."]}], "ಕರ್ಕರ": [{"type": "adjective", "defs": ["shaggy or bristly; harsh; very rough."]}, {"type": "noun", "defs": ["a particuar fault in gems.", "a tool with a heavy metal head and a long handle, used for pounding or banging.", "a small piece of glass or metal with a smooth surface that can give the image of an object; a mirror.", "any of the separate parts of the skeleton of a vertebrate animal; a bone.", "the leather lash of a whip."]}, {"type": "noun", "defs": ["= ಕರ್ಕಟ - 8."]}], "ಕರ್ಕರಿ": [{"type": "noun", "defs": ["a jar with a seive-like bottom (for filtering liquids).", "a water jar.", "a kind of stringed musical instrument."]}], "ಕರ್ಕರೇಟು": [{"type": "noun", "defs": ["any of a family (Gruidae) of usu. large gruiform wading white birds with very long legs and neck, and a long, straight bill; a crane."]}], "ಕರ್ಕರೋಗ": [{"type": "noun", "defs": ["a disease caused by any malignant growth or tumour from an abnormal and uncontrolled division of body cells; cancer."]}], "ಕರ್ಕಲ": [{"type": "noun", "defs": ["the plant Grewia flavescens (= G. G. pilosa) of Tiliaceae family."]}], "ಕರ್ಕಲು": [{"type": "noun", "defs": ["any sweet or spicy eatable fried in oil."]}], "ಕರ್ಕವೃತ್ತ": [{"type": "noun", "defs": ["= ಕರ್ಕಾಟಕ ಸಂಕ್ರಾಂತಿವೃತ್ತ."]}], "ಕರ್ಕಶ": [{"type": "adjective", "defs": ["unpleasantly rough or sharp, esp. to the senses as grating to the ear, to hard to touch."]}, {"type": "noun", "defs": ["Yama, the God of Death and the dispenser of divine justice.", "the tree Cassia (or Senna) esculanta."]}], "ಕರ್ಕಶಕಾರಿ": [{"type": "noun", "defs": ["a man who is rough, crude or forbiddig in apperance or behaviour."]}], "ಕರ್ಕಶಗೊಳ್": [{"type": "verb", "defs": ["to become harsh or rough; to be sharp to the ear."]}], "ಕರ್ಕಶತೆ": [{"type": "noun", "defs": ["the quality of being harsh, rough, rude.", "(fig.) a difficult or miserable situation."]}], "ಕರ್ಕಶಯಿಸು": [{"type": "verb", "defs": ["= ಕರ್ಕಶಗೊಳ್."]}], "ಕರ್ಕಶಯೌವನ": [{"type": "noun", "defs": ["youth that has brought roughness, crudeness or rebelious attitude."]}], "ಕರ್ಕಶಲೋಮ": [{"type": "noun", "defs": ["a man with bristle-like hairs."]}], "ಕರ್ಕಶವಡೆ": [{"type": "verb", "defs": ["= ಕರ್ಕಶಗೊಳ್."]}], "ಕರ್ಕಶವೃತ್ತಿ": [{"type": "noun", "defs": ["the quality of being harsh or rough; roughness.", "uncultured, rude, unrefined behaviour."]}], "ಕರ್ಕಶಾಂಗ": [{"type": "noun", "defs": ["a (human or animal) body that is very rough.", "a man with a rough body."]}], "ಕರ್ಕಸ": [{"type": "noun", "defs": ["difficulty - a) the condition or fact of being difficult; b) something that is difficult, as a hard problem or an obstacle or objection.", "the quality or condition of being severe, strict, harsh, trying etc.; severity.", "the quality of being unduly proud in oneself and being disdainful, contemptuous or scornful toward others; haughtiness.", "the quality of acting or moving with great force, violence; vehemence; impetuosity."]}], "ಕರ್ಕಸೈಲ": [{"type": "noun", "defs": ["a kind of salt, used for medicinal purpose."]}], "ಕರ್ಕಳ": [{"type": "noun", "defs": ["a white horse."]}], "ಕರ್ಕಾಟಕ": [{"type": "noun", "defs": ["any of numerous decapod crustaceans of the section Brachyura, which have the first pair of legs modified into pincers and can move in any direction, including sideways and backwards; a crab.", "the vine Momordica cochinchinensis (= Muricia cochinchinensis) of Cucurbitaceae family.", "the fourth sign of the zodiac, entered by the sun about June 21; the Cancer."]}], "ಕರ್ಕಾಟಕಶೃಂಗಿ": [{"type": "noun", "defs": ["= ಕರ್ಕಾಟಶೃಂಗಿ."]}], "ಕರ್ಕಾಟಕ ಸಂಕ್ರಾಂತಿವೃತ್ತ": [{"type": "noun", "defs": ["(astron.) the circle of the celestial sphere parallel to the celestial equator at c. 230 26' north; the Tropic of Cancer."]}], "ಕರ್ಕಾಟಶೃಂಗಿ": [{"type": "noun", "defs": ["the tree Pistacia khinjauk (= P. integerrima) of Anacardiaceae family.", "the tree Rhus succedanea of the same family."]}], "ಕರ್ಕಾರು": [{"type": "noun", "defs": ["the plant Belamcanda punctata of Iridaceae family."]}], "ಕರ್ಕಿ": [{"type": "noun", "defs": ["the tree Celtis tetrandra of Ulmaceae family; Nilagiri elm."]}, {"type": "noun", "defs": ["the fourth zodiacal sign, usu. associated with the period 22 June to 21 July; the Cancer."]}], "ಕರ್ಕಿಸೆಲ್ಲಿ": [{"type": "noun", "defs": ["the plant Grewia disperma of Tiliaceae family."]}], "ಕರ್ಕೇತನ": [{"type": "noun", "defs": ["a kind of gem or precious gem."]}], "ಕರ್ಕೊಂಚೆ": [{"type": "noun", "defs": ["a kind of cranes with very long legs and neck, a long, straight bill and black or blackish feathers."]}], "ಕರ್ಕೊಳ": [{"type": "noun", "defs": ["the plant Luvunga eleutherandra of Rutaceae family; trifoliate climbing lime and its berry.", "a perfume made from its berries."]}], "ಕರ್ಕೊಳಿ": [{"type": "noun", "defs": ["= ಕರ್ಕೊಳ."]}], "ಕರ್ಕೋಟ": [{"type": "noun", "defs": ["(myth.) one of the eight principal cobras.", "a malignant, spiteful, malicious person."]}], "ಕರ್ಕೋಟಕ": [{"type": "noun", "defs": ["= ಕರ್ಕೋಟ - 1."]}], "ಕರ್ಕೋಟಕಿ": [{"type": "noun", "defs": ["the creeper Momordica charantia of Cucurbitaceae family.", "its gourd; bitter gourd."]}], "ಕರ್ಕೋಲ": [{"type": "noun", "defs": ["= ಕರ್ಕೊಳ."]}], "ಕರ್ಕೋಲಕ": [{"type": "noun", "defs": ["= ಕರ್ಕೊಳ."]}], "ಕರ್ಗಂಟಿ": [{"type": "noun", "defs": ["a black cow."]}], "ಕರ್ಗಂಡ": [{"type": "noun", "defs": ["a large lobed glandular organ in the abdomen of vertebrates, functioning in many metabolic processes including the regulation of toxic materials in the blood, secreting bile, etc.; the liver."]}], "ಕರ್ಗಡ": [{"type": "noun", "defs": ["= ಕರ್ಗಂಡ."]}], "ಕರ್ಗತ್ತಲೆ": [{"type": "noun", "defs": ["the state of having no light at all; absolute darkness."]}], "ಕರ್ಗನೆ": [{"type": "adverb", "defs": ["darkly; blackly; gloomingly."]}], "ಕರ್ಗಲ್": [{"type": "noun", "defs": ["= ಕರ್ಗಲ್ಲು."]}], "ಕರ್ಗಲ್ಲು": [{"type": "noun", "defs": ["a very hard, black, and undressed stone."]}], "ಕರ್ಗಳ್ತಲೆ": [{"type": "noun", "defs": ["= ಕರ್ಗತ್ತಲೆ."]}], "ಕರ್ಗೞ್ತಲೆ": [{"type": "noun", "defs": ["= ಕರ್ಗತ್ತಲೆ."]}], "ಕರ್ಗು": [{"type": "verb", "defs": ["to become dark or black.", "to turn (a thing) into black; to cause to become black or dark."]}, {"type": "noun", "defs": ["black colour; blackness; darkness."]}], "ಕರ್ಗುಂಬಳ": [{"type": "noun", "defs": ["the vine Benincasa hispida (= B. cerifera) of Cucurbitaceae.", "its gourd."]}], "ಕರ್ಗುಡಿ": [{"type": "noun", "defs": ["the blackened tip of a wick."]}], "ಕರ್ಗುಡಿಗತ್ತಲೆ": [{"type": "noun", "defs": ["(dial.) the state of being pitch dark."]}], "ಕರ್ಗುಡಿವಡು": [{"type": "verb", "defs": ["(a wick) to become black at the tip."]}], "ಕರ್ಗೆಂಪು": [{"type": "noun", "defs": ["dark red colour (that is almost black)."]}], "ಕರ್ಗೆರೆ": [{"type": "noun", "defs": ["a black line or something looking like it (as a line of black hairs running down on the belly)."]}], "ಕರ್ಗೊರಳ": [{"type": "noun", "defs": ["Śiva, whose neck is black."]}], "ಕರ್ಗೊಲೆ": [{"type": "noun", "defs": ["the plant Ocimum gratissimum of Lamiaceae family; shrubby basil."]}], "ಕರ್ಗೊಳ್ಳಿ": [{"type": "noun", "defs": ["a charred piece of wood."]}], "ಕರ್ಗೋಟು": [{"type": "noun", "defs": ["(dial.) arecanut dried and sorted and made ready for marketing."]}], "ಕರ್ಗೋಡಗ": [{"type": "noun", "defs": ["a black monkey."]}], "ಕರ್ಚ": [{"type": "noun", "defs": ["a genus of fish."]}], "ಕರ್ಚಿ": [{"type": "noun", "defs": ["(dial.) a woman of black complexion."]}, {"type": "noun", "defs": ["the quality that is not best; ordinary quality.", "ಕರ್ಚಿಯಡಕೆ k arciyaḍake areca nut of ordinary quality; ಕರ್ಚಿಯೆಲೆ karciyele betel leaf of ordinary quality; 2. a card of least importance in the game of cards."]}, {"type": "noun", "defs": ["the plant Adhatoda vasica (= Justicia adhatoda) of Acanthaceae family."]}], "ಕರ್ಚಿಕಾಯಿ": [{"type": "noun", "defs": ["= ಕರ್ಜಿಕಾಯಿ."]}], "ಕರ್ಚಿಸು": [{"type": "verb", "defs": ["to cause to bite with the teeth.", "to light a lamp, candle, etc."]}, {"type": "verb", "defs": ["to cause to wash, clean."]}], "ಕರ್ಚು": [{"type": "verb", "defs": ["to seize, pierce or cut with the teeth or with the jaws.", "to touch or press with the lips, esp. as a sign of love, affection, greeting or reverence; to kiss."]}, {"type": "verb", "defs": ["to clean by means of water or other liquid, as by dipping, tumbling or scrubbing etc.; to wash."]}, {"type": "noun", "defs": ["the act of cleaning by means of water or other liquid.", "water with whch one's feet are washed.", "water with which rice to be cooked is washed."]}, {"type": "noun", "defs": ["the amount of money spent; expense; expenditure.", "ಕರ್ಚಾಗು karcāgu (money) to be spent; 2. (a consumable) to be used up, consumed; ಕರ್ಚಿಗೆ ಕೊಡು karicige koḍu to pay for (another's) expenses; 2. (fig.) to beat; to thrash."]}], "ಕರ್ಚುಂಗಲ್": [{"type": "noun", "defs": ["a piece of iron, steel, alloy ore, etc., usu. in the form of a bar or horseshoe, having properties of attracting or repelling iron; a magnet."]}], "ಕರ್ಚುನೀರ್": [{"type": "noun", "defs": ["water with which something (esp. an idol of a deity) is washed.", "water with which rice is washed before being cooked."]}], "ಕರ್ಚುರ": [{"type": "noun", "defs": ["the fragrant plant Kaempferia galanga of Zingiberaceae family.", "a fragrance made from this tree."]}], "ಕರ್ಚೂರ": [{"type": "noun", "defs": ["the plant Curcuma zeodarina (= C. zerumbet, = Amomum zerumbet) of Zingiberaeae family.", "gold.", "arsenic trisulfide, As2S3, having a lemon-yellow color and a resinous luste which is used as a pigment; orpiment."]}], "ಕರ್ಚೂರಕ": [{"type": "noun", "defs": ["= ಕರ್ಚೂರ.", "the plant Curcuma longa of Zingiberaceae family and the powder made from its rhizome."]}], "ಕರ್ಚೂರಿಗೆಡ್ಡೆ": [{"type": "noun", "defs": ["a kind of plant.", "its bulbous root."]}], "ಕರ್ಚೆಮಂಗ": [{"type": "noun", "defs": ["(dial.) a large and black kind ofpe."]}], "ಕರ್ಜಾಲಿ": [{"type": "noun", "defs": ["the plant Leucas lavandulaefolia (= L. linifolia) of Lamiaceae family.", "the tree Acacia farnesiana of Mimosae family; black babool; sweet acacia."]}], "ಕರ್ಜಿ": [{"type": "noun", "defs": ["the plant Adhatoda vasica (= Justicia adhatoda) of Acanthaceae family; (?)."]}], "ಕರ್ಜಿಕಾಯಿ": [{"type": "noun", "defs": ["a kind of sweet pancake made of sesame seeds, jaggery."]}], "ಕರ್ಜಿಗಿ": [{"type": "noun", "defs": ["a plant disease characterised by the appearance of masses of black spores which usu. break up into a fine powder, mostly affecting cotton plants; smut."]}], "ಕರ್ಜೀರಿಗೆ": [{"type": "noun", "defs": ["any of various families of winged hymenopteran insects, characterised by a slender body with the abdomen attached by a narrow stalk, biting mouthparts, and, in the females and workers, a vicious sting that can be used repeatedly; a wasp.", "a seed of a plant, used for medicinal purpose."]}], "ಕರ್ಜೂರ": [{"type": "noun", "defs": ["the tree Phoenix dactylifera of Arecaceae family; date palm.", "its sweet, fleshy fruit having a large, hard seed."]}], "ಕರ್ಜೇಡಿ": [{"type": "noun", "defs": ["black clay soil."]}], "ಕರ್ಣ": [{"type": "noun", "defs": ["a paste applied to the central part of the skin or parchment of percussion instruments like Mridanga, tabala."]}, {"type": "noun", "defs": ["the organ of hearing and balance in humans and vertebrates, esp. the external part of this; the ear.", "a broad, flat, movable piece of wood or metal hinged vertically at the stern of a boat or ship, used for steering; the helm or rudder of a ship.", "(fig.) a very generous man.", "a line extending between the vertices of any two non-adjacent angles in a polygonal figure; a line opposite to any angle in a triangle.", "a symbol for the number two,2."]}], "ಕರ್ಣಕಟುಕ": [{"type": "adjective", "defs": ["sharp or grating to the ear; disagreeable or offensive to the ear."]}], "ಕರ್ಣಕಠೋರ": [{"type": "adjective", "defs": ["= ಕರ್ಣಕಟುಕ."]}, {"type": "noun", "defs": ["that which is ear-piercing; a harsh, deafening sound.", "(fig.) a very unpleasant speech or statement."]}], "ಕರ್ಣಕೀಟ": [{"type": "noun", "defs": ["any of an order (Dermaptera) of widely distributed insects with short, horny forewings, a pair of forceps at the terminal end of the abdomen, and biting mouthparts; earwig."]}], "ಕರ್ಣಕುಂಡಲ": [{"type": "noun", "defs": ["the plant Impatiens balsamina of Balsaminaceae family.", "its flower; garden balsam.", "an ornament for ears; an ear-ring."]}], "ಕರ್ಣಕೋಟರ": [{"type": "noun", "defs": ["the opening of the external ear."]}], "ಕರ್ಣಗತ": [{"type": "adjective", "defs": ["heard; listened."]}], "ಕರ್ಣಚಾಲನ": [{"type": "noun", "defs": ["a moving of the ear."]}], "ಕರ್ಣಚ್ಛೇದ": [{"type": "noun", "defs": ["the act or an instance of cutting one's ear or ears.", "(geom.) a bifurcating or bisecting of a diagonal of geometrical figure."]}], "ಕರ್ಣಜ": [{"type": "noun", "defs": ["the yellowish, waxlike secretion found in the canal of the external ear; cerumen; earwax."]}], "ಕರ್ಣಜಪ": [{"type": "noun", "defs": ["the act or an instance of whispering, esp. slandering against another."]}], "ಕರ್ಣಜಲೌಕೆ": [{"type": "noun", "defs": ["any of a class (Chilopoda) of elongated, many-segmented, insect-eating arthropods with a pair of legs to each segment; a centipede."]}], "ಕರ್ಣಜಾಪ್ಯ": [{"type": "noun", "defs": ["(Jain.) a hymn that is whispered in another's ear (as not to be heard by a third person)."]}], "ಕರ್ಣತಾಟಂಕ": [{"type": "noun", "defs": ["a kind of ear-ornament."]}], "ಕರ್ಣತಾಡನ": [{"type": "noun", "defs": ["a slapping on the ear (as the waves of sound); the act of hearing."]}], "ಕರ್ಣತಾಳ": [{"type": "noun", "defs": ["a moving of the ear.", "a wide ear."]}], "ಕರ್ಣದೂಷಿಕೆ": [{"type": "noun", "defs": ["a type of horse disease."]}], "ಕರ್ಣಧಾರ": [{"type": "noun", "defs": ["a person who steers a vessel; a steersman.", "(fig.) one who controls or leads an organisation, government, etc.; a helmsman."]}], "ಕರ್ಣಧಾರಕ": [{"type": "noun", "defs": ["= ಕರ್ಣಧಾರ."]}], "ಕರ್ಣಧಾರಕತ್ವ": [{"type": "noun", "defs": ["the office and duty of a person who steers a vessel.", "the office or quality of a person who leads or controls an orgnisation, government, etc."]}], "ಕರ್ಣಧಾರತ್ವ": [{"type": "noun", "defs": ["= ಕರ್ಣಧಾರಕತ್ವ."]}], "ಕರ್ಣಧಾವಕ": [{"type": "noun", "defs": ["an instrrument used for washing ears."]}], "ಕರ್ಣನಳಿಕೆ": [{"type": "noun", "defs": ["a slender tube between the middle ear and the pharynx, which serves to equalise air pressure on both sides of the eardrum; the eustachian tube."]}], "ಕರ್ಣನಾಳ": [{"type": "noun", "defs": ["= ಕರ್ಣನಳಿಕೆ."]}], "ಕರ್ಣಪಟಲ": [{"type": "noun", "defs": ["a thin membrane that separates the middle ear from the external ear and vibrates when struck by sound waves; eardrum; tympanic membrane."]}], "ಕರ್ಣಪಟುತ್ವ": [{"type": "noun", "defs": ["the quality of being sharp and acutely sensitive in perceiving sound."]}], "ಕರ್ಣಪತ್ರ": [{"type": "noun", "defs": ["a coil of palmyra leaf inserted in to the lobe of the ear as an ornament.", "a gold or silver ear fixed to the ear of an idol."]}], "ಕರ್ಣಪಥ": [{"type": "noun", "defs": ["a means of hearing."]}], "ಕರ್ಣಪರಂಪರೆ": [{"type": "noun", "defs": ["a custom, account, story, hymn, scripture, etc. that is handed down from generation to generation by only oral communication."]}], "ಕರ್ಣಪರೀಕ್ಷಕ": [{"type": "noun", "defs": ["an examiner of the year.", "an instrument for examining the tympanic membrane and external canal of the ear; an otoscope."]}], "ಕರ್ಣಪಾತ್ರ": [{"type": "noun", "defs": ["either of the parts of a crown that covers the ears of the person wearing it."]}], "ಕರ್ಣಪಾಲಿಕೆ": [{"type": "noun", "defs": ["the lobe of the ear."]}], "ಕರ್ಣಪಾಶ": [{"type": "noun", "defs": ["a beautiful ear."]}], "ಕರ್ಣಪಿಶಾಚ": [{"type": "noun", "defs": ["= ಕರ್ಣಪಿಶಾಚಿ."]}], "ಕರ್ಣಪಿಶಾಚಿ": [{"type": "noun", "defs": ["a demon that is supposed to whisper in the ears about others.", "a one who whispers in a similar manner."]}], "ಕರ್ಣಪೂರ": [{"type": "noun", "defs": ["a kind of ornament for the ear."]}], "ಕರ್ಣಬಿಂದು": [{"type": "noun", "defs": ["the angle opposite to the diagonal line that connects the vertices of any two non-adjacent angles in a polyganal figure."]}], "ಕರ್ಣಭೂಷಣ": [{"type": "noun", "defs": ["an ornament for the ear or flower, small garland used to decorate the ear with."]}], "ಕರ್ಣಮಂತ್ರ": [{"type": "noun", "defs": ["a hymn whispered in the ear of a dying person."]}], "ಕರ್ಣಮಲ": [{"type": "noun", "defs": ["the yellowish, waxlike secretion found in the canal of the external ear; cerumen; earwax."]}], "ಕರ್ಣಮೂಲ": [{"type": "noun", "defs": ["the root of the outer ear."]}], "ಕರ್ಣಮೋಟಿ": [{"type": "noun", "defs": ["an incarnation of the goddess Pārvati."]}], "ಕರ್ಣರಸಾಯನ": [{"type": "noun", "defs": ["(fig.) that which is very pleasant to hear."]}], "ಕರ್ಣರೇಖೆ": [{"type": "noun", "defs": ["a line that joins the vertices of two non-adjacent angles in a figure having more than three angles; in a triangle, a line opposite to any of the angles."]}], "ಕರ್ಣರೋಗ": [{"type": "noun", "defs": ["an ear-disease."]}], "ಕರ್ಣವೃತ್ತಿ": [{"type": "noun", "defs": ["(fig.) the quality of being very generous."]}], "ಕರ್ಣವೇಧ": [{"type": "noun", "defs": ["the piercing of the ear; a making hole in the lobe of the ear."]}], "ಕರ್ಣವೇಷ್ಟನ": [{"type": "noun", "defs": ["an ornament for the ear."]}], "ಕರ್ಣಶಂಖ": [{"type": "noun", "defs": ["the spiral-shaped part of the inner ear, containing the auditory nerve endings; the cochlea."]}], "ಕರ್ಣಶೂಲ": [{"type": "noun", "defs": ["pain in the ear; ear-pain.", "that which is harsh, grating or unpleasant to hear."]}], "ಕರ್ಣಶೂಲೆ": [{"type": "noun", "defs": ["= ಕರ್ಣಶೂಲ - 1."]}], "ಕರ್ಣಾಕರ್ಣಿ": [{"type": "noun", "defs": ["that which is passed on from person to person by means of spoken words."]}], "ಕರ್ಣಾಕರ್ಣಿಕೆ": [{"type": "noun", "defs": ["= ಕರ್ಣಾಕರ್ಣಿ."]}], "ಕರ್ಣಾಟ": [{"type": "noun", "defs": ["Kannaḍa one of the major Dravidian languages, and the official language of, and chiefly spoken by the people of, Karnāṭaka.", "Karnāṭaka, one of the major states of Indian republic, situated in the southern plateau.", "the people of this state.", "(mus.) a mode in Karnāṭaka system."]}], "ಕರ್ಣಾಟಕ": [{"type": "noun", "defs": ["= ಕರ್ಣಾಟ - 1 & 2."]}], "ಕರ್ಣಾಟಕವಿಷಯ": [{"type": "noun", "defs": ["= ಕರ್ಣಾಟ - 2.", "ಕರ್ಣಾಟಕವಿಷಯ ಜಾತಿ karnāṭaka viṣaya jāti amśagaṇa chandassu, a class of meters that are peculiar to the Kannaḍa language."]}], "ಕರ್ಣಾಟಾಶ್ವ": [{"type": "noun", "defs": ["a horse of Karṇāṭaka."]}], "ಕರ್ಣಾಟಿ": [{"type": "noun", "defs": ["a woman of Karṇāṭaka; a Kannaḍa woman."]}], "ಕರ್ಣಾಭರಣ": [{"type": "noun", "defs": ["any ornament for the ear."]}], "ಕರ್ಣಾಮೃತ": [{"type": "noun", "defs": ["that which is very pleasant to hear."]}], "ಕರ್ಣಾಯತ": [{"type": "adjective", "defs": ["(a bow-string) drawn till one's ear."]}], "ಕರ್ಣಾವತಂಸ": [{"type": "noun", "defs": ["any ornament for the ear."]}], "ಕರ್ಣಾವಧಿ": [{"type": "noun", "defs": ["the height or depth from foot to the ear."]}], "ಕರ್ಣಿ": [{"type": "noun", "defs": ["an accountant; a scribe."]}, {"type": "adjective", "defs": ["relating to the ear.", "having or being at, the helm of a ship."]}, {"type": "noun", "defs": ["the part of a plough or other agricultural tool that cuts the soil; the share of a plough."]}], "ಕರ್ಣಿಕಾಗ್ರಂಥಿ": [{"type": "noun", "defs": ["a tumour at the root of the outer ear."]}], "ಕರ್ಣಿಕಾರ": [{"type": "noun", "defs": ["the tree Pterospermum acerifolium (= P. aceroides) of Sterculiaceae family.", "the plant Macaranga indica of Euphorbiaceae family; Indian lotus croton."]}], "ಕರ್ಣಿಕೆ": [{"type": "noun", "defs": ["the pericarp of a lotus.", "a flower, coil of a palmyra leaf, etc. used to decorate one's ear.", "the tip of the trunk of an elephant.", "the foot-stalk of a fruit,(the part that connects the fruit to its plant).", "a battle-field.", "a holy lake or river flowing by a holy place.", "(myth.) any of a group of minor nature goddesses, represented as young and beautiful, living in heavens; a nymph.", "a young girl.", "the middle-finger."]}], "ಕರ್ಣಿಕ್ಕೆ": [{"type": "noun", "defs": ["the tip of the penis of a horse."]}], "ಕರ್ಣೀರಥ": [{"type": "noun", "defs": ["a veiled litter or palanquin for women."]}], "ಕರ್ಣೇಂದ್ರಿಯ": [{"type": "noun", "defs": ["the organ of hearing and balance in humans and vertebrates; the ear."]}], "ಕರ್ಣೇಜಪ": [{"type": "noun", "defs": ["one who whispers in another's ears false and harmful statements about a third person; a slanderer; a calumniator."]}], "ಕರ್ಣೋತ್ತಂಸ": [{"type": "noun", "defs": ["any ornament for the ear."]}], "ಕರ್ಣೋತ್ಪಲ": [{"type": "noun", "defs": ["a blue lily flower used to keep on the ear (as of a deity, rarely of men)."]}], "ಕರ್ತ": [{"type": "noun", "defs": ["one who does, performs, works; a doer.", "the creator of the universe; the God.", "a chief, leader or a prominent man."]}], "ಕರ್ತನ": [{"type": "noun", "defs": ["the act of cutting, severing or cutting into pieces."]}], "ಕರ್ತಬಗಾರಿ": [{"type": "noun", "defs": ["the ability to perform, carrying out a work; the quality of being capable; practical ability; capability.", "a capable, practical man."]}], "ಕರ್ತಬುಗಾರಿ": [{"type": "noun", "defs": ["= ಕರ್ತಬಗಾರಿ."]}], "ಕರ್ತಬ್ಯ": [{"type": "noun", "defs": ["= ಕರ್ತವ್ಯ."]}], "ಕರ್ತರಿ": [{"type": "noun", "defs": ["an instrument for cutting fabric, paper, hair, etc., having two pivoted blades with finger and thumb holes in the handles, operating by closing on the material to be cut; a pair of scissors.", "a small sword-like weapon; a dagger.", "the back feathered end of an arrow."]}], "ಕರ್ತರಿಗಾಲು": [{"type": "noun", "defs": ["a stance in sword fighting, keeping both the legs crossing each other."]}], "ಕರ್ತರಿಪ್ರಯೋಗ": [{"type": "noun", "defs": ["(gram.) the voice or form of a verb whose subject is the performer or agent, of the action of the verb; active voice."]}], "ಕರ್ತರಿಮಂಡಿ": [{"type": "noun", "defs": ["a particular stance in sword fighting."]}], "ಕರ್ತರಿಸು": [{"type": "verb", "defs": ["to cut; to severe; to separate into two or more parts."]}], "ಕರ್ತರೀಮುಖ": [{"type": "noun", "defs": ["(dance.) a single hand gesture, bending the thumb and ring finger, extending the forefinger and middle finger one behind the other in the shape of a scissorś blades."]}], "ಕರ್ತಲಿಸು": [{"type": "verb", "defs": ["to become dark or darker.", "to make dark or darker."]}], "ಕರ್ತಲೆ": [{"type": "noun", "defs": ["absence of light; darkness."]}], "ಕರ್ತವ್ಯ": [{"type": "noun", "defs": ["any action, task, etc. required by or relating to one's occupation or position; that which ought to be done; duty."]}], "ಕರ್ತವ್ಯಚ್ಯುತ": [{"type": "adjective", "defs": ["failed or failing to do one's duty."]}, {"type": "noun", "defs": ["a man who has failed to do his duty."]}], "ಕರ್ತವ್ಯಚ್ಯುತಿ": [{"type": "noun", "defs": ["the fact or an instance of a failure in carrying out one's duty."]}], "ಕರ್ತವ್ಯಚ್ಯುತೆ": [{"type": "noun", "defs": ["a woman who has failed to do her duty."]}], "ಕರ್ತವ್ಯನಿಷ್ಠ": [{"type": "adjective", "defs": ["showing or having a proper sense of duty."]}, {"type": "noun", "defs": ["a man showing or having a proper sense of duty; a dutiful man."]}], "ಕರ್ತವ್ಯನಿಷ್ಠೆ": [{"type": "noun", "defs": ["a woman showing or having a proper sense of duty; a dutiful woman.", "the quality of being dutiful; dutifulness."]}], "ಕರ್ತವ್ಯಪ್ರಜ್ಞೆ": [{"type": "noun", "defs": ["the quality of being conscious of one's duty; the sense of duty."]}], "ಕರ್ತವ್ಯಭ್ರಷ್ಟ": [{"type": "adjective", "defs": ["= ಕರ್ತವ್ಯಚ್ಯುತ1."]}, {"type": "noun", "defs": ["= ಕರ್ತವ್ಯಚ್ಯುತ2."]}], "ಕರ್ತವ್ಯಭ್ರಷ್ಟತೆ": [{"type": "noun", "defs": ["= ಕರ್ತವ್ಯಚ್ಯುತಿ."]}], "ಕರ್ತವ್ಯಭ್ರಷ್ಟೆ": [{"type": "noun", "defs": ["= ಕರ್ತವ್ಯಚ್ಯುತೆ - 1."]}], "ಕರ್ತವ್ಯಮೂಢ": [{"type": "noun", "defs": ["a man who is puzzled about his duty."]}], "ಕರ್ತವ್ಯಮೂಢೆ": [{"type": "noun", "defs": ["a woman who is puzzled about her duty."]}], "ಕರ್ತವ್ಯಲೋಪ": [{"type": "noun", "defs": ["= ಕರ್ತವ್ಯಚ್ಯುತಿ."]}], "ಕರ್ತವ್ಯಸಾರ": [{"type": "noun", "defs": ["a person who is capable of performing or carrying out a work; an efficient man."]}], "ಕರ್ತಾರ": [{"type": "noun", "defs": ["the creator of the universe; Brahma.", "one who does, performs or works; a doer.", "a man who is capable of applying knowledge to useful ends.", "a master; a ruler."]}], "ಕರ್ತು": [{"type": "noun", "defs": ["= ಕರ್ತಾರ."]}], "ಕರ್ತುಕ": [{"type": "noun", "defs": ["= ಕರ್ತಾರ - 1."]}], "ಕರ್ತೃ": [{"type": "noun", "defs": ["a person who does, performs or carries out a work; a doer.", "a master; a owner; a ruler.", "the man who originates, creates or initiates something.", "(gram.) the noun or other substantive that is one of the two immediate constituents of a sentence and about which something is said in the predicate and with which the verb agrees; a subject."]}], "ಕರ್ತೃತ್ವ": [{"type": "noun", "defs": ["the quality of, capacity for, doing, carrying out a work; the position or authority of a doer.", "the state or fact of being an owner; ownership; the ability to lead; leadership."]}], "ಕರ್ತೃತ್ವಶಾಲಿ": [{"type": "noun", "defs": ["a man who has the ability to a) do, carry out or perform a work; b) lead others organise a work."]}], "ಕರ್ತೃತ್ವಶಾಲಿನಿ": [{"type": "noun", "defs": ["a woman who has the ability to a) do, carryout or perform a work; b) lead others organise a work, etc."]}], "ಕರ್ತೃಪದ": [{"type": "noun", "defs": ["(gram.) the word in a sentance that denotes the doer of a work."]}], "ಕರ್ತೆ": [{"type": "noun", "defs": ["any of a number of horselike perissodactylous mammals (family Equidae) having long ears and a short mane, which are domesticated for hardwork; an ass."]}], "ಕತ್ರ್ರರ್ಥ": [{"type": "noun", "defs": ["(gram.) the sense of a verb or verbal phrase, any complements, objects, in relation to the subject."]}], "ಕರ್ದ": [{"type": "noun", "defs": ["any of a number of large, strong, flesh-eating accipitrine birds of prey noted for their sharp vision and powerful wings; an eagle."]}, {"type": "noun", "defs": ["soft, moist, slippery mud.", "a firm, fine-grained earth, plastic when wet, composed chiefly of hydrous aluminum silicate minerals, used to make earthen pots; clay.", "the fibrous root of the lotus plant."]}], "ಕರ್ದಟಕಿ": [{"type": "noun", "defs": ["any aquatic weed."]}], "ಕರ್ದಡಿಗ": [{"type": "noun", "defs": ["a black, stout and clumsy fellow; a lubber."]}], "ಕರ್ದನಿ": [{"type": "noun", "defs": ["a harsh, unpleasant sound."]}], "ಕರ್ದಮ": [{"type": "noun", "defs": ["soft, moist, slippery mud esp. the sediments settled to the bottom of water in a lake, water-tank, etc.", "water mixed with perfume.", "any soiling matter, as mud, dust, dung, etc.; dirt.", "an offense against God, religion or good morals; a sin.", "the flesh of animals used as food; meat.", "(myth.) one of the ten lords (Prajāpatis)of created beings, produced by the Creator of the universe, Brahma."]}], "ಕರ್ದಮಂಗರ್ಚು": [{"type": "verb", "defs": ["to remove mud, dirt etc. by washing.", "(fig.) to exonerate from a blemish, sin etc."]}], "ಕರ್ದಮಂಬೊರೆ": [{"type": "verb", "defs": ["to sling mud at.", "(fig.) to make unscrupulous or malicious attack against a person."]}], "ಕರ್ದಮಿತ": [{"type": "adjective", "defs": ["full of or spattered with mud; dirty."]}], "ಕರ್ದಮೋದಕ": [{"type": "noun", "defs": ["a fortified place having deep, broad ditch dug around, filled with water and soggy earth below."]}], "ಕರ್ದರಿ": [{"type": "noun", "defs": ["a deep and narrow valley having little or no light."]}], "ಕರ್ದಾದಾರ": [{"type": "noun", "defs": ["a man who cultivates the land; a farmer; a cultivator."]}], "ಕರ್ದಾಳೆ": [{"type": "noun", "defs": ["the plant Aloe barbadensis (= A. Vera) of Liliaceae family.", "the plant Agave sisalana of Agavaceae family."]}], "ಕರ್ದಿಂಗಳ್": [{"type": "noun", "defs": ["the day on which the moon has its first phase, that is when it is between the earth and the sun, with its dark side toward the earth; new-moon day; the last day of the lunar month."]}]}