{"ಸೋಮಶಾಲಿ": [{"type": "noun", "defs": ["a variety of paddy."]}], "ಸೋಮಸಾಲೆ": [{"type": "noun", "defs": ["the pavilion in front of a temple."]}], "ಸೋಮಾಂಕ": [{"type": "noun", "defs": ["= ಸೋಮಧರ."]}], "ಸೋಮಾರಿ": [{"type": "noun", "defs": ["a man disinclined to work or physical exertion; a lazy, indolent man."]}], "ಸೋಮಾರಿತನ": [{"type": "noun", "defs": ["the quality of being not eager or willing to work or exert oneself; laziness."]}], "ಸೋಮಾಶ್ಮ": [{"type": "noun", "defs": ["= ಸೋಮಮಣಿ."]}], "ಸೋಮಿ": [{"type": "noun", "defs": ["(correctly, ಸ್ವಾಮಿ) a master; a lord; an employer.", "a king; a ruler.", "a man appointed to a position or office of authority in government, business, institution, etc.; an officer.", "a man as he is related to his wife; a husband.", "the Supreme Being.", "a suffix added to the names of men as a mark of respect.", "a respectful mode of addressing eleders, gods, officers, etc."]}, {"type": "noun", "defs": ["a man who has performed sōma yajña."]}, {"type": "noun", "defs": ["a kind of tree."]}], "ಸೋಮೆ": [{"type": "noun", "defs": ["the tree Walsura trijuga ( = Heynea trijuga) of Meliaceae family; 2 ) the tree Saymida febrifuga of the same family; Indian redwood."]}], "ಸೋಮೇಶ": [{"type": "noun", "defs": ["= ಸೋಮೇಶ್ವರ."]}], "ಸೋಮೇಶ್ವರ": [{"type": "noun", "defs": ["= Śiva."]}], "ಸೋಮೋಪರಾಗ": [{"type": "noun", "defs": ["= ಸೋಮಗ್ರಹಣ."]}], "ಸೋಯ": [{"type": "adjective", "defs": ["competent; capable; fit."]}, {"type": "noun", "defs": ["(correctly, ಸ್ವಯ) 1. the state of being under another's domination or the state of having another under one's domination; subjection; subordination.", "the state of being one with another; absorption.", "that which is eternal.", "something that belongs to oneself; belongings; possessions.", "the quality or state of being true; truth; genuineness; honesty.", "trust; confidence."]}], "ಸೋಯಸ್ಕರ": [{"type": "adjective", "defs": ["= ಸೋಬಸ್ಕರ1."]}, {"type": "noun", "defs": ["= ಸೋಬಸ್ಕರ2."]}], "ಸೋಯಿ": [{"type": "noun", "defs": ["= ಸೋವಿ."]}], "ಸೋಯಿದರ": [{"type": "noun", "defs": ["= ಸೋವಿ - 2."]}], "ಸೋಯಿಸ್ಕರ": [{"type": "adjective", "defs": ["= ಸೋಬಸ್ಕರ1."]}, {"type": "noun", "defs": ["= ಸೋಬಸ್ಕರ2."]}], "ಸೋಯು": [{"type": "verb", "defs": ["= ಸೋವು1."]}], "ಸೋರ್": [{"type": "noun", "defs": ["= ಸೋರು1."]}, {"type": "noun", "defs": ["the act of oozing, leaking out.", "the act or manner of flowing; a flow.", "the act of emitting; issuance; a discharge."]}], "ಸೋರಣ": [{"type": "noun", "defs": ["= ಸೋರಿಕೆ - 1."]}], "ಸೋರಾಟ": [{"type": "noun", "defs": ["(correctly, ಸೌರಾಷ್ಟ್ರ) the name of a country, forming a part of the present Gujarāt."]}], "ಸೋರಿಕೆ": [{"type": "noun", "defs": ["the act or an instance of (a liquid) leaking, trickling or dropping out.", "(money of a company, government) to be defrauded (by its employees)."]}], "ಸೋರಿಸು": [{"type": "verb", "defs": ["to cause to leak, drop or trickle.", "to cause (the public or company money) to be defrauded."]}], "ಸೋರು": [{"type": "verb", "defs": ["to send forth (sap, any liquid) from within; to cause to ooze or leak.", "to fall in a continuous stream (said of a liquid).", "to leak out, to drip; to flow out (as through small openings or pores.", "to be lost.", "to be hanging or hung.", "to become loose and slip down.", "(one's haughtiness, overbearingness, etc.) to be subdued, lost."]}, {"type": "verb", "defs": ["(milk) to be ready in the udder (of a cow, buffalo,etc.) to flow out or to be milked."]}], "ಸೋರುಗಂಡಿ": [{"type": "noun", "defs": ["a hole or passage for (waste) water to go out."]}], "ಸೋರುಗಣ್ಣು": [{"type": "noun", "defs": ["an eye having excessive discharge of watery rheum; a watery-eye.", "an eye disease causing this."]}], "ಸೋರುಪ್ಪು": [{"type": "noun", "defs": ["a colourless, crystalline compound, potassium nitrate (KNO3), used in gunpowder, medicine, preservative, etc.; saltpetre."]}], "ಸೋರುಬಿಡು": [{"type": "verb", "defs": ["(a cow, buffalo) to relax the muscles of the udder to allow the milk to flow out; to be milked."]}], "ಸೋರುಮುಡಿ": [{"type": "noun", "defs": ["= ಸೋರ್ಮುಡಿ."]}], "ಸೋರೆ": [{"type": "noun", "defs": ["the vine Lagenaria vulgaris ( = Cucurbita lagenaria) of Cucurbitaceae family.", "its gourd.", "a vessel made of this gourd or in its shape.", "a sort of musical instrument made of this gourd, used by snake-charmers; a kind of fife.", "a big, semi-sphrical part of a vīṇe or tambūri.", "the tree Crescentia cujete of Bignoniaceae family; calabash tree."]}, {"type": "noun", "defs": ["the forest-dwelling pigeon, Columba livia; wild-pigeon; rock pigeon; rock dove."]}], "ಸೋರೆಕಾಯಿ": [{"type": "noun", "defs": ["= ಸೋರೆ3 - 2, 3 & 4."]}], "ಸೋರೆಗಾಯಿ": [{"type": "noun", "defs": ["= ಸೋರೆ3 - 2, 3 & 4."]}], "ಸೋರೆಗುಂಡಿಗೆ": [{"type": "noun", "defs": ["= ಸೋರೆ3 - 3."]}], "ಸೋರೆಬುರುಡೆ": [{"type": "noun", "defs": ["= ಸೋರೆ1 - 6.", "a dried gourd of the vine Lagenaria vulgaris."]}], "ಸೋರೆಬುರುಡೆಮರ": [{"type": "noun", "defs": ["= ಸೋರೆ1 - 6."]}], "ಸೋರೆಮೊಗ": [{"type": "noun", "defs": ["an unhappy or gloomy expression; a long-face."]}], "ಸೋರೋಡು": [{"type": "noun", "defs": ["a boat having holes; a damaged boat."]}], "ಸೋರ್ಗುರುಳು": [{"type": "noun", "defs": ["= ಸೋರ್ಮುಡಿ."]}], "ಸೋರ್ಚು": [{"type": "verb", "defs": ["= ಸೋರಿಸು."]}], "ಸೋರ್ಮುಡಿ": [{"type": "noun", "defs": ["loosely tied or braided hair."]}], "ಸೋರ್ವಿ": [{"type": "noun", "defs": ["= ಸೋರಿಕೆ - 1."]}], "ಸೋಲ್": [{"type": "verb", "defs": ["= ಸೋಲು1."]}], "ಸೋಲ": [{"type": "noun", "defs": ["= ಸೋಲು2."]}], "ಸೋಲಂಬಡೆ": [{"type": "verb", "defs": ["= ಸೋಲುವಡೆ."]}], "ಸೋಲಕಾರ್ತಿ": [{"type": "noun", "defs": ["a woman who charms, fascinates or captivates by her beauty, grace."]}], "ಸೋಲಗಿತಿ": [{"type": "noun", "defs": ["= ಸೋಲಕಾರ್ತಿ."]}], "ಸೋಲಿಗ": [{"type": "noun", "defs": ["name of a tribe of people living in hilly areas."]}], "ಸೋಲಿಸು": [{"type": "verb", "defs": ["to overcome in a contest, election, battle, etc.", "to attract; to captivate by charming, fascinatiing."]}], "ಸೋಲು": [{"type": "verb", "defs": ["to be defeated; to fail to win.", "to fail to achieve the set goal.", "to lose the money bet as stake in a game of chance.", "to lose one's strength; to become unable to pursue ones course of action.", "to be captured, charmed, fascinated by the beauty, grandeur, etc. of.", "to keep on becoming or making smaller or less; to diminish; to dwindle.", "ಸೋತ ಪುರುಕ sōta puruka a man who has been defeated in a game, contest, etc.; ಸೋತ ಪುರುಕಿ sōta puruki a woman who has been defeated in a game, contest, etc.; ಸೋತು ಸುಣ್ಣವಾಗು sōtu suṇṇavāgu (a person) to become exausted completely as by series of failures; ಸೋತುಹೋಗು sōtu hōgu to be defeated; 2. to be exhausted completely; 3. to withdraw oneself from humility; ಮಾತು ಬಂದಾಗ ಸೋತು ಹೋದವನೇ ಜಾಣ mātu bandāga sōtu hōdavanē jāṇa (prov.) he is wise, who withdraws himself from arguing in vain."]}, {"type": "noun", "defs": ["the fact of being defeated.", "an instance of not succeeding in doing or becoming; a failure.", "the fact or act of capturing the interest, attention of; fascination.", "the state of being satisfied; satisfcation.", "something, esp. money, bet, as in a wager, game or contest; stake.", "the damage, trouble, disadvantage, deprivation, etc. caused by losing something; a loss.", "weariness from bodily or mental exertion; fatigue."]}, {"type": "noun", "defs": ["a kind of plant.", "a perfume made from this plant."]}], "ಸೋಲುಮುಡಿ": [{"type": "noun", "defs": ["= ಸೋರ್ಮುಡಿ."]}], "ಸೋಲುವಡೆ": [{"type": "verb", "defs": ["= ಸೋಲಿಸು.", "to be defeated; to fail to win."]}], "ಸೋಲುವೆ": [{"type": "noun", "defs": ["= ಸೋಲು2 - 1 & 2."]}], "ಸೋಲೆ": [{"type": "noun", "defs": ["the outer covering of onion, garlic, pulses, etc.", "the fibre-like structure that covers the segments of jackfruit.", "the thin, outer layer of the skin of a snake that is periodically cast off."]}], "ಸೋಲೆಗಳೆ": [{"type": "verb", "defs": ["to remove the outer covering (of onion, garlic, pulses, etc.).", "(a snake) to cast of its outer layer of skin."]}], "ಸೋಲ್ಕೆ": [{"type": "noun", "defs": ["= ಸೋಲು2 - 1 & 2."]}], "ಸೋಲ್ತಯಿಸು": [{"type": "verb", "defs": ["= ಸೋಲಿಸು 1."]}], "ಸೋಲ್ನಡೆ": [{"type": "noun", "defs": ["a slow walk."]}], "ಸೋಲ್ಮುಡಿ": [{"type": "noun", "defs": ["= ಸೋರ್ಮುಡಿ."]}], "ಸೋವಡಿ": [{"type": "noun", "defs": ["a simple, artless man."]}], "ಸೋವಣ": [{"type": "noun", "defs": ["a kind of tax."]}], "ಸೋವತ": [{"type": "noun", "defs": ["the act of offering the life of a person or animal or some object, in propitiation of or homage to a deity; a sacrifice; ಸೋವತಂ ಮಾಡು sōvata māḍu to offer as a sacrifice to a deity; ಸೋವತಮಾಗು sōvatamāgu to sacrifice oneself or be sacrificed."]}], "ಸೋವದಿಕೆ": [{"type": "noun", "defs": ["that which is offered as a sacrifice."]}], "ಸೋವನ": [{"type": "noun", "defs": ["a song sung by women in chorus on auspicious occasions as marriage.", "a term used at the end of each verse of a song, wishing good, welfare, etc.", "any auspicious song.", "any auspicious occasions as marriage.", "a ceremony on a day after marriage, on which night the married copule would have sexual intercourse for the first time."]}], "ಸೋವನಿಗ": [{"type": "noun", "defs": ["a man who makes and deals with articles of gold; a goldsmith.", "a man belonging to the caste of goldsmiths."]}], "ಸೋವಳಿ": [{"type": "noun", "defs": ["the act of driving out or away; a chasing."]}], "ಸೋವಾಸಿಣಿ": [{"type": "noun", "defs": ["(correctly, ಸುವಾಸಿನಿ) a married woman whose husband is alive."]}], "ಸೋವಿ": [{"type": "noun", "defs": ["a state of ease and quiet enjoyment, free from worry, pain or trouble; comfort.", "the quality or fact of being low in price or cost; inexpensiveness; cheapness."]}], "ಸೋವಿದರ": [{"type": "noun", "defs": ["= ಸೋವಿ - 2."]}], "ಸೋವಿಲು": [{"type": "noun", "defs": ["the front part of the human body from the waist to the knees when in a sitting position; the lap.", "the central part of a sari (a garment worn by Indian women, consisting of a long piece of cotton or silk wrapped around the body with one end draped over the head or over one shoulder) excluding the borders on all sides.", "a pouch formed by folding or doubling a part of one's cloth (as sari or dhōti)."]}], "ಸೋವಿಲುದುಂಬು": [{"type": "verb", "defs": ["to fill ಸೋಗಿಲಕ್ಕಿ into the pouch formed by a woman by stretching the front portion of her sari."]}], "ಸೋವಿಸು": [{"type": "verb", "defs": ["= ಸೋವು1–1.", "to overpower; to defeat."]}], "ಸೋವು": [{"type": "verb", "defs": ["to drive out or away; to chase away.", "to cause a prey come out of a bush, hole, etc.", "to prevent (an evil) from befalling; to get rid of an evil.", "to cause to be involved in.", "to grasp mentally; to understand; to comprehend."]}, {"type": "noun", "defs": ["a manner of hunting by driving the prey from its hole or the bush it is hiding in.", "a tract made by repeated passage of wild animals in a forest; a beaten path.", "an indication, token; a sign.", "mental concentration; attention.", "an animal hunted or killed for food by another animal or a person; a prey.", "a protecting; protection.", "the duty of a watchman, guard."]}], "ಸೋವುಗ": [{"type": "noun", "defs": ["a hunter or his assistant, who, for purpose of hunting, drives the prey from its hole or the bush it is hiding in."]}], "ಸೋವೆ": [{"type": "noun", "defs": ["= ಸೋವು2."]}, {"type": "noun", "defs": ["a kind of tree."]}], "ಸೋಶೀರ": [{"type": "noun", "defs": ["the grass Vetiveria zizanioides ( = Andropogon muricatus) of the same family; vetiver.", "its fibrous fragrant grass used for making screens, mats, etc.; vetiver."]}], "ಸೋಷ್ಣ": [{"type": "adjective", "defs": ["having or giving warmth or heat."]}], "ಸೋಸ": [{"type": "noun", "defs": ["a bold, risky undertaking; a hazardous action; an adventure.", "the quality of being bold, brave, valorous."]}], "ಸೋಸಲು": [{"type": "noun", "defs": ["a kind of fish."]}], "ಸೋಸು": [{"type": "verb", "defs": ["to drive out or away; to chase away."]}, {"type": "verb", "defs": ["to pass through a screen, sieve, filter, etc. to remove adulterants from; to filter; to strain.", "to search for and pick out.", "to remove errors from (a written passage); to correct.", "to go over or look through for the purpose of finding something; to explore; to search.", "to look at or into critically or methodically in order to find out the facts, condition, etc. of; investigate; to examine.", "to study and analyse something critically, and, according to certain standards, pass the judgement as to its value, merit, etc.; to judge as a critic."]}, {"type": "verb", "defs": ["(dial.) to bear with; to put up with; to endure patiently."]}, {"type": "noun", "defs": ["beauty; charm; loveliness.", "fervour for a person, cause or object; eager desire or endeavour; enthusiastic diligence."]}], "¸Éೂೀಹ": [{"type": "noun", "defs": ["(phil.) the realisation of the identify of one's self with the Supreme Soul."]}], "ಸೋಹಂ": [{"type": "noun", "defs": ["= ಸೋಹ."]}], "ಸೋಹಗೊಳ್ಳು": [{"type": "verb", "defs": ["(phil.) to realise the fact that one's self is not different from the Supreme Soul."]}], "ಸೋಹನಿ": [{"type": "noun", "defs": ["(mus.) name of a rāga (musical mode) in Hindūstāni system."]}], "ಸೋಹಿ": [{"type": "noun", "defs": ["(phil.) he who realised the fact that one's self is not different from the Supreme Soul."]}], "ಸೋಹು": [{"type": "verb", "defs": ["= ಸೋವು1."]}, {"type": "noun", "defs": ["= ಸೋವು2."]}], "ಸೋಹುಮೃಗ": [{"type": "noun", "defs": ["a prey-animal used to lure another into a snare; a decoy."]}], "ಸೋಹುಲಿ": [{"type": "noun", "defs": ["a cry to scare the birds that would come to eat up the corns in the field."]}], "ಸೋಹುವೇಂಟೆ": [{"type": "noun", "defs": ["a hunting of an animal chasing it."]}], "ಸೋಹೆ": [{"type": "noun", "defs": ["= ಸೋವು2."]}], "ಸೋಹೊನ್ನೆ": [{"type": "noun", "defs": ["the tree Terminalia crenulata of Combretaceae family."]}], "ಸೋಳ": [{"type": "adjective", "defs": ["= ಸೋಳಹ1."]}, {"type": "noun", "defs": ["= ಸೋಳಹ2."]}], "ಸೋಳಹ": [{"type": "adjective", "defs": ["totalling to sixteen."]}, {"type": "noun", "defs": ["the cardinal number sixteen."]}], "ಸೋಳೆ": [{"type": "noun", "defs": ["any of several segments of a fruit (as orange, jackfruit, etc.) each of which is an independent whole and which can be separated from each other."]}], "ಸೌಂತೆ": [{"type": "noun", "defs": ["= ಸೌತೆ."]}], "ಸೌಂದರ": [{"type": "adjective", "defs": ["beautiful; good looking."]}, {"type": "noun", "defs": ["beauty; fairness; attractiveness.", "a handsome man.", "an azure-blue, opaque semiprecious stone, a mixture of various minerals; lapis lazuli.", "(pros.) a metrical verse, having a group of three syllales (-uu) followed by a long syllable (-).", "(pros.) another metrical verse having four groups of three syllables followed by a long one ( -uu, --u, u-u, -uu, -).", "(pros.) another metrical verse having in each line seven groups of three syllables each (uuu, -uu, -uu,-uu, ---, uu-, uu-, u, -)."]}], "ಸೌಂದರತೆ": [{"type": "noun", "defs": ["the quality of being beautiful; beautifulness."]}], "ಸೌಂದರಿ": [{"type": "noun", "defs": ["a beautiful woman.", "the tree Santalum album of Santalaceae family."]}], "ಸೌಂದರಿಯ": [{"type": "noun", "defs": ["= ಸೌಂದರ್ಯ."]}], "ಸೌಂದರ್ಯ": [{"type": "noun", "defs": ["beauty; loveliness; gracefulness; elegance."]}], "ಸೌಂದರ್ಯಪ್ರಜ್ಞೆ": [{"type": "noun", "defs": ["the quality of being sensitive to beauty; the inclination for aesthetic value and consideration; aesthetic sense."]}], "ಸೌಂದರ್ಯಪ್ರಸಾಧನ": [{"type": "noun", "defs": ["any cosmetic preparation for the skin, hair, etc., as rouge and powder; a cosmetic."]}], "ಸೌಂದರ್ಯಪ್ರಿಯ": [{"type": "noun", "defs": ["a man who has taste for beauty or aesthetics."]}], "ಸೌಂದರ್ಯಪ್ರಿಯತೆ": [{"type": "noun", "defs": ["the quality of being sensitive to beauty."]}], "ಸೌಂದರ್ಯಪ್ರಿಯೆ": [{"type": "noun", "defs": ["a man who has taste for beauty or aesthetics."]}], "ಸೌಂದರ್ಯಮೀಮಾಂಸೆ": [{"type": "noun", "defs": ["the study or theory of beauty and of the psychological responses to it; the branch of philosophy dealing with art, its creative sources, its forms, and its effects; aesthetics."]}], "ಸೌಂದರ್ಯಶಾಲಿ": [{"type": "noun", "defs": ["a handsome man."]}], "ಸೌಂದರ್ಯಶಾಲಿನಿ": [{"type": "noun", "defs": ["a beautiful woman."]}], "ಸೌಂದರ್ಯಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["= ಸೌಂದರ್ಯಮೀಮಾಂಸೆ."]}], "ಸೌಂದರ್ಯಸಂವೇದನೆ": [{"type": "noun", "defs": ["the quality of being sensitive to beauty."]}], "ಸೌಂದರ್ಯಾನುಭªÀ": [{"type": "noun", "defs": ["an experiencing and enjoying the things aesthetically."]}], "ಸೌಂದರ್ಯೋಪಾಸಕ": [{"type": "noun", "defs": ["a man who admires, adores and appreciates beauty, aesthetically."]}], "ಸೌಂದರ್ಯೋಪಾಸಕಿ": [{"type": "noun", "defs": ["a woman who admires, adores and appreciates beauty, aesthetically."]}], "ಸೌಂದರ್ಯೋಪಾಸನೆ": [{"type": "noun", "defs": ["admiration, adoration and appreciation of beauty."]}], "ಸೌಕರ್ಯ": [{"type": "noun", "defs": ["the quality that is natural to a pig, boar.", "one of the ten major incarnation of Viṣṇu, in which he had taken the form of a boar.", "conveience; facility."]}], "ಸೌಕುಮಾರ್ಯ": [{"type": "noun", "defs": ["the quality of being soft, tender; softness; tenderness.", "(rhet.) one of the ten positive merits, in which the composition is mostly made of soft consonants and style is lucid."]}], "ಸೌಕುಮಾರ್ಯಂಬೆಱು": [{"type": "verb", "defs": ["to become soft, tender."]}], "ಸೌಖ್ಯ": [{"type": "noun", "defs": ["freedom from disagreement or quarrels; harmony; concord; peace.", "happiness; pleasure."]}], "ಸೌಗಂಧ": [{"type": "noun", "defs": ["a pleasing smell or odour; a sweet scent."]}], "ಸೌಗಂಧಿ": [{"type": "noun", "defs": ["that which has a pleasing smell.", "the tree Santalum album of Santalaceae family."]}], "ಸೌಗಂಧಿಕ": [{"type": "noun", "defs": ["= ಸೌಗಂಧಿ - 1.", "a man who sells perfumes.", "the water lily Nymphaea alba of Nymphaeaceae family; red lotus plant.", "its flower.", "the grass Sorghum nitidum ( =Andropogon serratus) of Poaceae family with fragrant roots.", "a small, hornless deer (Moschus moschiferus) of the uplands of central Asia, the male of which secretes musk and has tusk-like upper canines; a musk deer.", "a non-metallic element that exists in several forms, the ordinary one being a yellow rhombic crystalline solid, and that burns with a blue flame and a suffocating odour; sulphur (symbol: S).", "a clear, deep-red variety of corundum, valued as a precious stone; a ruby."]}], "ಸೌಗಂಧಿಸು": [{"type": "verb", "defs": ["to emit a pleasing odour."]}], "ಸೌಗಂಧ್ಯ": [{"type": "noun", "defs": ["the quality or fact of having a pleasing smell."]}], "ಸೌಗತ": [{"type": "adjective", "defs": ["being in accordance with the Buddha, the founder of Buddhism."]}, {"type": "noun", "defs": ["a follower of Buddhism; a Buddhist."]}], "ಸೌಗತಸಿದ್ಧಾಂತ": [{"type": "noun", "defs": ["the doctrine of the Buddha or Buddhism."]}], "ಸೌಗವಲ್ಲಿ": [{"type": "noun", "defs": ["the plant Clematis triloba of Ranunculaceae family."]}], "ಸೌಚ": [{"type": "noun", "defs": ["(correctly, ಶೌಚ) 1. the quality or condition of being clean, pure, spotless; cleanliness; immaculateness.", "the quality of being guiltless, sinless."]}], "ಸೌಚಾಚಾರ": [{"type": "noun", "defs": ["conduct of a person who is pure, spotless.", "a person having pure and spotless conduct."]}], "ಸೌಚಿಕ": [{"type": "noun", "defs": ["a man who makes, repairs or alters clothes; a tailor."]}], "ಸೌಜನ್ಯ": [{"type": "noun", "defs": ["courteous behavior; gracious politeness; courtesy.", "the quality of being generous; generosity; nobility of mind; magnanimity."]}], "ಸೌಜನ್ಯವಿದೂರ": [{"type": "noun", "defs": ["a man lacking courtesy, politeness; a wicked or savage man."]}], "ಸೌಜನ್ಯವಿದೂರೆ": [{"type": "noun", "defs": ["a woman lacking courtesy, politeness; a wicked or savage woman."]}], "ಸೌಜ್ಞೆ": [{"type": "noun", "defs": ["a bar used, by placing it on a fulcrum, to lift a weight on the one end, by pressing it down at the other end (using lesser force depending on the mechanical advantage derived); a lever."]}], "ಸೌಜ್ಞೆಗೆಯ್": [{"type": "verb", "defs": ["a sign, mark, gesture or indication made deliberately to communicate something."]}], "ಸೌಟಿಗೆ": [{"type": "noun", "defs": ["(arch.) a unit of capacity."]}], "ಸೌಟು": [{"type": "noun", "defs": ["a kitchen vessel consisting of long-handled spoon, with a deep cup at one end, used to stir and serve liquid foods.", "ಸೌಟು ಹಿಡಿ sauṭu hiḍi to cook; to take up the profession of a cook."]}], "ಸೌಡಂಗಿ": [{"type": "noun", "defs": ["= ಸೌಡಂಗೆ."]}], "ಸೌಡಂಗೆ": [{"type": "noun", "defs": ["the plant Solanum verbascifolium of Solanaceae family."]}], "ಸೌಡಿ": [{"type": "noun", "defs": ["a village servant whose duty is to channel water through artificial means to agricultural fields."]}], "ಸೌಡೀರ": [{"type": "adjective", "defs": ["(rhet.) dealing with, writing about, containing valourousness as a sentiment."]}], "ಸೌಡು": [{"type": "noun", "defs": ["a period of free time; a time of inactivity after work or exertion.", "an opportunity; an opportune time.", "information, announcement or warning; a notice.", "the state of being free from working.", "that by which something is done or obtained;a means."]}], "ಸೌತಿ": [{"type": "noun", "defs": ["one of the two wives of a man, as related to another (wife); a fellow-wife.", "(fig.) a woman who hates or is hated by, intensly another woman."]}], "ಸೌತೆ": [{"type": "noun", "defs": ["the annual vine Cucumis sativus of the Cucurbitaceae family; cucumber.", "its long fruit with green rind and firm, white flesh, used as a vegetable; cucumber."]}], "ಸೌದರ್ಯ": [{"type": "noun", "defs": ["the relation between brothers; the state of being a brother or brothers; brotherhood."]}], "ಸೌದಾಗಾರ": [{"type": "noun", "defs": ["a man who buys and sells commodities for profit; dealer; a trader; a merchant."]}], "ಸೌದಾಮನಿ": [{"type": "noun", "defs": ["a brilliant electric spark discharge in the atmosphere, occurring within a thundercloud, between clouds or between a cloud and the ground; lightning."]}], "ಸೌದಾಮಿನಿ": [{"type": "noun", "defs": ["= ಸೌದಾಮನಿ.", "a flash of lightning and the accompanying thunder; a thunderbolt."]}], "ಸೌದೆ": [{"type": "noun", "defs": ["wood used as fuel; fire-wood."]}, {"type": "noun", "defs": ["a business deal or agreement; a transaction."]}], "ಸೌಧ": [{"type": "noun", "defs": ["a white-washed building.", "a huge or palatial building.", "the quality of being white; whiteness.", "ambrosia, the food of gods.", "wet, soggy earth; slush; mire.", "any grass.", "that which is true; truth."]}], "ಸೌಧರ್ಮ": [{"type": "noun", "defs": ["(jain.) name of the first of the sixteen heavens."]}], "ಸೌಧರ್ಮಕಲ್ಪ": [{"type": "noun", "defs": ["= ಸೌಧರ್ಮ."]}], "ಸೌಧರ್ಮಿಕೆ": [{"type": "noun", "defs": ["courteous behavior; gracious politeness; courtesy.", "the quality of being generous; generosity; nobility of mind; magnanimity."]}], "ಸೌಧರ್ಮೇಂದ್ರ": [{"type": "noun", "defs": ["(jain.) the Indra of the first of the sixteen heavens."]}], "ಸೌನಂದಕ": [{"type": "noun", "defs": ["(jain.) a divine sword, one of the fourteen essential 'jewels' that a jaina emperor must possess."]}], "ಸೌನಿಕ": [{"type": "noun", "defs": ["a man whose work is killing animals or dressing their carcasses for meat; a butcher."]}], "ಸೌಪರ್ಣ": [{"type": "noun", "defs": ["the Brahminee kite, Haliastur indus, an accipitrine bird with long, pointed wings, forked tail and white neck.", "(myth.) the king of birds, which is used by Viṣṇu as his vehicle."]}], "ಸೌಪ್ತಿಕ": [{"type": "adjective", "defs": ["connected with or relating to sleep."]}, {"type": "noun", "defs": ["an assault on people sleeping."]}], "ಸೌಭಾಗ್ಯ": [{"type": "noun", "defs": ["that which is auspicious, causes or brings prosperity, welfare, etc.", "good fortune; good luck.", "the state of a woman whose husband is alive (as opp. to widowhood).", "wealth; riches.", "loveliness; comeliness; fairness; attractiveness.", "a bright-red or slightly orange powder applied by women on their foreheads, as an auspicious sign and also used in worshipping a deity.", "(yoga.) one of the twenty seven yogas.", "(phil.) one of the forty kinds of qualities in the nature of things."]}], "ಸೌಭಾಗ್ಯಂದಳೆ": [{"type": "verb", "defs": ["to become lucky, fortunate, prosperous; to achieve happiness, comfort, good health, etc."]}], "ಸೌಭಾಗ್ಯವತಿ": [{"type": "noun", "defs": ["a woman who is considered to be auspicious.", "a woman whose husband is alive."]}], "ಸೌಭಾಗ್ಯಶಾಲಿ": [{"type": "noun", "defs": ["a fortunate, lucky man; a man who has happiniess, comfort, good health, etc."]}], "ಸೌಭಾಗ್ಯಶಾಲಿನಿ": [{"type": "noun", "defs": ["a fortunate, lucky woman; a woman who has happiniess, comfort, good health, etc."]}], "ಸೌಭಾಗ್ಯಶಾಳಿ": [{"type": "noun", "defs": ["= ಸೌಭಾಗ್ಯಶಾಲಿ."]}], "ಸೌಭಾಗ್ಯಸಂಪನ್ನೆ": [{"type": "noun", "defs": ["= ಸೌಭಾಗ್ಯಶಾಲಿನಿ."]}], "ಸೌಮಂಗಲ್ಯ": [{"type": "noun", "defs": ["= ಸೌಭಾಗ್ಯ - 3.", "the qulality of being auspicious; propitiousness."]}], "ಸೌಮನಸ": [{"type": "noun", "defs": ["a gladness, cheerfulness of mind; a gentle and kind disposition.", "a good natured man.", "(jain.) one of the nine regions above the heavens.", "(jain.) name of one of the heavens."]}], "ಸೌಮನಸವನ": [{"type": "noun", "defs": ["= ಸೌಮನಸ - 3."]}], "ಸೌಮನಸ್ಯ": [{"type": "noun", "defs": ["right understanding; healthy, wholesome nature (of a person).", "gladness; cheerfulness; plesure."]}], "ಸೌಮನಸ್ಸು": [{"type": "noun", "defs": ["= ಸೌಮನಸ - 1."]}], "ಸೌಮಿತ್ರಿ": [{"type": "noun", "defs": ["Lakṣmaṇa, the younger brouther or Rāma."]}], "ಸೌಮ್ಯ": [{"type": "adjective", "defs": ["of or relating to the moon.", "lovely; comely; beautiful.", "gentle or kind in disposition, action or effect; not severe, harsh, bitter, etc.; mild.", "not extreme in any way; moderate; temperate.", "tending to reduce discomfort in warm or hot weather."]}, {"type": "noun", "defs": ["loveliness; comeliness; beauty.", "a handsome man.", "a mild, gentle or patient man.", "an auspicious, lucky thing, event or moment.", "name of the fortythird in the cycle of the sixty years.", "the plant Glycine debilis.", "the plant Ruta Graveolens ( = R. angustifolia) of Rutaceae family; common rue.", "the plant Abrus precatorius of Papilionaceae family.", "(astrol.) the planet Mercury personified as the son of Candra, the moon.", "(astrol.) any propitious planet."]}], "ಸೌಮ್ಯಕ": [{"type": "noun", "defs": ["(archit.) a kind of seat of an idol.", "(archit.) a class of buildings."]}], "ಸೌಮ್ಯತೆ": [{"type": "noun", "defs": ["the quality of being mild, gentle or patient; mildness; gentleness."]}], "ಸೌಮ್ಯವಾರ": [{"type": "noun", "defs": ["Wednesday, the fourth day of the week."]}], "ಸೌಮ್ಯೆ": [{"type": "noun", "defs": ["a mild, gentle and patient woman."]}], "ಸೌಮ್ಯೋಕ್ತಿ": [{"type": "noun", "defs": ["gentle, kind speech.", "the use of a word or phrase that is less expressive or direct but considered less harsh, less distasteful, less offensive, etc. than another; euphemism."]}], "ಸೌರ": [{"type": "adjective", "defs": ["of, pertaining to or having to do with the sun; solar.", "produced by or coming from the sun; solar.", "depending upon the suṇs light or energy; solar.", "fixed or measured by the earth's motion with relation to the sun; solar.", "of, pertaining to or having to do with gods."]}, {"type": "noun", "defs": ["that which is pertaining to the sun.", "a devotee of the Sun-God.", "the system of calculation of days, months and year based on the suṇs movement.", "(astrol.) the Saturn, personified as the son of the Sun-God."]}], "ಸೌರಂಭ": [{"type": "noun", "defs": ["excitement caused by joy, happiness."]}], "ಸೌರಚಾಪ": [{"type": "noun", "defs": ["a luminous arc showing the prismatic colours, appearing opposite the sun during rain, caused by the reflection, double refraction and dispersion of the suṇs rays passing through the drops; a rainbow."]}], "ಸೌರಣೆ": [{"type": "noun", "defs": ["the act of collecting. accumulating; accumulation; collection.", "that which is accumulated, gathered together.", "the act of preparing; preparation.", "the state of being prepared.", "something that is made or kept ready, well-equipped for the purpose, etc.", "a crowd; a multitude; a throng.", "the act or duty of guarding; careful watch; wariness; defence; protection.", "a condition or state of affairs; plight.", "that which completes, complements or brings to perfection.", "the quality of acting or working in a thoughtful, cautious way; carefulness.", "spectacular, pompous display; ostentation."]}], "ಸೌರಪುರಾಣ": [{"type": "noun", "defs": ["one of the eighteen minor purāṇas."]}], "ಸೌರಭ": [{"type": "noun", "defs": ["a pleasing smell or odour; a sweet scent."]}], "ಸೌರಭಂಗೆಡು": [{"type": "verb", "defs": ["(the pleasant smell or odour of something) to be lost."]}], "ಸೌರಭವೆಱು": [{"type": "verb", "defs": ["to have a pleasing smell or odour."]}], "ಸೌರಭೇಯ": [{"type": "noun", "defs": ["an ox or bullock."]}], "ಸೌರಭ್ಯ": [{"type": "noun", "defs": ["= ಸೌರಭ.", "any of the four tastes - bitterness, sour, hotness (as of pepper) and astringent taste.", "a cow."]}], "ಸೌರಭ್ಯವಡು": [{"type": "verb", "defs": ["to emit a pleasing smell."]}], "ಸೌರಭ್ಯವಡೆ": [{"type": "verb", "defs": ["= ಸೌರಭವೆಱು."]}], "ಸೌರಮಾನ": [{"type": "adjective", "defs": ["computing a day, month, year, etc. based on the movements of the sun."]}, {"type": "noun", "defs": ["the system of computing a day, month, year, etc. based on the movements of the sun."]}], "ಸೌರಮಾಸ": [{"type": "noun", "defs": ["a month in a solar calendar year; a solar month."]}], "ಸೌರವರ್ಷ": [{"type": "noun", "defs": ["a solar year."]}], "ಸೌರವ್ಯೂಹ": [{"type": "noun", "defs": ["that portion of our galaxy which is subject to the gravity of the sun; the solar system."]}], "ಸೌರಸ": [{"type": "noun", "defs": ["approval; consent."]}], "ಸೌರಸಂಕ್ರಾಂತಿ": [{"type": "noun", "defs": ["the passage of the sun from one zodiacal sign to another."]}], "ಸೌರಾಷ್ಟ್ರ": [{"type": "noun", "defs": ["the name of a country, forming a part of the present Gujarāt; Sūrat.", "(mus.) in Karnāṭaka system, a rāga (musical mode) derived from the main mode Cakravāka."]}], "ಸೌರಾಷ್ಟ್ರಕ": [{"type": "noun", "defs": ["an alloy consisting chiefly of copper and tin; bronze.", "a kind of (snake, vegetable or mineral) poison."]}], "ಸೌರಾಷ್ಟ್ರಿ": [{"type": "noun", "defs": ["a kind of fragrant soil (of ಸೌರಾಷ್ಟ್ರ).", "a kind of vine of Cucurbitaceae family."]}], "ಸೌರಿ": [{"type": "noun", "defs": ["(correctly, ಶೌರಿ) Křṣṇa or Viṣṇu."]}], "ಸೌರಿಕ": [{"type": "adjective", "defs": ["of the finest or highest kind; perfect; heavenly."]}, {"type": "noun", "defs": ["the abode of gods; the heaven; the paradise.", "(astrol.) Śani, the planet Saturn as personified.", "any spirituous liquor.", "a man who sells spirituous liquors."]}], "ಸೌರಿಯ": [{"type": "noun", "defs": ["a valorous, brave man.", "marked bravery; valour; gallantry; prowess."]}], "ಸೌರಿವಾರ": [{"type": "noun", "defs": ["Saturday, the seventh day of the week."]}], "ಸೌರಿಸು": [{"type": "noun", "defs": ["= ಸೌವರಿಸು."]}], "ಸೌರ್ಯ": [{"type": "noun", "defs": ["= ಸೌರಿಯ."]}, {"type": "adjective", "defs": ["of, pertaining to or having to do with the sun; solar."]}, {"type": "noun", "defs": ["that which is pertaining to the sun."]}], "ಸೌರ್ಯಶಾಳಿ": [{"type": "noun", "defs": ["= ಸೌರಿಯ -1."]}], "ಸೌಲಕ್ಕಿ": [{"type": "noun", "defs": ["(correctly, ಸೋಗಿಲಕ್ಕಿ) rice along with jaggery, a blouse piece, coconut, etc. filled in to the pouch formed by stretching the middle portion of her saree by a woman, as a mark of good wishes and blessings."]}], "ಸೌಲತ್ತು": [{"type": "noun", "defs": ["a right, advantage, favour or immunity specially granted to one; a privilege.", "an opportunity; suitable scope; room.", "a thing granted, reduction allowed etc.; concession."]}], "ಸೌಲಭ್ಯ": [{"type": "noun", "defs": ["the quality of being convenient; fitness or serviceability; convenience.", "anything that adds to one's comfort or saves work; convenience."]}], "ಸೌವತ್ಸರ": [{"type": "noun", "defs": ["(correctly, ಸಂವತ್ಸರ) 1. a period of twelve months or three hundred sixty five days; a year.", "a period of twelve months beginning from a particular day; a calendar year."]}], "ಸೌವನೆ": [{"type": "adverb", "defs": ["with a splitting sound."]}], "ಸೌವರಣೆ": [{"type": "noun", "defs": ["(correctly, ಸಂವರಣೆ) 1. the act of collecting. accumulating; accumulation; collection.", "that which is accumulated, gathered together.", "the act of preparing; preparation.", "the state of being prepared.", "something that is made or kept ready, well-equipped for the purpose, etc.", "a crowd; a multitude; a throng.", "the act or duty of guarding; careful watch; wariness; defence; protection.", "a condition or state of affairs; plight.", "that which completes, complements or brings to perfection.", "the quality of acting or working in a thoughtful, cautious way; carefulness.", "spectacular, pompous display; ostentation."]}], "ಸೌವರಿಸು": [{"type": "verb", "defs": ["(correctly, ಸಂವರಿಸು) 1. to gather; to collect; to accumulate.", "to come together in a large number; to crowd.", "to make ready; to make something suitable (for specific purpose).", "to become ready; to be ready for; to be equipped suitably for.", "to guard (something) against danger, harm; to watch over and protect.", "to guard oneself against.", "to alleviate or lessen the grief, sorrow or disappointment of; to give solace or comfort.", "to make something free from defects, faults; to remove deficiencies, shortcomings.", "to adjust oneself to a condition, situation, place, etc.", "to keep, place (something on, above, at or in such and such a manner, etc.).", "to arrange in proper or tidy manner.", "to be excited from joy.", "to plan a strategy or strategies; to strategise.", "to bring about or succeed in accomplishing, despite difficulty or hardship; to manage.", "to recover one's balance, consciousness, etc.", "to watch over; to be careful in handling."]}], "ಸೌವರ್ಚಲ": [{"type": "noun", "defs": ["impure carbonate of soda; hydrated sodium carbonate; natron.", "a kind of preparation made by mixing gooseberries and salt."]}], "ಸೌವರ್ಚಲವಣ": [{"type": "noun", "defs": ["= ಸೌವರ್ಚಲ - 1."]}], "ಸೌವರ್ಚಳ": [{"type": "noun", "defs": ["= ಸೌವರ್ಚಲ."]}], "ಸೌವರ್ಣ": [{"type": "adjective", "defs": ["= ಸೌವರ್ಚಲ."]}, {"type": "noun", "defs": ["made of or containing gold; golden."]}], "ಸೌವರ್ಣಿ": [{"type": "noun", "defs": ["gold."]}], "ಸೌವಸ್ತಿಕ": [{"type": "adjective", "defs": ["indicative of favor; auspicious; propitious."]}, {"type": "noun", "defs": ["a man who leads others (in matters of righteousness, spiritual matters, etc.); a priest."]}], "ಸೌವಾಗ್ಯ": [{"type": "noun", "defs": ["(correctly, ಸೌಭಾಗ್ಯ) 1. that which is auspicious, causes or brings prosperity, welfare, etc.", "good fortune; good luck."]}], "ಸೌವಾದ": [{"type": "noun", "defs": ["approval; assent; consent."]}], "ಸೌವಿದ": [{"type": "noun", "defs": ["a superintendent of a harem in a palace."]}], "ಸೌವಿದಲ್ಲ": [{"type": "noun", "defs": ["= ಸೌವಿದ."]}], "ಸೌವೀರ": [{"type": "noun", "defs": ["sour gruel.", "the fruit of jujube (Ziziphud msutiyisns ( = Z. jujuba).", "name of a country lying beside the river Sindhu.", "a man belonging to this country.", "a silvery-white, brittle, nonmetallic chemical element; antimony (symbol: Sb).", "(mus.) in Karnāṭaka system, a rāga (musical mode) derived from the main mode Suvarṇāngi."]}], "ಸೌವೀರಾಂಜನ": [{"type": "noun", "defs": ["a kind of collyrium made using antimony."]}], "ಸೌವೀರಿ": [{"type": "noun", "defs": ["= ಸೌವೀರ - 6."]}], "ಸೌಶೀಲ್ಯ": [{"type": "noun", "defs": ["good conduct; righteous conduct."]}], "ಸೌಷಿರ": [{"type": "noun", "defs": ["a kind of oral disease, characterised by excess production of saliva."]}], "ಸೌಷ್ಠವ": [{"type": "noun", "defs": ["excellence; superior goodness.", "marvelous beauty.", "the quality of being capable; practical ability; capability.", "the quality of being fit, proper, appropriate.", "extreme skilfulness or cleverness.", "absence of flaw, defect etc.; flawlessness."]}], "ಸೌಸವ": [{"type": "noun", "defs": ["a pleasing smell or odour."]}], "ಸೌಸ್ಥಿತ್ಯ": [{"type": "noun", "defs": ["the state or quality of not moving; fixedness."]}], "ಸೌಹಾರ್ದ": [{"type": "noun", "defs": ["the ability to share in another's emotions, thoughts or feelings sympathetically.", "courteous behavior; gracious politeness; courtesy."]}], "ಸೌಹಿತ್ಯ": [{"type": "noun", "defs": ["complete satisfaction."]}], "ಸೌಹೃದ": [{"type": "noun", "defs": ["= ಸೌಹಾರ್ದ - 1.", "a friendly relation or intimacy; friendship."]}], "ಸೌಳಕಾರ": [{"type": "noun", "defs": ["= ಸೌಳು - 3."]}], "ಸೌಳಗೆ": [{"type": "adverb", "defs": ["with a splitting sound."]}], "ಸೌಳನೆ": [{"type": "adverb", "defs": ["= ಸೌಳಗೆ."]}], "ಸೌಳು": [{"type": "noun", "defs": ["that which is somewhat salty.", "the quality of being salty; brackishness.", "sodium chloride, NaCl, a white, crystalline substance with a characteristic taste, found in natural beds, in sea water, etc.; salt.", "a tract of land that is rich in salts as sodium chloride or potassium nitrate.", "the soil of this type of land.", "water tasting or containing water; salty water."]}], "ಸೌಳುಗಿಡ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಸೌಳುನೀರು": [{"type": "noun", "defs": ["water that is rich in salts as sodium chloride or potassium nitrate; salt-water."]}], "ಸೌಳುನೆಲ": [{"type": "noun", "defs": ["a tract of land that is rich in salts as sodium chloride or potassium nitrate."]}], "ಸೌಳುಪ್ಪು": [{"type": "noun", "defs": ["the form of potassium nitrate, KNO3, that occurs naturally, used in the manufacture of fireworks, fluxes, gunpowder, etc.; niter; saltpeter."]}], "ಸೌಳುಮಣ್ಣು": [{"type": "noun", "defs": ["the soil that is rich in salts as sodium chloride or potassium nitrate."]}], "ಸೌಳುವಣ್ಣು": [{"type": "noun", "defs": ["= ಸೌಳುಮಣ್ಣು."]}], "ಸೌಳ್ನೆಲ": [{"type": "noun", "defs": ["= ಸೌಳುನೆಲ."]}], "ಸ್ಕಂದ": [{"type": "noun", "defs": ["Ṣaṇmukha, the son of Śiva.", "Śiva.", "a ruler; a king.", "the physical structure and material substance of an animal including human being; the body.", "either of the bank of a river.", "nervous disorder as epilepsy, convulsions, etc. that affect children.", "a clever, intelligent man.", "mercury, a heavy, silver-white, highly toxic metallic element (symbol: Hg).", "the act of hopping or jumping."]}], "ಸ್ಕಂಧ": [{"type": "noun", "defs": ["the upper part of the back or region from the neck to the shoulder-joint, in humans; the shoulder.", "corresponding part of an elephant.", "the stem or trunk of a tree (from the ground to that part where the branches begin).", "a troop or division of an army consisting of elephants, horses, and foot-soldiers.", "a chapter or section of a book.", "a large number of persons, animals or things gathered together; a multitude.", "a number of people or things grouped together because of certain likenesses or common traits; kind; sort; a category; a class.", "a ruler; a king.", "a learned and wise man.", "(pros.) a particular form of ārya metre having 64 syllables in each verse.", "(buddh.) the five constituent elements of being (viz. bodily form, sensation, perception, aggregate of formations and consciousness or thought-faculty)."]}], "ಸ್ಕಂಧಕ": [{"type": "noun", "defs": ["= ಸ್ಕಂಧ - 10."]}], "ಸ್ಕಂಧವಾಹಕ": [{"type": "noun", "defs": ["a draughting ox."]}], "ಸ್ಕಂಧಸಂಧಿ": [{"type": "noun", "defs": ["the joint connecting the arm with the body; the shoulder joint."]}], "ಸ್ಕಂಧಾವಾರ": [{"type": "noun", "defs": ["an army or a division of an army.", "a military camp.", "the capital of a kingdom, state or nation."]}], "ಸ್ಕಂಧೋಪನಯ": [{"type": "noun", "defs": ["a kind of treaty or alliance to maintain peace; a peace offering."]}], "ಸ್ಕಂಭ": [{"type": "noun", "defs": ["a rigid support; a prop.", "a pillar; a column.", "he who supports all the beings and the universe; the Supreme Being."]}], "ಸ್ಕನ್ನ": [{"type": "adjective", "defs": ["slipped or fallen down.", "trickled down.", "emitted.", "sprinkled.", "gone; gone away.", "dried; that has lost moisture."]}, {"type": "noun", "defs": ["that which has fallen, slipped down."]}], "ಸ್ಕಾಂದ": [{"type": "adjective", "defs": ["relating to Ṣaṇmukha."]}], "ಸ್ಕಾಂದಪುರಾಣ": [{"type": "noun", "defs": ["one of the eighteen major Purāṇas."]}], "ಸ್ಕೂಲು": [{"type": "noun", "defs": ["an institution where instruction is given; a school or college."]}], "ಸ್ಖಲನ": [{"type": "noun", "defs": ["an act of stumbling; an instance of tripping or one's step in walking, running etc.", "a falling down or an instance of this.", "an instance of being defeated.", "a stopping or being stopped; a stoppage.", "a mistake; an error; a blunder.", "a missing of one's way, course of action or thoughts, etc.", "a walking on the both the palms and knees (as the babies do in pre-walking stage)."]}], "ಸ್ಖಲಿತ": [{"type": "adjective", "defs": ["stumbling; faltering.", "slipping; skidding; sliding.", "shivering; trembling.", "misdone; wrongly done.", "holding back from indecision; hesitating; vacillating.", "trickled; dripped; dribbled.", "obstructed; hindered; stopped.", "gone astray."]}, {"type": "noun", "defs": ["a mistake; a wrong deed; a blunder.", "the act of cheating; an instance of cheating or being cheated.", "a secret plan to achieve an unlawful end; an underhand plot; an evil design; machination.", "a man who is trembling from fear.", "(dance.) a particular movement in which one leg is lifted and swung with the front portion of the foot raised, and the heel is placed on ground and moving one arm correspondingly, holding the little finger stretched upward, other three fingers stretched and bent forward and thumb held close to the forefinger.", "(dance.) a breathing hard (as from sorrow, disease or while dying)."]}], "ಸ್ಖಲಿತಗತಿ": [{"type": "noun", "defs": ["a walking, moving unsteadily."]}], "ಸ್ಖಲಿತವಚನ": [{"type": "noun", "defs": ["a breaking of one's promise; violation of one's own vow.", "he who has failed to carry out his promise."]}], "ಸ್ಖಲಿತಾಂತರಂಗ": [{"type": "noun", "defs": ["a man who is emotionally wounded."]}], "ಸ್ಖಳನ": [{"type": "noun", "defs": ["= ಸ್ಖಲನ."]}], "ಸ್ಖಳಿತ": [{"type": "adjective", "defs": ["= ಸ್ಖಲಿತ1."]}, {"type": "noun", "defs": ["= ಸ್ಖಲಿತ2."]}], "ಸ್ಖಾಲಿತ್ಯ": [{"type": "noun", "defs": ["an act of falling, slipping or stumbling down.", "a departure from what is right, correct, righteous.", "an error, mistake; a blunder."]}], "ಸ್ತಂಬ": [{"type": "noun", "defs": ["a stalk of hay.", "a bunch or cluster of flowers, fruits, etc.", "a large number of plants grown together or a thick bush.", "a post for tying elephants.", "a pillar or a column.", "a hill or mountain."]}], "ಸ್ತಂಬಕರಿ": [{"type": "noun", "defs": ["a small, hard seed or seedlike fruit, esp. a seed or grain of a cereal grass; a corn; a grain.", "rice in the husk; paddy."]}], "ಸ್ತಂಬೇರಮ": [{"type": "noun", "defs": ["an elephant (Elephas maximus)."]}], "ಸ್ತಂಭ": [{"type": "noun", "defs": ["the quaity or state of being rigid, firm, immovable.", "the act of stopping, preventing from going ahead, spreading, etc.", "a controlling or subjugating.", "a pillar; a column.", "a stem or trunk (as of a tree).", "a regid support; a prop.", "a mystical act of preventing, controlling or making inactive.", "any of the vertical sections of printed matter that are side by side on a page, separated by a rule or blank space; a column.", "(rhet.) the condition or feeling of swooning, fainting."]}], "ಸ್ತಂಭಕ": [{"type": "adjective", "defs": ["preventing; controlling or inactivating."]}, {"type": "noun", "defs": ["= ಸ್ತಂಭ - 9."]}], "ಸ್ತಂಭಕ್ರೀಡಿತ": [{"type": "noun", "defs": ["(dance.) a particular type of movement of legs, in which the side of one foot kept across is touched often by the sole of another feet."]}], "ಸ್ತಂಭದೀಪಿಕೆ": [{"type": "noun", "defs": ["a lamp at the top of a post or pillar."]}], "ಸ್ತಂಭನ": [{"type": "noun", "defs": ["a stopping, arresting or checking.", "the act of weakening or inactivating (another).", "the act of calming, tranquilising or soothing; tranquilisation; pacification.", "a stiffening, making rigid or immovable.", "the act or an instance of providing (something) with a rigid support.", "name of one of the five arrows of Manmatha, the God of Love.", "magic with an evil pupose; sorcery.", "(rhet.) the condition or feeling of swooning; fainting."]}], "ಸ್ತಂಭನಗೈ": [{"type": "verb", "defs": ["to stop, prevent, arrest."]}], "ಸ್ತಂಭನಾಕ್ಷರ": [{"type": "noun", "defs": ["a mystical hymn supposed to have the power of stopping and stupefying an enemy."]}], "ಸ್ತಂಭನೆ": [{"type": "noun", "defs": ["= ಸ್ತಂಭನ - 1, 2, 3, 4 & 5."]}], "ಸ್ತಂಭಿತ": [{"type": "adjective", "defs": ["stopped; obstructed; arrested.", "inactivated; stupefied."]}, {"type": "noun", "defs": ["stiff and rigid breath as in discharging missiles."]}], "ಸ್ತಂಭಿನಿ": [{"type": "noun", "defs": ["an obstructing another's way by a magical art."]}], "ಸ್ತಂಭಿಸು": [{"type": "verb", "defs": ["to fix a post, pillar firmly in the ground.", "to make firm, rigid or tight.", "to make inactive; to inactivate.", "to stop; to prevent from moving, spreading or acting.", "to be brought into a state of stupor; to be stunned, stupefied."]}], "ಸ್ತಂಭೀಭೂತ": [{"type": "adjective", "defs": ["stupefied; stunned; overwhelmed."]}, {"type": "noun", "defs": ["a man who has lost his consciousness (for a temporary period)."]}], "ಸ್ತಂಭೀಭೂತೆ": [{"type": "noun", "defs": ["a woman who has lost her consciousness (for a temporary period)."]}], "ಸ್ತನ": [{"type": "noun", "defs": ["either of two milk-secreting glands protruding from the upper, front part of a woman's body; the breast.", "the small protuberance on a breast through which, in the women, the milk passes in suckling the baby; the nipple."]}], "ಸ್ತನಂಧಯ": [{"type": "noun", "defs": ["an unweaned child; a suckling."]}], "ಸ್ತನಪಯೋಗಂಧಿ": [{"type": "noun", "defs": ["the plant Alternanthera sessilis of Amaranthaceae family."]}], "ಸ್ತನಪಾನ": [{"type": "noun", "defs": ["= ಸ್ತನ್ಯಪಾನ."]}], "ಸ್ತನಪಾನಗುಡು": [{"type": "verb", "defs": ["to suckle a child."]}], "ಸ್ತನಯಿತ್ನು": [{"type": "noun", "defs": ["a cloud.", "a thunder."]}], "ಸ್ತನಿಕ": [{"type": "noun", "defs": ["= ಸ್ತಾನೀಕ."]}], "ಸ್ತನಿತ": [{"type": "adjective", "defs": ["sounded; roared.", "roaring; crying in a rumbling voice."]}, {"type": "noun", "defs": ["a loud, explosive, resounding noise produced by the explosive expansion of air heated by a lightning discharge; a thunder.", "any loud noise.", "the sound made by clapping with both the hands.", "the sound produced by pulling and releasing suddenly the string of a bow.", "(jain.) a class of gods."]}], "ಸ್ತನಿತಾಮರ": [{"type": "noun", "defs": ["= ಸ್ತನಿತ2 - 5."]}], "ಸ್ತನ್ಯ": [{"type": "noun", "defs": ["the breast milk."]}], "ಸ್ತನ್ಯಪಾನ": [{"type": "noun", "defs": ["the act of sucking at the breast."]}], "ಸ್ತಬಕ": [{"type": "noun", "defs": ["a bunch of flowers, leaves or fruits.", "a large number of persons or things, esp. when gathered together or considered as a unit; a multitude; a host.", "a feather of a peacock.", "a chapter or division of a book."]}], "ಸ್ತಬ್ಧ": [{"type": "adjective", "defs": ["firmly fixed.", "not moving, shaking; still.", "lacking normal intelligence; foolish."]}, {"type": "noun", "defs": ["an adamant, ruthless, cruel man.", "(dance.) a posture of the thighs, in which thighs are not shaken."]}], "ಸ್ತಬ್ಧಚಿತ್ರ": [{"type": "noun", "defs": ["a representation of a picture, statue, scene, etc., (with or without persons); a tableau."]}], "ಸ್ತಬ್ಧತ್ವ": [{"type": "noun", "defs": ["the quality or fact of being unmoved, not shaking; stillness.", "the quality or state of being immobile; immobility.", "the quality of being unyielding, not giving in or relenting; adamancy.", "harshness; roughness."]}], "ಸ್ತರ": [{"type": "adjective", "defs": ["spreading; distriuting over a surface."]}, {"type": "noun", "defs": ["that which is unrolled and spread (as a mat, bed, etc.).", "a horizontal layer or section of material, esp. any of several lying one upon another; a stratum.", "the distance between two parallel planes.", "a period, level or degree in a process of development, growth or change; a stage.", "a class or division in a scheme of classification; a category."]}], "ಸ್ತವ": [{"type": "noun", "defs": ["the act of praising; praise.", "a hymn in praise of (a deity)."]}], "ಸ್ತವಂಗೆಯ್": [{"type": "verb", "defs": ["= ಸ್ತುತಿಸು."]}], "ಸ್ತವಕ": [{"type": "noun", "defs": ["a bunch of flowers, leaves or fruits.", "a chapter or division of a book.", "a large number of persons or things, esp. when gathered together or considered as a unit; a multitude; a host.", "the act of praising, extolling.", "one who praises, laudes often hypoerbolically; a sycophant."]}], "ಸ್ತವನ": [{"type": "noun", "defs": ["= ಸ್ತವ - 2."]}], "ಸ್ತವನೀಯ": [{"type": "adjective", "defs": ["worthy of praise; laudable; commendable."]}, {"type": "noun", "defs": ["that which is laudable."]}], "ಸ್ತಳನಿಬಂಧಿ": [{"type": "noun", "defs": ["(arch.) a kind of local tax."]}], "ಸ್ತಾನ": [{"type": "noun", "defs": ["a position (in society, professional field, etc.); a rank.", "a person who originally belongs to or the oldest inhabitant of a place.", "a temple of a bhūta, a demi-god."]}]}