{"ನಾತಿಮಾನಿತೆ": [{"type": "noun", "defs": ["the quality of not being overbearing or excessively proud."]}], "ನಾತು": [{"type": "noun", "defs": ["= ನಾತ."]}], "ನಾತೆ": [{"type": "noun", "defs": ["connection of persons by blood, marriage, etc.; kinship; relation.", "a cause that brings or motivates to bring a result."]}], "ನಾತ್ಮಕ": [{"type": "adjective", "defs": ["lacking in positive character or quality; negative.", "containing, expressing or implying a denial or refusal; that says “no” ; negative."]}], "ನಾತ್ಯುಷ್ಣ": [{"type": "adjective", "defs": ["not very hot."]}], "ನಾಥ": [{"type": "noun", "defs": ["a master; a protector; a patron; a ruler; a lord.", "a man as related to a woman whom he is married to; a husband.", "ನಾಥನಾದರೂ ಭೂತ ಬಿಡದು nātanādarū bhūta biḍadu (prov.) destiny never differentiates between the lord and the labour."]}], "ನಾಥತ್ವ": [{"type": "noun", "defs": ["the quality, office, status etc. of a lord, master; lordship; mastership."]}], "ನಾಥದೀಕ್ಷೆ": [{"type": "noun", "defs": ["a religious initiation a man receives while taking up Nātha sampradāya, a bhakti tradition in Mahārāṣṭra."]}], "ನಾಥವತಿ": [{"type": "noun", "defs": ["a woman whose husband is alive."]}], "ನಾಥಸಂಪ್ರದಾಯ": [{"type": "noun", "defs": ["a Bhakti tradition started by Adinātha, in Mahārāṣṭra."]}], "ನಾದ": [{"type": "noun", "defs": ["that which is perceived through the auditory nerves; the auditory sensation; sound.", "any auditory effect that is distinctive or characteristic of its source as a musical note, human voice, etc.", "(phil.) one of the modes of manifestation or a state of the Supreme.", "(myth.) one of the hells.", "an excessive interest in or enthusiasm for something; craze; monomania."]}, {"type": "noun", "defs": ["the plant Rourea santaloides of Connaraceae family; naval wort; (?)."]}], "ನಾದಕಟ್ಟು": [{"type": "noun", "defs": ["an adjusting of a musical instrumenṭs strings and other auxiliary parts to get full and proper sounds."]}], "ನಾದಗೈ": [{"type": "verb", "defs": ["to make a sound or sound.", "to play or pluck a musical instrument to produce a sound."]}], "ನಾದಚಕ್ರ": [{"type": "noun", "defs": ["(vīr.) the primordial power of Śiva, that is impelling the universe onward."]}], "ನಾದತ್ರಯ": [{"type": "noun", "defs": ["(phil.) the sounds of three mystic syllables which in union becomes \"Ōm', considered as the manifestation of the Supreme."]}], "ನಾದದಂಡ": [{"type": "noun", "defs": ["a stick for beating a drum or drum-like percussion instruments; a drum-stick."]}], "ನಾದಧ್ವನಿ": [{"type": "noun", "defs": ["the sense of a literary work suggested indirectly, which is different from the literal sense."]}], "ನಾದನಾಮಕ್ರಿಯೆ": [{"type": "noun", "defs": ["(mus.) a mode in Karnāṭaka system, derived from the main mode MāyāMāḷavagauḷa."]}], "ನಾದಪೂರ್ಣ": [{"type": "adjective", "defs": ["characterised by proper, melodious, harmonious and full (musical) sound."]}], "ನಾದಪ್ರಪಂಚ": [{"type": "noun", "defs": ["the exclusive sphere of music or musical sounds (which transcends the existence of the mundane world)."]}], "ನಾದಬ್ರಹ್ಮ": [{"type": "noun", "defs": ["the divine music personified as the Supreme Being."]}], "ನಾಧಭರಿತ": [{"type": "adjective", "defs": ["having the nature of music; melodious or harmonious."]}], "ನಾದಮಯೆ": [{"type": "noun", "defs": ["Sarasvati, who is the embodiment of divine music."]}], "ನಾದಮೂರ್ತಿ": [{"type": "noun", "defs": ["Śiva, who is the embodiment of three divine or mystical syllables which, in union, sound \"ಓಮ್\"."]}], "ನಾದರಾಮಕ್ರಿಯೆ": [{"type": "noun", "defs": ["= ನಾದನಾಮಕ್ರಿಯೆ."]}], "ನಾದವತಿ": [{"type": "noun", "defs": ["(mus.) the first quarter tone of the note ನಿ (niṣāda), the seventh of the seven notes (in the ascending order, i.e. B in the C major)."]}], "ನಾದವರಾಂಗಿಣಿ": [{"type": "noun", "defs": ["(mus.) a mode in Karnāṭaka system, derived from the main mode Kharaharapriya."]}], "ನಾದವೇತ್ತ": [{"type": "noun", "defs": ["a man who has discreet knowledge of acoustics."]}], "ನಾದವೇದಿ": [{"type": "noun", "defs": ["= ನಾದವೇತ್ತ."]}], "ನಾದಶುದ್ಧಿ": [{"type": "noun", "defs": ["purity of the musical notes."]}], "ನಾದಸಂಪುಟ": [{"type": "noun", "defs": ["a chamber in a musical instrument, as the body of a violin, for increasing the sonority of its tone; a sound-box."]}], "ನಾದಸ್ತಂಭ": [{"type": "noun", "defs": ["a small post placed inside a musical instrument, as a violin, bridging the upper and bottom portions."]}], "ನಾದಸ್ವರ": [{"type": "noun", "defs": ["a single-reed wind instrument with a long wooden tube played by means of holes, having a range of nearly three octaves and a high, penetrating tone, used on auspicious occasions besides rendering independently; the South-Indian oboe."]}], "ನಾದಾತ್ಮಕ": [{"type": "adjective", "defs": ["caused by, made of, filled with musical sound or sounds."]}], "ನಾದಾನ": [{"type": "noun", "defs": ["a man lacking ordinary quickness and keenness of mind; a stupid fellow."]}], "ನಾದಾನುಸಂಧಾನ": [{"type": "noun", "defs": ["a meditating on music and musical phrases and their sounds."]}], "ನಾದಾರ್": [{"type": "adjective", "defs": ["= ನಾದಾರು1."]}, {"type": "noun", "defs": ["= ನಾದಾರು2."]}], "ನಾದಾರ": [{"type": "adjective", "defs": ["= ನಾದಾರು1."]}, {"type": "noun", "defs": ["= ನಾದಾರು2."]}], "ನಾದಾರಚೀಟಿ": [{"type": "noun", "defs": ["the declaration of a person that he or she is bankrupt, and which is duly endorsed by a court of law."]}], "ನಾದಾರಿ": [{"type": "adjective", "defs": ["= ನಾದಾರು1."]}, {"type": "noun", "defs": ["= ನಾದಾರು2."]}], "ನಾದಾರು": [{"type": "adjective", "defs": ["utterly poor; insolvent."]}, {"type": "noun", "defs": ["an utterly poor or insolvent man."]}], "ನಾದಿಕೆ": [{"type": "noun", "defs": ["the quality or condition of being damp, moistened or wet; dampness; moisture; dampness."]}], "ನಾದಿಗ": [{"type": "noun", "defs": ["= ನಾಪಿತ."]}], "ನಾದಿನಿ": [{"type": "noun", "defs": ["an younger sister of one's husband.", "the wife of one's younger brother.", "the daughter of one's maternal uncle.", "an younger sister of one's wife."]}], "ನಾದಿಷ್ಟ": [{"type": "noun", "defs": ["a pleasure seeking man; a man inclined to enjoy the worldly life well."]}], "ನಾದಿಸು": [{"type": "verb", "defs": ["to place or keep in liquid in order to saturate thoroughly; to soak.", "to wet thoroughly; to saturate or drench."]}, {"type": "verb", "defs": ["to make a sound.", "to produce a sound from a musical instrument.", "to speak; to express audibly (speech sounds, syllables, words, thoughts, etc.)."]}], "ನಾದು": [{"type": "verb", "defs": ["to mix and work (dough, clay, etc.) into a pliable mass by folding over, pressing, and squeezing.", "to hit repeatedly with a hard, heavy blows or impact."]}, {"type": "verb", "defs": ["to place or keep in liquid in order to saturate thoroughly; to soak.", "to wet thoroughly; to saturate or drench.", "to become wet or drenched.", "to become liquid; to be liquefied; to melt.", "to soften; to make gentle and tender."]}, {"type": "noun", "defs": ["an excessive interest in or enthusiasm for some one thing; craze; monomania."]}], "ನಾದುನಿ": [{"type": "noun", "defs": ["= ನಾದಿನಿ."]}], "ನಾದುರಸ್ತ": [{"type": "adjective", "defs": ["= ನಾದುರಸ್ತು1."]}, {"type": "noun", "defs": ["= ನಾದುರಸ್ತು2."]}], "ನಾದುರಸ್ತಿ": [{"type": "adjective", "defs": ["= ನಾದುರಸ್ತು1."]}, {"type": "noun", "defs": ["= ನಾದುರಸ್ತು2."]}], "ನಾದುರಸ್ತು": [{"type": "adjective", "defs": ["that has gone out of order; that is damaged and needing repair."]}, {"type": "noun", "defs": ["the condition of being out of order; want of repairs."]}], "ನಾದೆ": [{"type": "noun", "defs": ["= ನಾದಮಯೆ."]}], "ನಾದೇಯ": [{"type": "adjective", "defs": ["of, relating to , depending on, derived from etc. a river."]}, {"type": "noun", "defs": ["= ನಾದೇಯಿ.", "that which is got from, born in, derived from a river."]}], "ನಾದೇಯಿ": [{"type": "noun", "defs": ["the rattan Calamus viminalis (fasciculata) of Fasciculata of Arecaceae family; water cane.", "the tree Syzygium hemisphaericum (= Eugenia hemisphaerica) of Myrtaceae family.", "its plum.", "the plant Sesbania sesban (= S. Aegyptiaca) of Papilionaceae family.", "the hibiscus plant Hibiscus rosa-sinensis of Malvaceae family.", "its red flower; china rose."]}], "ನಾದೋತ್ತರಿ": [{"type": "noun", "defs": ["(mus.) a mode."]}], "ನಾದೋಪಾಸಕ": [{"type": "noun", "defs": ["he who is single-mindedly devotd to music."]}], "ನಾದೋಪಾಸನೆ": [{"type": "noun", "defs": ["a single-minded devotion to music."]}], "ನಾನ್": [{"type": "verb", "defs": ["= ನಾನು1."]}, {"type": "pronoun", "defs": ["= ನಾನು2."]}], "ನಾನಡ್ಡಿಕೆ": [{"type": "noun", "defs": ["a kind of ornament, made of crescent-shaped gold pieces, worn round the neck by women."]}], "ನಾನಲ್": [{"type": "noun", "defs": ["the grass Saccharum spontaneum of Poaceae family the reed of which is used for making thatches; thatch grass.", "the grass Saccharum fuscum of Poaceae family.", "its reed, used for writing with; a reed-pen.", "a marshy land abounding in these reeds."]}], "ನಾನಾ": [{"type": "adjective", "defs": ["of different kinds, varieties, types, etc."]}], "ನಾನಾತ್ವ": [{"type": "noun", "defs": ["the condition of being plural or numerous; plurality.", "the quality, state, fact or an instance of being diverse; difference; diversity."]}], "ನಾನಾದೇಶಿ": [{"type": "noun", "defs": ["= ನಾನಾದೇಸಿ."]}], "ನಾನಾದೇಸಿ": [{"type": "noun", "defs": ["a group of merchants (usu. moving together for purpose of selling goods in different places)."]}], "ನಾನಾಲಿಂಗ": [{"type": "noun", "defs": ["non-conformity of the genders of two things compared in a simile."]}], "ನಾನಾವಚನ": [{"type": "noun", "defs": ["non-conformity of the grammatical numbers of two things compared in a simile."]}], "ನಾನು": [{"type": "verb", "defs": ["to become completely wet; to be soaked in (water or any other liquid).", "(fig.) to become gentle, tender or softened in feeling by pity, sympathy, love, affection, etc.; to melt."]}, {"type": "pronoun", "defs": ["(the nominative form of the first person) the person speaking or writing.", "the self; the individual as self-aware.", "egotism; conceit."]}], "ನಾನೂರು": [{"type": "adjective", "defs": ["four times hundred."]}, {"type": "noun", "defs": ["the cardinal number four hundred; 400."]}], "ನಾನೂಱು": [{"type": "adjective", "defs": ["= ನಾನೂರು1."]}, {"type": "noun", "defs": ["= ನಾನೂರು2."]}], "ನಾನೆತ": [{"type": "noun", "defs": ["a species ofserpent, the Wana Kogli of Russel."]}], "ನಾನ್ಕಾರ್": [{"type": "noun", "defs": ["(archaic.) an allowance or payment made to the officer who would collect revenue."]}], "ನಾನ್ನುಡಿ": [{"type": "noun", "defs": ["a short, catchy saying, usu. of unknown origin, that expresses effectively some commonplace truth or useful thought; an adage; a saw; a proverb.", "a widely talked about subject."]}], "ನಾನ್ಪರ್ವರಿಷ್": [{"type": "noun", "defs": ["a regular payment made by the government for upbringing of talented children.", "a monthly pension paid to the widow of a soldier died in a war."]}], "ನಾಪತ್ತೆ": [{"type": "noun", "defs": ["a being absent, missing; the fact of not being present."]}], "ನಾಪಾಸು": [{"type": "noun", "defs": ["a failing to pass; failure."]}], "ನಾಪಿಕ": [{"type": "noun", "defs": ["failure of crop."]}], "ನಾಪಿತ": [{"type": "noun", "defs": ["a man whose work is dressing hair, shaving and trimming beards etc.; a barber."]}], "ನಾಪಿತಾನಿ": [{"type": "noun", "defs": ["a son or daughter of a barber."]}], "ನಾಪಿತಿ": [{"type": "noun", "defs": ["the wife of a barber.", "a woman belonging to the barberś caste."]}], "ನಾಪಿತೆ": [{"type": "noun", "defs": ["= ನಾಪಿತಿ."]}], "ನಾಬತ್ತು": [{"type": "noun", "defs": ["a kind of crystallised sugar made by boiling and evaporating cane sugar."]}], "ನಾಭಸ": [{"type": "adjective", "defs": ["of or in the sky; moving or appearing in the sky; celestial; heavenly."]}], "ನಾಭಿ": [{"type": "noun", "defs": ["the depression in the centre of the surface of the abdomen indicating the point of attachment of the umbilical cord to the embryo; navel; umbilicus.", "the central point or middle of any thing or place.", "the hub of a wheel; the nave.", "the point where rays of light, heat, etc. or waves of sound come together or from which they spread or seem to spread; focus.", "the plant Aconitum heterophyllum of Ranunculaceae family, the non-poisonous rhizome of which is regarded as antiperiodic and tonic.", "a close relation from paternal side.", "a king of kings; a supreme ruler; an emperor.", "a man belonging to the military caste.", "a substance with a strong, penetrating odour, obtained from a small sac (musk bag) under the skin of the abdomen in the male musk-deer; musk.", "(dance.) a sphere, on and around the navel, as one of the thirteen spheres of hand movement."]}], "ನಾಭಿಕ": [{"type": "noun", "defs": ["the plant Achyranthes atropurpurea."]}], "ನಾಭಿಕಮಲ": [{"type": "noun", "defs": ["(myth.) the lotus flower in the navel of Viṣṇu; from which Brahma, the Creator of the universe, was born."]}], "ನಾಭಿಕೂಪ": [{"type": "noun", "defs": ["the depression of the navel."]}], "ನಾಭಿಖಂಡನ": [{"type": "noun", "defs": ["= ನಾಭಿನಿಕರ್ತನ."]}], "ನಾಭಿಗೋಲ್": [{"type": "noun", "defs": ["an ancient unit of linear measure, approx. equal to two cubits."]}], "ನಾಭಿಜ": [{"type": "noun", "defs": ["(myth.) Brahma, the Creator of the universe, who was born from the lotus flower in the navel of Viṣṇu."]}], "ನಾಭಿತಾನ": [{"type": "noun", "defs": ["(mus.) a gamut of notes (being less than seven in numbers) in the lower octave."]}], "ನಾಭಿದಘ್ನ": [{"type": "adjective", "defs": ["(said of quantifying depth) from the feet to the navel."]}, {"type": "noun", "defs": ["the distance from one's navel to the feet."]}], "ನಾಭಿನಗ": [{"type": "noun", "defs": ["(Jain.) one of the mythological mountains, Mēru."]}], "ನಾಭಿನಾಲ": [{"type": "noun", "defs": ["= ನಾಭಿನಾಳ."]}], "ನಾಭಿನಾಳ": [{"type": "noun", "defs": ["a tough, cordlike structure connecting the navel of a foetus to the placenta and transporting nourishment to, and remove waste from, the foetus; the umbilical cord."]}], "ನಾಭಿನಿಕರ್ತನ": [{"type": "noun", "defs": ["the removal of umbilical cord from the new born baby, immediately after its birth."]}], "ನಾಭಿಮಂಡಲ": [{"type": "noun", "defs": ["the circular depression in the middle of the abdomen of human beings."]}], "ನಾಭಿಮೂಲ": [{"type": "noun", "defs": ["the portion of the body just below the navel."]}], "ನಾಭಿಮೂಳ": [{"type": "noun", "defs": ["= ನಾಭಿಮೂಲ."]}], "ನಾಭಿಶೂಲೆ": [{"type": "noun", "defs": ["the severe pain in and around the navel."]}], "ನಾಭಿಸರೋಜ": [{"type": "noun", "defs": ["= ನಾಭಿಕಮಲ."]}], "ನಾಭಿಸೂತ್ರ": [{"type": "noun", "defs": ["= ನಾಭಿನಾಳ."]}], "ನಾಭಿಸ್ಥಾನ": [{"type": "noun", "defs": ["any centrally located point, part or place; navel."]}], "ನಾಭೀಕೂಪ": [{"type": "noun", "defs": ["= ನಾಭಿಕೂಪ."]}], "ನಾಭೀನಳಿನ": [{"type": "noun", "defs": ["= ನಾಭಿಕಮಲ."]}], "ನಾಭೇಯ": [{"type": "noun", "defs": ["(myth.) Brahma, the Creator of the universe, who was born from the lotus flower in the navel of Viṣṇu.", "(Jain.) one of the epithets of the first Jaina spiritual teacher."]}], "ನಾಮ": [{"type": "noun", "defs": ["a word or a combination of words by which a person, place or thing, a body or class or any object of thought is designated, called or known; name.", "any of various sectarian marks worn (usu.) on the forehead.", "a kind of white powder used to put a vertical sectarian mark on the forehead.", "= ನಾಮಕಲ್ಪನೆ.", "(gram.) any of a class of words naming or donoting a person, thing, place, action, quality, etc.; a noun.", "the root form of a noun; the nounal root.", "the act of cheating or a being cheated; an instance of this.", "ನಾಮದ ಉಂಡೆ nāmada uṇḍe = ನಾಮದ ಗೆಡ್ಡೆ; ನಾಮದ ಕೋಳಿ nāmada kōḷi a variety of fowl that has a vertical mark on its forehead; ನಾಮದ ಗೆಡ್ಡೆ nāmada geḍḍe a lump of certain kind of white powder used to put a vertical sectarian mark on the forehead; ನಾಮ ಹಾಕು nāma hāku to cheat; to deceive; to defraud."]}], "ನಾಮಂಜೂರ್": [{"type": "noun", "defs": ["= ನಾಮಂಜೂರು."]}], "ನಾಮಂಜೂರಿ": [{"type": "noun", "defs": ["= ನಾಮಂಜೂರು."]}], "ನಾಮಂಜೂರು": [{"type": "noun", "defs": ["the fact of not being sanctioned, approved or permitted; rejection."]}], "ನಾಮಕರಣ": [{"type": "noun", "defs": ["the act, fact or an instance of designating something, someone with a name; a naming.", "the religious ceremony observed in naming a child.", "the act or an instance of naming or appointing a person to an office or position or to a legislature as a member.", "ನಾಮಕರಣ ಮಾಡು nāmakaraṇa māḍu to formally name a child; 2. to name or appoint (a person) to an office, position, body of administration or legislature."]}], "ನಾಮಕರಣಪತ್ರ": [{"type": "noun", "defs": ["a formal or prescribed form filled with the particulars of a person being proposed, nominated to an office or position, and filed or to be filed with the concerned authority; nomination paper."]}], "ನಾಮಕರ್ಮ": [{"type": "noun", "defs": ["= ನಾಮಕರಣ - 2.", "(Jain.) one of four types of karma that causes the soul to get physical form of various types."]}], "ನಾಮಕರ್ಮಪ್ರಕೃತಿ": [{"type": "noun", "defs": ["= ನಾಮಕರ್ಮ - 2."]}], "ನಾಮಕಾಣಿಕೆ": [{"type": "noun", "defs": ["the reverential gift paid by a disciple to his teacher when the later puts the religious mark on the body of the former."]}], "ನಾಮಕಾವಾಸ್ತೆ": [{"type": "adverb", "defs": ["for name sake only; not with real or genuine intention."]}], "ನಾಮಕೀರ್ತನ": [{"type": "noun", "defs": ["= ನಾಮಕೀರ್ತನೆ."]}], "ನಾಮಕೀರ್ತನೆ": [{"type": "noun", "defs": ["chanting of the name of, and praising of, a deity."]}], "ನಾಮಕೇವಾಸ್ತೆ": [{"type": "adverb", "defs": ["= ನಾಮಕಾವಾಸ್ತೆ."]}], "ನಾಮಗ್ರಹ": [{"type": "noun", "defs": ["a calling by name."]}], "ನಾಮಗ್ರಹಣ": [{"type": "noun", "defs": ["= ನಾಮಗ್ರಹ."]}], "ನಾಮದ ಬೇರು": [{"type": "noun", "defs": ["the plant Hemidesmus indicus of Asclepiadaceae family; sarsaparilla, 2.its fragrant root."]}], "ನಾಮದ ಸೊಪ್ಪು": [{"type": "noun", "defs": ["the plant Alysicarpus rugosus var. styracifolius of Papilionaceae family."]}], "ನಾಮದಾರ": [{"type": "adjective", "defs": ["widely known; well-known; famous; renowned."]}, {"type": "noun", "defs": ["a prefix to the names of venerable persons."]}], "ನಾಮದೇಶಿ": [{"type": "noun", "defs": ["= ನಾಮನಾರಾಯಣಿ."]}], "ನಾಮಧಾರಕ": [{"type": "adjective", "defs": ["in name only, not in fact."]}, {"type": "noun", "defs": ["a man who has a well-meaning or pompous adjectival appellation without having any relevance to his real being."]}], "ನಾಮಧಾರಿ": [{"type": "noun", "defs": ["a well-known, renowned man.", "a man who pretends what he really is not or who claims falsely; a pretender.", "a man who always chants the name of the God within himself.", "he who puts on his forehead the vertical sectarian mark of Śri Vaiṣṇavas.", "a follower of Sri Rāmānujāchārya's cult and philosophy."]}], "ನಾಮಧೇಯ": [{"type": "noun", "defs": ["a word or phrase by which a person, thing or class of things is known, called or spoken to or of; an appellation; a name.", "that part of the Vedas which lists the names of various religious sacrifices."]}], "ನಾಮನಕ್ಷತ್ರ": [{"type": "noun", "defs": ["(astrol.) the birth star of a person determined based on the first letter of his or her name (when the actual birth-star is not known)."]}], "ನಾಮರಾಯಣಿ": [{"type": "noun", "defs": ["(mus.) fiftieth of the seventy two main modes in the Karnāṭaka system."]}], "ನಾಮನಿರ್ದೇಶ": [{"type": "noun", "defs": ["a telling of one's name.", "the act or an instance of naming or appointing a person to an office or position or to a legislature as a member."]}], "ನಾಮನಿರ್ವಚನ": [{"type": "noun", "defs": ["a praising of a person highly; extolment."]}], "ನಾಮಪತ್ರ": [{"type": "noun", "defs": ["= ನಾಮಕರಣಪತ್ರ."]}], "ನಾಮಪದ": [{"type": "noun", "defs": ["= ನಾಮ - 5."]}], "ನಾಮಪ್ರಕೃತಿ": [{"type": "noun", "defs": ["(gram.) the root of a noun; a nounal root."]}], "ನಾಮಫಲಕ": [{"type": "noun", "defs": ["a, usu. rectangular, board on which the name of a person organisation, with or without address, is written."]}], "ನಾಮರೂಢಿ": [{"type": "noun", "defs": ["the real meaning or intent of a word."]}], "ನಾಮರ್ದ": [{"type": "noun", "defs": ["a person who lacks courage, esp. one who is shamefully unable to control fear and so shrinks from danger or trouble; a thorough coward.", "a man lacking natural sexual potency; an impotent.", "that which lacks its very essence, vigour or vitality."]}], "ನಾಮಲಿಂಗ": [{"type": "noun", "defs": ["= ನಾಮಪ್ರಕೃತಿ."]}], "ನಾಮವಾಚಕ": [{"type": "noun", "defs": ["= ನಾಮಪ್ರಕೃತಿ."]}], "ನಾಮವಿಭಕ್ತಿ": [{"type": "noun", "defs": ["(gram.) any of several terminations that is conjoined to a noun, based on the case in which it is used."]}], "ನಾಮವಿಶೇಷಣ": [{"type": "noun", "defs": ["any of a class of words used to modify a noun or other substantive; an adjective."]}], "ನಾಮಶೂನ್ಯ": [{"type": "noun", "defs": ["that whose name is obliterated; a thing that is not existent at present."]}], "ನಾಮಶೇಷ": [{"type": "noun", "defs": ["= ನಾಮಾವಶೇಷ."]}], "ನಾಮಸಂಕೀರ್ತನ": [{"type": "noun", "defs": ["= ನಾಮಕೀರ್ತನೆ."]}], "ನಾಮಸಂಕೀರ್ತನೆ": [{"type": "noun", "defs": ["= ನಾಮಕೀರ್ತನೆ."]}], "ನಾಮಸೂಚಿ": [{"type": "noun", "defs": ["an index of names or titles."]}], "ನಾಮಸ್ಮರಣ": [{"type": "noun", "defs": ["= ನಾಮಸ್ಮರಣೆ."]}], "ನಾಮಸ್ಮರಣೆ": [{"type": "noun", "defs": ["a meditating of the name or names of a deity, spiritual person, a person to whom one must be grateful, etc."]}], "ನಾಮಾಂಕ": [{"type": "noun", "defs": ["a denoting a person, thing, etc. by a name."]}], "ನಾಮಾಂಕಿತ": [{"type": "adjective", "defs": ["denoted by or designated with a name.", "widely or well known; famous."]}, {"type": "noun", "defs": ["that which has a name or is designated with a name.", "that on which a name is or names are engraved.", "a name; an appellation.", "ನಾಮಾಂಕಿತ ಮಾಡು nāānkita māḍu to designate (something) with a name; to name."]}], "ನಾಮಾಂತರ": [{"type": "noun", "defs": ["a different name; a name that is changed."]}], "ನಾಮಾಂತರಿತ": [{"type": "noun", "defs": ["(rhet.) a kind of composition in which a noun is or nouns are expressed using alternate words."]}], "ನಾಮಾನುಕ್ರಮ": [{"type": "noun", "defs": ["a list of names that are written or printed in a particular order."]}], "ನಾಮಾನುಕ್ರಮಣಿಕೆ": [{"type": "noun", "defs": ["= ನಾಮಾನುಕ್ರಮ."]}], "ನಾಮಾವಶೇಷ": [{"type": "noun", "defs": ["a thing of which only the name is remaining; that which is not physically existent.", "ನಾಮಾವಶೇಷಮಾಡು nāmāvaśeṣa māḍu to do away with as if by effacing completely; to destroy; to obliterate."]}], "ನಾಮಿ": [{"type": "noun", "defs": ["the ninth day of a lunar fortnight."]}, {"type": "adjective", "defs": ["causing to bend; bending; turning."]}, {"type": "noun", "defs": ["any of the vowels in Kannaḍa system of alphabets, excepting the first two ಅ and ಆ."]}, {"type": "noun", "defs": ["(arch.) a kind of tax."]}], "ನಾಮಿತ": [{"type": "noun", "defs": ["a particular mode or manner of singing."]}], "ನಾಮು": [{"type": "noun", "defs": ["a cattle disease caused by a kind of slender worm."]}], "ನಾಮುಹುಳ": [{"type": "noun", "defs": ["a kind of slender worm, chiefly thriving in dirty water, causing various diseases to human and cattle."]}], "ನಾಮೂಷಿ": [{"type": "noun", "defs": ["lack of respect or esteem; a deliberate act of disregarding another or treating disdainfully."]}], "ನಾಮೆ": [{"type": "noun", "defs": ["good reputation; fame; renown."]}, {"type": "noun", "defs": ["anything printed, written, etc. that contains information or is relied upon to record or prove something; a document."]}], "ನಾಮೇರು": [{"type": "noun", "defs": ["the tree Calophyllum inophyllum (= C. apetalum, = C. spurium) of Clusiaceae family; Indian laurel."]}], "ನಾಯ್": [{"type": "noun", "defs": ["= ನಾಯಿ."]}], "ನಾಯ": [{"type": "noun", "defs": ["the quality of being right or correct; impartiality; fairness; rectitude; justice."]}], "ನಾಯಂಕ": [{"type": "noun", "defs": ["= ನಾಯಕ – 1 & 2."]}], "ನಾಯಂದ": [{"type": "noun", "defs": ["= ನಾಯಿಂದ."]}], "ನಾಯಕ": [{"type": "noun", "defs": ["a man who leads; he who directs, commands or guides a group of people; a leader.", "a male ruler of a state; a male sovereign or monarch.", "the chief officer of a military unit; a commander.", "a man with reference to the woman to whom he is married.", "the main pearl placed, usu. at the centre of a necklace.", "a guiding factor, thing or principle.", "a surname of particular families.", "any of the various castes the members of which usu. take this as their surname.", "the central male character in a novel, play, poem, etc., usu. portrayed as courageous, noble, etc., with whom the reader or audience is supposed to sympathise; the hero."]}], "ನಾಯಕಗ್ಗಲಿ": [{"type": "noun", "defs": ["a variety of acacia tree."]}], "ನಾಯಕತಃಖ್ತೆ": [{"type": "noun", "defs": ["a master form or of an office in which details of all transactions are written regularly."]}], "ನಾಯಕತನ": [{"type": "noun", "defs": ["= ನಾಯಕತ್ವ."]}], "ನಾಯಕತ್ವ": [{"type": "noun", "defs": ["the office or condition of being or quality of, a leader; leadership."]}], "ನಾಯಕನರಕ": [{"type": "noun", "defs": ["(myth.) name of one of the hells."]}], "ನಾಯಕವಾಡಿ": [{"type": "noun", "defs": ["= ನಾಯಕ – 1 & 3.", "a group of leaders."]}], "ನಾಯಕಸಾನಿ": [{"type": "noun", "defs": ["a female dancer.", "a prostitute; a harlot."]}], "ನಾಯಕಿ": [{"type": "noun", "defs": ["a woman who leads, directs, commands or guides a group of people; a female leader.", "a woman with reference to a man to whom she is married; a wife.", "the queen either as a ruler of a state or as a wife of a king.", "a female dancer.", "a prostitute; a whore.", "the central female character in a novel, play, etc., usu. portrayed as noble, virtuous, etc., with whom the reader or audience is supposed to sympathise; a heroine.", "a suffix of certain female names."]}, {"type": "noun", "defs": ["(mus.) a mode in Karnāṭaka system, derived from the main mode Kharaharapriya."]}], "ನಾಯಕಿಣಿ": [{"type": "noun", "defs": ["= ನಾಯಕಸಾನಿ - 2."]}], "ನಾಯಕಿತಿ": [{"type": "noun", "defs": ["the wife of a leader, chieftain.", "a prostitute; a harlot."]}], "ನಾಯಕಿತ್ತಿ": [{"type": "noun", "defs": ["= ನಾಯಕಿತಿ."]}], "ನಾಯಚಿಲಕೆ": [{"type": "noun", "defs": ["a kind of plant."]}], "ನಾಯಚುಂಚಲು": [{"type": "noun", "defs": ["= ನಾಯಿಚುಂಚ."]}], "ನಾಯತುಳಸಿ": [{"type": "noun", "defs": ["= ನಾಯಿತೊಳಸಿ."]}], "ನಾಯತೊಳಸಿ": [{"type": "noun", "defs": ["= ನಾಯಿತೊಳಸಿ."]}], "ನಾಯತ್ತಿ": [{"type": "noun", "defs": ["the ficus tree Ficus tomentosa of Moraceae tree; grey woolly banyan tree."]}], "ನಾಯನರಕ": [{"type": "noun", "defs": ["(myth.) one of the terrible hells."]}], "ನಾಯನಾರ್": [{"type": "noun", "defs": ["any of the sixty three ancient ardent Śaiva devotees who spread Śaivism in Tamil Nadu."]}], "ನಾಯನೇಱಿಲ್": [{"type": "noun", "defs": ["= ನಾಯಿನೇರಳೆ."]}], "ನಾಯನ್ಮಾರ": [{"type": "noun", "defs": ["= ನಾಯನಾರ್."]}], "ನಾಯಬ": [{"type": "noun", "defs": ["a person appointed to act as a substitute for or as an assistant to, another; a deputy.", "an official of lower position.", "an officer in charge of administration of a small division of a state or district."]}], "ನಾಯಬಶಿರಸ್ತೇದಾರ": [{"type": "noun", "defs": ["a revenue officer superintending clerical staff in a taluk office."]}], "ನಾಯಬೇಳ": [{"type": "noun", "defs": ["= ನಾಯಿಬೇಲ."]}], "ನಾಯಮಾರ": [{"type": "noun", "defs": ["= ನಾಯರ್2."]}], "ನಾಯಮ್ಮಾರ": [{"type": "noun", "defs": ["= ನಾಯರ್2."]}], "ನಾಯರ್": [{"type": "noun", "defs": ["a kind of tree."]}, {"type": "noun", "defs": ["a caste among Keralites.", "a member of that caste.", "the surname of the members of this caste."]}], "ನಾಯಹತ್ತಿ": [{"type": "noun", "defs": ["the cotton plant Gossypium indicum (= G. neglectum) of Malvaceae family; wild cotton plant.", "cotton wool get from this plant."]}], "ನಾಯಾಟ": [{"type": "noun", "defs": ["the play of a dog.", "(fig.) excessive indulgence of sexual appetite; debauchery."]}], "ನಾಯಿ": [{"type": "noun", "defs": ["a dog - a) a domesticated canine (Canis familiaris), raised in many breeds which are commonly kept as house pets and also used for hunting, guarding people or property, etc.; b) any of various wild canines.", "(fig.) a thing that deserves scorn; a despicable thing.", "a mean, contemptible fellow.", "ನಾಯ ತೇಜ nāya tēja that which brings infamy, disgrace, dishonour; ನಾಯ ಪಾಡು nāya pāḍu = ನಾಯಿ ಪಾಡು; ನಾಯಿ ತಲೆಮೇಲಿನ ಬುತ್ತಿ nāyi tale mēlina butti a thing which cannot be reasonably hoped to happen or sustain;a thing that may fall in to the hands of an unworthy person;ನಾಯಿ ಪಾಡು nāyi pā'u a contemptible, abject condition of living; ನಾಯಿ ಬಾಲ nāyi bāla a habit that can never be corrected; ನಾಯಿ ಬಾಲ ಡೊಂಕು nāyi bāla ḍonku (a phrase meaning) a habit that can never be corrected; ನಾಯಿಗೆ ನೈವೇದ್ಯವಾಗು nāyige naïvēdyavu (a worthy thing) to fall into the hands of an totally undeserved or utterly despicable person; ಸಾಕಿದ ನಾಯಿ sākida nāyi a faithful, loyal person (often used in ridiculing manner); ನಾಯಿಗೆ ಕೆಲಸವಿಲ್ಲ, ಕೂಡಲಿಕ್ಕೆ ಸಮಯವಿಲ್ಲ nāyige kelasavilla, kūḍalikke samayavilla some are always busy but they never do anything; ನಾಯಿ ಬಾಲ ನಳಿಗೇಲಿ ಹಾಕಿದರೆ ಡೊಂಕು ಬಿಟ್ಟೀತೆ? nāyi bāla naḷigēli hākidare ḍonku biṭṭīte? human perversion can never be set right by advice; ನಾಯಿ ಬೊಗಳಿದರೆ ದೇವಲೋಕ ಹಾಳೆ nāyi bogaḷidare dēvalōka hāḷe? the moon does not heed the barking of dogs."]}], "ನಾಯಿ ಉಗನಿಹಂಬು": [{"type": "noun", "defs": ["the plant Lettsomia ellliptica of Convolvulaceae family."]}], "ನಾಯಿಂದ": [{"type": "noun", "defs": ["a caste the profession of the members of which is cutting hair, shaving and trimming beards; a barber.", "a male member of that caste."]}], "ನಾಯಿಂದಗತ್ತಿ": [{"type": "noun", "defs": ["a sharp-edged cutting instrument for shaving off or cutting hair: the razor."]}], "ನಾಯಿಂದಗಿತ್ತಿ": [{"type": "noun", "defs": ["a woman belonging to the barberś caste.", "the wife of a barber."]}], "ನಾಯಿಕಲಮೆಗಿಡ": [{"type": "noun", "defs": ["the plant Carissa spinarum of Apocynaceae family.", "Carissa carandas, a spinous shrub with black berries, of Apocynaceae family."]}], "ನಾಯಿಕಡಂಬೆ": [{"type": "noun", "defs": ["the plant Mitragyna parvifolia (=Stephegyne parvifolia) of Rubiaceae family; water cadamba."]}], "ನಾಯಿಕಸಾನಿ": [{"type": "noun", "defs": ["= ನಾಯಕಸಾನಿ."]}], "ನಾಯಿಕುನ್ನಿ": [{"type": "noun", "defs": ["a young dog; a puppy."]}], "ನಾಯಿಕೂಟೆ": [{"type": "noun", "defs": ["the tree Antidesma bunius of Euphorbiaceae family."]}], "ನಾಯಿಕೆ": [{"type": "noun", "defs": ["a woman who leads, directs, comands or guides a group of people; a female leader.", "a woman with reference to a man to whom she is married; a wife.", "the central female character in a novel, play, etc., usu portrayed as noble, virtuous, etc., with whom the reader or audience is supposed to sympathise; a heroine."]}], "ನಾಯಿಕುಳಿ": [{"type": "noun", "defs": ["the plan Scleropyrum wallichianum of Santalaceae family."]}], "ನಾಯಿಕೆತನ": [{"type": "noun", "defs": ["the quality or the fact of being a heroine.", "the quality or qualities that a heroine must have."]}], "ನಾಯಿಕೆಮ್ಮಲು": [{"type": "noun", "defs": ["= ನಾಯಿಕೆಮ್ಮು."]}], "ನಾಯಿಕೆಮ್ಮು": [{"type": "noun", "defs": ["an acute infectious disease caused by the bacillus Bordetella pertussis, usu. affecting children, characterised by a mucous discharge from the nose and later by repeated attacks of coughing that end in a forced intake of breath or whoop; the whooping cough."]}], "ನಾಯಿಕೊಡೆ": [{"type": "noun", "defs": ["= ನಾಯಿಕೂಟೆ.", "a) any of various rapidly growing, fleshy fungi, typically having a stalk capped with an umbrellalike top, esp. a gill or pore fungus, as the Agarricus campestris of Agaricaceae family; b) an edible fruiting body of such a fungus."]}], "ನಾಯಿಗಣ್ಣು": [{"type": "noun", "defs": ["(fig.) a lustful, lecherous look."]}], "ನಾಯಿಗಳ್ಳಿ": [{"type": "noun", "defs": ["the spurge plant Euphorbia neriifolia of Euphorbiaceae family; dog's tongue spurge; (?)."]}], "ನಾಯಿಗೆಮ್ಮಲು": [{"type": "noun", "defs": ["= ನಾಯಿಕೆಮ್ಮು."]}], "ನಾಯಿಗೆಮ್ಮು": [{"type": "noun", "defs": ["= ನಾಯಿಕೆಮ್ಮು."]}], "ನಾಯಿಚತ್ರಿ": [{"type": "noun", "defs": ["= ನಾಯಿಕೊಡೆ - 2."]}], "ನಾಯಿಚುಂಚ": [{"type": "noun", "defs": ["a kind of plant."]}], "ನಾಯಿಛತ್ತರಿಗೆ": [{"type": "noun", "defs": ["= ನಾಯಿಕೊಡೆ - 2."]}], "ನಾಯಿಜನ್ಮ": [{"type": "noun", "defs": ["the birth and life of a dog.", "(fig.) a miserable, wretched life."]}], "ನಾಯಿಡು": [{"type": "noun", "defs": ["the chief of a village.", "a Telugu speaking caste spread widely in Andhra Pradesh, Karnataka and Tamil Nadu.", "the surname of the people belonging to this caste."]}], "ನಾಯಿತಕ್ಕಿಲೆ": [{"type": "noun", "defs": ["the tree Clerodendrum inerme of Verbenaceae family; garden quinine."]}], "ನಾಯಿತನ": [{"type": "noun", "defs": ["the quality or fact of being, a dog.", "lowness in quality; inferior quality; meanness; ignobleness.", "the quality of yielding or being submissive to vested interests, without having moral compunction, for personal gains."]}], "ನಾಯಿತುಳಸಿ": [{"type": "noun", "defs": ["the shrubby plant Ocimum canum of Lamiaceae family; hoary basil.", "the plant Ageratum conyzoides of Asteraceae family."]}], "ನಾಯಿತೇಗ": [{"type": "noun", "defs": ["the tree Premna herbacea of Verbenaceae family; bushy fire brand teak."]}], "ನಾಯಿತೊಣಚಿ": [{"type": "noun", "defs": ["a kind of insect that lives on the body of dogs as a parasite."]}], "ನಾಯಿತೊಳಸಿ": [{"type": "noun", "defs": ["= ನಾಯಿತೊಳಸಿ."]}], "ನಾಯಿದ": [{"type": "noun", "defs": ["= ನಾಯಿಂದ."]}], "ನಾಯಿನಾರ್": [{"type": "noun", "defs": ["= ನಾಯನಾರ್."]}], "ನಾಯಿನಾಲಿಗೆಕಳ್ಳಿ": [{"type": "noun", "defs": ["the spurge plant Euphorbia neriifolia of Euphorbiaceae family; dog's tongue spurge."]}], "ನಾಯಿನಾಲಿಗೆ": [{"type": "noun", "defs": ["the plant Elephantopus scaber of Asteraceae family; elephant's foot."]}], "ನಾಯಿನಿದ್ದೆ": [{"type": "noun", "defs": ["a light sleep."]}], "ನಾಯಿನಿಸೊಪ್ಪು": [{"type": "noun", "defs": ["the plant Cyanotis cucullata of Commelinaceae family."]}], "ನಾಯಿನೇರಳೆ": [{"type": "noun", "defs": ["the tree Syzygium hemisphaericum (= Eugenia heisphaerica) of Myrtaceae family.", "its fruit; hemispheric rose apple.", "another tree of the same family Syzygium operculatum."]}], "ನಾಯಿನೇಱಿಲ್": [{"type": "noun", "defs": ["= ನಾಯಿನೇರಳೆ."]}], "ನಾಯಿನೊಳಲೆ": [{"type": "noun", "defs": ["= ನಾಯ್ನೊಳಲೆ."]}], "ನಾಯಿಪಾಡು": [{"type": "noun", "defs": ["a wretched, humiliating condition."]}], "ನಾಯಿಪಾಲು": [{"type": "noun", "defs": ["that portion of a thing (as food) that a dog has got.", "(fig.) a thing (usu. valuable one) that has gone to an undeserved person."]}], "ನಾಯಿಪೆಲ್ಲ": [{"type": "noun", "defs": ["the plant Clematis recta of Ranunculaceae family."]}], "ನಾಯಿಬ್": [{"type": "noun", "defs": ["= ನಾಯಬ."]}], "ನಾಯಿಬದುಕು": [{"type": "noun", "defs": ["= ನಾಯಿಬಾಳು."]}], "ನಾಯಿಬಾಲ": [{"type": "noun", "defs": ["(fig.) stubborn perverseness that can not be corrected."]}], "ನಾಯಿಬಾಳು": [{"type": "noun", "defs": ["(fig.) a miserable, wretched life."]}], "ನಾಯಿಬೀಟೆ": [{"type": "noun", "defs": ["the tree Dalbergia rubiginosa of Papilionaceae family."]}], "ನಾಯಿಬೆಂಡೆ": [{"type": "noun", "defs": ["the plant Kydia calycina of Malvaceae family."]}], "ನಾಯಿಬೆತ್ತ": [{"type": "noun", "defs": ["the cane Calamus travancoricus of Arecaceae family."]}], "ನಾಯಿಬೆಳೆಗಿಡ": [{"type": "noun", "defs": ["a kind of plant."]}], "ನಾಯಿಬೇಲ": [{"type": "noun", "defs": ["the tree Hesperethusa crenulata (=Limonia crenulata) of Rutaceae family.", "its fruit.", "the acacia tree Acacia leucophloea (=Mimosa leucophloea) of Mimosae family."]}], "ನಾಯಿಬೇಲಿ": [{"type": "noun", "defs": ["the plant Flacourtia indica (= F. sapida, = F. sepiaria) of Flacourtiaceae family.", "its plum."]}], "ನಾಯಿಬೇಳ": [{"type": "noun", "defs": ["= ನಾಯಿಬೇಲ."]}], "ನಾಯಿಮಾರ": [{"type": "noun", "defs": ["= ನಾಯರ್2."]}], "ನಾಯಿಯುಳ್ಳಿ": [{"type": "noun", "defs": ["the plant Scilla indica of Liliaceae family.", "its bulb."]}], "ನಾಯಿಯೆಲವ": [{"type": "noun", "defs": ["a kind of tree."]}], "ನಾಯಿರಾಗಿ": [{"type": "noun", "defs": ["the grass Eleusine stricta of Poaceae family.", "its grain for which it is cultivated."]}], "ನಾಯಿವೇಳ": [{"type": "noun", "defs": ["= ನಾಯಿಬೇಲ."]}], "ನಾಯಿಸಂತೆ": [{"type": "noun", "defs": ["a place where goods are sold at cheaper prices.", "the condition of price being very low."]}], "ನಾಯಿಹಲಸು": [{"type": "noun", "defs": ["the medium to large sized, ever-green tree Carallia lucida (= C. integerrima) of Rhizophoraceae family.", "its fruit."]}, {"type": "noun", "defs": ["the tree Carallia brachiata (=C. integrifolia, = C. lucida) of Rhizophoraceae family; common inland mangrove."]}], "ನಾಯಿಹುಲಿ": [{"type": "noun", "defs": ["any of various wolf-like carnivores (family Hyaenidae) of Africa and Asia, with powerful jaws, a bristly mane, short hind legs, and a characteristic shrill cry; hyena."]}], "ನಾಯಿಸಾಸಿವೆ": [{"type": "noun", "defs": ["the plant Cleome viscosa of Capparaceae family with flowers having stalked petals and long stamens; sticky cleome."]}], "ನಾಯಿಸೆಡೆ": [{"type": "noun", "defs": ["= ನಾಯಿಕೊಡೆ."]}], "ನಾಯಿಸೊಂಕುಬಳ್ಳಿ": [{"type": "noun", "defs": ["the plant Mucuna prurita (=M. puriens) of Papilionaceae family; flea plant.", "its bean; cat bean."]}], "ನಾಯಿಸೊಣಗು": [{"type": "noun", "defs": ["a kind of plant."]}], "ನಾಯಿಸೊಪ್ಪು": [{"type": "noun", "defs": ["the plant Trianthema triquetra of Aizoceae family."]}], "ನಾಯಿಹಂಚಿಕಡ್ಡಿ": [{"type": "noun", "defs": ["the grass Aristida setacea of Poaceae family."]}], "ನಾಯಿಹಕ್ಕರಿಕೆ": [{"type": "noun", "defs": ["the annual plant Sonchus oleraceus of Asteraceae family."]}], "ನಾಯಿಹಾಲೆ": [{"type": "noun", "defs": ["the plant Tylophora indica (= Asclepias asthmatica) of Asclepiadaceae family; vomiting swallow."]}], "ನಾಯಿಹೊನ್ನೆ": [{"type": "noun", "defs": ["the tree Dalbergia ougeinensis (= Ougeinia oojeoinensis, = O. dalbergioides) of Papilionaceae family."]}], "ನಾಯೆಲವ": [{"type": "noun", "defs": ["= ನಾಯಿಯೆಲವ."]}], "ನಾಯೇಬ": [{"type": "noun", "defs": ["= ನಾಯಬ."]}], "ನಾಯೊಡಲ್": [{"type": "noun", "defs": ["(fig.) a despicable body."]}], "ನಾಯೊಳಲೆ": [{"type": "noun", "defs": ["= ನಾಯಿನೊಳಲೆ."]}], "ನಾಯ್ಕಿತಿ": [{"type": "noun", "defs": ["the wife of a leader, chieftain.", "a prostitute; a harlot."]}], "ನಾಯ್ಗೆಮ್ಮು": [{"type": "noun", "defs": ["= ನಾಯಿಕೆಮ್ಮು."]}], "ನಾಯ್ಚಿಲಿಕೆ": [{"type": "noun", "defs": ["a kind of plant."]}], "ನಾಯ್ತನ": [{"type": "noun", "defs": ["= ನಾಯಿತನ."]}], "ನಾಯ್ದಱಿಯ": [{"type": "noun", "defs": ["a variety of acacia tree."]}], "ನಾಯ್ನೊಳಲೆ": [{"type": "noun", "defs": ["= ನಾಯಿಕೊಡೆ - 2.", "a kind of slender, long worm that thrives in damp conditions."]}], "ನಾಯ್ಪಾಲ್": [{"type": "noun", "defs": ["= ನಾಯಿಪಾಲು."]}], "ನಾಯ್ಬದುಕು": [{"type": "noun", "defs": ["= ನಾಯಿಬಾಳು."]}], "ನಾಯ್ಬಸನಿಗತನ": [{"type": "noun", "defs": ["(fig.) excessive indulgence of sexual appetite; debauchery."]}], "ನಾಯ್ಬಾಳು": [{"type": "noun", "defs": ["= ನಾಯಿಬಾಳು."]}], "ನಾಯ್ಬೇಲ": [{"type": "noun", "defs": ["= ನಾಯಿಬೇಲ."]}], "ನಾಯ್ವೇಳ": [{"type": "noun", "defs": ["= ನಾಯಿಬೇಲ."]}], "ನಾರ್": [{"type": "noun", "defs": ["= ನಾರು3."]}], "ನಾರ": [{"type": "adjective", "defs": ["of, belonging to man (Homo sapiens) or consisting of or produced by people; human.", "having or showing human qualities."]}, {"type": "noun", "defs": ["water.", "a just-born calf of a cow.", "a group of persons, collectively, people, in general."]}], "ನಾರಂಗ": [{"type": "adjective", "defs": ["of the colour of orange; reddish-yellow; orange."]}, {"type": "noun", "defs": ["the citrus tree Citrus aurantium (var. bigardia) of Rutaceae family.", "its bitter fruit; bitter orange; (this name is applied to several trees and their fruits)."]}], "ನಾರಂಗಿ": [{"type": "adjective", "defs": ["= ನಾರಂಗ1."]}, {"type": "noun", "defs": ["= ನಾರಂಗ2."]}], "ನಾರಂಬೇಳೆ": [{"type": "noun", "defs": ["= ನಾರುಂಬೇಳೆ.", "the plant Cleome gynandra (= Gynandropsis pentaphylla) of Capparaceae family.", "its seed:."]}], "ನಾರಕ": [{"type": "adjective", "defs": ["of, from or like hell; hellish."]}, {"type": "noun", "defs": ["(myth.) the world believed to be below the earth, where wicked and condemned are punished after death; hell.", "a person suffering punishment in the hell for the wicked acts committed during one's life-time.", "a wicked act; sin."]}], "ನಾರಕಿ": [{"type": "noun", "defs": ["= ನಾರಕ2 -2."]}], "ನಾರಚ": [{"type": "noun", "defs": ["= ನಾರಾಚ."]}], "ನಾರಜ": [{"type": "noun", "defs": ["that which has caused by human beings."]}], "ನಾರಡೆ": [{"type": "noun", "defs": ["(hist.) a kind of tax."]}], "ನಾರದ": [{"type": "noun", "defs": ["(myth.) one of the sons of Brahma, and is a famous celestial sage, who also acts as a messenger between the gods and human beings, and is believed to have authored code of laws 'Nāradīya Smřti' considered as one of the eighteen of holy scriptures of Hindus.", "this scripture itself.", "that which gives water, cloud."]}], "ನಾರದಪುರಾಣ": [{"type": "noun", "defs": ["one of the eighteen Hindu Purāṇas, supposed to have been written by the sage Nārada."]}], "ನಾರದವೀಣೆ": [{"type": "noun", "defs": ["a variety of the Indian lute (vīṇe)."]}], "ನಾರದಸಂಹಿತೆ": [{"type": "noun", "defs": ["= ನಾರದ - 2."]}], "ನಾರದಸ್ಮøತಿ": [{"type": "noun", "defs": ["= ನಾರದ - 2."]}], "ನಾರದೀಯ": [{"type": "adjective", "defs": ["of or related to or written by or relating to the writings of the sage Nārada."]}, {"type": "noun", "defs": ["= ನಾರದ - 2."]}], "ನಾರದೀಯ ಪುರಾಣ": [{"type": "noun", "defs": ["= ನಾರದಪುರಾಣ."]}], "ನಾರಲೆ": [{"type": "noun", "defs": ["the small to middle sized tree Premna tomentosa of Verbenaceae family with fragrant leaves, the yellow wood of which is used for making combs and shuttles for looms."]}]}