{"ಧೈರ್ಯವಂತ": [{"type": "noun", "defs": ["a bold, brave man."]}], "ಧೈರ್ಯವಂತೆ": [{"type": "noun", "defs": ["a bold, brave woman."]}], "ಧೈರ್ಯಶಾಲಿ": [{"type": "noun", "defs": ["= ಧೈರ್ಯವಂತ."]}], "ಧೈರ್ಯಸ್ಖಲನ": [{"type": "noun", "defs": ["a losing of one's courage."]}], "ಧೈರ್ಯಸ್ಥ": [{"type": "noun", "defs": ["= ಧೈರ್ಯವಂತ."]}], "ಧೈರ್ಯಸ್ಥೆ": [{"type": "noun", "defs": ["= ಧೈರ್ಯವಂತೆ."]}], "ಧೈರ್ಯಾವಲಂಬೆ": [{"type": "noun", "defs": ["= ಧೈರ್ಯವಂತೆ."]}], "ಧೈವತ": [{"type": "noun", "defs": ["the sixth tone or note in the ascending scale of both Karnāṭaka and Hindūstāni systems of music."]}], "ಧೊಕ್ಕನೆ": [{"type": "adverb", "defs": ["immediately; suddenly."]}], "ಧೊಣೆ": [{"type": "noun", "defs": ["a natural pond on a hill or mountain.", "an artificial pool or pond used for water storage; a water-tank.", "a place that is depressed in position compared to the places surrounding it; a hollow or low place."]}], "ಧೊಪ್ಪನೆ": [{"type": "adverb", "defs": ["with a heavy sound as made by something bulky while falling down suddenly."]}], "ಧೊಪ್ಪಳಿಸು": [{"type": "verb", "defs": ["to fall down suddenly with a heavy sound."]}], "ಧೊರೆ": [{"type": "noun", "defs": ["a male ruler of a nation or state usu. called a kingdom; a king; a ruler; a monarch.", "a term used in addressing one's superior, administrator or ruler.", "a term of endearment used in addressing children.", "ability; capability.", "competence; worthiness.", "the quality of excelling; excellence; superiority."]}], "ಧೊರೆಪೂಜೆ": [{"type": "noun", "defs": ["a grand, majestic worshipping of a deity."]}], "ಧೋಕಾ": [{"type": "noun", "defs": ["deep trouble or misery.", "the use of false representations to gain an unjust advantage; a dishonest artifice or trick; criminal deception."]}], "ಧೋತರ": [{"type": "noun", "defs": ["= ಧೋತ್ರ."]}], "ಧೋತಿ": [{"type": "noun", "defs": ["= ಧೋತ್ರ - 1."]}], "ಧೋತ್ರ": [{"type": "noun", "defs": ["a long, unsewn cloth worn by men around the waist covering upto the ankles, sometimes, one end of which is passed between the thighs and tucked in behind at the waist.", "a loose garment for covering the shoulder or shoulders.", "ಧೋತ್ರ ದೊಡ್ಡದಾದರೆ ಗೋತ್ರ ದೊಡ್ಡದೆ dhōtra doḍḍadādare, gōtra doḍḍade? more goes to the making of a fine gentleman than fine clothes; it is not the gay coat that makes the gentleman."]}], "ಧೋಬಿ": [{"type": "noun", "defs": ["a man who washes clothes, linens, etc., for hire; laundryman.", "a caste the main profession of the members of which is washing clothes.", "a member of this caste."]}], "ಧೋರ": [{"type": "noun", "defs": ["a large kettle-drum."]}], "ಧೋರಣ": [{"type": "noun", "defs": ["= ಧೋರಣೆ - 1, 2, 3 &4.", "any vehicle.", "a kind of gait of a horse.", "the act of a person or thing that runs; a running or galloping.", "the object to be attained; intention; purpose; aim.", "a particular disposition or bent of mind; bias; tendency; inclination."]}], "ಧೋರಣೆ": [{"type": "noun", "defs": ["the style of a composition.", "a manner of acting, feeling or thinking that shows one's disposition, opinion, etc., attitude.", "one's disposition, opinion, mental set, view, etc.; a stand.", "the manner in which one behaves, acts; behavior.", "the quality characterised by dignity, self-importance, arrogance, conceit or pomp.", "(fig.) lack of concern, interest or feeling; apathy; indifference."]}], "ಧೋವತಿ": [{"type": "noun", "defs": ["= ಧೋತ್ರ - 1."]}], "ಧೌತ": [{"type": "adjective", "defs": ["cleansed; clean; washed.", "white; shining; lustrous."]}, {"type": "noun", "defs": ["a thing that is clean, washed (as clothes).", "the quality of being white; whiteness.", "a white metallic element that is sonorous, ductile, very malleable, capable of a high degree of polish, and chiefly univalent in compounds, and that has the highest thermal and electric conductivity of any substance; silver; (Ag.).", "that which is sharpened (as a weapon)."]}], "ಧೌತಿ": [{"type": "noun", "defs": ["(yoga.) a yogic cleansing, in which a narrow, long piece of clean cloth is taken into stomach and taken our from the anus."]}], "ಧೌರಿತಕ": [{"type": "noun", "defs": ["a running by hopping, a kind of gait of a horse."]}], "ಧೌರೇಯ": [{"type": "noun", "defs": ["a draft-animal.", "a responsible man.", "a horse."]}], "ಧೌರೇಯಕ": [{"type": "noun", "defs": ["= ಧೌರೇಯ."]}], "ಧ್ಯಾತೃ": [{"type": "noun", "defs": ["a person who meditates or is meditating."]}], "ಧ್ಯಾನ": [{"type": "noun", "defs": ["the act of meditating or thinking deeply; meditation; thought; reflection.", "profound and abstract religious meditation.", "observant care; consideration; attention.", "the act of concentrating; the state of being concentrated; ಧ್ಯಾನ ಮಾಡು dhyāna māḍu to meditate; to think deeply.", "to engage in abstract religious meditation.", "to observe; to consider.", "to concentrate on."]}], "ಧ್ಯಾನಂಗೈ": [{"type": "verb", "defs": ["= ಧ್ಯಾನ ಮಾಡು."]}], "ಧ್ಯಾನಂಬೆಱು": [{"type": "verb", "defs": ["= ಧ್ಯಾನ ಮಾಡು."]}], "ಧ್ಯಾನಗಮ್ಯ": [{"type": "adjective", "defs": ["that can be known through meditation, deep cogitation only."]}, {"type": "noun", "defs": ["he who can be known through meditation, deep cogitation only; the Supreme Being."]}], "ಧ್ಯಾನಗಮ್ಯೆ": [{"type": "noun", "defs": ["she who can be known through meditation, deep cogitation only; the Supreme Being."]}], "ಧ್ಯಾನಗೋಚರ": [{"type": "adjective", "defs": ["can be seen through meditation only."]}, {"type": "noun", "defs": ["he who can be seen through meditation only; the Supreme Being."]}], "ಧ್ಯಾನಗೋಚರೆ": [{"type": "noun", "defs": ["she who can be seen through meditation only; the Supreme Being."]}], "ಧ್ಯಾನಪರ": [{"type": "adjective", "defs": ["meditating or inclined to meditate; thinking deeply."]}, {"type": "noun", "defs": ["he who is meditating or thinking deeply."]}], "ಧ್ಯಾನಪರಾಯಣ": [{"type": "noun", "defs": ["= ಧ್ಯಾನಪರ2."]}], "ಧ್ಯಾನಪರಾಯಣೆ": [{"type": "noun", "defs": ["= ಧ್ಯಾನಪರೆ."]}], "ಧ್ಯಾನಪರೆ": [{"type": "noun", "defs": ["she who is meditating or thinking deeply."]}], "ಧ್ಯಾನಮಗ್ನ": [{"type": "adjective", "defs": ["= ಧ್ಯಾನಪರ1."]}, {"type": "noun", "defs": ["= ಧ್ಯಾನಪರ2."]}], "ಧ್ಯಾನಮಗ್ನೆ": [{"type": "noun", "defs": ["= ಧ್ಯಾನಪರೆ."]}], "ಧ್ಯಾನಮುದ್ರೆ": [{"type": "noun", "defs": ["the countenance of a person who is thinking deeply.", "a pose in dance or iconography that suggests meditation."]}], "ಧ್ಯಾನಯೋಗ": [{"type": "noun", "defs": ["= ಧ್ಯಾನ -2."]}], "ಧ್ಯಾನಯೋಗಿ": [{"type": "noun", "defs": ["= ಧ್ಯಾನಶೀಲ2."]}], "ಧ್ಯಾನಶೀಲ": [{"type": "adjective", "defs": ["engaged or habitually engaging, in deep and abstract, religious meditation."]}, {"type": "noun", "defs": ["a man engaged or habitually engages, in deep and abstract, religious meditation."]}], "ಧ್ಯಾನಶೀಲೆ": [{"type": "noun", "defs": ["a woman engaged or habitually engages, in deep and abstract, religious meditation."]}], "ಧ್ಯಾನಸ್ಥ": [{"type": "adjective", "defs": ["engaged in deep and abstract, religious meditation."]}, {"type": "noun", "defs": ["a man engaged in deep and abstract, religious meditation."]}], "ಧ್ಯಾನಸ್ಥೆ": [{"type": "noun", "defs": ["a woman engaged in deep and abstract, religious meditation."]}], "ಧ್ಯಾನಾತೀತ": [{"type": "adjective", "defs": ["transcending meditation; that cannot be got even through meditation."]}, {"type": "noun", "defs": ["he who transcends meditation or who cannot be got by merely meditating on; the Supreme Being."]}], "ಧ್ಯಾನಾತೀತೆ": [{"type": "noun", "defs": ["she who transcends meditation or who cannot be got by merely meditating on; the Supreme Being."]}], "ಧ್ಯಾನಾರೂಢ": [{"type": "noun", "defs": ["= ಧ್ಯಾನಸ್ಥ1."]}, {"type": "noun", "defs": ["= ಧ್ಯಾನಸ್ಥ2."]}], "ಧ್ಯಾನಾರೂಢೆ": [{"type": "noun", "defs": ["= ಧ್ಯಾನಸ್ಥೆ."]}], "ಧ್ಯಾನಿ": [{"type": "noun", "defs": ["a person engaged or habitually engages, in deep and abstract, religious meditation."]}], "ಧ್ಯಾನಿಸು": [{"type": "verb", "defs": ["to meditate or think on (something) deeply; to reflect.", "to engage in profound and abstract religious meditation.", "to have observant care; to consider; to be attentive.", "to concentrate on."]}], "ಧ್ಯಾಮ": [{"type": "noun", "defs": ["a kind of fragrant grass.", "the grass, Aristida depressa of Poaceae family, whose thin, long stem-like portion is used for making broomstick."]}], "ಧ್ಯಾಸ": [{"type": "noun", "defs": ["a meditating on (something) deeply; deep and continued thought; meditation.", "awareness of one's own feelings, what is happening around one, etc.; consciousness.", "the power, act or process of recalling to mind facts previously learned or past experiences; memory.", "the act, practice or power of noticing; observation."]}], "ಧ್ಯೇಯ": [{"type": "adjective", "defs": ["that is to be meditated on; fit for meditation.", "to be achieved; that is aimed at."]}, {"type": "noun", "defs": ["that which is aimed as a goal.", "the subject matter to be meditated on.", "a conception of something in its most excellent or perfect form; an ideal."]}], "ಧ್ಯೇಯಜೀವಿ": [{"type": "noun", "defs": ["a person whose behaviour or thought is based on high ideals; an idealist.", "one who follows his ideals to the maximum extent; a visionary or dreamer."]}], "ಧ್ಯೇಯವಸ್ತು": [{"type": "noun", "defs": ["= ಧ್ಯೇಯ2 - 2."]}], "ಧ್ಯೇಯವಾದ": [{"type": "noun", "defs": ["the theory that we have to strive to achieve something that is most excellent and idealistic."]}], "ಧ್ಯೇಯವಾದಿ": [{"type": "noun", "defs": ["= ಧ್ಯೇಯಜೀವಿ."]}], "ಧ್ಯೇಯಸಾಧನೆ": [{"type": "noun", "defs": ["a striving for achieving one's ideals.", "achievement of this."]}], "ಧ್ರುಪದ": [{"type": "noun", "defs": ["(mus.) a kind of song, sung in Hindūstāni system, in which a phrase or a line of a verse is repeated with systematic, elaborate elongation of the mode using different phrases of notes that are particular to the rāga (musical mode)."]}], "ಧ್ರುವ": [{"type": "adjective", "defs": ["not moving; unchangeable; firm; fixed; constant.", "not to be doubted; certain.", "permanent; eternal."]}, {"type": "noun", "defs": ["that which is eternal.", "a slightly variable, super giant, binary star, the brightest star in the constellation Ursa Minor, with a magnitude of 2.1, used as a guide for navigation, since it is the closest star to the north; North Star; Pole Star; Polaris.", "a mythological man personifying this star.", "one of a class of deities (known as Vasus, eight in number) who are the attendants upon Indra, the chief of gods.", "either end of any axis, as of the earth, of the celestial sphere, of a mitotic spindle during cell division, etc.; a pole.", "either of two ends of a magnet, opposed to each other; a magnetic pole.", "either of two opposed or extremes of opinion.", "a length of wood pointed at one end which is driven into the ground, for tying or supporting something; a stake.", "the lower portion of a tree, above the ground, trimmed by cutting off branches.", "a wooden roller used in an oil mill.", "(astrol.) a particular combination of astrological planets.", "(mus.) a cycle of time that has fourteen units (4+2+4+4).", "a variety of musical composition.", "the first verse of a song that is repeated at the end of each of the following verses.", "a spot on the skin of a horse where hair is curled.", "the tip of one's nose."]}], "ಧ್ರುವಕ": [{"type": "noun", "defs": ["= ಧ್ರುವ2 - 8."]}], "ಧ್ರುವಕ್ಷೇತ್ರ": [{"type": "noun", "defs": ["= ಧ್ರುವ2 - 15."]}], "ಧ್ರುವಗತಿ": [{"type": "noun", "defs": ["the unchangeable or eternal state."]}], "ಧ್ರುವಜಲ": [{"type": "noun", "defs": ["water (or source of water) that never gets dried."]}], "ಧ್ರುವತಾರೆ": [{"type": "noun", "defs": ["= ಧ್ರುವ2 - 2.", "2.(fig.) a most excellent or idealistic person who remains to be an example for ever.", "(fig.) a standard of perfection or excellence; an ideal."]}], "ಧ್ರುವತಾಳ": [{"type": "noun", "defs": ["= ಧ್ರುವ2 - 12."]}], "ಧ್ರುವತ್ವ": [{"type": "noun", "defs": ["the quality, state or fact of being eternal; eternal existence or duration; continuance without end; eternity."]}], "ಧ್ರುವನಕ್ಷತ್ರ": [{"type": "noun", "defs": ["= ಧ್ರುವತಾರೆ."]}], "ಧ್ರುವನಿಧಿ": [{"type": "noun", "defs": ["an amount of money kept as a permanent deposit, usu. for earning interest to be used for an ideal cause."]}], "ಧ್ರುವಪೈರು": [{"type": "noun", "defs": ["a long-lasting plant (as coconut or arecanut tree)."]}], "ಧ್ರುವಫಲ": [{"type": "noun", "defs": ["= ಧ್ರುವಪೈರು."]}], "ಧ್ರುವಬೇರ": [{"type": "noun", "defs": ["an idol of a deity that is permanently fixed at a place."]}], "ಧ್ರುವಮಂಡಲ": [{"type": "noun", "defs": ["= ಧ್ರುವ2 - 2."]}], "ಧ್ರುವಮೃತ್ಯು": [{"type": "noun", "defs": ["death, as an inevitable and inescapable happening in one's life."]}], "ಧ್ರುವಯಷ್ಟಿ": [{"type": "noun", "defs": ["= ಧ್ರುವ2 - 8."]}], "ಧ್ರುವರಕ್ಷಕ": [{"type": "noun", "defs": ["the Little Dipper, situated close to the North Star (Polaris), in the constellation Ursa Minor."]}], "ಧ್ರುವಲೋಕ": [{"type": "noun", "defs": ["= ಧ್ರುವ2 - 2."]}], "ಧ್ರುವವೀಣೆ": [{"type": "noun", "defs": ["a kind of stringed, musical instrument."]}], "ಧ್ರುವವುಂಡಿಗೆ": [{"type": "noun", "defs": ["a permanent endowment of a land or village, that is free from being taxed."]}], "ಧ್ರುವವೃತ್ತ": [{"type": "noun", "defs": ["either of the two imaginary circles parallel to the equator being c. 66º 34' south or north of it.", "the region around either South or North Pole; the Antarctica or Arctic."]}], "ಧ್ರುವಸ್ಥಾನ": [{"type": "noun", "defs": ["= ಧ್ರುವ2 - 5."]}], "ಧ್ರುವೀಕರಣ": [{"type": "noun", "defs": ["the producing of polarity in something or the acquiring of polarity; polarisation.", "the condition of electromagnetic or other waves in which the transverse motion or field of the wave is confined to one plane or one direction; polarisation.", "the production of this condition; polarisation.", "alignment of different parties with different ideologies for achieving some purpose; polarisation."]}], "ಧ್ರುವೀಯ": [{"type": "adjective", "defs": ["of, relating to, near, coming from the region near the North or South pole; polar.", "of a (magnetic) pole or poles; polar.", "having polarity."]}], "ಧ್ರುವೀಯತೆ": [{"type": "noun", "defs": ["the tendency of bodies having opposite magnetic poles to arrange themselves so that their two extremities point to the two magnetic poles of the earth; polarity.", "any tendency to turn, grow, think, feel, etc. in a certain way or direction, as if because of magnetic attraction or repulsion; polarity.", "the having or showing of contrary qualities, powers, tendencies, forms, etc. as the two electrodes of a battery, etc.; polarity.", "the condition of being positive or negative with respect to some reference point or object, as electricity; polarity."]}], "ಧ್ರುವೆ": [{"type": "noun", "defs": ["a wooden ladle used in religious sacrifices.", "the plant Barleria prionites of Acanthaceae family; common yellow nail dye.", "the plant Desmodium gangeticum of Papilionaceae family."]}], "ಧ್ರೌವ್ಯ": [{"type": "noun", "defs": ["fixedness; firmness; immovableness.", "the quality, state or fact of being eternal; eternity."]}], "ಧ್ವಂಸ": [{"type": "noun", "defs": ["a coming down suddenly from a standing or sitting position; a falling down.", "a disappearing from the sight; disappearance.", "a removing from; removal.", "the act or process of destroying or the fact of being destroyed; demolition; destruction.", "ಧ್ವಂಸ ಮಾಡು dhvamsa māḍu to destroy completely; ಧ್ವಂಸವಾಗು dhvamsavāgu to be destroyed completely."]}], "ಧ್ವಂಸಕ": [{"type": "adjective", "defs": ["having the tendency to destroy or spoil; destroying; spoiling."]}, {"type": "noun", "defs": ["a man who destroys.", "a kind of disease caused by over-drinking."]}], "ಧ್ವಂಸನ": [{"type": "noun", "defs": ["the act of pushing, chopping down something; a felling.", "the act or fact of falling down.", "the act of being removed (from a place) or being disappearing; disappearance.", "the act of destroying or being destroyed; the fact or state of being destroyed.", "the act of throwing or driving hither and thither; a scattering.", "the act or fact of dropping something in small pieces or particles over; a sprinkling."]}], "ಧ್ವಂಸನೀಯ": [{"type": "adjective", "defs": ["that is to be or fit to be destroyed."]}, {"type": "noun", "defs": ["= ಧ್ವಂಸನ - 4."]}], "ಧ್ವಂಸಿ": [{"type": "noun", "defs": ["= ಧ್ವಂಸನ - 1, 2 & 4.", "he who destroys."]}], "ಧ್ವಜ": [{"type": "noun", "defs": ["a piece of cloth or bunting, often attached to a staff, with distinctive colours, patterns or symbolic devices, used as a national or state symbol, as a signal, etc.; banner; a flag; standard.", "an object used to represent something; a symbol.", "the organ of copulation and of urinary excretion in men; the penis.", "a foretelling the prosperity of a person living in a house, based on the remainder got by dividing the area of the site of the building by 8.", "ಧ್ವಜ ಹಾರಿಸು dhvaja hārisu to hoist a flag; 2. (fig.) to become victorious."]}], "ಧ್ವಜಗಂಭ": [{"type": "noun", "defs": ["= ಧ್ವಜಸ್ತಂಭ."]}], "ಧ್ವಜದ್ರುಮ": [{"type": "noun", "defs": ["any tall palm tree (used for making flag-staffs)."]}], "ಧ್ವಜಪಟ": [{"type": "noun", "defs": ["= ಧ್ವಜ - 1."]}], "ಧ್ವಜಭಂಗ": [{"type": "noun", "defs": ["a falling down of a flag.", "a failure of the penis to being swollen and rigid; impotence of the male organ."]}], "ಧ್ವಜಭೂಮಿ": [{"type": "noun", "defs": ["a piece of ground where a flagpole is planted for hoisting a flag."]}], "ಧ್ವಜಮುದ್ರೆ": [{"type": "noun", "defs": ["a particular hand-posture while worshiping a deity."]}], "ಧ್ವಜವಂದನೆ": [{"type": "noun", "defs": ["a saluting of a flag (of a nation organisation, etc.)."]}], "ಧ್ವಜಸ್ತಂಭ": [{"type": "noun", "defs": ["a pole on which a flag is raised and flown; a flag-pole.", "a tall pillar of wood or stone, with somewhat tapered top, to which flag or flag-like metal plates are fixed, and installed in front of a temple."]}], "ಧ್ವಜಾದಂಡ": [{"type": "noun", "defs": ["= ಧ್ವಜಸ್ತಂಭ."]}], "ಧ್ವಜಾಯ": [{"type": "noun", "defs": ["= ಧ್ವಜ - 4."]}], "ಧ್ವಜಾರೋಹಣ": [{"type": "noun", "defs": ["a hoisting of a flag."]}], "ಧ್ವಜಿ": [{"type": "noun", "defs": ["a man who draws the sweet sap from palm trees; a toddy-drawer."]}], "ಧ್ವಜಿನಿ": [{"type": "noun", "defs": ["a battalion of an army bearing its own particular flag."]}], "ಧ್ವಜಿನೀಪತಿ": [{"type": "noun", "defs": ["the chief of an army or a battallion."]}], "ಧ್ವಜಿನೀಪತಿತ್ವ": [{"type": "noun", "defs": ["the status, office, duties of the chief of an army or a battalion."]}], "ಧ್ವನನ": [{"type": "noun", "defs": ["the act of making a sound or sounds.", "a humming or singing in a low voice.", "a suggesting something indirectly; a hinting at.", "the suggested sense of a word (as opp. to its literal sense)."]}], "ಧ್ವನನಮಾರ್ಗ": [{"type": "noun", "defs": ["the style or manner of suggesting a sense of a word that is different from its literal sense."]}], "ಧ್ವನಿ": [{"type": "noun", "defs": ["sound made through the mouth by human beings; voice.", "a sound produced by playing a musical instrument.", "the quality or tone of vocal sound.", "echo - a) the repetition of a sound by reflection of sound waves from a surface, b) a sound so produced.", "(ling.) a word or part of a word pronounced with a single, uninterrupted sounding of the voice; a unit of pronunciation, consisting of a single sound of great sonority; a syllable.", "the sense of a word or expression suggested indirectly as opp. to its literal sense)", "ಧ್ವನಿ ಕೂರು dhvani kūru (one's voice) to fail; ಧ್ವನಿ ಬೀಳು dhvani bīḷu = ಧ್ವನಿ ಕೂರು; ಧ್ವನಿ ಮಾಡು dhvani māḍu to produce a vocal sound of sounds; ಧ್ವನಿ ಹೂತುಹೋಗು dhvani hūtuhōgu = ಧ್ವನಿ ಕೂರು; ಧ್ವನಿ ಹೊರಡು dhvani horaḍu (a vocal sound) to be produced; 2. usu. used negatively) (reply, answer) to come forth from shame, fear, etc."]}], "ಧ್ವನಿಕಾರ": [{"type": "noun", "defs": ["an upholder of the theory that the indirectly suggested sense of a literary work is important than the literal sense."]}], "ಧ್ವನಿಕಾವ್ಯ": [{"type": "noun", "defs": ["a literary work that gives prominence to the indirectly suggested sense rather than literal sense."]}], "ಧ್ವನಿಗಯ್": [{"type": "verb", "defs": ["= ಧ್ವನಿಗೆಯ್."]}], "ಧ್ವನಿಗುಡು": [{"type": "verb", "defs": ["= ಧ್ವನಿಗೊಡು."]}], "ಧ್ವನಿಗೆಯ್": [{"type": "verb", "defs": ["to produce a vocal sound of sounds.", "to express one's opinion."]}], "ಧ್ವನಿಗೈ": [{"type": "verb", "defs": ["= ಧ್ವನಿಗೆಯ್."]}], "ಧ್ವನಿಗೊಡು": [{"type": "verb", "defs": ["to produce a vocal sound or sounds."]}], "ಧ್ವನಿಜಾರು": [{"type": "noun", "defs": ["an intermediate sound produced in the transition of the speech organs from the position for one sound to that for another; glide."]}], "ಧ್ವನಿತ": [{"type": "adjective", "defs": ["sounded; uttered.", "hinted at; suggested indirectly."]}, {"type": "noun", "defs": ["a sense of a word, sentence, etc. suggested indirectly.", "that which makes a (vocal) sound.", "a (vocal) sound.", "the thundering sound produced by clouds."]}], "ಧ್ವನಿತಂತು": [{"type": "noun", "defs": ["either of two pairs of membranous cords or folds in the larynx, consisting of a thicker upper pair (false vocal cords) and a lower pair (true vocal cords) which produce sound by vibrating themselves when air passes through them in a regulated manner; vocal cords."]}], "ಧ್ವನಿತತ್ತ್ವ": [{"type": "noun", "defs": ["the theory that the indirectly suggested sense in a literary work is important than the literal sense."]}], "ಧ್ವನಿತತ್ವ": [{"type": "noun", "defs": ["= ಧ್ವನಿತತ್ತ್ವ."]}], "ಧ್ವನಿತಾರ್ಥ": [{"type": "noun", "defs": ["the sense in a literary work suggested indirectly, which is different from the literal sense."]}], "ಧ್ವನಿತೆಗೆ": [{"type": "verb", "defs": ["to produce a vocal sound or sounds.", "to talk; to speak."]}], "ಧ್ವನಿಪರಿವರ್ತನೆ": [{"type": "noun", "defs": ["the natural change in the voice that occurs in boys in the beginning of their teenage.", "(ling.) a phonetic change that happens gradually in the pronunciation of a letter or a phoneme in a language."]}], "ಧ್ವನಿಪೆಟ್ಟಿಗೆ": [{"type": "noun", "defs": ["the structure of muscle and cartilage at the upper end of the human trachea, containing the vocal cords and serving as the organ of voice; the voice box; the larynx.", "a box-like instrument with closure attached to it by operating which a base pitch is produced for a singer or player of a musical instrument."]}], "ಧ್ವನಿಪ್ರತಿಫಲಕ": [{"type": "noun", "defs": ["a structure over or behind a rostrum, stage, etc. designed to reflect sound toward the audience; a sounding board.", "a thin plate, as of wood, built into a musical instrument to increase its resonance or serve as a resonator; a sound-board."]}], "ಧ್ವನಿಪ್ರಸ್ಥಾನ": [{"type": "noun", "defs": ["the upholding of the view that the indirectly suggested sense of a literary work is important than the literal sense."]}], "ಧ್ವನಿಭ್ರಮೆ": [{"type": "noun", "defs": ["a wrong comprehension of a word when pronounced by another; phonetic confusion."]}], "ಧ್ವನಿಮತ": [{"type": "noun", "defs": ["a vote based on estimation of the relative strength of ayes and noes called out rather than on a counting of ballots, a roll call or a division; voice vote."]}], "ಧ್ವನಿಮಾ": [{"type": "noun", "defs": ["(ling.) a set of phonetically similar but slightly different sounds in a language that are heard as the same sound by native speakers and are represented in phonemic transcription by the same symbol; a phoneme."]}], "ಧ್ವನಿಮಾರ್ಪಾಟು": [{"type": "noun", "defs": ["= ಧ್ವನಿಪರಿವರ್ತನೆ."]}], "ಧ್ವನಿಮುದ್ರಕ": [{"type": "noun", "defs": ["a man who records sounds with the help of a tape recorder; a recorder.", "a device for recording sounds (for re-producing back later); a tape recorder or digital writer."]}], "ಧ್ವನಿಮುದ್ರಣ": [{"type": "noun", "defs": ["the recording of sounds on magnetic tapes, compact discs, etc.; sound recording."]}], "ಧ್ವನಿಮುದ್ರಣಯಂತ್ರ": [{"type": "noun", "defs": ["= ಧ್ವನಿಮುದ್ರಕ - 2."]}], "ಧ್ವನಿಮುದ್ರಿಕೆ": [{"type": "noun", "defs": ["a disc or magnetic tape on which sound is recorded."]}], "ಧ್ವನಿಮುದ್ರಿಸು": [{"type": "verb", "defs": ["to record sounds on a disc, magnetic tape, etc."]}], "ಧ್ವನಿಯಿಸು": [{"type": "verb", "defs": ["= ಧ್ವನಿಸು."]}], "ಧ್ವನಿವರ್ಧಕ": [{"type": "noun", "defs": ["any of various devices, usu. electronic, by which speech, music, etc., can be intensified and made audible throughout a room, hall or the like or from a distance; a loud-speaker."]}], "ಧ್ವನಿವಾದ": [{"type": "noun", "defs": ["= ಧ್ವನಿತತ್ತ್ವ."]}], "ಧ್ವನಿವಾಹಕ": [{"type": "noun", "defs": ["a telephonic instrument used for secretly listening to or recording conversations; a dictograph."]}], "ಧ್ವನಿವಿಕಾರ": [{"type": "noun", "defs": ["(rhet.) a temporary change in one's voice from fear, distress, etc.", "(ling.) a variation in the original sound (of a word, syllable, phoneme, etc.)."]}], "ಧ್ವನಿವಿಜ್ಞಾನ": [{"type": "noun", "defs": ["the branch of physics dealing with sound, esp. with its transmission; acoustics.", "the study of speech sounds, their production and combination, and their representation by written symbols; phonetics."]}], "ಧ್ವನಿಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["= ಧ್ವನಿವಿಜ್ಞಾನ."]}], "ಧ್ವನಿಸಂಕೇತ": [{"type": "noun", "defs": ["a symbol used in phonetic transcription, having a separate symbol for every speech sound that can be distinguished."]}], "ಧ್ವನಿಸಂಪತ್ತು": [{"type": "noun", "defs": ["a rich voice."]}], "ಧ್ವನಿಸಾಂಗತ್ಯ": [{"type": "noun", "defs": ["the concordance or harmonious agreement of different sounds."]}], "ಧ್ವನಿಸು": [{"type": "verb", "defs": ["to produce a vocal sound.", "to be indicated or expressed by an indirect suggestion; to be hinted.", "to express so; to hint."]}], "ಧ್ವನಿಸುರುಳಿ": [{"type": "noun", "defs": ["a thin plastic ribbon coated with a suspension of ferromagnetic iron oxide particles, used as a storage medium for magnetic recording of sounds; a magnetic tape."]}], "ಧ್ವನ್ಯಂತರ": [{"type": "noun", "defs": ["different sounds.", "difference between two sounds."]}], "ಧ್ವನ್ಯಕ್ಷರ": [{"type": "noun", "defs": ["a phonetic symbol or character, as used in printing; a phonotype."]}], "ಧ್ವನ್ಯನುರೂಪತೆ": [{"type": "noun", "defs": ["the phonetic correspondence, usu. between two or more languages."]}], "ಧ್ವನ್ಯರ್ಥ": [{"type": "noun", "defs": ["the sense of a literary work suggested indirectly, that is different from the literal sense."]}], "ಧ್ವನ್ಯಾತ್ಮಕ": [{"type": "adjective", "defs": ["in the form of sound; being expressed through a sound or sounds.", "suggesting or hinting indirectly."]}, {"type": "noun", "defs": ["that which is pregnant with suggested meaning."]}], "ಧ್ವನ್ಯಾತ್ಮಕತೆ": [{"type": "noun", "defs": ["the quality or fact of being pregnant with suggested meaning."]}], "ಧ್ವಸ್ತ": [{"type": "adjective", "defs": ["fallen down.", "spoiled; destroyed.", "not to be found; lost."]}, {"type": "noun", "defs": ["that which has fallen down.", "that which is spoiled, destroyed.", "abusive language."]}], "ಧ್ವಾಂಕ್ಷ": [{"type": "noun", "defs": ["any of a genus (Corvus, family Corvidae) of large, non-migratory passerine birds with glossy black plumage and a typical harsh call, including the raven, rook, and jackdaw; a crow."]}], "ಧ್ವಾಂತ": [{"type": "noun", "defs": ["absence of light; darkness.", "(myth.) name of a hell."]}], "ಧ್ವಾನ": [{"type": "noun", "defs": ["a sound; an utterance."]}], "ಧ್ವಾನಿತ": [{"type": "adjective", "defs": ["uttered; expressed through a sound."]}], "ನ": [{"type": "noun", "defs": ["(gen. pronounced with the vowel 'ಅ') the thirty fourth letter of Kannaḍa alphabet and the twentieth consonant.", "a symbol for the zero.", "(pros.) a group consisting of three short syllabic instants ( uuu ); tribrach."]}], "ನಂಗರಿ": [{"type": "noun", "defs": ["a farm implement used to cut, turn up, and break up the soil, either drawn by a pair of bullock or motor driven; a plough."]}], "ನಂಗರು": [{"type": "noun", "defs": ["a heavy object, usu. a shaped iron weight with flukes, lowered by cable or chain to the bottom of a body of water to keep a ship or boat from drifting; an anchor", "ನಂಗರು ಎತ್ತು nangaru ettu to take out the anchor as to move the ship; to start a ship; ನಂಗರು ಬಿಡು nangaru biḍu to lower the anchor overboard so as to keep from drifting; to station a ship; ನಂಗರುವಾಡೆ nangaruvāḍe a protected inlet or branch of a sea, lake, etc., where ships can anchor, with port facilities; a harbour; ನಂಗರುಹಾಕು nangaru hāku = ನಂಗರು ಬಿಡು."]}], "ನಂಗಲ್ಲು": [{"type": "noun", "defs": ["= ನಂಗರು."]}], "ನಂಗಿಲು": [{"type": "noun", "defs": ["a thin plate of flexible cartilage in front of the glottis that folds back over and protects the glottis during swallowing; the epiglottis."]}], "ನಂಗು": [{"type": "noun", "defs": ["the tree Holarrhena antidysentrica of Apocynaceae family."]}], "ನಂಗುಲಿಕ": [{"type": "noun", "defs": ["the plant Gloriosa superba of Liliaceae family."]}], "ನಂಚು": [{"type": "verb", "defs": ["= ನಂಜು1.", "ನಂಚಿಕೊಳ್ಳು nancikoḷḷu = ನಂಜು1."]}, {"type": "verb", "defs": ["(dial.) to put off a burning lamp."]}], "ನಂಜ": [{"type": "noun", "defs": ["Śiva, who has swallowed the deadly poison that came out when the cosmic ocean was churned by gods and daemons."]}, {"type": "noun", "defs": ["= ನಂಜೆ."]}], "ನಂಜೆನೆಲ": [{"type": "noun", "defs": ["= ನಂಜೆ."]}, {"type": "noun", "defs": ["= ನಂಜೆ."]}], "ನಂಜವಟ್ಟಲು": [{"type": "noun", "defs": ["= ನಂದಿಬಟ್ಟಲು."]}], "ನಂಜವಟ್ಟು": [{"type": "noun", "defs": ["= ನಂದಿಬಟ್ಟಲು."]}], "ನಂಜಾರೆ": [{"type": "noun", "defs": ["the plant Rauwolfia serpentina of Apocynaceae family, bright green leaves, and whitish flowers, the reserpine (the crystalline alkaloid) extracted from the root of which used in the treatment of hypertension and some forms of mental illness."]}], "ನಂಜಿಡಿ": [{"type": "verb", "defs": ["to contain a poison; to be or become poisonous.", "(fig.) to have malice, spite, hatred."]}], "ನಂಜಿಡು": [{"type": "verb", "defs": ["to add poison to.", "to give poison to."]}], "ನಂಜಿನಕೊರಡು": [{"type": "noun", "defs": ["the middle-sized tree Strychnos nux-vomica of Loganiaceae family, with poisonous, disk-like seed containing strychnine, brucine and other alkaloids; nux-vomica."]}], "ನಂಜಿಲಿ": [{"type": "noun", "defs": ["a variety of mouse whose bite is poisonous."]}], "ನಂಜಿಸು": [{"type": "verb", "defs": ["to cause to lick."]}], "ನಂಜು": [{"type": "verb", "defs": ["to taste or lick a small quantity of pickles or other condiments for adding taste or flavour to the principal food.", "ನಂಜಿಕೊಳ್ಳು nanjikoḷḷu = ನಂಜು1;"]}, {"type": "noun", "defs": ["a substance, including the venom secreted by some animals as snakes, with an inherent property that tends to destroy life or impair health, even when consumed in small quantities; any poison.", "a venomous snake or a snake in gen. 3. that which causes the blood become impure.", "the fever caused by such a substance.", "the condition of being inflicted which is intolerable or unendurable.", "the condition of mind so afflicted.", "jealous feeling expressed through taunting, sneering, caustic remark, etc.", "ನಂಜಾಗು nanjāgu to become poisonous; to turn to be a poison; 2. to act complete or absolutely against; 3. to absorb pathogenic micro-organisms and their products into the bloodstream; to have sepsis; to be putrefied; ನಂಜಿನ ಸುಳಿ nanjina suḷi a situation in which the solution of one problem gives rise to another, but the solution of this or of other problems rising out of it, brings back the first; a vicious circle; ನಂಜಿನುರುಳಿ nanjinuruḷi a pill made of poisonous substance; ನಂಜಿನೊಡೆಯ nanjinoḍeya (myth.) Ādiśeṣa, the king of serpents; ನಂಜು ಕಾರು nanju kāru to feel or show envious resentment, strong dislike; ನಂಜು ನುಡಿ1 nanju nuḍi to speak enviously; to show one's resentful dislike; ನಂಜು ನುಡಿ2 nanju nuḍi envious or resentful words or speech."]}], "ನಂಜುಂಡ": [{"type": "noun", "defs": ["Śiva, who swallowed the all-destroying poison that came out when the cosmic ocean was churned by the gods and daemons."]}], "ನಂಜುಗಣ್ಣು": [{"type": "noun", "defs": ["an eye with dimmed vision."]}], "ನಂಜುಗೊರಲ": [{"type": "noun", "defs": ["= ನಂಜುಂಡ."]}], "ನಂಜುಗೊರಲು": [{"type": "noun", "defs": ["= ನಂಜುಗೊರಳು."]}], "ನಂಜುಗೊರಳ": [{"type": "noun", "defs": ["= ನಂಜುಂಡ."]}], "ನಂಜುಗೊರಳು": [{"type": "noun", "defs": ["the neck of Śiva."]}], "ನಂಜುಜೋಗಿ": [{"type": "noun", "defs": ["(masc.) a doctor who is an expert in administering antidotes; a toxicologist."]}], "ನಂಜುಜ್ವರ": [{"type": "noun", "defs": ["a fever that a woman likely to get immediately after giving birth to a child, caused by sepsis; a puerperal fever."]}], "ನಂಜುಬಟ್ಟಲು": [{"type": "noun", "defs": ["= ನಂದಿಬಟ್ಟಲು."]}], "ನಂಜುರಂಜಿಕೆ": [{"type": "noun", "defs": ["a kind of plant."]}], "ನಂಜುರುಳೆ": [{"type": "noun", "defs": ["a kind of venomous insect."]}], "ನಂಜುರೋಧಕ": [{"type": "adjective", "defs": ["inhibiting the action of micro-organisms; antiseptic."]}, {"type": "noun", "defs": ["any substance that inhibits the action of micro-organisms; an antiseptic."]}], "ನಂಜುಹಿಡಿ": [{"type": "verb", "defs": ["(an infection) to turn septic by absorbing pathogenic micro-organisms and their products into the bloodstream."]}], "ನಂಜೂಡು": [{"type": "verb", "defs": ["to feed poison; to give poison to.", "to smear with some poisonous substance."]}], "ನಂಜೂಱು": [{"type": "verb", "defs": ["(poison) to enter into the body.", "to make a poison enter into another's body as with a bite, injecting with a syringe, etc."]}], "ನಂಜೆ": [{"type": "noun", "defs": ["an agricultural field with required water supplied by means of channels; irrigated land."]}], "ನಂಟ": [{"type": "noun", "defs": ["(masc.) a man connected with another by blood, marriage, etc.; a kinsman; a relative.", "a man who has helped another at the time of distress, misery, suffering, etc.", "ನಂಟರ ಮನೆಗೆ ನಾಯಿ ಹೊಕ್ಕರೆ ಎಂಟು ಮನೆಗೆ ಬೆರಕೆ eṇṭare manege nāyi hokkare eṇṭu manege berake (prov.) a bad or evil thing spoils the entire surrounding; a rotten sheep infects the whole flock; ನಂಟರಿಷ್ಟರು naṇṭariṣṭaru (pl.) relatives, friends and well-wishers."]}], "ನಂಟತನ": [{"type": "noun", "defs": ["connection of persons by blood, marriage, etc.; kinship; relation."]}], "ನಂಟರ್ತನ": [{"type": "noun", "defs": ["= ನಂಟತನ."]}], "ನಂಟಸ್ತ": [{"type": "noun", "defs": ["= ನಂಟ - 1."]}], "ನಂಟಸ್ತನ": [{"type": "noun", "defs": ["= ನಂಟತನ."]}], "ನಂಟಸ್ತಿಕೆ": [{"type": "noun", "defs": ["= ನಂಟತನ."]}], "ನಂಟಿಕೆ": [{"type": "noun", "defs": ["= ನಂಟತನ."]}], "ನಂಟಿತಿ": [{"type": "noun", "defs": ["a woman connected with another by blood, marriage, etc.; a kinswoman; a relative."]}], "ನಂಟು": [{"type": "verb", "defs": ["to join (oneself) with; to have physical contact."]}, {"type": "noun", "defs": ["= ನಂಟತನ.", "the fact of being connected, related, as in thought, meaning, profession or any aspect of living; relation.", "ford or tender feeling; warm liking; affection; love."]}], "ನಂಟುಗಾಣಿಸು": [{"type": "verb", "defs": ["to cause to be associated, related.", "to connect (two or more persons) by marriage.", "to bring harmony, consonance, agreement, etc. between (two others)."]}], "ನಂಟುಗೊಳುಹ": [{"type": "noun", "defs": ["the act or fact of creating relation between or becoming related with."]}], "ನಂಟುತನ": [{"type": "noun", "defs": ["= ನಂಟತನ."]}], "ನಂಟುಭಕ್ತಿ": [{"type": "noun", "defs": ["affection, favouritism shown to relatives."]}], "ನಂಟುಮೊಱೆ": [{"type": "noun", "defs": ["= ನಂಟತನ."]}], "ನಂಟುವಳಿ": [{"type": "noun", "defs": ["= ನಂಟತನ."]}], "ನಂಡುಲಿ": [{"type": "noun", "defs": ["(dial.) a sowing of seeds while the soil has moisture or is slightly wet."]}], "ನಂತರ": [{"type": "noun", "defs": ["a later time."]}, {"type": "adverb", "defs": ["(wrong form of 'ಅನಂತರ') subsequently or at a later time; afterwards."]}], "ನಂದ": [{"type": "noun", "defs": ["the emotion of great delight or happiness; joy.", "name of one of the nine treasures of Kubēra, the regent of wealth.", "(arith.) a symbol for the number nine.", "(pros.) a kind of meter ನಂದೋರಾಜಾ ಭವಿಷ್ಯತಿ nandō rāja bhaviṣyati (a Samskřta sentence meaning) 'it might happen on some (indefinite) day'."]}], "ನಂದಕ": [{"type": "noun", "defs": ["the act of giving great joy or pleasure to another.", "delight; happiness; joy.", "a weapon with a long blade for cutting or thrusting; a sword.", "the sword of Viṣṇu.", "a frog.", "a kind of meter."]}], "ನಂದಕೆ": [{"type": "noun", "defs": ["a frog."]}], "ನಂದಗೋಕುಲ": [{"type": "noun", "defs": ["(fig.) a joyous house or family having large number of children."]}], "ನಂದದೀವಿಗೆ": [{"type": "noun", "defs": ["= ನಂದಾದೀಪ."]}], "ನಂದನ": [{"type": "noun", "defs": ["the act of giving great joy or pleasure to another.", "delight; happiness; joy.", "one's son.", "the garden of heaven.", "any garden, pleasure-grove, in gen.", "the twenty sixth year in the cycle of sixty years.", "Śiva.", "Viṣṇu.", "(dance.) a kind of musical composition."]}], "ನಂದನವನ": [{"type": "noun", "defs": ["= ನಂದನ - 4 & 5."]}], "ನಂದನೆ": [{"type": "noun", "defs": ["one's daughter."]}], "ನಂದಯಂತಿ": [{"type": "noun", "defs": ["name of a musical mode."]}], "ನಂದವರ್ತಿ": [{"type": "noun", "defs": ["= ನಂದಿಬಟ್ಟಲು."]}], "ನಂದವಿಡು": [{"type": "verb", "defs": ["to give keen enjoyment; to delight."]}], "ನಂದಾದೀಪ": [{"type": "noun", "defs": ["an ever-lasting (or long-lasting) votive lamp."]}], "ನಂದಾದೀಪ್ತಿ": [{"type": "noun", "defs": ["= ನಂದಾದೀಪ."]}], "ನಂದಾದೀವಿಗೆ": [{"type": "noun", "defs": ["= ನಂದಾದೀಪ."]}], "ನಂದಾದ್ಯುತಿ": [{"type": "noun", "defs": ["= ನಂದಾದೀಪ."]}], "ನಂದಾಬೆಂಕಿ": [{"type": "noun", "defs": ["a fire maintained perpetually; an ever-burning fire."]}], "ನಂದಾಬೆಳಕು": [{"type": "noun", "defs": ["= ನಂದಾದೀಪ."]}], "ನಂದಾವನ": [{"type": "noun", "defs": ["a garden of flowering plants that flower during all the seasons."]}], "ನಂದಾವಳ": [{"type": "noun", "defs": ["= ನಂದಾದೀಪ."]}], "ನಂದಾವುಳ": [{"type": "noun", "defs": ["= ನಂದಾದೀಪ."]}], "ನಂದಾವೆಳಕು": [{"type": "noun", "defs": ["= ನಂದಾದೀಪ."]}], "ನಂದಿ": [{"type": "noun", "defs": ["he who delights (others).", "he who enjoys or get delighted.", "Basava, (the divine ox), the vehicle of Śiva.", "an idol of an ox or Nandi, the divine ox.", "the large, deciduous tree Lagerstroemia lanceolata of Lythraceae family, with thin, white bark and hard wood which is used building construction.", "the large, deciduous tree Toona ciliata (= Cedrela toona) of Meliaceae family, with paripinnate leaves and white flowers, the wood of which is used in making plywood, tea-chests, furniture, etc.", "one of several Jaina associations or schools.", "a clan of Jaina mendicants", "ನಂದಿ ಬಿಡು nandi biḍu to allow a bull to graze without restriction in the village, as part of a funeral rite; ನಂದಿಯ ಕುಣಿತ nandiya kuṇita a dancing upholding nandidhvaja."]}], "ನಂದಿಯ ಕೋಲು": [{"type": "noun", "defs": ["= ನಂದಿಕಂಬ."]}], "ನಂದಿಕ": [{"type": "noun", "defs": ["= ನಂದಿ - 3."]}], "ನಂದಿಕಂಬ": [{"type": "noun", "defs": ["a tall, well decorated pole having small jingling plates, which is held vertically by a single person, while dancing during village god festivals and cultural occasions."]}], "ನಂದಿಕಲ್ಲುಸೊಪ್ಪು": [{"type": "noun", "defs": ["the plant Bergia ammanioides of Elatinaceae family."]}], "ನಂದಿಕೆ": [{"type": "noun", "defs": ["the fact or an instance of extinguishing a burning lamp or the fact of a lamp stopping burning."]}], "ನಂದಿಕೇಶ": [{"type": "noun", "defs": ["= ನಂದಿ - 3.", "Śiva."]}], "ನಂದಿಕೇಶ್ವರ": [{"type": "noun", "defs": ["= ನಂದಿಕೇಶ."]}], "ನಂದಿಕೋಲು": [{"type": "noun", "defs": ["= ನಂದಿಕಂಬ.", "ನಂದಿ ಕೋಲು ಕುಣಿತ nandi kōlu kuṇita = ನಂದಿಯ ಕುಣಿತ."]}], "ನಂದಿತ": [{"type": "adjective", "defs": ["delighted; glad; pleased."]}], "ನಂದಿಧ್ವಜ": [{"type": "noun", "defs": ["= ನಂದಿಕಂಬ.", "a banner having a symbol of Nandi, the bull of Śiva.", "a man belonging to a sub-castes of Śaivas, having that banner."]}], "ನಂದಿನಿ": [{"type": "noun", "defs": ["she who delights.", "one's daughter.", "the tree Lagerstroemia lanceolata of Lythraceae family."]}], "ನಂದಿನೆಲಬೇವು": [{"type": "noun", "defs": ["the plant Justicia diffusa (= Rostellularia diffusa) of Acanthaceae family."]}], "ನಂದಿಬಟ್ಟಲು": [{"type": "noun", "defs": ["the flowering plant Tabernaemontana divaricata (= T. coronaria, = Ervatamia coronaria) of Apocynaceae family.", "its white flower."]}], "ನಂದಿಮೆಟ್ಟಲು": [{"type": "noun", "defs": ["a flight of steps in front of a temple, having on either side idols of Nandi, the divine bull."]}], "ನಂದಿಲಿಪಿ": [{"type": "noun", "defs": ["a kind of secret script."]}], "ನಂದಿವಟ್ಟ": [{"type": "noun", "defs": ["= ನಂದಿಬಟ್ಟಲು."]}], "ನಂದಿವಟ್ಟಲು": [{"type": "noun", "defs": ["= ನಂದಿಬಟ್ಟಲು."]}], "ನಂದಿವರ್ಧನ": [{"type": "noun", "defs": ["Śiva.", "one's son.", "a friend.", "the tree Lagerstroemia lanceolata of Lythraceae family.", "a particular type of construction (chiefly of temples).", "the fifteenth day of a lunar fortnight; full moon-day or new moon-day."]}], "ನಂದಿವಾಳ": [{"type": "noun", "defs": ["= ನಂದಿಬಟ್ಟಲು (?)."]}], "ನಂದಿಸು": [{"type": "verb", "defs": ["to extinguish a lamp, fire, etc.; to put off.", "to put an end to; to destroy; to cause to die out.", "to ward off; to fend off; to prevent (an evil) from happening to remove (it)."]}, {"type": "verb", "defs": ["to give great pleasure, satisfaction or enjoyment to; to please highly; to delight."]}], "ನಂದಿಸೋಪಾನ": [{"type": "noun", "defs": ["= ನಂದಿಮೆಟ್ಟಲು."]}], "ನಂದಿಹಾಳ": [{"type": "noun", "defs": ["a variety of sorghum (great millet) plant.", "its corn."]}], "ನಂದೀಮುಖಿ": [{"type": "noun", "defs": ["a variety of wheat plant.", "its grain."]}], "ನಂದೀಶ": [{"type": "noun", "defs": ["= ನಂದಿ - 3."]}], "ನಂದೀಶ್ವರ": [{"type": "noun", "defs": ["= ನಂದಿ - 3.", "name of a jaina mythological island.", "a jaina festival."]}], "ನಂದೀಶ್ವರಂಗೆಯ್": [{"type": "verb", "defs": ["(Jain.) to observe ನಂದೀಶ್ವರ festival."]}], "ನಂದು": [{"type": "verb", "defs": ["(a lamp, fire, etc.) to be extinguished; to be put out.", "(pain, suffering, etc.) to become milder and gradually quenched.", "to lose lustre; to become dull; to wither; to fade."]}], "ನಂದುಗಳ್ಳಿ": [{"type": "noun", "defs": ["the spurge plant Euphorbia tirucalli of Euphorbiaceae family."]}], "ನಂದುರಿ": [{"type": "noun", "defs": ["= ನಂದಿ - 6."]}], "ನಂದೆ": [{"type": "noun", "defs": ["Durge, the formidable form of Pārvati.", "the first or sixth or eleventh day of a lunar fortnight."]}], "ನಂದ್ಯಾಮ್ಲ": [{"type": "noun", "defs": ["the plant Mangifera sylvatica.", "its fruit."]}], "ನಂದ್ಯಾವರ್ತ": [{"type": "noun", "defs": ["= ನಂದಿಬಟ್ಟಲು.", "the valerian plant Valeriana wallichii of Valerianaceae family; Indian Valerian.", "(archit.) a type of circular building that does not have a door on its west side.", "a species of large fish.", "a particular kind of mark on the body of a horse."]}], "ನಂದ್ಯಾವರ್ತವಿಮಾನ": [{"type": "noun", "defs": ["(Jain.) name of a heaven."]}], "ನಂಬರು": [{"type": "noun", "defs": ["a symbol or word or a group of either of these, showing how many or which one in a series; a (cardinal) number.", "the score a student is awarded based on his performance in an examination, test, etc.; mark.", "a distinct number allotted (usu. serially to a land or site in government records); ನಂಬರ ಮನೆ nambara mane (coll.) a hotel or mess."]}], "ನಂಬಿ": [{"type": "noun", "defs": ["a man strongly devoted to a god or gods; a devotee.", "a temple-officer."]}], "ನಂಬಿಕಸ್ತ": [{"type": "noun", "defs": ["a man whom one can trust or rely on, a trustworthy man."]}], "ನಂಬಿಕಸ್ತಿಕೆ": [{"type": "noun", "defs": ["= ನಂಬಿಕೆ -4."]}], "ನಂಬಿಕಸ್ತೆ": [{"type": "noun", "defs": ["a woman whom one can trust or rely on, a trustworthy woman."]}], "ನಂಬಿಕೆ": [{"type": "noun", "defs": ["unquestioning belief that does not require proof or evidence; faith.", "unquestioning belief in God, religious tenets, etc.; faith.", "complete trust, confidence or reliance.", "the quality of being trustworthy, dependable, reliable; trustworthy.", "ನಂಬಿಕೆ ಮೂಡಿಸು nambike mūḍisu = ನಂಬಿಕೆ ಹುಟ್ಟಿಸು; ನಂಬಿಕೆ ಮೂಡು nambike mūḍu = ನಂಬಿಕೆ ಹುಟ್ಟು; ನಂಬಿಕೆ ಹುಟ್ಟಿಸು nambike huṭṭisu to make another trust or believe; 2. to cause to have faith; ನಂಬಿಕೆ ಹುಟ್ಟು nambike huṭṭu (trust, belief) to be formed in one's mind; 2. (faith) to be formed in one's mind."]}], "ನಂಬಿಕೆದ್ರೋಹ": [{"type": "noun", "defs": ["an instance of being disloyal to or acting against another who has placed complete trust on; a breaking faith with; breech of trust; betrayal."]}], "ನಂಬಿಕೆದ್ರೋಹಿ": [{"type": "noun", "defs": ["he who breaks faith with or betrays another's trust; a betrayer."]}], "ನಂಬಿಗ": [{"type": "noun", "defs": ["= ನಂಬಿಕಸ್ತ."]}], "ನಂಬಿಗಸ್ತ": [{"type": "noun", "defs": ["= ನಂಬಿಕಸ್ತ."]}], "ನಂಬಿಗಸ್ತಿಕೆ": [{"type": "noun", "defs": ["= ನಂಬಿಕೆ - 4."]}], "ನಂಬಿಗೆ": [{"type": "noun", "defs": ["= ನಂಬಿಕೆ."]}], "ನಂಬಿಸು": [{"type": "verb", "defs": ["to make another believe.", "to make another have trust, confidence or reliance.", "to cause to suck at the breast or udder; to suckle."]}], "ನಂಬಿಸುಹ": [{"type": "noun", "defs": ["the act or an instance of making another believe."]}], "ನಂಬು": [{"type": "verb", "defs": ["to take as true, real, genuine, etc.; to believe.", "to have confidence, trust or faith; to trust.", "to depend on; to rely on."]}], "ನಂಬುಗೆ": [{"type": "noun", "defs": ["= ನಂಬಿಕೆ.", "an oral or written agreement to do or not do something; a promise."]}], "ನಂಬುಗೆಗೆಡು": [{"type": "verb", "defs": ["to lose one's trustworthiness (in the views of a person who trusted); to become or look disloyal."]}], "ನಂಬುಗೆಗೆಯ್": [{"type": "verb", "defs": ["= ನಂಬು."]}], "ನಂಬುಗೆಗೇಡು": [{"type": "noun", "defs": ["= ನಂಬಿಕೆದ್ರೋಹ."]}], "ನಂಬುಗೆಗೇಳು": [{"type": "verb", "defs": ["= ನಂಬು 1 & 2.", "to take a promise."]}], "ನಂಬುಗೆಗೊಡು": [{"type": "verb", "defs": ["= ನಂಬಿಸು 1 & 2."]}], "ನಂಬುಗೆಗೊಳ್": [{"type": "verb", "defs": ["= ನಂಬುಗೆಗೊಳ್ಳು."]}], "ನಂಬುಗೆಗೊಳ್ಳು": [{"type": "verb", "defs": ["= ನಂಬು 1 & 2.", "to get a promise."]}], "ನಂಬುಗೆದಾಳು": [{"type": "verb", "defs": ["= ನಂಬು 1 & 2."]}], "ನಂಬುಗೆದೋರು": [{"type": "verb", "defs": ["(faith, trustworthiness, etc.) to be convinced."]}], "ನಂಬುಗೆದೋಱು": [{"type": "verb", "defs": ["= ನಂಬುಗೆದೋರು."]}], "ನಂಬುಗೆಯೀ": [{"type": "verb", "defs": ["to make a promise; to promise."]}], "ನಂಬುಗೆವಂತ": [{"type": "noun", "defs": ["= ನಂಬಿಕಸ್ತ."]}]}