{"ಮೋಡಿಕಾರ್ತಿ": [{"type": "noun", "defs": ["(fem.) an entertainer who is skilled in producing illusion by sleight of hand, deceptive devices, etc.; a magician.", "a woman who by her words, manners, styles, etc. enchants others."]}], "ಮೋಡಿಗಾರ": [{"type": "noun", "defs": ["= ಮೋಡಿಕಾರ."]}], "ಮೋಡಿಗೊಳ್": [{"type": "verb", "defs": ["= ಮೋಡಿಗೊಳ್ಳು."]}], "ಮೋಡಿಗೊಳು": [{"type": "verb", "defs": ["= ಮೋಡಿಗೊಳ್ಳು."]}], "ಮೋಡಿಗೊಳ್ಳು": [{"type": "verb", "defs": ["to become attractive, lovely, charming.", "to become obstinate, adamant."]}], "ಮೋಡಿಸು": [{"type": "verb", "defs": ["to attract or please greatly; to enchant; to allure; to fascinate; to charm."]}], "ಮೋಡೆ": [{"type": "noun", "defs": ["= ಮೋಡಿ3."]}], "ಮೋಡೆರಕ್ಕಣಿ": [{"type": "noun", "defs": ["the plant Hugonia mystax of Linaceae family."]}], "ಮೋಣ": [{"type": "noun", "defs": ["a dried fruit."]}], "ಮೋತಾದಾರ": [{"type": "noun", "defs": ["a man or boy whose work is tending, feeding, and currying horses; a groom."]}], "ಮೋತಿ": [{"type": "noun", "defs": ["(deog.) the face of a person.", "the part of an animaḷs head projecting forward and containing the nose and jaws; muzzle; snout.", "the corner of the moth.", "the front part."]}], "ಮೋತಿಖಾನೆ": [{"type": "noun", "defs": ["= ಮೋತೀಖಾನೆ."]}], "ಮೋತಿಬಿಂದು": [{"type": "noun", "defs": ["an eye disease in which the crystalline lens or its capsule becomes opaque, causing partial or total blindness; cataract."]}], "ಮೋತೀಖಾನೆ": [{"type": "noun", "defs": ["the room or building where provisions for army is stored.", "ಮೋತೀಖಾನೆ ಹೆಗ್ಗಣ mōtī khāne heggaṇa a man who swindles public money or takes bribes for favouring people illegally."]}], "ಮೋತೀಚೂರು": [{"type": "noun", "defs": ["a globular sweet-meat, made of smaller bead-like rounds.", "an ornmental border of a dhōti (a long loincloth worn by many men to cover from the waist to the ankles)."]}], "ಮೋತೆ": [{"type": "noun", "defs": ["the flower of a plantain tree.", "the flower of screw-pine, covered with a leaf-like sheath.", "ಬಾಳೆಗೆ ಒಂದೇ ಮೋತೆ, ಬಾಳುವವರಿಗೆ ಒಂದೇ ಮಾತು bāḷege ondē gone, bāḷuvavarige ondē mātu (prov.) a sincere man needs no repeated advice."]}], "ಮೋದ": [{"type": "noun", "defs": ["a pleased feeling; enjoyment; delight; pleasure.", "a sweet smell; pleasant odour; fragrance.", "a mango fruit; the fruit of Mangifera indica.", "the nut of the tree Cocos nucifera; a coconut.", "(jain.) one of the fifty three pre-natal ceremonial act observed."]}, {"type": "noun", "defs": ["the plant Trachyspermum ammi ( = Carum copiticum) of Apiaceae family; bishop's weed.", "its seed."]}], "ಮೋದಂಡ": [{"type": "noun", "defs": ["lack of certainty; a doubt; uncertainty."]}], "ಮೋದಂಬೆಱು": [{"type": "verb", "defs": ["to be glad, happy or delighted; to be full of joy; to rejoice."]}], "ಮೋದಕ": [{"type": "adjective", "defs": ["making glad; gladdening; delighting."]}, {"type": "noun", "defs": ["a kind of sweet pudding."]}, {"type": "noun", "defs": ["= ಮೋದ2."]}], "ಮೋದಗೆ": [{"type": "noun", "defs": ["= ಮೋದಕ2."]}], "ಮೋದನೀಯ": [{"type": "adjective", "defs": ["that can be enjoyed; enjoyable.", "giving delight; delighting."]}, {"type": "noun", "defs": ["any of various tropical and subtropical plants (genus Jasminum) of the Olaceae family.", "its fragrant flowers."]}], "ಮೋದವಿ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಮೋದಿ": [{"type": "adjective", "defs": ["giving great joy or pleasure to; delighting.", "mixing, blending together."]}, {"type": "noun", "defs": ["a man who gives great joy or plesures to others.", "(mus.) name of a musical mode."]}], "ಮೋದಿಕೆ": [{"type": "noun", "defs": ["the act of beating with the hands or sticks."]}], "ಮೋದಿಖಾನೆ": [{"type": "noun", "defs": ["= ಮೋತೀಖಾನೆ."]}], "ಮೋದಿತ": [{"type": "adjective", "defs": ["highly pleased; happy; delighted."]}, {"type": "noun", "defs": ["great joy; pleasure; delight."]}], "ಮೋದಿನಿ": [{"type": "noun", "defs": ["= ಮೋದ2."]}], "ಮೋದಿರ": [{"type": "noun", "defs": ["a small circular band of metal esp. one of gold or other precious metal, often set with gems, for wearing on the finger as an ornament; a finger-ring."]}], "ಮೋದಿಸು": [{"type": "verb", "defs": ["to cause to beat; to get smashed.", "to beat; to hit; to smash."]}, {"type": "verb", "defs": ["to give pleasure to; to delight another or others.", "to be highly pleased; to be delighted."]}], "ಮೋದೀಖಾನೆ": [{"type": "noun", "defs": ["= ಮೋತೀಖಾನೆ."]}], "ಮೋದು": [{"type": "verb", "defs": ["to hit with a resounding blow; strike hard and noisily; to slam.", "to beat oneself repeatedly.", "to make an assault upon; to attack.", "to come into physical contact; to touch.", "to deliver a blow with the foot; to kick.", "to strike with the fist.", "to break or shatter into pieces with noise or violence.", "to destroy; to ruin; to demolish.", "to eat or eat up hungrily, greedily or voraciously; to devour.", "to test the flavour of by putting a little in one's mouth; to taste; to eat.", "(fig.) to take forcibly and quickly; to grab; to seize.", "to find the product of by multiplication; to multiply."]}, {"type": "noun", "defs": ["a stroke; a blow.", "a bruised area of tissue, of a surface, etc.; a bruise.", "a kind of disease transmitted by sexual intercourse with an infected individual."]}], "ªÉೂೀದುಗಟ್ಟು": [{"type": "verb", "defs": ["(a part of the body) to have a bruise (as from a heavy blow)."]}], "ಮೋದುವೆಱು": [{"type": "verb", "defs": ["to be beaten, slammed."]}], "ಮೋದೆ": [{"type": "noun", "defs": ["= ಮೋದ2."]}], "ಮೋದೋಪಚಾರ": [{"type": "noun", "defs": ["a drying the body of a child or a woman who has just borne a child, with the soft, fragrant smoke of benzoin or frankincense, after bathing."]}], "ಮೋನ": [{"type": "noun", "defs": ["a refraining from speech; silence.", "a vow of refraining from speech.", "a becoming speechless caused by the separation from one's lover."]}], "ಮೋನಂಗೆಡು": [{"type": "verb", "defs": ["(the vow of refraining from speech) to be broken; to break one's silence."]}], "ಮೋನಂಗೊಳ್": [{"type": "verb", "defs": ["= ಮೋನಗೊಳ್ಳು."]}], "ಮೋನಗೊಳ್": [{"type": "verb", "defs": ["= ಮೋನಗೊಳ್ಳು."]}], "ಮೋನಗೊಳ್ಳು": [{"type": "verb", "defs": ["to refrain from speaking; to observe silence.", "to undertake a vow of refraining from speech."]}], "ಮೋನದಳೆ": [{"type": "verb", "defs": ["= ಮೋನಗೊಳ್ಳು."]}], "ಮೋನಾನುಷ್ಟಾನ": [{"type": "noun", "defs": ["observance of silence, refraining from speech, for religious purpose as meditation."]}], "ಮೋನಾನುಷ್ಠಾಣ": [{"type": "noun", "defs": ["= ಮೋನಾನುಷ್ಟಾನ."]}], "ಮೋನಾನುಷ್ಠಾನ": [{"type": "noun", "defs": ["= ಮೋನಾನುಷ್ಟಾನ."]}], "ಮೋನಿ": [{"type": "noun", "defs": ["a person refraining from speaking.", "a man refraining from speaking for religious purpose."]}], "ಮೋನಗುರುವ": [{"type": "noun", "defs": ["= ಮೋನಿ - 2."]}], "ಮೋನಿಗುರವಡಿ": [{"type": "noun", "defs": ["= ಮೋನಿ - 2."]}], "ಮೋನಿಗೊರವ": [{"type": "noun", "defs": ["= ಮೋನಿ - 2."]}], "ಮೋನಿಭಟಾರ": [{"type": "noun", "defs": ["= ಮೋನಿ - 2."]}], "ಮೋಪು": [{"type": "noun", "defs": ["wood suitable for building houses, whether cut or still in the form of trees; timber.", "a physically attractive body.", "a burden; a load.", "heaviness; weight.", "the impact of a blow.", "firmness in holding, seizing (something).", "an opportunity; a favourable circumstance."]}, {"type": "noun", "defs": ["the front portion (of something).", "the flat, square piece of metal which forms the front portion of a metal ornamental girdle when worn by women."]}, {"type": "noun", "defs": ["a strong wish or craving.", "a strong sexual appetite.", "loyalty or deep affection and interest; devotion."]}], "ಮೋಪುಗಾರಿಕೆ": [{"type": "noun", "defs": ["the enterprise of sawing, dressing, etc. of timbers providing them for building construction, ship-building etc.; the timber industry."]}], "ಮೋಬದಲಿ": [{"type": "noun", "defs": ["a giving or taking of one thing for another; an exchange.", "a short term loan."]}], "ಮೋಬೆದ": [{"type": "noun", "defs": ["a pharisee priest."]}], "ಮೋಯಿರ": [{"type": "noun", "defs": ["= ಮೋದಿರ."]}], "ಮೋಯಿರಮುಹೂರ್ತ": [{"type": "noun", "defs": ["the auspicious moment fixed for exchange of finger rings as a token of betrothal."]}], "ಮೋರ್": [{"type": "noun", "defs": ["a substance consisting mainly of casein and the like, obtained from milk by coagulation, and used as food or for getting butter; curds."]}], "ಮೋರ": [{"type": "noun", "defs": ["the large bird Pavo cristatus of Phasianidae family, with a tuft on the head, with blue feathers, male of which has long, attractive tail (each feather having an eye-like spot), while the female has a relatively short tail, domesticaed as an ornamental bird; Indian peafowl or peacock."]}], "ಮೋರಂಟೆ": [{"type": "noun", "defs": ["the tree Buchanania lanzan ( = B. latifolia) of Anacardiaceae family."]}], "ಮೋರಚೂತ": [{"type": "noun", "defs": ["copper sulphate."]}], "ಮೋರಟ": [{"type": "noun", "defs": ["= ಮೋರಟೆ."]}], "ಮೋರಟೆ": [{"type": "noun", "defs": ["= ಮೋರಂಟೆ.", "the root of the sugar-cane.", "the plant Sansevieria roxburghiana of Liliaceae family."]}], "ಮೋರಿ": [{"type": "noun", "defs": ["the gourd-pipe of Indian jugglers and snake charmers."]}, {"type": "noun", "defs": ["a pipe or drain, usu. underground, for carrying off water and waste matter; sewer.", "a water-passage crossing under a road, railroad track, footpath, etc; a culvert."]}], "ಮೋರು": [{"type": "verb", "defs": ["to drink (esp. alcoholic liquor); to imbibe."]}], "ಮೋರುಂಡೆ": [{"type": "noun", "defs": ["a kind of eatable made using curds."]}], "ಮೋರೆ": [{"type": "noun", "defs": ["the front of the head from the top of the forehead to the bottom of the chin, and from ear to ear; visage; the face.", "the area or region which something is facing.", "ಮೋರೆ ಕಂಡರೆ ಮನಸ್ಸು ತಿಳಿದೀತೆ? mōre kaṇḍare manassu tiḷidīte (prov.) the face is not the true index of the mind."]}], "ಮೋರ್ಚಂಗ್": [{"type": "noun", "defs": ["= ಮೋರ್ಸಿಂಗ್."]}], "ಮೋರ್ಚಾಲ್": [{"type": "noun", "defs": ["a fan made of the peacockś feathers."]}], "ಮೋರ್ಚೆ": [{"type": "noun", "defs": ["a platform on the bastion that gives a wider range for a firing artilleries.", "a military attack.", "a strategic place on a fort for soldiers to stand."]}], "ಮೋರ್ಚೆಕಟ್ಟು": [{"type": "verb", "defs": ["to attack with a military force."]}], "ಮೋರ್ತಬ್ಬ": [{"type": "noun", "defs": ["a seal which is usedmark documents officially; a signet.", "a mark, signature, special design imprinted with a seal or signet."]}], "ಮೋರ್ಸಿಂಗ್": [{"type": "noun", "defs": ["a small musical instrument consisting of a lyre-shaped metal frame containing a metal tongue, played by plucking while the frame is held in the teeth, which produces twanging tones; a jew's-harp."]}], "ಮೋಲು": [{"type": "noun", "defs": ["the worth of a thing in money or goods at a certain time; market price.", "estimated or appraised worth or price; valuation; value.", "that quality of a thing according to which it is thought of as being more or less desirable, useful, estimable, important, etc.; worth; value."]}], "ಮೋವೆ": [{"type": "noun", "defs": ["the area or region close to one's face of someone or which something is facing."]}], "ಮೋಷ": [{"type": "noun", "defs": ["the act or an instance of stealing; larceny; theft.", "the act of plundering; pillage; robbery."]}], "ಮೋಷಕ": [{"type": "noun", "defs": ["a man who steals; a thief."]}], "ಮೋಸ": [{"type": "noun", "defs": ["the act or an instance of cheating, deceiving; deception.", "something that may cause harm or injury; a danger; a perilous situation.", "something done wrongly or done in an eronneous way; a misdeed; an offence.", "a losing or being lost; an instance of this; a loss.", "ಮೋಸ ಮಾಡು mōsa māḍu to cheat; to deceive; ಮೋಸ ಹೋಗು mōsa hōgu to be cheated; to be deceived."]}], "ಮೋಸಂಬಿ": [{"type": "noun", "defs": ["the evergreen citrus plant Citrus aurantium (var. typica) of Rutaceae family.", "its juicy and edible fruit."]}], "ಮೋಸಕಾಱ": [{"type": "noun", "defs": ["= ಮೋಸಗಾರ."]}], "ಮೋಸಕೂಪ": [{"type": "noun", "defs": ["a covered pit to trap something."]}], "ಮೋಸಗಾತಿ": [{"type": "noun", "defs": ["a woman who habitually cheats others; a cheat; a fraud."]}], "ಮೋಸಗಾರ": [{"type": "noun", "defs": ["a man who habitually cheats others; a cheat; a fraud."]}], "ಮೋಸಗಾರಿಕೆ": [{"type": "noun", "defs": ["the tendency of cheating habitually others."]}], "ಮೋಸಗಾರ್ತಿ": [{"type": "noun", "defs": ["= ಮೋಸಗಾತಿ."]}], "ಮೋಸಗೊಳಿಸು": [{"type": "verb", "defs": ["to behave, deal with, dishonestly for one's own gain; to defraud.", "to deceive by trickery; to fool; to mislead."]}], "ಮೋಸಗೊಳು": [{"type": "verb", "defs": ["= ಮೋಸಗೊಳ್ಳು."]}], "ಮೋಸಗೊಳ್ಳು": [{"type": "verb", "defs": ["to be cheated; to be deceived; to be mislead."]}], "ಮೋಸಮ್": [{"type": "noun", "defs": ["= ಮೋಸಮು."]}], "ಮೋಸಮು": [{"type": "noun", "defs": ["an appropriate or favorable time or occasion; opportunity.", "any of the arbitrary divisions of the year made based on marked and continued differences in the weather, as summer, spring, rainfall, winter, etc.; a season."]}], "ಮೋಸಮ್ಮು": [{"type": "noun", "defs": ["= ಮೋಸಮು."]}], "ಮೋಸವಡೆ": [{"type": "verb", "defs": ["= ಮೋಸಗೊಳ್ಳು."]}], "ಮೋಸು": [{"type": "verb", "defs": ["to remove or divide into parts with a sharp-edged instrument; to cut; to sever.", "(a woman) to get her head shaved, following the death of her husband.", "(a widow) to cover her head with the upper part of her sari (a garment worn by Indian women, consisting of a long piece of cotton or silk wrapped around the body with one end draped over the head or over one shoulder).", "(fig.) to destroy; to demolish; to ruin.", "(fig.) to pay an amount of money (unwillingly, as a fine, punishment, etc.)."]}, {"type": "noun", "defs": ["the new, tender growth putforth by a plant or seed.", "that from which something comes into existence, develops; the source."]}], "ಮೋಸುಂ": [{"type": "noun", "defs": ["= ಮೋಸಮು."]}], "ಮೋಹ": [{"type": "noun", "defs": ["the state of being unconscious; unconsciousness.", "a false impression or belief; or state of being deceived by appearances.", "the state of being bewildered, perplexed; bewilderment; utter confusion.", "lack of good sense and judgement; foolishness; stupidity.", "a mistake; a fault.", "love; affection; fondness.", "anger; ire.", "the fact or act of capturing the interest, attention of; fascination.", "a losing (of facts, knowledge, tc.) from the mind; a failure or inability to remember.", "a kind of magic used to cause utter confusion among enemies.", "(phil.) want of spiritual knowledge; ignorance.", "(rhet.) one of the minor sentiments, a losing of consciousness as from excess joy, grief, etc.", "(phil.) the state of being inspired with intense, transitory fondness or admiration (to the extent that it blinds judgement, reasoning); infatuation.", "ಮೋಹ ಸಲ್ mōha sal to have an irrepresible desire for; ಮೋಹಪಡು mōha paḍu to be attracted, fascinated by; to be allured."]}, {"type": "noun", "defs": ["the aloe plant Aloe littoralis of Liliaceae family; small aloe.", "the tree Madhuca India ( = Bassia latifolia) of Sapotaceae family; Indian buttter tree."]}], "ಮೋಹಕ": [{"type": "adjective", "defs": ["causing utter confusion; perplexing; bewildering.", "capturing the interest and attention; fascinating."]}, {"type": "noun", "defs": ["false belief; delusion; hullucination.", "the quality of being attractive, fascinating."]}], "ಮೋಹಕತೆ": [{"type": "noun", "defs": ["the quality of being attractive, fascinating; fascination."]}], "ಮೋಹಗೊಳಿಸು": [{"type": "verb", "defs": ["to captivate another's mind or attention; to fascinate; to enthrall."]}], "ಮೋಹಗೊಳ್ಳು": [{"type": "verb", "defs": ["to be captivated; to be fascinated; to be enthralled."]}], "ಮೋಹತಮೀಮ": [{"type": "noun", "defs": ["one whose work is examining records, people, etc. or conducting examinations in a school or schools; an examiner."]}], "ಮೋಹನ": [{"type": "adjective", "defs": ["causing a person become unconscious.", "causing utter confusion; perplexing; bewildering.", "capturing the interest and attention; fascinating."]}, {"type": "noun", "defs": ["temporary loss of consciousness; unconsciousness.", "illusion or hallucination.", "attraction; fascination.", "the charming beauty or loveliness.", "Křṣṇa, one of the most fascinating of Indian deities.", "sexual intercourse; copulation; coition.", "a casting of a spell on another person by incantation.", "one of the five stages of a person undergoing the agony caused by the separation from his or her beloved.", "the plant Datura stramonium of Solanaceae family.", "(mus.) in Karnāṭaka system, a musical mode (rāga) derived from the the main mode Harikambhoji."]}], "ಮೋಹನಕಲ್ಯಾಣಿ": [{"type": "noun", "defs": ["(mus.) in Karnāṭaka system, a musical mode (rāga) derived from the the main mode Mēchakalyāṇi."]}], "ಮೋಹನಗಾರ": [{"type": "noun", "defs": ["a man who fascinates, charms by his handsomeness, speech, behaviour, etc."]}], "ಮೋಹನಗೌಳ": [{"type": "noun", "defs": ["(mus.) name of a musical mode (rāga)."]}], "ಮೋಹನಚೂರ್ಣ": [{"type": "noun", "defs": ["a small quantity of ash, infused with magical power of keeping another or others spellbound, submissive etc."]}], "ಮೋಹನನಾಟ": [{"type": "noun", "defs": ["(mus.) in Karnāṭaka system, a musical mode (rāga) derived from the the main mode Dhēnuka."]}], "ಮೋಹನಮಾಲೆ": [{"type": "noun", "defs": ["a type of necklace having attractive beads of gold."]}], "ಮೋಹನವಡೆ": [{"type": "verb", "defs": ["to become attractive, fascinating."]}], "ಮೋಹನಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["any study which is not based on right approach, that leads to ignorance."]}], "ಮೋಹನಾಂಗ": [{"type": "noun", "defs": ["a man alluringly handsome."]}], "ಮೋಹನಾಂಗಿ": [{"type": "noun", "defs": ["a woman alluringly handsome."]}], "ಮೋಹನಾಸ್ತ್ರ": [{"type": "noun", "defs": ["a mystical arrow, which, when discharged religiously chanting invoking its presiding deity, would cause a spell on the enemy soldiers and render unconscious."]}], "ಮೋಹನಿ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಮೋಹನಿದ್ರೆ": [{"type": "noun", "defs": ["a state in which the mind and senses are dulled; stupor."]}], "ಮೋಹನೀಯ": [{"type": "adjective", "defs": ["resulting from illusion or error or infatuation.", "baffling; confusing; bewildering."]}, {"type": "noun", "defs": ["the result of illusion or error or infatuation.", "the state of being baffled, confused; bewilderment.", "(jain.) one of eight Karmas that bind the a being to the worldly life."]}], "ಮೋಹನೀಯಕರ್ಮ": [{"type": "noun", "defs": ["= ಮೋಹನೀಯ2 - 3."]}], "ಮೋಹನೆ": [{"type": "noun", "defs": ["a beautiful woman; a charming lady."]}], "ಮೋಹಪರವಶ": [{"type": "noun", "defs": ["a man who is enchanted, fascinated by the beauty of a woman."]}], "ಮೋಹಪರವಶೆ": [{"type": "noun", "defs": ["a woman who is enchanted, fascinated by the beauty of a man."]}], "ಮೋಹಪರವಶತೆ": [{"type": "noun", "defs": ["the state of being enchanted,fascinated; infatuation."]}], "ಮೋಹಪಾಶ": [{"type": "noun", "defs": ["the worldly attachment or infatuating affection which binds a person to mundane world, and are considered as an impediment in the way of spiritual achievement."]}], "ಮೋಹಭಾವ": [{"type": "noun", "defs": ["the feeling or sentiment of love, affection."]}], "ಮೋಹರ": [{"type": "noun", "defs": ["organised armed land force; an army.", "an open and prolonged fight between two armed forces.", "a vast open ground where battle between two armed forces is fought; a battle-field."]}, {"type": "noun", "defs": ["(hist.) a monetary coin of gold.", "an embossed emblem, figure, symbol, word, letter, etc., placed on a letter, document, etc. or envelopes that contain a letter, document, as attestation or evidence of authenticity or genuineness."]}, {"type": "noun", "defs": ["a mode in playing a maddaḷe, a kind of percussion instrument."]}], "ಮೋಹರಂಬಡೆ": [{"type": "verb", "defs": ["to come together in a large number; to assemble."]}], "ಮೋಹರಂಬೆಱು": [{"type": "verb", "defs": ["= ಮೋಹರಂಬಡೆ."]}], "ಮೋಹರದೆಗೆ": [{"type": "verb", "defs": ["= ಮೋಹರಂಬಡೆ.", "to organise one's army to be ready for a war or for an attack."]}], "ಮೋಹರಸ": [{"type": "noun", "defs": ["= ಮೋಹಭಾವ."]}], "ಮೋಹರಿ": [{"type": "noun", "defs": ["the gourd-pipe used by snake charmers."]}, {"type": "noun", "defs": ["= ಮೋಹರ2."]}], "ಮೋಹರಿಸು": [{"type": "verb", "defs": ["to attack with a military force.", "to set oneself against; to resist; to oppose.", "to cover from all or almost all sides; to encircle; to envelop.", "(an army) to be prepared to move on, attack or resist; an attack.", "to set the army in a defensive or offensive array; to marshal.", "to make ready for use; to prepare.", "to come together in a large number; to assemble.", "to increase (oneself) in number, size, extent, intensity, etc.", "to make a mark on; to mark.", "to join another; to mingle with; to be associted with.", "to cause to join together (in a large number); to assemble.", "to fill oneself in or pervade throughout."]}], "ಮೋಹಲತೆ": [{"type": "noun", "defs": ["a kind of creeper, supposed to have the power of attracting, bringing (a person) under a spell, etc."]}], "ಮೋಹವೆಚ್ಚು": [{"type": "verb", "defs": ["(love, affection) to become more intense."]}], "ಮೋಹವೆಣ್": [{"type": "noun", "defs": ["a beautiful woman; a charming lady.", "a woman who engages herself in sexual activity for payment; a prostitute."]}], "ಮೋಹಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["any study which is not based on right approach, that leads to ignorance."]}], "ಮೋಹಸಲೆ": [{"type": "noun", "defs": ["a coercive measure, as imposing restrictions on the movement, preventing help when required most, etc. used against a person or persons for having violated a norm, agreement, etc."]}], "ಮೋಹಳ": [{"type": "noun", "defs": ["the handle of a sword or dagger."]}], "ಮೋಹಳಿಸು": [{"type": "noun", "defs": ["= ಮೋಹರಿಸು."]}], "ಮೋಹಾಂಧ": [{"type": "noun", "defs": ["a man who has lost his judgement, reasoning from love or affection."]}], "ಮೋಹಾಂಧೆ": [{"type": "noun", "defs": ["a woman who has lost her judgement, reasoning from love or affection."]}], "ಮೋಹಾತುರ": [{"type": "noun", "defs": ["a man who is impetuously running after his love, sexual desire, etc."]}], "ಮೋಹಾತುರೆ": [{"type": "noun", "defs": ["a woman who is impetuously running after her love, sexual desire, etc."]}], "ಮೋಹಾಪೋಹ": [{"type": "noun", "defs": ["(rhet.) a kind of figure of speech in which false characters, qualities are ascribed to a beloved person, denying his or her real characters, qualities."]}], "ಮೋಹಾಲಸ್ಯ": [{"type": "noun", "defs": ["inertness, lethargy caused by infatuating love, affection."]}], "ಮೋಹಿ": [{"type": "adjective", "defs": ["causing confusion; perplexing; baffling; bewildering.", "fascinating; charming; seducing.", "attractive; beautiful."]}, {"type": "noun", "defs": ["the quality of being beautiful, attractive.", "a man who is enchanted, fascinated, bewitched."]}], "ಮೋಹಿಂ": [{"type": "noun", "defs": ["a military attack."]}], "ಮೋಹಿಚಕ": [{"type": "noun", "defs": ["the tree Butea frondosa of Papilionaceae family; flame of the forest."]}], "ಮೋಹಿತ": [{"type": "adjective", "defs": ["stunned; stupefied; perplexed; confused; baffled.", "attracted, charmed, fascinated by."]}, {"type": "noun", "defs": ["a man who is attracted, charmed, fascinated by."]}], "ಮೋಹಿತೆ": [{"type": "noun", "defs": ["a woman who is attracted, charmed, fascinated by."]}], "ಮೋಹಿನಿ": [{"type": "noun", "defs": ["a beautiful woman; a charming lady.", "(myth.) name of a celestial woman.", "the seductive female form that Viṣṇu took while sharing between the gods and demons the ambrosia got from churning the ocean.", "a female ghost (said to be of young women died an unnatural death) in the form of a beautiful woman, believed to seduce men.", "a woman who lures, seduces men.", "a kind of black magic, sorcery.", "a kind of mystical power used to make a person lose consciousness.", "a kind of plant."]}], "ಮೋಹಿನಿಅಟ್ಟಂ": [{"type": "noun", "defs": ["a system of dance prevalent in Kērala."]}], "ಮೋಹಿಮು": [{"type": "noun", "defs": ["= ಮೋಹಿಂ."]}], "ಮೋಹಿವೆಣ್": [{"type": "noun", "defs": ["= ಮೋಹಿವೆಣ್ಣು."]}], "ಮೋಹಿವೆಣ್ಣು": [{"type": "noun", "defs": ["a beautiful woman; a charming lady.", "a woman who is attracted, charmed, fascinated by."]}], "ಮೋಹಿಸು": [{"type": "verb", "defs": ["to cause to beat; to get (another) smashed (by).", "to engage in a mutual fight.", "to fall upon; to attack.", "to withstand; to oppose; to stand firm against; to withstand the action of.", "to push or jab with a stick, finger, etc.; to prod; to poke.", "to poke or stab oneself with.", "to keep, put (something, on, above, at, etc. or in such and such a manner).", "(fig.) to ruin; to spoil."]}, {"type": "verb", "defs": ["to lose consciousness for a short period.", "to cause to lose consciousness.", "to be under the influence of illusion; to become illusioned.", "to cause illusion; to deceive by appearance.", "to love; to show love.", "to like; to have a taste or fondness for.", "to attract; to draw another's attention or admiration.", "to be drawn towards; to be attracted; to have admiration for.", "to look bright, conspicuous, as to attract attention of people."]}], "ಮೋಹೀಮ್": [{"type": "noun", "defs": ["= ಮೋಹಿಂ."]}], "ಮೋಹು": [{"type": "verb", "defs": ["to aim, target at (for hitting, shooting, etc.).", "to strike with violence; to dash against.", "to hit, strike with the fist; to punch.", "to fall upon; to attack.", "to poke; to prod.", "to poke or stab oneself with.", "to shut (a door) rashly or violently.", "to press, squeeze gently.", "to join together; to yoke.", "to strategically array (an army).", "to keep; to put (something on, above, at, etc. or in such and such a manner).", "to smear, coat, daub a surface with (a oily, greasy substance).", "to push (something) forward or against.", "to move or agitate air with or as with a fan; to fan.", "to extend oneself or be extended over a wider area; to spread."]}, {"type": "verb", "defs": ["to trip while walking or be caught in a net, vine, etc.", "to bestow something kindly to; to favour."]}], "ಮೋಹೋಪಮಿತ": [{"type": "noun", "defs": ["(rhet.) a figure of speech in which a comparison leads to confusing the subject and object of comparison."]}], "ಮೋಳ": [{"type": "noun", "defs": ["a male cat.", "(fig.) a big, slow, fat person; a lubber."]}], "ಮೋಳಬೆಕ್ಕು": [{"type": "noun", "defs": ["a male cat."]}], "ಮೋಳಿಗೆ": [{"type": "noun", "defs": ["a bundle of firewood.", "a bundle; a load; a burden."]}], "ಮೋಳಿಡು": [{"type": "verb", "defs": ["to make long, shrill cry (as a dog, fox, etc.)."]}], "ಮೋಳೆ": [{"type": "noun", "defs": ["a narrow opening caused by a crack or split; fissure; cleft; chink.", "a subterranean water-course."]}, {"type": "noun", "defs": ["a wide extent of level country; a plain land.", "a field where salt is made from sea-water.", "a heap of salt."]}], "ಮೋಳೆಯೋಗು": [{"type": "verb", "defs": ["to have a crack, split or fissure."]}], "ಮೋಱೆ": [{"type": "noun", "defs": ["the front of the head from the top of the forehead to the bottom of the chin, and from ear to ear; visage; the face.", "the area or region which something is facing."]}], "ಮೌಂಜ": [{"type": "adjective", "defs": ["made of or using the grass Saccharum sara ( = S. munja)."]}], "ಮೌಂಜಿ": [{"type": "noun", "defs": ["a cord made by intertwisting the blades of grass Saccharum sara ( = S. munja)."]}], "ಮೌಂಜೀಧಾರಣ": [{"type": "noun", "defs": ["a ritual of getting tied around one's waist a cord made by intertwisting the blades of grass Saccharum sara ( = S. munja), at the time of being initiated into religious studies."]}], "ಮೌಂಜೀಬಂಧ": [{"type": "noun", "defs": ["= ಮೌಂಜೀಧಾರಣ."]}], "ಮೌಂಜೀಬಂಧನ": [{"type": "noun", "defs": ["a ritual of tying around a boy's waist a cord made by intertwisting the blades of grass Saccharum sara ( = S. munja), at the time of being initiating him into religious studies."]}], "ಮೌಕೂಫ್": [{"type": "noun", "defs": ["a discharging or removing or being discharged or removed from office or service, etc.; dismissal; removal.", "the act closing an office, court, shop, etc.or fact of being closed."]}], "ಮೌಕ್ತಿಕ": [{"type": "noun", "defs": ["a smooth lustrous round structure inside the shell of a clam or oyster; much valued as a jewel; a pearl."]}], "ಮೌಖರ್ಯ": [{"type": "noun", "defs": ["the quality or fact of being fond or given to talking a great deal; talkativeness."]}], "ಮೌಖಿಕ": [{"type": "adjective", "defs": ["uttered by the mouth; spoken; oral.", "being spoken only (not having script) (said of languages)."]}], "ಮೌಖಿಕಪರೀಕ್ಷೆ": [{"type": "noun", "defs": ["an oral examination (diff. from the written one, where examinees are supposed to write their answers, etc.)."]}], "ಮೌಗ್ಧ್ಯ": [{"type": "noun", "defs": ["freedom from guile or cunning; simplicity; innocence.", "the fact of being harmless; harmlessness; innocence."]}], "ಮೌಜು": [{"type": "noun", "defs": ["lively, joyous play or playfulness; amusement, sport, recreation, etc.; fun.", "an entertaining or being entertained.", "the act or state of enjoying; the inclination for enjoyment.", "joy; a very glad feeling; happiness.", "the state of being excited from joy, happiness.", "the quality of being attractive; beauty; loveliness.", "lively mood; good humour.", "festival celebration; a festive occasion."]}], "ಮೌಜೆ": [{"type": "noun", "defs": ["a small village."]}], "ಮೌಢ್ಯ": [{"type": "noun", "defs": ["lack of knowledge, information, etc.; ignorance.", "lack of ordinary quickness and keenness of mind; stupidity."]}], "ಮೌದ್ಗ": [{"type": "noun", "defs": ["a field where the annual plant Phaseolus aureus ( = P. radiatus) of papilionaceae family is grown; a green gram plant field."]}], "ಮೌದ್ಗೀನ": [{"type": "noun", "defs": ["= ಮೌದ್ಗ."]}], "ಮೌನ": [{"type": "noun", "defs": ["the state or fact of keeping silent; a refraining from speech or from making noise.", "the period during which one refrains from talking as a religious vow.", "absence of sound; silence.", "speechlessness caused by the agony of being separated from one's lover."]}], "ಮೌನಂಗೊಳ್": [{"type": "verb", "defs": ["= ಮೌನಗೊಳ್."]}], "ಮೌನಕಲಹ": [{"type": "noun", "defs": ["a refraining from talking to each other owing to serious difference of opinion, bitter quarrel, etc."]}], "ಮೌನಗೊಳ್": [{"type": "verb", "defs": ["to observe silence; to refrain from talking.", "to make no sound or noise."]}], "ಮೌನಗೌರಿ": [{"type": "noun", "defs": ["Pārvati.", "a woman who is very reserved."]}], "ಮೌನಮುದ್ರೆ": [{"type": "noun", "defs": ["the state of being silent."]}], "ಮೌನವಡು": [{"type": "verb", "defs": ["to refrain from speaking; to observe silence."]}], "ಮೌನವ್ರತ": [{"type": "noun", "defs": ["silence observed as a religious vow."]}], "ಮೌನಸಮ್ಮತಿ": [{"type": "noun", "defs": ["the act of giving tacit assent; agreement or consent by silence or without objection; acquiescence."]}], "ಮೌನಿ": [{"type": "noun", "defs": ["a person who is refraining from talking or from making any speech."]}], "ಮೌರಜಿಕ": [{"type": "noun", "defs": ["a man who plays maddale, a percussion instrument."]}], "ಮೌರಜಿಗ": [{"type": "noun", "defs": ["= ಮೌರಜಿಕ."]}], "ಮೌರವಪಾಶ": [{"type": "noun", "defs": ["an iron chain."]}], "ಮೌರಿ": [{"type": "noun", "defs": ["the gourd-pipe used by snake charmers."]}, {"type": "noun", "defs": ["(mus.) name of a musical mode (rāga); ."]}], "ಮೌಖ್ರ್ಯ": [{"type": "noun", "defs": ["the quality of being foolish; foolishness."]}], "ಮೌರ್ವ": [{"type": "adjective", "defs": ["made of iron."]}, {"type": "noun", "defs": ["a dark brown horse."]}], "ಮೌರ್ವಿ": [{"type": "noun", "defs": ["the string of a bow."]}], "ಮೌರ್ವೀನಾದ": [{"type": "noun", "defs": ["the heavy sound produced by pulling the string of a bow and leaving it suddenly."]}], "ಮೌಲ": [{"type": "adjective", "defs": ["of times long past; ancient.", "most important; chief; fundamental."]}, {"type": "noun", "defs": ["a man hereditarily holding an office (of a minister, warrior, etc.)."]}], "ಮೌಲಬಲ": [{"type": "noun", "defs": ["the core part of an army."]}], "ಮೌಲಿ": [{"type": "noun", "defs": ["a top or apex; the tip.", "the head.", "a head-dress, usu. of gold and jewels, worn by king, as a symbol of authority; a crown.", "plaited hair.", "(fig.) a leader; a highly valued person."]}], "ಮೌಲಿಕ": [{"type": "adjective", "defs": ["original not copy, facsimile or reproduction.", "of great merit, use or service; highly important, esteemed, etc.; valuable."]}, {"type": "noun", "defs": ["an original work, as of art or literature, as distinguished from a reproduction, copy, etc.", "anything that is of great merit, use or service; a highly important, valuable thing."]}], "ಮೌಲಿಕತೆ": [{"type": "noun", "defs": ["the fact of being original.", "the fact or quality of being highly important, valuable; great merit."]}], "ಮೌಲ್ಯ": [{"type": "noun", "defs": ["the amount of money, etc. asked or paid for something; cost; charge; price.", "that quality of a person or thing that lends importance, value, merit, etc. and that is measurable by the esteem in which the person or thing is held; worth; value."]}], "ಮೌಲ್ಯಧನ": [{"type": "noun", "defs": ["material value, in terms of money."]}], "ಮೌಲ್ಯನಿರ್ಣಯ": [{"type": "noun", "defs": ["the act of determining the value or price of anything; evaluation; appraisal; valuation."]}], "ಮೌಲ್ಯಮಾಪನ": [{"type": "noun", "defs": ["the act of estimating or setting the value of something; appraisal; valuation."]}], "ಮೌಲ್ವಿ": [{"type": "noun", "defs": ["a Muslim priest."]}], "ಮೌವರಿ": [{"type": "noun", "defs": ["= ಮೌರಿ1."]}], "ಮೌಸಿ": [{"type": "noun", "defs": ["a sister of one's mother."]}], "ಮೌಸೂಫ": [{"type": "adjective", "defs": ["above mentioned; already referred, cited."]}, {"type": "noun", "defs": ["the person mentioned already (in a discussion, writing, etc.)."]}], "ಮೌಹಳಿಗ": [{"type": "noun", "defs": ["a variety of horse."]}], "ಮೌಹೂರ್ತ": [{"type": "noun", "defs": ["a man who claims to foretell the future by studying the motions and positions of the moon, sun and stars."]}], "ಮೌಹೂರ್ತಿಕ": [{"type": "adjective", "defs": ["lasting for only a moment; momentary.", "of or relating to a particular moment."]}, {"type": "noun", "defs": ["= ಮೌಹೂರ್ತ."]}], "ಮೌಳಿ": [{"type": "noun", "defs": ["= ಮೌಲಿ."]}], "ಮೌಳಿಕಾಱ": [{"type": "noun", "defs": ["= ಮೌಲಿ - 5."]}], "ಮೌಳಿಕಾಱತನ": [{"type": "noun", "defs": ["(fig.) the quality or fact of being a leader."]}], "ಮ್ಯಾಚು": [{"type": "noun", "defs": ["the act of bringng two equal or complementary things together; a matching.", "a contest or game involving two or more contestants; a match."]}], "ಮ್ಯಾಜಿಸ್ತ್ರೇಟು": [{"type": "noun", "defs": ["a civil administrative officer empower to administer the law; a magistrate."]}], "ಮ್ಯಾಣ": [{"type": "noun", "defs": ["(correctly ಮೇಣ)1. a plastic, dull-yellow substance secreted by bees for building cells; bee-wax.", "a kind of adhesive paste prepared using the flour of some corns.", "any of various solid or semisolid, viscous, yellowish or brownish organic substances exuded from various plants and trees, that is used as or in preparing adhesives.", "Manmatha, the Love-God.", "compelling or strong love; passion.", "the dark brown bird Acridotheres tristis of Sturnidae family, with yellow beak, black head, short, white bordered black tail, yellow legs; common myna."]}], "ಮ್ಯಾಣಗಪ್ಪಟ": [{"type": "noun", "defs": ["a protective covering of canvas or other material water-proofed with wax; tarpaulin."]}], "ಮ್ಯಾನಾ": [{"type": "noun", "defs": ["a passenger conveyance, usu. for one person, consisting of a covered or box-like litter carried by two or more men on their shoulders; a palankeen."]}], "ಮ್ಯಾನೇಜರಿಕೆ": [{"type": "noun", "defs": ["the office, duty or status of a manager."]}], "ಮ್ಯಾನೇಜರು": [{"type": "noun", "defs": ["one who manages a business, institution, etc.; a manager."]}], "ಮ್ಯುಜಿಯಂ": [{"type": "noun", "defs": ["= ಮ್ಯೂಸಿಯಂ."]}], "ಮ್ಯುಝಿಯಮ್ಮು": [{"type": "noun", "defs": ["= ಮ್ಯೂಸಿಯಂ."]}], "ಮ್ಯೂಸಿಯಂ": [{"type": "noun", "defs": ["a place where artistic, historical or scientific objects are exhibited in an organised manner."]}], "ಮ್ರಿತ್ತು": [{"type": "noun", "defs": ["the end of life; death.", "the Death-God or Goddess.", "great danger; peril; jeopardy."]}], "ಮ್ಲಾನ": [{"type": "adjective", "defs": ["dried up (as from heat); that has lost freshness; withered.", "fatigued; weary; tired; worn out.", "sad; gloomy; dejected; depressed.", "soiled; unclean; dirty.", "black (as distinctly opposite to white)."]}, {"type": "noun", "defs": ["anything that is dried up, has lost freshness; a withered thing.", "an unclean, soiled, dirty thing.", "that which is of low, mean or base quality."]}], "ಮ್ಲಾನತೆ": [{"type": "noun", "defs": ["lack of lustre, brightness; lusterlessness.", "the state of being tired, weary; weriness; fatigue.", "lowness of spirites; dejection; depression."]}], "ಮ್ಲಾನೆ": [{"type": "noun", "defs": ["a dejected, depressed or distressed woman."]}], "ಮ್ಲೇಂಛ": [{"type": "noun", "defs": ["= ಮ್ಲೇಚ್ಛ -1."]}], "ಮ್ಲೇಂಛಖಂಡ": [{"type": "noun", "defs": ["= ಮ್ಲೇಚ್ಛ-3."]}], "ಮ್ಲೇಚ್ಛ": [{"type": "noun", "defs": ["an uncultured, uncivilised man.", "a roguish, dishonest, unscrupulous man; a wicked fellow.", "a foreign country; a country the culture of which not in agreement with that of ancient India."]}], "ಮ್ಲೇಚ್ಛಖಂಡ": [{"type": "noun", "defs": ["= ಮ್ಲೇಚ್ಛ -3."]}], "ಮ್ಲೇಚ್ಛದೇಶ": [{"type": "noun", "defs": ["= ಮ್ಲೇಚ್ಛ -3."]}], "ಮ್ಲೇಚ್ಛಭಾಷೆ": [{"type": "noun", "defs": ["any foreign language."]}], "ಮ್ಲೇಚ್ಛಮುಖ": [{"type": "noun", "defs": ["a malleable red-brown metallic element; copper."]}], "ಮ್ಲೇಚ್ಛೆ": [{"type": "noun", "defs": ["an uncultured, uncivilised woman.", "a dishonest, unscrupulous woman; a wicked woman."]}], "ಯ": [{"type": "noun", "defs": ["(gen. pronounced with the vowel 'ಅ') the fortieth letter of Kannaḍa alphabet and the twenty sixth consonant.", "(pros.) a metre having one short syllable followed by two long syllables (u--).", "(math.) a symbol for the number one."]}], "ಯಂತರ": [{"type": "noun", "defs": ["= ಯಂತ್ರ.", "a kind of stringed, musical instrument.", "an apparatus with a wheel used in spinning or in drawing water from a well.", "a child's toy, puppet; a doll."]}], "ಯಂತೃ": [{"type": "noun", "defs": ["controlling; regulating.", "managing; conducting."]}, {"type": "noun", "defs": ["a man who controls, regulates or operates a machine; a controller; a regulator.", "a man who manages, conducts; a manager; a conductor.", "the driver of a chariot or cart; a charioteer.", "the driver of an elephant; a mahout."]}], "ಯಂತ್ರ": [{"type": "noun", "defs": ["a structure consisting of a framework and various fixed and moving parts that are interralated, for doing some kind of specific work; a machine.", "a machine for transmitting motion to some other machine; an engine.", "a mystical chart, diagram, figure written, engraved on a thin copper plate by worshipping which, it is supposed, superhuman powers can be achieved or one can overcome the influence of evil spirits.", "a thin plate of copper engraved with mystical syllables, rolled and tied to the upper arm, which is thought would keep away evil; a talisman; an amulet."]}], "ಯಂತ್ರಕರ್ಮಿ": [{"type": "noun", "defs": ["a man skilled in using, operating and repairing machines; a mechanic."]}], "ಯಂತ್ರಕಲೆ": [{"type": "noun", "defs": ["the skill in making, using and maintaining a machine or machines."]}], "ಯಂತ್ರಕಾರ": [{"type": "noun", "defs": ["= ಯಂತ್ರಕರ್ಮಿ."]}], "ಯಂತ್ರಚಾಲಕ": [{"type": "noun", "defs": ["a man who operates a machine."]}], "ಯಂತ್ರಚಾಲಿತ": [{"type": "adjective", "defs": ["done, run by a machine or using a machine; automated."]}], "ಯಂತ್ರಣ": [{"type": "noun", "defs": ["the act, fact or power of controlling, regulating; control; regulation."]}], "ಯಂತ್ರನಾಗರಿಕತೆ": [{"type": "noun", "defs": ["excessive use of or dependence on machines.", "a culture, system of life that lacks human qualities as warmth, courtesy, kindness, mercy, sympathy, etc."]}], "ಯಂತ್ರಪ್ರಯೋಗ": [{"type": "noun", "defs": ["the art or skill in using machines."]}], "ಯಂತ್ರಮುಕ್ತ": [{"type": "adjective", "defs": ["released, discharged from a machine or mechanical apparatus.", "not using machines or mechanical appliances; free from the usage of machines."]}], "ಯಂತ್ರಯುಗ": [{"type": "noun", "defs": ["the era or period of time in which social and economic organisation has resulted from the use or excess use, of machines, power tools, and large-scale industrial production."]}], "ಯಂತ್ರವಾಹಕ": [{"type": "noun", "defs": ["a man who operates a machies.", "(fig.) a man, who, usu. being in the background, meticulously plans and makes others act, work according to his plan."]}], "ಯಂತ್ರಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["the planning, designing, construction or management of machinery; the study of this; engineering.", "(loosely) any branch of engineering."]}], "ಯಂತ್ರಶಿಲ್ಪ": [{"type": "noun", "defs": ["mechanical engineering."]}], "ಯಂತ್ರಶಿಲ್ಪಜ್ಞ": [{"type": "noun", "defs": ["(masc.) a mechanical engineer."]}], "ಯಂತ್ರಶಿಲ್ಪಜ್ಞೆ": [{"type": "noun", "defs": ["(fem.) a mechanical engineer."]}], "ಯಂತ್ರಶಿಲ್ಪಿ": [{"type": "noun", "defs": ["a mechanical engineer."]}], "ಯಂತ್ರಾಗಾರ": [{"type": "noun", "defs": ["a building or buildings in which things are manufactured using machines; manufacturing plant; a factory."]}], "ಯಂತ್ರಾಪೀಡೆ": [{"type": "noun", "defs": ["a disorder of the body characterised by a seizure in which the victim loses consciousness, has convulsions, etc.; fits."]}], "ಯಂತ್ರೋದ್ಧರಣ": [{"type": "noun", "defs": ["the writing of a mystical chart, diagram, figure on a thin copper plate by worshipping which, it is supposed, superhuman powers can be achieved or one can overcome the influence of evil spirits.", "a writing or engraving on a thin plate of copper mystical syllables, to be used as a talisman to keep away evil."]}], "ಯಂತ್ರೋಪಕರಣ": [{"type": "noun", "defs": ["(pl.) machines and mechanical apparatus, tools, etc."]}], "ಯಂಬ್ರಹ್ಮ": [{"type": "noun", "defs": ["(fig.) a totally stupid fellow."]}], "ಯಃಕಶ್ಚಿತ್": [{"type": "adjective", "defs": ["of little or no value, importance or worth; fit to be neglected or ignored."]}], "ಯಃಕಶ್ಚಿತ": [{"type": "noun", "defs": ["a man or thing of little or no value, importance or worth."]}], "ಯಃಖ್ತ್ಯಾರಿ": [{"type": "noun", "defs": ["an official in a government or private organisation who is vested with authority; an officer."]}], "ಯಕಾರ": [{"type": "noun", "defs": ["the letter 'ಯ' (usu. pronounced with the vowel 'ಅ')."]}], "ಯಕೃತ್ತು": [{"type": "noun", "defs": ["the largest glandular organ in vertebrate animals, located in the upper rightside of the abdominal cavity, which secretes bile; the liver."]}], "ಯಕ್ಷ": [{"type": "noun", "defs": ["a class of Hindu, jaina or buddhist demi-gods.", "Kubēra, the head of this class.", "an evil spiit; a devil; a goblin."]}], "ಯಕ್ಷಕರ್ದಮ": [{"type": "noun", "defs": ["a kind of fragrant substance made by mixing camphor, musk, etc., used to smear on the body."]}], "ಯಕ್ಷಗಾನ": [{"type": "noun", "defs": ["a folk dance system, prevalent mostly in the coastal districts of Karnāṭaka, having themes selected from Rāmāyaṇa, Mahābhārata and Purāṇa."]}], "ಯಕ್ಷಗ್ರಹ": [{"type": "noun", "defs": ["annoyance, harm, trouble caused by an evil spirit.", "an evil spirit; a devil; a goblin."]}], "ಯಕ್ಷತರು": [{"type": "noun", "defs": ["the tree Ficus benghalensis ( = F. indica) of Moraceae family; a banyan tree."]}], "ಯಕ್ಷಧೂಪ": [{"type": "noun", "defs": ["a kind of frankincense used in perfumes and as incense."]}], "ಯಕ್ಷಪತಿ": [{"type": "noun", "defs": ["= ಯಕ್ಷ - 2."]}], "ಯಕ್ಷಪ್ರಶ್ನೆ": [{"type": "noun", "defs": ["(fig.) a question or problem solving of or answering to which is impossible or very difficult."]}], "ಯಕ್ಷರಾತ್ರಿ": [{"type": "noun", "defs": ["a festival of lights, observed during Kārtika, the eighth month in Hindu lunar calendar (approx. coinciding with November); diwali."]}], "ಯಕ್ಷಲೋಕ": [{"type": "noun", "defs": ["the world of Kubēra, the Regent of Wealth."]}], "ಯಕ್ಷವಾಸ": [{"type": "noun", "defs": ["= ಯಕ್ಷತರು."]}], "ಯಕ್ಷಸಂಪ್ರದಾಯ": [{"type": "noun", "defs": ["an ancient Indian system of painting that prevailed in the third century B.C."]}], "ಯಕ್ಷಸತ್ತ್ವ": [{"type": "noun", "defs": ["a class of women, as classified in Indian erotics, characterised by excess inclination towards sensual enjoyments."]}], "ಯಕ್ಷಾಂದೋಳ": [{"type": "noun", "defs": ["a kind of dance."]}], "ಯಕ್ಷಾಂಶಕೆ": [{"type": "noun", "defs": ["a woman, characterised by excess inclination towards sensual enjoyments."]}], "ಯಕ್ಷಿ": [{"type": "noun", "defs": ["a female belonging to the class of demi-gods Yakṣas.", "a wife of a demi-god of this class.", "a wife of Kubēra, the chief of this class.", "a woman skilled in black-magic and supposedly having supernatural power by a compact with the devil or evil spirits; a witch.", "(jain.) a class of demi-goddesses."]}], "ಯಕ್ಷಿಣಿ": [{"type": "noun", "defs": ["= ಯಕ್ಷಿ - 1, 2 & 4.", "name of an attendent of Durgā.", "a female devil or goblin.", "the power or practices of witches; black magic; sorcery; witchcraft.", "the art or performing skill of producing baffling effects or illusions by sleight of hand, concealed apparatus, etc.; magic.", "a female character in yakṣagāna."]}], "ಯಕ್ಷಿಣಿಗಾರ": [{"type": "noun", "defs": ["a man skilled in magic; a magician."]}], "ಯಕ್ಷಿಣಿವಿದ್ಯ": [{"type": "noun", "defs": ["= ಯಕ್ಷಿಣಿ - 6 & 7."]}], "ಯಕ್ಷಿಣಿವಿದ್ಯೆ": [{"type": "noun", "defs": ["= ಯಕ್ಷಿಣಿ - 6 & 7."]}], "ಯಕ್ಷ್ಮ": [{"type": "noun", "defs": ["an infectious disease, caused by the organism Mycobacterium tuberculosis, that affects the lungs, and characterised by abnormal hard nodule or swelling; tuberculosis of the lungs."]}], "ಯಕ್ಷ್ಮರೋಗ": [{"type": "noun", "defs": ["= ಯಕ್ಷ್ಮ.", "(fig.) mental agony."]}], "ಯಗಣ": [{"type": "noun", "defs": ["(pros.) a metrical foot consisting of one short followed by two long syllabic instants (u--); bacchius."]}], "ಯಚ್ಚಾವತ್ತು": [{"type": "noun", "defs": ["that which all necessary parts; a complete or integrated whole."]}], "ಯಜನ": [{"type": "noun", "defs": ["a religious sacrifice.", "a conducting of a religious sacrifie.", "the act of worshipping a deity."]}], "ಯಜನಾಧಿಕಾರಿ": [{"type": "noun", "defs": ["a man who is eligible for performing a religious sacrifice.", "a man who is eligible for worshipping a deity."]}], "ಯಜಮಾನ": [{"type": "noun", "defs": ["the man who performs a religious sacrifice.", "a priest or worshipper of a deity.", "a man who maintains a house; the chief of a family; a house-holder.", "a land owner; the proprietor of a factory, business firm, company, etc.", "a man as related to a woman whom he is married to; a husband.", "an aged and respectable man."]}], "ಯಜಮಾನಗಿತ್ತಿ": [{"type": "noun", "defs": ["= ಯಜಮಾನಿ."]}], "ಯಜಮಾನಪಟ್ಟ": [{"type": "noun", "defs": ["the authority, status of a leader, owner or proprietor."]}], "ಯಜಮಾನತನ": [{"type": "noun", "defs": ["the authority, status of a leader, owner or proprietor; ownership."]}], "ಯಜಮಾನತಿ": [{"type": "noun", "defs": ["= ಯಜಮಾನಿ."]}], "ಯಜಮಾನಿ": [{"type": "noun", "defs": ["a woman who maintains a house; the mistress of a family.", "(fem.) a land or any other property owner; the proprietress of a factory, business establishment, company, etc.", "a woman as related to the man whom she is married to; a wife."]}], "ಯಜಮಾನಿಕೆ": [{"type": "noun", "defs": ["= ಯಜಮಾನತನ."]}]}