{"ದೌರ್ಮನಸ್ಯ": [{"type": "noun", "defs": ["the wicked-heartedness."]}], "ದೌರ್ಹೃದ": [{"type": "noun", "defs": ["strong dislike or ill will; hatred; enmity.", "a hollow, muscular organ of female mammals in which the ovum is deposited and the embryo and foetus are developed; the womb; the uterus.", "the longing of a pregnant woman for a particular object.", "a wish or desire in gen."]}], "ದೌಲಾಚ್ಛಾದ": [{"type": "noun", "defs": ["a mode of saluting a dignitary or celebrity, by a troupe of female dancers."]}], "ದೌಲತ್": [{"type": "noun", "defs": ["= ದೌಲತ್ತು."]}], "ದೌಲತ್‍ಜಾದಾ": [{"type": "noun", "defs": ["= ದೌಲಾಚ್ಛಾದ."]}], "ದೌಲತ್ತು": [{"type": "noun", "defs": ["a great quantity or store of money, valuable possessions, property or other riches; wealth; opulence.", "ostentatious display; pomp.", "the reigning power; authority of a king.", "ದೌಲತ್ತು ನಡೆಸು daulattu naḍesu = ದೌಲತ್ತು ಮಾಡು; ದೌಲತ್ತು ಮಾಡು daulattu māḍu to wield one's reigning power; 2. to put up an exaggerated show of (one's wealth, power, etc.)."]}], "ದೌವಾರಿಕ": [{"type": "noun", "defs": ["a man guarding the entrance of a house or other building; a door-keeper."]}], "ದೌವಾರಿಕೆ": [{"type": "noun", "defs": ["a woman guarding the entrance of a house; a door-keeper."]}], "ದೌಷ್ಟ್ಯ": [{"type": "noun", "defs": ["the disposition of a wicked person; wickedness."]}], "ದೌಹಿತ್ರ": [{"type": "noun", "defs": ["one's daughter's son."]}], "ದೌಹೃದ": [{"type": "noun", "defs": ["= ದೌರ್ಹೃದ."]}], "ದ್ಯಾಸ": [{"type": "noun", "defs": ["a meditating on (something) deeply; deep continued thought; meditation.", "awareness of one's own feelings, what is happening around one, etc.; consciousness.", "the power, act or process of recalling to mind facts previously learnt or past experience.", "a wish or desire in gen."]}], "ದ್ಯು": [{"type": "noun", "defs": ["the period of light between sunrise and sunset; a day.", "the sky."]}], "ದ್ಯುಚರ": [{"type": "noun", "defs": ["a man or an animal that moves in the sky, as a god, bird, etc.", "a heavenly body, as a star, planet, etc."]}], "ದ್ಯುತಿ": [{"type": "noun", "defs": ["the form of electromagnetic radiation that acts upon the retina of the eye, optic nerve, etc., making sight possible; light.", "a ray of light.", "radiant beauty."]}, {"type": "noun", "defs": ["a kind of medicinal plant."]}], "ದ್ಯುತಿ ಅಭಿಗ್ರಹಣ": [{"type": "noun", "defs": ["the act of detecting and receiving light for biological purposes; photo-reception."]}], "ದ್ಯುತಿ ಅಭಿಗ್ರ್ರಾಹಕ": [{"type": "noun", "defs": ["(biol.) a sense organ specialised to detect light, as the eye or any of the elements of a compound eye; photo-receptor."]}], "ದ್ಯುತಿ ಉತ್ಸರ್ಜನೆ": [{"type": "noun", "defs": ["the ejection of one or more electrons from a substance, usu. a metal, when subjected to light or other suitable radiation; photo-emission."]}], "ದ್ಯುತಿಗರೆ": [{"type": "verb", "defs": ["to emit or reflect light."]}], "ದ್ಯುತಿಗುಂದು": [{"type": "verb", "defs": ["to become dull; to lose brightness, sheen; to grow lustreless."]}], "ದ್ಯುತಿಗ್ರಾಹಕ": [{"type": "noun", "defs": ["= ದ್ಯುತಿ ಅಭಿಗ್ರ್ರಾಹಕ."]}], "ದ್ಯುತಿಮಾಪಕ": [{"type": "noun", "defs": ["an instrument used in measuring the intensity of light, esp. in determining its relative intensity from different sources; a photometer."]}], "ದ್ಯುತಿಮಾಪನ": [{"type": "noun", "defs": ["the measurement of the intensity of the light; photometry."]}], "ದ್ಯುತಿಮಾಪನಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["the branch of optics dealing with the measurement of the intensity of the light; photometry."]}], "ದ್ಯುತಿಮಾಲಿ": [{"type": "noun", "defs": ["the sun."]}], "ದ್ಯುತಿರಸಾಯನಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["the branch of chemistry having to do with the effect of light or other radiant energy in producing chemical action, as in photography; photochemistry."]}], "ದ್ಯುತಿವಿದ್ಯುತ್ಕೋಶ": [{"type": "noun", "defs": ["a cell whose electrical state is changed by the effect of light, esp. any device in which light controls the electron emission from a cathode, the electrical resistance of an element or the electromotive force produced by a cell; a photoelectric cell."]}], "ದ್ಯುತಿವೀಱು": [{"type": "verb", "defs": ["to emit light."]}], "ದ್ಯುತಿಸಂಶ್ಲೇಷಣ": [{"type": "noun", "defs": ["= ದ್ಯುತಿಸಂಶ್ಲೇಷಣೆ."]}], "ದ್ಯುತಿಸಂಶ್ಲೇಷಣೆ": [{"type": "noun", "defs": ["photosynthesis - a) the biological synthesis of chemical compounds in the presence of light; b) the production of organic substances, chiefly sugars, from carbon dioxide and water occurring in green plant cells supplied with enough light to allow chlorophyll to aid in the transformation of the radiant energy into a chemical form."]}], "ದ್ಯುತ್ತು": [{"type": "noun", "defs": ["= ದ್ಯುತಿ."]}], "ದ್ಯುನ": [{"type": "noun", "defs": ["= ದ್ಯೂನ."]}], "ದ್ಯುನಗೃಹ": [{"type": "noun", "defs": ["= ದ್ಯೂನ."]}], "ದ್ಯುಮಣಿ": [{"type": "noun", "defs": ["the Sun, the jewel of the sky."]}], "ದ್ಯುಮುಖ": [{"type": "noun", "defs": ["the first appearance of daylight in the morning; dawn."]}], "ದ್ಯುಮ್ನ": [{"type": "noun", "defs": ["the quality or state of being radiant; radiance; luminousness.", "the quality or state of being strong; strength; vigour.", "a great store of money, valuable possessions; riches; wealth."]}], "ದ್ಯುಲೋಕ": [{"type": "noun", "defs": ["the world of gods; heaven."]}], "ದ್ಯೂತ": [{"type": "noun", "defs": ["a sport as an activity for recreation.", "a game of chance played with dice and pawns; gambling.", "money or other valuable offered as stake, in this game."]}], "ದ್ಯೂತಕರ": [{"type": "noun", "defs": ["a man who plays a game; a player.", "one who gambles offering a stake, in the game of chance.", "money or other valuable offered as stake in the game of chance."]}], "ದ್ಯೂತಕಾರ": [{"type": "noun", "defs": ["= ದ್ಯೂತಕರ - 2."]}], "ದ್ಯೂತಕಾರಕ": [{"type": "noun", "defs": ["a man who runs a club where the game of chance is regularly played.", "a man who plays this game."]}], "ದ್ಯೂತಕೃತ್ತು": [{"type": "noun", "defs": ["= ದ್ಯೂತಕರ - 2."]}], "ದ್ಯೂತಕೇಳಿ": [{"type": "noun", "defs": ["= ದ್ಯೂತ - 2."]}], "ದ್ಯೂತವರ್ತಿ": [{"type": "noun", "defs": ["= ದ್ಯೂತಕರ - 2."]}], "ದ್ಯೂತಾಳಿ": [{"type": "noun", "defs": ["= ದ್ಯೂತಕರ - 2."]}], "ದ್ಯೂನ": [{"type": "noun", "defs": ["(astrol.) the seventh house from the birth house in the zodiac."]}], "ದ್ಯೂನಗೇಹ": [{"type": "noun", "defs": ["= ದ್ಯೂನ."]}], "ದ್ಯೋತ": [{"type": "noun", "defs": ["the form of electromagnetic radiation that acts upon the retina of the eye, optic nerve, etc., making sight possible; light.", "sunlight.", "the condition or quality of being hot; heat."]}], "ದ್ಯೋತಕ": [{"type": "adjective", "defs": ["shining; radiant; lustrous.", "directing attention to; pointing to; showing."]}, {"type": "noun", "defs": ["that which directs attention to or point to or makes something seen; an indicator."]}], "ದ್ಯೋತನ": [{"type": "adjective", "defs": ["= ದ್ಯೋತಕ1."]}, {"type": "noun", "defs": ["light; lustre; brilliance.", "that which is seen; vision; view."]}], "ದ್ಯೋತಿ": [{"type": "adjective", "defs": ["giving out or reflecting light; shining; lustrous."]}, {"type": "noun", "defs": ["the form of electromagnetic radiation that acts upon the retina of the eye, optic nerve, etc., making sight possible; light."]}], "ದ್ಯೋತಿತ": [{"type": "adjective", "defs": ["that is made to shine or to be lustrous."]}], "ದ್ಯೋತಿರಿಂಗಣ": [{"type": "noun", "defs": ["any of a number of beetles or beetle larvae that give off a luminescent light; a glow-worm."]}], "ದ್ಯೋತಿಸು": [{"type": "verb", "defs": ["to be seen; to appear.", "to cause to be seen; to show."]}], "ದ್ರಂಗ": [{"type": "noun", "defs": ["a town or city."]}], "ದ್ರಢಿಮ": [{"type": "noun", "defs": ["the quality of being physically strong; vigorousness; sturdiness."]}], "ದ್ರಪ್ಸ": [{"type": "adjective", "defs": ["falling in or as in drops; dripping."]}, {"type": "noun", "defs": ["a small quantity of liquid that is somewhat spherical as when falling or thrown out.", "the liquid left after churning butter from milk; butter-milk."]}], "ದ್ರಬ್ಯ": [{"type": "noun", "defs": ["money."]}], "ದ್ರಮಿಳ": [{"type": "noun", "defs": ["= ದ್ರಮಿೞ."]}], "ದ್ರಮಿೞ": [{"type": "noun", "defs": ["one of the states of South India having 130,356 sq. mt. area and Chennai as its capital; Tamil Nadu.", "one of the groups or clans of Jaina mendicants belonging to this area."]}], "ದ್ರಮ್ಮ": [{"type": "noun", "defs": ["an ancient gold coin."]}], "ದ್ರವ": [{"type": "adjective", "defs": ["running (as a horse).", "leaking, seeping or oozing out slowly (as through very small holes).", "readily flowing; running in a stream.", "being in the form of liquid; liquefied."]}, {"type": "noun", "defs": ["a moving with a fast pace; a running; a galloping.", "that which readily flows (as water); a liquid.", "any activity or experience that gives enjoyment or recreation; a sport.", "the condition of containing moisture or quality of being moist.", "the condition or fact of melting, being liquefied.", "a liquid substance made by decocting; decoction."]}], "ದ್ರವಂತಿ": [{"type": "noun", "defs": ["a current or flow of water or other liquid, esp. one running along the surface of the earth; a stream; a river.", "the plant Chlorophytum tuberosum (= Anthodium tuberosum) of Liliaceae family."]}], "ದ್ರವಗಲ್ಲು": [{"type": "noun", "defs": ["a milky-white, translucent feldspar with a pearly lustre, used as a gem; the moonstone."]}], "ದ್ರವಗಾಳಿ": [{"type": "noun", "defs": ["= ದ್ರವವಾಯು."]}], "ದ್ರವಗೊಳಿಸು": [{"type": "verb", "defs": ["to cause to become liquid; to convert (a solid or gas) into a liquid; to liquefy."]}], "ದ್ರವಣ": [{"type": "noun", "defs": ["the act or an instance of running.", "the act of leaking, seeping or oozing out (from small holes).", "the act or an instance of flowing in a stream."]}], "ದ್ರವತ್ರಪು": [{"type": "noun", "defs": ["liquefied lead or zinc.", "(myth.) a pouring of hot liquid of lead or zinc on the body; a punishment given in hell."]}], "ದ್ರವತ್ವ": [{"type": "noun", "defs": ["the quality of being able to be liquefied.", "the quality or condition of being a liquid."]}], "ದ್ರವಪಾವುಡ": [{"type": "noun", "defs": ["= ದ್ರವವಸ್ತ್ರ."]}], "ದ್ರವರೂಪ": [{"type": "noun", "defs": ["the state of being liquid; the liquid form (of a substance)."]}], "ದ್ರವವಸ್ತು": [{"type": "noun", "defs": ["any liquid substance."]}], "ದ್ರವವಸ್ತ್ರ": [{"type": "noun", "defs": ["(vīr.) a small piece of cloth meant for wiping an idol after bathing it."]}], "ದ್ರವವಾಯು": [{"type": "noun", "defs": ["air brought to a liquid state by being subjected to great pressure and then cooled by its own expansion to a temperature below the boiling point of its main constituents, nitrogen and oxygen, used as a refrigerant; liquid air."]}], "ದ್ರವಸೇಚಕ": [{"type": "noun", "defs": ["an artificial means for diverting water for farming purposes."]}], "ದ್ರವಾಗ್ನಿ": [{"type": "noun", "defs": ["flaming petroleum or the like, as employed against an enemy in warfare; liquid-fire.", "a lustrous line in a pearl."]}], "ದ್ರವಾಶಯ": [{"type": "noun", "defs": ["a place where or container in which a liquid is stored, usu. in large quantity; a tank or reservoir."]}], "ದ್ರವಿಡ": [{"type": "noun", "defs": ["one of the states of South India having 130,356 sq. mt. area and Chennai as its capital; Tamil Nadu.", "the people of this state.", "the official language of Tamil Nadu, one of the Dravidian languages."]}], "ದ್ರವಿಡಭಾಷೆ": [{"type": "noun", "defs": ["the Dravidian language of the Tamils, ancient or modern; official language of the state of Tamil Nadu."]}], "ದ್ರವಿಡಮಂಟಂನ್ಯಾಯ": [{"type": "noun", "defs": ["= ದ್ರವಿಡಮಂಟಕನ್ಯಾಯ."]}], "ದ್ರವಿಡಮಂಟಕನ್ಯಾಯ": [{"type": "noun", "defs": ["a using of more labour than required; a way of working with unwarranted effort."]}], "ದ್ರವಿಡಮಂಡಕನ್ಯಾಯ": [{"type": "noun", "defs": ["= ದ್ರವಿಡಮಂಟಕನ್ಯಾಯ."]}], "ದ್ರವಿಡವೇದ": [{"type": "noun", "defs": ["collectively the devotional hymns of Tamil āḷvārs, canonised Vaiṣṇava saints, considered as parallel to the Vedas:."]}], "ದ್ರವಿಡಾಮ್ನಾಯ": [{"type": "noun", "defs": ["= ದ್ರವಿಡವೇದ."]}], "ದ್ರವಿಣ": [{"type": "noun", "defs": ["much money or property; great amount of worldly possessions; riches; wealth."]}], "ದ್ರವಿಣೇಂದ್ರ": [{"type": "noun", "defs": ["Kubēra, the regent of wealth and also the regent of north quarter."]}], "ದ್ರವಿತ": [{"type": "noun", "defs": ["the fact of the mind becoming softened, gentle and tender.", "a man who has become gentle, tender as from sympathy, compassion, etc."]}], "ದ್ರವಿಯಿಸು": [{"type": "verb", "defs": ["= ದ್ರವಿಸು."]}], "ದ್ರವಿಸು": [{"type": "verb", "defs": ["to fall in drops.", "to become tender, gentle as from sympathy, compassion, love, etc.", "to become or remain moist.", "(the mind) to become tender, gentle compassionate, sympathetic, etc.", "to physically change oneself into liquid form either solid or gaseous form.", "to seep or ooze out (as a liquid from small holes)."]}], "ದ್ರವಿಳ": [{"type": "noun", "defs": ["= ದ್ರಮಿೞ."]}], "ದ್ರವಿಳಗಣ": [{"type": "noun", "defs": ["= ದ್ರವಿಳಸಂಘ."]}], "ದ್ರವಿಳದೇಶ": [{"type": "noun", "defs": ["= ದ್ರಮಿೞ -1 ."]}], "ದ್ರವಿಳಸಂಘ": [{"type": "noun", "defs": ["a group or clan of Jaina mendicants belonging Tamil Nadu."]}], "ದ್ರವಿೞ": [{"type": "noun", "defs": ["= ದ್ರಮಿೞ."]}], "ದ್ರವಿೞಗಣ": [{"type": "noun", "defs": ["= ದ್ರವಿಳಸಂಘ."]}], "ದ್ರವೀಕರಣ": [{"type": "noun", "defs": ["the act of liquefying or being liquefied; liquefaction."]}], "ದ್ರವೀಕರಿಸು": [{"type": "verb", "defs": ["to change the state of a solid or gaseous substance to liquid form; to liquefy.", "to become liquid."]}], "ದ್ರವೀಕೃತ": [{"type": "adjective", "defs": ["that is made liquid; liquefied."]}], "ದ್ರವ್ಯ": [{"type": "noun", "defs": ["the physical matter of which a thing consists; material; a substance.", "the real or essential part or element of anything; the basic matter.", "abundance of valuable material possessions or resources; riches; wealth.", "official monetary currency; money.", "an ancient monetary coin.", "an idol made of wood.", "a medicinal substance or a medicinal herb.", "(arith.) a symbol for the number six.", "(phil.) an elementary substance."]}], "ದ್ರವ್ಯಚೇತನವಾದ": [{"type": "noun", "defs": ["the doctrine that matter is inseparable from life; hylozoism."]}], "ದ್ರವ್ಯತಪ": [{"type": "noun", "defs": ["a penance or vow observed for getting material possessions; a false religious vow."]}], "ದ್ರವ್ಯತ್ವ": [{"type": "noun", "defs": ["the quality or state of being a substance.", "the quality or state of having essence, basic substance within."]}], "ದ್ರವ್ಯಭ್ರಮೆ": [{"type": "noun", "defs": ["the illusion that our body, material possessions, mundane life, etc. are the means for happiness and this happiness is the principal good."]}], "ದ್ರವ್ಯಮೋಕ್ಷ": [{"type": "noun", "defs": ["(Jain.) a complete detachment from the worldly life."]}], "ದ್ರವ್ಯಯಜ್ಞ": [{"type": "noun", "defs": ["a gifting or sacrificing one's wealth and other material possessions for a noble cause."]}], "ದ್ರವ್ಯರ್ಷಿ": [{"type": "noun", "defs": ["(jain.) a sage whose penances and religious vows are means of obtaining material possessions; a pretentious sage."]}], "ದ್ರವ್ಯಲಿಂಗಿ": [{"type": "noun", "defs": ["= ದ್ರವ್ಯರ್ಷಿ."]}], "ದ್ರವ್ಯವಂತ": [{"type": "noun", "defs": ["a man having abundant material wealth; a rich man."]}], "ದ್ರವ್ಯವಿವಕ್ಷೆ": [{"type": "noun", "defs": ["the keen power of understanding and analysing the true nature of substances."]}], "ದ್ರವ್ಯವ್ಯಸನ": [{"type": "noun", "defs": ["a longing for material wealth."]}], "ದ್ರವ್ಯಶಕ್ತಿ": [{"type": "noun", "defs": ["the essential character or nature of a thing."]}], "ದ್ರವ್ಯಸ್ಥಾಪನೆ": [{"type": "noun", "defs": ["a storing of accumulated wealth in a secret place, esp. under the surface of the earth."]}], "ದ್ರವ್ಯಹೀನ": [{"type": "adjective", "defs": ["not having money or other material possessions."]}, {"type": "noun", "defs": ["a poor, indigent or destitute man."]}], "ದ್ರವ್ಯಹೀನೆ": [{"type": "noun", "defs": ["a poor, indigent or destitute woman."]}], "ದ್ರವ್ಯಾಂಜನ": [{"type": "noun", "defs": ["a kind of balm supposed to have the power of discovering the money lost."]}], "ದ್ರವ್ಯಾದ್ವೈತ": [{"type": "noun", "defs": ["the doctrine that the mental or emotional attachments, sympathy, empathy, that exist between the nearest one, are but the same as the non-dualistic relation that exists between the Supreme Being and the individual souls."]}], "ದ್ರವ್ಯಾನುಕೂಲ": [{"type": "noun", "defs": ["availability of money and other means."]}], "ದ್ರವ್ಯಾನುಯೋಗ": [{"type": "noun", "defs": ["(Jain.) a Jaina scripture dealing with the six types of substances and seven principles."]}], "ದ್ರವ್ಯಾಯಿಲ": [{"type": "noun", "defs": ["= ದ್ರವ್ಯವಂತ."]}], "ದ್ರವ್ಯೇಂದ್ರಿಯ": [{"type": "noun", "defs": ["any of the five sense organs of the body."]}], "ದ್ರಹಿಭೇದ": [{"type": "noun", "defs": ["the grass Echinochloa frumentacea (= Panicum frumentaceum) of Poaceae family; deccan grass."]}], "ದ್ರಷ್ಟ": [{"type": "noun", "defs": ["he who sees.", "a man who sees things that are beyond the sight of a normal person; a seer.", "that which can be seen."]}], "ದ್ರಷ್ಟವ್ಯ": [{"type": "noun", "defs": ["that which is or ought, to be seen or realised."]}], "ದ್ರಷ್ಟಾರ": [{"type": "noun", "defs": ["= ದ್ರಷ್ಟ -2."]}], "ದ್ರಷ್ಟೆ": [{"type": "noun", "defs": ["she who sees.", "a woman who sees things that are beyond the sight of a normal person; a seer."]}], "ದ್ರಾಕ್ಷಾಪಾಕ": [{"type": "noun", "defs": ["= ದ್ರಾಕ್ಷಾರಸ 1.", "(rhet.) a style that is very clear and lucid, as such does not demand extra effort to understand."]}], "ದ್ರಾಕ್ಷಾರಸ": [{"type": "noun", "defs": ["the liquid extracted from grapes; grape-juice.", "the fermented juice of grapes, used as an alcoholic beverage; wine."]}], "ದ್ರಾಕ್ಷಾರಿಷ್ಟ": [{"type": "noun", "defs": ["a decocted medicinal substance to which sugar, honey and grape juice are added."]}], "ದ್ರಾಕ್ಷಾವಲ್ಲಿ": [{"type": "noun", "defs": ["the vine of grape plant."]}], "ದ್ರಾಕ್ಷಾಸವ": [{"type": "noun", "defs": ["= ದ್ರಾಕ್ಷಾರಸ -2."]}], "ದ್ರಾಕ್ಷಿ": [{"type": "noun", "defs": ["the vine Vitis vinifera of Vitaceae family.", "its small, round, smooth-skinned, juicy berries, growing in clusters, eaten raw or used to make wine; grape (raw or dried).", "ದ್ರಾಕ್ಷಿ ಸಿಹಿ ಎಂದು ಬಳ್ಳಿಯನ್ನೂ ತಿನ್ನಬಾರದು drākṣi sihi endu baḷḷiyannū tinnabāradu (prov.) the orange that too hard squeezed, yields bitter juice."]}], "ದ್ರಾಕ್ಷಿಚೂರ್ಣ": [{"type": "noun", "defs": ["a medicinal powder made using dried grapes and other substances."]}], "ದ್ರಾಕ್ಷೆ": [{"type": "noun", "defs": ["= ದ್ರಾಕ್ಷಿ."]}], "ದ್ರಾಘಿಮ": [{"type": "noun", "defs": ["the quality or fact of being long or longer."]}], "ದ್ರಾಘಿಷ್ಠ": [{"type": "noun", "defs": ["lengthened; not short or brief."]}], "ದ್ರಾಪ": [{"type": "noun", "defs": ["mud mixed with water; slush; soft mud; mire.", "the sky.", "a stupid fellow; a fool."]}], "ದ್ರಾಬೆ": [{"type": "noun", "defs": ["a stupid fellow; a fool.", "an useless man.", "a dirty fellow.", "a man low in physical strength or vitality; a weak man."]}], "ದ್ರಾಭೆ": [{"type": "noun", "defs": ["= ದ್ರಾಬೆ."]}], "ದ್ರಾಮಿಡ": [{"type": "adjective", "defs": ["= ದ್ರಾವಿಡ1."]}, {"type": "noun", "defs": ["= ದ್ರಾವಿಡ2."]}], "ದ್ರಾಮಿಡಗೌಳ": [{"type": "noun", "defs": ["(mus.) a musical mode in Karnāṭaka system."]}], "ದ್ರಾಮಿಡಘೂರ್ಜರಿ": [{"type": "noun", "defs": ["(mus.) a musical mode in Karnāṭaka system."]}], "ದ್ರಾಮಿಡವರಾಳಿ": [{"type": "noun", "defs": ["(mus.) a musical mode in Karnāṭaka system."]}], "ದ್ರಾಮಿಡಿ": [{"type": "noun", "defs": ["a woman belonging to or originated from Tamil Nadu; a Tamil woman."]}], "ದ್ರಾವ": [{"type": "noun", "defs": ["the act or an instance of running.", "the speed or force with which one moves or is moving.", "the act or fact of flowing in a stream; flow.", "the act of melting (a solid substance).", "he process of first heating a mixture to separate the more volatile parts from the less volatile parts, and then cooling and condensing the resulting vapour so as to produce a nearly pure or refined substance; distillation."]}], "ದ್ರಾವಕ": [{"type": "adjective", "defs": ["causing to flow in a stream.", "changing from a solid to a liquid state; melting.", "softening; making gentle and tender; causing to have sympathy for."]}, {"type": "noun", "defs": ["a piece of certain kind of material that has the property of attracting iron; a magnet.", "a milky-white, translucent feldspar with a pearly lustre, used as a gem; the moonstone.", "a thief; a burglar.", "a skilled man.", "a man given excessively to sexual enjoyments; a debauchee.", "a distilled liquid.", "a liquid that has one or more substances dissolved in; a solution."]}], "ದ್ರಾವಣ": [{"type": "noun", "defs": ["a liquid that has one or more substances dissolved in; a solution.", "the process by which a gas, liquid or solid is dispersed homogeneously in a liquid without chemical change; solution.", "(fig.) the fact of being filled with love or being charmed, enamoured with."]}], "ದ್ರಾವಣಿ": [{"type": "noun", "defs": ["a woman who is very tender, compassionate and sympathetic."]}], "ದ್ರಾವಣೀಯ": [{"type": "noun", "defs": ["having the tendency to melt.", "being very tender, compassionate and sympathetic."]}], "ದ್ರಾವಾಗ್ನಿ": [{"type": "noun", "defs": ["melted rock flowing out from a volcano; lava."]}], "ದ್ರಾವಿಡ": [{"type": "adjective", "defs": ["of or relating to Dravidian (sometimes, Tamil in particular) family of languages, country or people."]}, {"type": "noun", "defs": ["a man belonging to Dravidian (sometimes, Tamil, in particular) country or speaking Dravidian (sometimes, Tamil in particular) languages.", "any language belonging to Dravidian family.", "the Dravidian country (traditionally believed to be the entire South India).", "Tamil Nadu, a South Indian state.", "the Dravidian people or one of its male member.", "the people of Tamil Nadu or one of its male member.", "a style of architecture originated from the Dravidian country."]}], "ದ್ರಾವಿಡಕ": [{"type": "noun", "defs": ["the plant Curcuma zeodarina (= C. zerumbet, = Amonum zerumbet) of Zingiberaceae family; round zedoary.", "the aromatic substance obtained from the dried, pulverised rhizome of this; zedoary."]}], "ದ್ರಾವಿಡತಪಸ್ಸು": [{"type": "noun", "defs": ["a penance or vow observed with an evil purpose; a false religious vow."]}], "ದ್ರಾವಿಡಪದ್ಧತಿ": [{"type": "noun", "defs": ["the custom, habit of, prevailing among, Dravidian people.", "(pros.) the prosody or prosodic system that is particular to the languages belonging to the Dravidian family."]}], "ದ್ರಾವಿಡಪ್ರಬಂಧ": [{"type": "noun", "defs": ["any of the spiritual works of the ten Tamil Vaiṣṇava canonised saints, containing mainly hymns in praise of Viṣṇu."]}], "ದ್ರಾವಿಡಪ್ರಾಣಾಯಾಮ": [{"type": "noun", "defs": ["a way of working with unnecessary, unwarranted effort."]}], "ದ್ರಾವಿಡವೇದ": [{"type": "noun", "defs": ["collectively the devotional hymns of Tamilāḷvārs, Vaiṣṇava canonised saints, considered as parallel to the Vedas:."]}], "ದ್ರಾವಿಡಸಂಘ": [{"type": "noun", "defs": ["a group or clan of Jaina mendicants belonging Tamil Nadu."]}], "ದ್ರಾವಿಡಿ": [{"type": "noun", "defs": ["a woman belonging to or originated from Tamil Nadu; a Tamil woman."]}], "ದ್ರಾವಿತ": [{"type": "adjective", "defs": ["that is melted or resolved in a liquid.", "softened, gentle and tender."]}], "ದ್ರಾವಿಳ": [{"type": "adjective", "defs": ["= ದ್ರಾವಿಡ1."]}, {"type": "noun", "defs": ["= ದ್ರಾವಿಡ2."]}], "ದ್ರು": [{"type": "noun", "defs": ["= ದ್ರುಮ."]}], "ದ್ರುಕಿಲಮ": [{"type": "noun", "defs": ["the tree Pinus deodara of Pinaceae family; sacred Indian fir."]}], "ದ್ರುಕ್ಕು": [{"type": "noun", "defs": ["the organ of sight; the eye."]}], "ದ್ರುಗ್ಧ": [{"type": "adjective", "defs": ["annoyed; troubled; irritated.", "cheated or betrayed."]}, {"type": "noun", "defs": ["an annoying or being annoyed; annoyance; vexation; irritation."]}], "ದ್ರುಘಣ": [{"type": "noun", "defs": ["a wooden hammer.", "a tool having a long wooden handle and a heavy metal head with a blade on one side used for chopping trees and splitting wood; an axe; a hatchet."]}], "ದ್ರುಣ": [{"type": "noun", "defs": ["an arachnid of an order (Scorpionida) that has an elongated body and a narrow segmented tail bearing a venomous stinger at the tip; a scorpion.", "a curved, flexible strip of wood or metal, with a tightly drawn cord connecting the two ends, used for shooting arrows; a bow.", "a, usu. curved, weapon with a long blade for cutting or thrusting which is also used as a symbol of honour or authority; a sword."]}], "ದ್ರುಣಿ": [{"type": "noun", "defs": ["any of a class (Chilopoda) of elongated, many-segmented, insect-eating arthropods with a pair of legs to each segment; a centipede.", "a female tortoise.", "a wooden trough or boat."]}], "ದ್ರುತ": [{"type": "adjective", "defs": ["characterised by speed of motion; rapid; swift; speedy.", "that has run; gone away with a rapid pace.", "that is melted or dissolved.", "scattered in all directions; spread out; dispersed."]}, {"type": "noun", "defs": ["= ದ್ರುಣ - 1; 2.the speed, force or swiftness of motion.", "speedy action or swift motion.", "a long pole with a broad blade at one end used for propelling or steering a boat; an oar.", "a period of time, in music, measured with two sub-units and kept with two different actions of the hand.", "the fastest tempo in music."]}], "ದ್ರುತಪದ": [{"type": "noun", "defs": ["(pros.) a meter having four lines of twelve syllables each."]}], "ದ್ರುತವಿಡು": [{"type": "verb", "defs": ["to undergo pain, annoyance or irritation."]}], "ದ್ರುತವಿಲಂಬಿತ": [{"type": "noun", "defs": ["(pros.) a meter having four lines of twelve syllables each."]}], "ದ್ರುತವಿಳಂಬಿತ": [{"type": "noun", "defs": ["= ದ್ರುತವಿಲಂಬಿತ."]}], "ದ್ರುತಿ": [{"type": "noun", "defs": ["the process by which a gas, liquid or solid is dispersed homogeneously in a liquid without chemical change; solution.", "a melted or dissolved substance."]}], "ದ್ರುಪದ": [{"type": "noun", "defs": ["a variety of time or pace keeping in Hindustani music."]}, {"type": "noun", "defs": ["a wooden pillar."]}], "ದ್ರುಮ": [{"type": "noun", "defs": ["a woody perennial plant having a single usu. elongate main stem generally with few or no branches on its lower part; a tree."]}], "ದ್ರುಮೋತ್ಪಲ": [{"type": "noun", "defs": ["the large, evergreen tree Pterospermum acerifolium (= P. aceroides) of Sterculiaceae family.", "its flower."]}], "ದ್ರುವಣಿ": [{"type": "noun", "defs": ["a kind of plant."]}], "ದ್ರುವಯ": [{"type": "noun", "defs": ["a standard for determining extent, dimensions, etc.; unit of measurement as seer, koḷaga, etc."]}], "ದ್ರುಹಿಣ": [{"type": "noun", "defs": ["Brahma, the Creator of Universe."]}], "ದ್ರುಹಿಣಾಂಡ": [{"type": "noun", "defs": ["the entire universe as created by Brahma."]}], "ದ್ರೇಕ್ಕಾಣ": [{"type": "noun", "defs": ["(astrol.) the third part of a sign of the zodiac."]}], "ದ್ರೋಣ": [{"type": "noun", "defs": ["a wooden vessel, bucket, trough, etc.", "a cup made of a leaf of a plant.", "a measure of capacity equal to four koḷagas.", "a kind of cloud (from which the rain streams forth as from a bucket).", "the largest crow (Corvus corax), with a straight, sharp beak; a raven.", "an arachnid of an order (Scorpionida) that has an elongated body and a narrow segmented tail bearing a venomous stinger at the tip; a scorpion.", "the eighth sign of the zodiac, entered by the sun about October 24; Scorpio.", "any of various families of tailless, leaping anuran amphibians with long, powerful hind legs, short forelegs, a smooth skin, and webbed feet; a frog.", "the celebrated teacher in Mahābhārata, who tought martial arts to Pāndava and Kaurava princes.", "a curved, flexible strip of wood or metal, with a tightly drawn cord connecting the two ends, used for shooting arrows; a bow.", "the administrative city that has jurisdiction over four surrounding towns and villages.", "the small plant Leucas aspera of Lamiaceae family.", "its small, white flower."]}], "ದ್ರೋಣಕಾಕ": [{"type": "noun", "defs": ["the largest crow (Corvus corax), with a straight, sharp beak; a raven."]}], "ದ್ರೋಣಮುಖ": [{"type": "noun", "defs": ["the administrative city that has jurisdiction over four surrounding towns and villages."]}], "ದ್ರೋಣಾಮುಖ": [{"type": "noun", "defs": ["= ದ್ರೋಣಮುಖ."]}], "ದ್ರೋಣಿ": [{"type": "noun", "defs": ["a small vessel for travel on water; a boat.", "a cum made of leaves of certain plants.", "a container made by hollowing a wood piece.", "a stretch of low land lying between hills or mountains; a valley.", "a part of a sea that is very deep.", "any of a genus (Indigofera) of plants of the pea family that yield indigo.", "the larger of the two gourds of a Vīṇe, the fretted and stringed musical instrument used in Karnāṭaka system."]}], "ದ್ರೋಣಿಕೆ": [{"type": "noun", "defs": ["a small boat."]}], "ದ್ರೋಹ": [{"type": "noun", "defs": ["betrayal of trust, faith or allegiance; treachery; perfidy; disloyalty; treason.", "that which is not right or not just, proper, correct, etc.; esp., an unjust or immoral act; a wrong doing.", "strong and deep-rooted dislike or hatred; enmity.", "a man who cheats; a deceiver.", "ದ್ರೋಹ ಎಣಿಸು drōha eṇisu = ದ್ರೋಹ ಬಗೆ; ದ್ರೋಹ ಬಗೆ drōha bage to plan to cheat; ದ್ರೋಹ ಮಾಡು drōha māḍu to cheat; to deceive; ದ್ರೋಹವಾಗು drōhavāgu (an act of disloyalty, cheating, etc.) to be committed."]}], "ದ್ರೋಹಚಿಂತನ": [{"type": "noun", "defs": ["a drawing of a scheme to cheat another or to plan to commit a treacherous deed."]}], "ದ್ರೋಹಿ": [{"type": "noun", "defs": ["a person who betrays trust, faith or allegiance; a perfidious person.", "a cheat; a deceiver."]}], "ದ್ರೋಹಿಗ": [{"type": "noun", "defs": ["= ದ್ರೋಹಿ."]}], "ದ್ರೋಹಿತನ": [{"type": "noun", "defs": ["the quality or tendency of betraying, cheating, etc.; treachery; disloyalty; betrayal; perfidy."]}], "ದ್ರೌಣಿ": [{"type": "noun", "defs": ["= ದ್ರೋಣಿ - 1."]}], "ದ್ರೌಣಿಕ": [{"type": "noun", "defs": ["a measure of land (i.e. that much of land which requires a ದ್ರೋಣ (four koḷagas) of corn for being sown with)."]}], "ದ್ರೌಪದಿ": [{"type": "noun", "defs": ["the main female character in Mahābhārata, the great Indian epic.", "a Northern constellation between Cassiopeia and Pisces containing the nearest spiral galaxy, Andromeda galaxy M31, which is visible to the naked eye; Andromeda."]}], "ದ್ವಂದ್ವ": [{"type": "noun", "defs": ["a set of two corresponding things; a pair.", "a pair of opposites.", "the feeling of being dual or separate from; dualism.", "a physical combat between only two persons.", "lack of certainty; uncertainty; doubt.", "a disputing; a dispute; heated argument.", "a discussion between two that is supposed to be kept from the knowledge of others.", "(gram.) a compound word in which both the words combined without lowering the importance of either of them."]}], "ದ್ವಂದ್ವಕರ್ಮ": [{"type": "noun", "defs": ["a pair of two different deeds that are opposite to each other in quality, virtue, importance, etc."]}], "ದ್ವಂದ್ವಜ": [{"type": "adjective", "defs": ["produced by two entirely causes or agents."]}], "ದ್ವಂದ್ವಜ್ವರ": [{"type": "noun", "defs": ["a disease caused by any two of the three humours in the body (ವಾತ, ಪಿತ್ತ and ಶ್ಲೇಷ್ಮ)."]}], "ದ್ವಂದ್ವಪ್ರಕೃತಿ": [{"type": "noun", "defs": ["a combination of two entirely different or opposite characters, disposition, tendencies, etc.", "he who or that which, has such a combination."]}], "ದ್ವಂದ್ವಪ್ರಯತ್ನ": [{"type": "noun", "defs": ["a plan or scheme for waging a war."]}], "ದ್ವಂದ್ವಮೇಹ": [{"type": "noun", "defs": ["a kind of venereal disease."]}], "ದ್ವಂದ್ವಯುದ್ಧ": [{"type": "noun", "defs": ["a physical combat between only two persons."]}], "ದ್ವಂದ್ವಯೋಗ": [{"type": "noun", "defs": ["two lines of scratch made by one's fingernail on the body of one's sexual partner."]}], "ದ್ವಂದ್ವರೋಗ": [{"type": "noun", "defs": ["a disease caused by two humours in the body (vāta and pitta)."]}], "ದ್ವಂದ್ವವಿರಹಿತ": [{"type": "noun", "defs": ["a wise man who has transcended the duality between the Supreme Being and the individual soul."]}], "ದ್ವಂದ್ವಸಮಾಸ": [{"type": "noun", "defs": ["(gram.) a compound word in which both the words combined without lowering the importance of either of them."]}], "ದ್ವಂದ್ವಾರ್ಥ": [{"type": "noun", "defs": ["two meanings (of a word, sentence, expression, etc. that is either possible or intended)."]}], "ದ್ವಂದ್ವಾರ್ಥತೆ": [{"type": "noun", "defs": ["the quality or condition or fact of having two possible or intended meanings."]}], "ದ್ವಯ": [{"type": "noun", "defs": ["a set of two similar, corresponding or complementary things, persons, animals, etc.; a pair."]}], "ದ್ವಯಭಾವ": [{"type": "noun", "defs": ["the knowledge or feeling of duality (between the Supreme Being and the individual soul)."]}], "ದ್ವಯವಿಡಿ": [{"type": "noun", "defs": ["the deliberately differentiate between two things esp. between the Supreme Being and the individual soul."]}], "ದ್ವಯಾತಿಗ": [{"type": "noun", "defs": ["a man who is virtuous and not characterised by blind dynamism and negative characters as ignorance, wickedness, selfishness, etc."]}], "ದ್ವಾಃಸ್ಥ": [{"type": "noun", "defs": ["a man who guards the entrance of a building; a doorkeeper."]}], "ದ್ವಾಃಸ್ಥಿತ": [{"type": "noun", "defs": ["= ದ್ವಾಃಸ್ಥ."]}], "ದ್ವಾತ್ರಿಂಶತಿ": [{"type": "adjective", "defs": ["= ದ್ವಾತ್ರಿಂಶತ್ತು1."]}, {"type": "noun", "defs": ["= ದ್ವಾತ್ರಿಂಶತ್ತು2."]}], "ದ್ವಾತ್ರಿಂಶತ್ತು": [{"type": "adjective", "defs": ["totalling thirty two."]}, {"type": "noun", "defs": ["the cardinal number thirty-two."]}], "ದ್ವಾದಶ": [{"type": "adjective", "defs": ["preceded by eleven others in a series; twelfth; 12th; totalling twelve."]}, {"type": "noun", "defs": ["the cardinal number twelve; 12."]}], "ದ್ವಾದಶಿ": [{"type": "noun", "defs": ["the twelfth day of a lunar fortnight."]}], "ದ್ವಾದಸಿ": [{"type": "noun", "defs": ["= ದ್ವಾದಶಿ."]}], "ದ್ವಾಪರ": [{"type": "noun", "defs": ["(myth.) the third of the four ages of the world, extending to 8,64,000 years.", "the deity presiding this age.", "the face of a die that indicates a score of two.", "lack of certainty; uncertainty.", "a physical combat between the armies.", "(fig.) ancient times."]}], "ದ್ವಾಪರಯುಗ": [{"type": "noun", "defs": ["= ದ್ವಾಪರ - 1."]}], "ದ್ವಾಪಾರ": [{"type": "noun", "defs": ["= ದ್ವಾಪರ - 1."]}], "ದ್ವಾಮುಷ್ಯಾಯಣ": [{"type": "noun", "defs": ["a boy or man who inherits or is legally entitled to inherit the property of, and is bound to perform the rites to, his father and another person who has adopted him as a son."]}], "ದ್ವಾರ": [{"type": "noun", "defs": ["a place for entering through; an entrance.", "any of the nine openings or aperture in the human body.", "that by which something is done or obtained; a means."]}], "ದ್ವಾರಗೊಲ್ಲ": [{"type": "noun", "defs": ["= ದ್ವಾರಪಾಲಕ."]}], "ದ್ವಾರನಿಯುಕ್ತ": [{"type": "noun", "defs": ["a man appointed to guard the entrance; a doorkeeper."]}], "ದ್ವಾರಪಟ್ಟ": [{"type": "noun", "defs": ["the upper cross-piece of a door.", "the panel of a door.", "a screen or curtain for the main door of a house."]}], "ದ್ವಾರಪಾಲ": [{"type": "noun", "defs": ["= ದ್ವಾರಪಾಲಕ."]}], "ದ್ವಾರಪಾಲಕ": [{"type": "noun", "defs": ["a man who guards the entrance of a building; a doorkeeper."]}], "ದ್ವಾರಪಾಳಕ": [{"type": "noun", "defs": ["= ದ್ವಾರಪಾಲಕ."]}], "ದ್ವಾರಬಂಧ": [{"type": "noun", "defs": ["the frame of a door.", "the panel of a door."]}], "ದ್ವಾರವಟ್ಟ": [{"type": "noun", "defs": ["the main entrance of a town.", "a structure that is relatively high for its length and width and of conical or pyramidal type standing on the main gate of a town.", "a length of wood along the bottom of a doorway; the doorsill; the threshold.", "a room a home used for meeting outside people."]}], "ದ್ವಾರವಾಟಿಕೆ": [{"type": "noun", "defs": ["the main entrance (of a town, building, etc.)."]}], "ದ್ವಾರಾ": [{"type": "adverb", "defs": ["by way of; through; by means of."]}], "ದ್ವಾರಾಪೇಕ್ಷೆ": [{"type": "noun", "defs": ["(Jain.) a looking forward for a guest, esp. a Jaina mendicant, before having one's meal."]}], "ದ್ವಾರಾವಲೋಕನ": [{"type": "noun", "defs": ["= ದ್ವಾರಾಪೇಕ್ಷೆ."]}], "ದ್ವಾರಿಕ": [{"type": "noun", "defs": ["= ದ್ವಾರಪಾಲಕ."]}], "ದ್ವಾರಿಗ": [{"type": "noun", "defs": ["= ದ್ವಾರಪಾಲಕ."]}], "ದ್ವಾವಿಂಶತಿ": [{"type": "adjective", "defs": ["totalling twenty two."]}, {"type": "noun", "defs": ["the cardinal number twenty two; 22."]}], "ದ್ವಾಶಿ": [{"type": "noun", "defs": ["a thin, flat cake made of ground and fermented rice or black gram."]}], "ದ್ವಾಸ್ಥ": [{"type": "noun", "defs": ["= ದ್ವಾರಪಾಲಕ."]}], "ದ್ವಿ": [{"type": "adjective", "defs": ["amounting to two in number."]}, {"type": "noun", "defs": ["the cardinal number two; 2.", "(gram.) the grammatical number referring to two persons, animals, things, etc."]}], "ದ್ವಿಕ": [{"type": "noun", "defs": ["a set of two.", "any of several large oscine birds of the genus Corvus, of the family Corvidae, having a long, stout bill, lustrous black plumage, and a wedge-shaped tail; a crow.", "the ruddy goose, the male and female of which are supposed to be together always."]}], "ದ್ವಿಕರ್ಮಕ": [{"type": "noun", "defs": ["(gram.) a verb having two objects."]}], "ದ್ವಿಖುರ": [{"type": "noun", "defs": ["the split hoof.", "a horse, that has split hooves."]}], "ದ್ವಿಗು": [{"type": "noun", "defs": ["(gram.) a compound word in which the first word is a numeral."]}], "ದ್ವಿಗುಣ": [{"type": "noun", "defs": ["the quantity, number, etc. that is twice the given quantity, number."]}], "ದ್ವಿಗುಣಂಗೆಯ್": [{"type": "verb", "defs": ["= ದ್ವಿಗುಣಿಸು."]}], "ದ್ವಿಗುಣಗೊಳ್ಳು": [{"type": "verb", "defs": ["to become double; to be made as much or as many; to be increased by the same quantity, number, etc."]}], "ದ್ವಿಗುಣಿ": [{"type": "noun", "defs": ["that which is twice the quantity, number of.", "a person who is more virtuous than (another)."]}], "ದ್ವಿಗುಣಿತ": [{"type": "adjective", "defs": ["increased by the same quantity or number; doubled."]}], "ದ್ವಿಗುಣಿಸು": [{"type": "verb", "defs": ["to make double; to make twice as much or as many; to multiply by two."]}], "ದ್ವಿಗುಣೀಕೃತ": [{"type": "adjective", "defs": ["= ದ್ವಿಗುಣಿತ."]}], "ದ್ವಿಗುಣೀಭೂತ": [{"type": "adjective", "defs": ["= ದ್ವಿಗುಣಿತ."]}], "ದ್ವಿಗುಸಮಾಸ": [{"type": "noun", "defs": ["= ದ್ವಿಗು."]}], "ದ್ವಿಗೃಹೀತಕ": [{"type": "noun", "defs": ["a kind of small vessel used for drinking the juice of sōma plant in religious sacrifices."]}], "ದ್ವಿಚರಮ": [{"type": "noun", "defs": ["(Jain.) a man who takes or has to take, human life twice before being emancipated."]}], "ದ್ವಿಚರಮತ್ವ": [{"type": "noun", "defs": ["(Jain.) the condition that a man has to take human life twice before being emancipated."]}], "ದ್ವಿಚರಮದೇಹ": [{"type": "noun", "defs": ["= ದ್ವಿಚರಮ."]}], "ದ್ವಿಚರಮಸಮಯ": [{"type": "noun", "defs": ["(jain.) the duration of last of the two human lives a person has to take before being emancipated."]}], "ದ್ವಿಚಾರಿಣಿ": [{"type": "noun", "defs": ["a woman having sexual relations with two men."]}], "ದ್ವಿಜ": [{"type": "adjective", "defs": ["born twice."]}, {"type": "noun", "defs": ["(lit.) a man who has undergone a definite experience of fundamental moral and spiritual renewal, which is considered as his rebirth.", "a man, belonging to brāhmaṇa, kṣatriya or Vaiṣya caste (but more often referred to the one belonging to brāhmaṇa caste), whose investitute with the sacred thread constitutes, religiously and metaphorically, his second birth.", "any being, as a bird or certain other animals, that comes to the world as an independent living being, from an egg; any egg-born being.", "any of the human teeth that is got for the second time", "any of the self-luminous celestial objects seen as points of light in the sky; a star.", "the moon.", "various grains.", "an ornament for the ears."]}], "ದ್ವಿಜತ್ವ": [{"type": "noun", "defs": ["the condition of being or the rank, status of a brāhmaṇa."]}], "ದ್ವಿಜನ್ಮ": [{"type": "noun", "defs": ["= ದ್ವಿಜ2 -1 & 2."]}], "ದ್ವಿಜವಂತಿ": [{"type": "noun", "defs": ["= ದ್ವಿಜಾವಂತಿ."]}], "ದ್ವಿಜಹತಿ": [{"type": "noun", "defs": ["a killing of a brāhmaṇa or brāhmaṇās.", "a wound, scratch or tear made by biting with a tooth or teeth."]}], "ದ್ವಿಜಾತ": [{"type": "adjective", "defs": ["= ದ್ವಿಜ1."]}, {"type": "noun", "defs": ["= ದ್ವಿಜ2 -1 & 2."]}], "ದ್ವಿಜಾತಿ": [{"type": "noun", "defs": ["= ದ್ವಿಜ2 -1 & 2."]}], "ದ್ವಿಜಾವಂತಿ": [{"type": "noun", "defs": ["(mus.) a mode in Karnāṭaka system, derived from the main mode Harikāmbhōji."]}], "ದ್ವಿಜಿಹ್ವ": [{"type": "adjective", "defs": ["having two tongues (as snakes).", "making false promises or not acting as per one's own words."]}, {"type": "noun", "defs": ["a snake that has split tongue.", "a man who lies and whose actions are different from his words.", "a slanderer."]}], "ದ್ವಿಜೆ": [{"type": "noun", "defs": ["the gum obtained from the olibanum trees.", "any of these trees."]}], "ದ್ವಿಟ್ಕುಲ": [{"type": "noun", "defs": ["= ದ್ವಿಟ್ಚಕ್ರ."]}], "ದ್ವಿಟ್ಚಕ್ರ": [{"type": "noun", "defs": ["a multitude of enemies."]}], "ದ್ವಿತಯ": [{"type": "noun", "defs": ["a set of two similar, corresponding, complementary persons, animals or things; a pair.", "(arith.) the cardinal number two; 2."]}], "ದ್ವಿತೀಯ": [{"type": "adjective", "defs": ["coming next after the first in order of place or time; second; 2nd.", "ದ್ವಿತೀಯ ವಯಸ್ಸು dvitīya vayassu the second half of one's life-period."]}, {"type": "noun", "defs": ["a friend or companion.", "a thing that is different (from the one under reference)."]}], "ದ್ವಿತೀಯಾವಿಭಕ್ತಿ": [{"type": "noun", "defs": ["(gram.) the accusative case."]}], "ದ್ವಿತೀಯೆ": [{"type": "noun", "defs": ["a woman as related to a man to whom she is married; a wife.", "the second day of a lunar fortnight.", "(gram.) the accusative case."]}], "ದ್ವಿತ್ವ": [{"type": "noun", "defs": ["a set of two similar, corresponding, complementary persons, animals or things; a pair.", "(arith.) the cardinal number two; 2.", "(gram.) a syllable formed by the combination of two consonants.", "a word having one or more such clustered consonants."]}], "ದ್ವಿತ್ವವಿಕಲ್ಪ": [{"type": "noun", "defs": ["(gram.) the usage of a word either with consonants combined or with a single consonant in its place."]}], "ದ್ವಿತ್ವವೃತ್ತಿ": [{"type": "noun", "defs": ["(gram.) occurrence of a syllable formed by the combination of two consonants."]}], "ದ್ವಿತ್ವಾಕ್ಷರ": [{"type": "noun", "defs": ["= ದ್ವಿತ್ವ - 3."]}], "ದ್ವಿದಲ": [{"type": "adjective", "defs": ["= ದ್ವಿದಳ1."]}, {"type": "noun", "defs": ["= ದ್ವಿದಳ2."]}], "ದ್ವಿದಳ": [{"type": "adjective", "defs": ["splitting or that can be split, into two parts."]}, {"type": "noun", "defs": ["a combination of two leaves, petals or pods.", "a leguminous seed (as of pea nut, soybean seed, etc.) that can be easily split into two parts (unlike the grain of rice, wheat)."]}], "ದ್ವಿದಳಧಾನ್ಯ": [{"type": "noun", "defs": ["= ದ್ವಿದಳ2 - 2."]}], "ದ್ವಿದಳಪದ್ಮ": [{"type": "noun", "defs": ["(yoga.) a mystical lotus flower, having two petals, one of the six such flowers in the body; (they are considered as six stages where the raised divine energy rests as it moves upwards to the crown of the head, and at each stage different mystical power is bestowed on the person)."]}], "ದ್ವಿದೃಷ್ಟಿ": [{"type": "noun", "defs": ["a defect of the eye, that makes two images of an object be seen."]}], "ದ್ವಿಧಾ": [{"type": "adverb", "defs": ["divided or dividing into two parts; dichotomously.", "in two ways, manners."]}], "ದ್ವಿಧಾಕೃತ": [{"type": "noun", "defs": ["that which is split, divided into two parts."]}], "ದ್ವಿಧಾಗತಿ": [{"type": "noun", "defs": ["a moving, thinking, acting in two different ways or manners.", "the quality of one's action being sharply opposed to what one has said or implied.", "any of a class of animals (as frogs, crab, crocodile, etc.) that live both in the water and on the land."]}], "ದ್ವಿಧಾಭಾವ": [{"type": "noun", "defs": ["the condition of having at the same time two feelings, that are contradictory to each other."]}], "ದ್ವಿಧಾವೃತ್ತಿ": [{"type": "noun", "defs": ["a conduct or behaviour characterised by contradictions (as between two kinds of emotions or between thought and emotion, speech and action, thought and action etc.)."]}], "ದ್ವಿಪ": [{"type": "noun", "defs": ["an elephant that drinks water in two stages (first sucking into its trunk and next taking into the mouth)."]}], "ದ್ವಿಪಕ್ಷ": [{"type": "noun", "defs": ["a set of two wings (as of an aeroplane).", "both the sides (of anything).", "(pl.) two groups."]}], "ದ್ವಿಪಕ್ಷೀಯ": [{"type": "adjective", "defs": ["of, having or involving two sides, halves, factions, etc.; bilateral.", "affecting both sides; reciprocal."]}], "ದ್ವಿಪದ": [{"type": "adjective", "defs": ["having or walking on two feet."]}, {"type": "noun", "defs": ["a two-legged animal (as a human being).", "(gram.) two words.", "(pros.) a kind of meter having three Viṣṇu gaṇas and one Brahma gaṇas in each line."]}], "ದ್ವಿಪದಿ": [{"type": "noun", "defs": ["(pros.) a meter in which each verse has two lines.", "(pros.) a meter in which each lines has three groups of five units and one group of three units."]}], "ದ್ವಿಪದೀಖಂಡ": [{"type": "noun", "defs": ["a literary composition, mainly for singing, having independent verses each having two lines."]}], "ದ್ವಿಪಾದಶೀರ್ಷಾಸನ": [{"type": "noun", "defs": ["(yoga.) a standing on one's head keeping both the legs pointing upwards (the entire body being perpendicular to the floor)."]}], "ದ್ವಿಪಾದ್ಯ": [{"type": "noun", "defs": ["a sum of money, which is double the prescribed amount, required to be paid as a punishment or penalty for an offence."]}]}