{"ಆರ್ಯಕರ್ಮ": [{"type": "noun", "defs": ["an act fit to be performed by wise people.", "an act to be performed by Jaina people."]}], "ಆರ್ಯಕೆ": [{"type": "noun", "defs": ["a Jaina religious woman under solemn vows."]}], "ಆರ್ಯಚರಿತ": [{"type": "noun", "defs": ["a man with exemplary behaviour."]}], "ಆರ್ಯಪುತ್ರ": [{"type": "noun", "defs": ["(archaic) a mode of addressing one's husband."]}], "ಆರ್ಯಮುಖ": [{"type": "noun", "defs": ["a man who does not regard or wilfully disregards, elders."]}], "ಆರ್ಯವೇಲ": [{"type": "noun", "defs": ["the tree Acacia farnesiana of Mimosae family; fragrant acacia."]}], "ಆರ್ಯವೇಷ": [{"type": "noun", "defs": ["a man dressed in decent robes, worthy of being worn by wise-men."]}], "ಆರ್ಯಷಟ್ಕರ್ಮ": [{"type": "noun", "defs": ["a particular act to be performed by Jaina people."]}], "ಆರ್ಯಸಮಾಜ": [{"type": "noun", "defs": ["a reformed Hindu religious body or school, founded by Svāmi Dayānanda Sarasvati (1824-83) in 1875 based on the Vēdas, opposing idolatry, caste, child-marriage and other social evils."]}], "ಆರ್ಯಾಗೀತಿ": [{"type": "noun", "defs": ["(rhet.) a metre corresponding to 'ಕಂದ'."]}], "ಆರ್ಯಾಣಿ": [{"type": "noun", "defs": ["a woman belonging to the traders' community."]}], "ಆರ್ಯಾವರ್ತ": [{"type": "noun", "defs": ["the tract of the land in northern India surrounded by the Himalayas on the north, Vindya mountain in the south."]}], "ಆರ್ಯಾವೃತ್ತ": [{"type": "noun", "defs": ["= ಆರ್ಯೆ - 3."]}], "ಆರ್ಯಿಕೆ": [{"type": "noun", "defs": ["a respectable woman.", "a Jaina religious woman under solemn vows."]}], "ಆರ್ಯೀಕರಣ": [{"type": "noun", "defs": ["the act or process of converting a race into 'ಆರ್ಯ'.", "the act or process of making another adopt the way of life, outlook and the philosophy of ಆರ್ಯ."]}], "ಆರ್ಯೆ": [{"type": "noun", "defs": ["a respectable woman; (also used as a mode of addressing elderly and respectable woman).", "the goddess Pārvati, the consort of Śiva.", "a metre, regulated by the number of syllabic instants, having twelve syllabic instants each in the first and third quarters and eighteen in the second, and fifteen in the fourth quarters."]}], "ಆರ್ಯೋಕ್ತಿ": [{"type": "noun", "defs": ["elders' speech, advice or wisdom."]}], "ಆರ್ಷ": [{"type": "adjective", "defs": ["of or relating to ancient (Indian) sages; followed or used by them.", "of times long past; belonging to the early history; ancient.", "spiritually perfect or pure; untainted by evil or sin; saintly; sacred; holy."]}, {"type": "noun", "defs": ["one of the eight forms of marriage in which the bride's father receives one or two pairs of cows from the bridegroom."]}], "ಆರ್ಷತೆ": [{"type": "noun", "defs": ["that which is belonging to the ancient Indian sages; the quality or fact of being so; ancient manners, customs, etc.", "the quality or fact of being related to very ancient times; the state or fact of existing for a very long time.", "the quality of being holy or sacred (on account of being ancient)."]}], "ಆರ್ಷದರ್ಶನ": [{"type": "noun", "defs": ["the vision of the ancient seers; any of the philosophies propounded by them."]}], "ಆರ್ಷದೃಷ್ಟಿ": [{"type": "noun", "defs": ["= ಆರ್ಷದರ್ಶನ."]}], "ಆರ್ಷಭ್ಯ": [{"type": "noun", "defs": ["an ox of suitable age for using in ploughing and other domestic purpose."]}], "ಆರ್ಷಮತ": [{"type": "noun", "defs": ["the opinion, judgement of ancient Indian sages (as a guideline)."]}], "ಆರ್ಷವಾಣಿ": [{"type": "noun", "defs": ["the saying, speech, opinion, philosophy of the ancient sages."]}], "ಆರ್ಷಸಂಪತ್ತು": [{"type": "noun", "defs": ["the knowledge, inherited from the ancient sages, considered as wealth."]}], "ಆರ್ಷಸಂಹಿತೆ": [{"type": "noun", "defs": ["the mystical hymns of Vedas."]}], "ಆರ್ಷೇಯ": [{"type": "adjective", "defs": ["followed by or relating to the ancient Indian sages.", "of olden times; ancient; traditional.", "holy; sacred.", "designating or of the earliest geological era, covering all the time before the Cambrian Period; pre-Cambrian."]}, {"type": "noun", "defs": ["a man belonging to an ancient time."]}], "ಆರ್ಷೇಯಕಲ್ಪ": [{"type": "noun", "defs": ["= ಆರ್ಷೇಯಯುಗ."]}], "ಆರ್ಷೇಯಯುಗ": [{"type": "noun", "defs": ["(geol.) the era covering all the time before the Cambrian period, designating the highly crystalline, igneous and metamorphic rocks formed during that time; pre-Cambrian era."]}], "ಆರ್ಷೇಯಾರ್ಥ": [{"type": "noun", "defs": ["the meaning, intention or signification of the scriptures as originally meant by the ancient Indian sages."]}], "ಆರ್ಸಿ": [{"type": "noun", "defs": ["the act or practice of deceiving; deception; cheating."]}], "ಆರ್ಹಂತ್ಯ": [{"type": "adjective", "defs": ["relating to arhanta, any of the twenty four Jaina spiritual teachers."]}, {"type": "noun", "defs": ["the status of the highest Jaina spiritual teacher.", "one of the fifty three spiritual ceremonies observed during the period of Arhanta's development in his mother's womb.", "worthiness for deserving something; legal or moral eligibility."]}], "ಆರ್ಹಂತ್ಯಕ್ರಿಯೆ": [{"type": "noun", "defs": ["the position or status of Arhanta, any of the twenty four spiritual teachers."]}], "ಆರ್ಹಂತ್ಯಧರ್ಮ": [{"type": "noun", "defs": ["Jainism, a Hindu religion resembling Buddhism, founded in the 6th cent. B.C., which emphasises asceticism and reverence for all living beings."]}], "ಆರ್ಹಂತ್ಯಲಕ್ಷ್ಮಿ": [{"type": "noun", "defs": ["(Jain.) the personified goddess of final beatitude."]}], "ಆರ್ಹತ": [{"type": "adjective", "defs": ["of or relating to Jainism."]}], "ಆರ್ಹತಮತ": [{"type": "noun", "defs": ["= ಆರ್ಹಂತ್ಯಧರ್ಮ."]}], "ಆಲ್": [{"type": "verb", "defs": ["to shout aloud; to scream.", "ಆಲಕರೆ ālakare to call a person by shouting (his name or making a screaming sound); ಆಲಿಕೊಳ್ ālikoḷ to shout aloud; to scream."]}], "ಆಲ್ ಅವಲಾದ್": [{"type": "noun", "defs": ["all those claiming descent from a common ancestor; lineage; family."]}], "ಆಲ": [{"type": "noun", "defs": ["the tree Ficus bengalensis ( = F. indica) of Moraceae family, with rooting branches; banyan tree.", "ಆಲದ ಪಣ್ ālada paṇ the fruit of the banyan tree (Ficus bengalensis); ಆಲದ ಬಿೞಲು ālada biłalu the shoot that grows from the branches of banyan tree (Ficus bengalensis) and which take root and form a new trunk; ಆಲದ ಮರ ālada mara = ಆಲ1.ಅಪ್ಪ ಹಾಕಿದ ಆಲಮರ ಅಂತ ನೇಣು ಹಾಕಿಕೊ appa hākida ālada mara see under ಅಪ್ಪ1."]}, {"type": "noun", "defs": ["a thing or place that gives support, help, etc.", "a person who helps, supports another."]}, {"type": "adjective", "defs": ["having more breadth or width; broad; wide."]}, {"type": "noun", "defs": ["a liquid discharged by poisonous animals.", "a silvery-white, brittle, very poisonous chemical element, compounds of which are used in making insecticides, glass, medicines, semiconductors, etc; arsenic.", "the red lotus flower .", "the red lotus plant.", "the tail of a scorpion that contains poison.", "the act or practice of deceiving; deception; a cheating."]}], "ಆಲಂಕಾರಿಕ": [{"type": "adjective", "defs": ["decorated; ornamented; adorned; ornate.", "representing one concept in terms of another that may be thought of as analogous with it; metaphoric; not literal; figurative.", "done, said, etc. for the sake of formality, not really whole-heartedly.", "dealing with the art of rhetoric or of artificial eloquence."]}, {"type": "noun", "defs": ["a man skilled in rhetorics and poetics."]}], "ಆಲಂಗಿರಿ": [{"type": "noun", "defs": ["an archaic coin of money currency."]}], "ಆಲಂಗಿಸು": [{"type": "verb", "defs": ["(correctly ಆಲಿಂಗಿಸು)to take another person in to one's arms and press to the bosom, as from affection."]}], "ಆಲಂಬ": [{"type": "noun", "defs": ["= ಆಲಂಬನ - 1."]}], "ಆಲಂಬಕ": [{"type": "noun", "defs": ["that to which anything is fixed as to keep the latter hanging.", "(bot.) a chain of cells to which a plant-embryo is fixed; suspensor."]}], "ಆಲಂಬನ": [{"type": "noun", "defs": ["that which supports; a prop; a stay; a support.", "support received from another; a help.", "the act of hanging or the state of being suspended."]}], "ಆಲಂಬನಗೆಯ್": [{"type": "verb", "defs": ["to attach to something above with no support from below as to suspend freely or recliningly.", "to rely for support or aid; to depend."]}], "ಆಲಂಬನಪ್ರತ್ಯಯ": [{"type": "noun", "defs": ["(Buddh.) that on which knowledge primarily depends."]}], "ಆಲಂಬನವಿಭಾವ": [{"type": "noun", "defs": ["that which gives rise to a sentiment (like presence of a beautiful heroine causing lovable sentiments in the hero) (cf. ಉದ್ದೀಪನ ವಿಭಾವ)."]}], "ಆಲಂಬಮಾನ": [{"type": "adjective", "defs": ["being in the suspended state; hanging."]}], "ಆಲಂಬಿತ": [{"type": "adjective", "defs": ["suspended; hung.", "supported (by); depended (on)."]}], "ಆಲಂಬಿತಕೂರ್ಚ": [{"type": "noun", "defs": ["a man with long beard (that is hanging)."]}], "ಆಲಂಬಿಸು": [{"type": "verb", "defs": ["to be hung; to be suspended.", "to hang; to suspend.", "to depend; to rely on."]}], "ಆಲಂಭ": [{"type": "noun", "defs": ["the act of taking hold of; an instance of seizing; seizure.", "the act of killing (esp. an animal at a sacrifice).", "the act of completely eliminating; a removal without leaving any trace behind."]}], "ಆಲಂಭನ": [{"type": "noun", "defs": ["= ಆಲಂಭ."]}], "ಆಲಗ್ನ": [{"type": "adjective", "defs": ["joined; bound; entangled; adhered; stuck."]}], "ಆಲಜಾಲ": [{"type": "noun", "defs": ["a bundle of lies; a false network; a spurious net."]}], "ಆಲಡೆ": [{"type": "noun", "defs": ["a temple devoted to Brahma; (in the coastal districts of Karnāṭaka)."]}], "ಆಲತಿ": [{"type": "noun", "defs": ["a waving of lights before a person or an idol of a deity.", "the lights used for the purpose or camphor burned so."]}], "ಆಲಪರಿ": [{"type": "verb", "defs": ["to wander (with a purpose).", "to beg humbly; to supplicate.", "to wail; to lament audibly."]}], "ಆಲಪಿಸು": [{"type": "verb", "defs": ["to speak; to converse.", "(mus.) to render an introductory prelude to a musical mode (rāga)."]}], "ಆಲಮರ್": [{"type": "noun", "defs": ["the tree Memecylon umbellatum (=M. edule) of Melastomataceae family; iron wood tree."]}], "ಆಲಮರ": [{"type": "noun", "defs": ["the tree Ficus bengalensis ( = F. indica) of Moraceae family, with rooting branches; banyan tree."]}], "ಆಲಮರು": [{"type": "noun", "defs": ["= ಆಲಮರ್."]}], "ಆಲಯ": [{"type": "noun", "defs": ["a building where one generally lives; a house; an abode; a dwelling."]}], "ಆಲಯಿಸು": [{"type": "verb", "defs": ["to listen attentively."]}], "ಆಲಯೆ": [{"type": "noun", "defs": ["(in comp.) she who has a house in (so and so place or thing)."]}], "ಆಲಯ್ಸು": [{"type": "verb", "defs": ["= ಆಲಯಿಸು."]}], "ಆಲವಂಟಿಗೆ": [{"type": "noun", "defs": ["= ಆಲವಟ್ಟ."]}], "ಆಲವಟ": [{"type": "noun", "defs": ["= ಆಲವಟ್ಟ."]}], "ಆಲವಟ್ಟ": [{"type": "noun", "defs": ["a fan made of scented grass, palm leaves or cloth."]}], "ಆಲವಟ್ಟಲು": [{"type": "noun", "defs": ["= ಆಲವಟ್ಟ; 2) a screen or shade, usually of cloth stretched over a folding radial frame, carried for protection against the rain or sun; an umbrella."]}], "ಆಲವಟ್ಟಿಗ": [{"type": "noun", "defs": ["he whose profession is directing a smooth current of air toward or on with a fan."]}], "ಆಲವಟ್ಟಿಗೆ": [{"type": "noun", "defs": ["= ಆಲವಟ್ಟ."]}], "ಆಲವಣ್": [{"type": "noun", "defs": ["the fruit of the banyan tree (Ficus bengalensis)."]}], "ಆಲವಣ್ಣದುಟಿ": [{"type": "noun", "defs": ["lip that is red like the banyan fruit."]}], "ಆಲವಣ್ದುಟಿ": [{"type": "noun", "defs": ["= ಆಲವಣ್ಣದುಟಿ."]}], "ಆಲವರಿ": [{"type": "verb", "defs": ["to wander (without a purpose).", "to beg humbly; to supplicate.", "to wail; to lament audibly."]}], "ಆಲವರು": [{"type": "verb", "defs": ["= ಆಲವರಿ."]}], "ಆಲವಾಲ": [{"type": "noun", "defs": ["a basin or trench for water round the root of a tree."]}], "ಆಲವಾಲಂಗೆಯ್": [{"type": "verb", "defs": ["= ಆಲವಾಲಂಗಟ್ಟು."]}], "ಆಲವಾಲಗಟ್ಟು": [{"type": "verb", "defs": ["to make a basin or a trench for holding water round the root of a tree."]}], "ಆಲವಾಲಜಲ": [{"type": "noun", "defs": ["water poured into an ಆಲವಾಲ."]}], "ಆಲಸ": [{"type": "adjective", "defs": ["sluggish - a) lacking energy, alertness or vigour; indisposed to exertion; slothful; b) not active; slow or slow-moving; dull; c) not functioning with normal vigour."]}, {"type": "noun", "defs": ["a man who is not eager or willing to work or exert himself; an indolent; a slothful, lazy man.", "the quality of a person having aversion to work or exertion; disinclination to work; laziness; sluggishness."]}], "ಆಲಸಿ": [{"type": "noun", "defs": ["= ಆಲಸ2 - 2."]}], "ಆಲಸಿಕೆ": [{"type": "noun", "defs": ["= ಆಲಸ2 - 2.", "2) weariness caused by mental or bodily labour; fatigue."]}], "ಆಲಸ್ಯ": [{"type": "noun", "defs": ["= ಆಲಸ2 - 3.", "want of health; sickness.", "a lazy, indolent man.", "weariness caused by mental or bodily labour; fatigue.", "the condition or quality of being tiresome, wearisome, boring; tedium; boredom.", "(dance) expression of the lethargic feeling, as one of the thirty three minor sentiments.", "ಆಲಸ್ಯಂ ಅಮೃತಂ ವಿಷಂ ālasyam a mřtam viṣam (sent.) idleness is the root of all evils; ಆಲಸ್ಯದವನಿಗೆ ಎರಡು ಕೆಲಸ, ಲೋಭಿಗೆ ಮೂರು ಖರ್ಚು ālasyadavanige eraḍu kelasa, lōbhige mūru kharcu idle folks have the most labour."]}], "ಆಲಸ್ಯಗಾಣ್": [{"type": "verb", "defs": ["to look down - a) to regard as an inferior; b) to regard with contempt; to despise."]}], "ಆಲಸ್ಯಗಾರ": [{"type": "noun", "defs": ["a lazy, slothful man.", "a man in bad health or affected with disease; a sick man."]}], "ಆಲಾ ಅದನಾ": [{"type": "noun", "defs": ["the sense of superiority and inferiority (used often to contrast each other)."]}], "ಆಲಾಜೀಲಿ": [{"type": "noun", "defs": ["= ಆಲಾಜೋಲಿ."]}], "ಆಲಾಜೋಲಿ": [{"type": "noun", "defs": ["the quality or tendency to delay; dilatoriness.", "a feeling of wild excitement, frenziness caused by intoxicating drinks; intoxication.", "the period of time for which something is delayed."]}], "ಆಲಾಟ": [{"type": "noun", "defs": ["a shouting; a crying aloud."]}], "ಆಲಾನ": [{"type": "noun", "defs": ["a post for tying an elephant to."]}], "ಆಲಾನಸ್ತಂಭ": [{"type": "noun", "defs": ["= ಆಲಾನ."]}], "ಆಲಾಪ": [{"type": "noun", "defs": ["= ಆಲಾಪನೆ -1 & 2.", "the act of lamenting; outward expression of grief; a weeping or wailing; lamentation."]}], "ಆಲಾಪನೆ": [{"type": "noun", "defs": ["the act or an instance of talking together esp. familiar talk; verbal exchange of feelings, ideas, opinions, etc.; conversation.", "an introductory prelude for a rāga, musical mode."]}], "ಆಲಾಪಿ": [{"type": "noun", "defs": ["one who holds a conversation; a converser."]}, {"type": "noun", "defs": ["a musical mode, derived from the main mode Sālaga, in Karnāṭaka system."]}], "ಆಲಾಪಿಸು": [{"type": "verb", "defs": ["to hold a conversation; to talk; to converse.", "to elaborate a musical mode (usu. without any using a composition set to any rhythm bound by time) as a prelude to a song."]}], "ಆಲಾಬು": [{"type": "noun", "defs": ["the creeper Lagenaria vulgaris of Cucurbitaceae family.", "its gourd like fruit; bottle gourd; calabash."]}], "ಆಲಾವರ್ತ": [{"type": "noun", "defs": ["a fan made of scented grass, palm leaves or cloth."]}], "ಆಲಾಷ": [{"type": "noun", "defs": ["a delineation of a rāga (musical mode) using the notes in different combinations in ascending and descending orders and in flowery style."]}], "ಆಲಾಸ್ಯ": [{"type": "noun", "defs": ["any of large, flesh-eating, lizardlike crocodilian reptiles of Crocodylinae sub-family living in or around tropical streams and having thick, horny skin composed of scales and plates, a long tail, and a long, narrow, triangular head with massive jaws; a crocodile."]}], "ಆಲಿ": [{"type": "noun", "defs": ["= ಆಲಿಕಲ್ಲು."]}, {"type": "noun", "defs": ["the contractile circular opening, apparently black, in the centre of the iris of the eye; pupil.", "the eye itself.", "a look; sight; gaze.", "either of the two movable folds of flesh that cover and uncover the front of the eyeball; the eye-lid.", "(dial.) an eye disease marked by irritation and redness of the eye."]}, {"type": "noun", "defs": ["the act or process of weaving.", "the structure of the woven material."]}, {"type": "noun", "defs": ["a female friend.", "a desire; a wish.", "any of a series of such horizontal lines in parallel, as of seats in a theatre or airplane, etc.; a row.", "a number of persons or things gathered closely together and forming a recognisable unit; a group.", "a raised mound by the side of a lake.", "any of broad-bodied, four-winged, hairy hymenopteran insects belonging to a large super family Apoidea, which gather pollen and nectar, have biting as well as sucking mouthparts; a bee.", "any of arachnids of Scorpiones order found in warm regions, with a front pair of nipping claws and a long, slender, jointed tail ending in a curved, poisonous sting; a scorpion."]}], "ಆಲಿಂಗ": [{"type": "noun", "defs": ["= ಆಲಿಂಗನ."]}], "ಆಲಿಂಗನ": [{"type": "noun", "defs": ["a taking another person into arms and pressing to the bosom with affection; embracing.", "an embrace."]}], "ಆಲಿಂಗನಂಗೆಯ್": [{"type": "verb", "defs": ["= ಆಲಿಂಗಿಸು."]}], "ಆಲಿಂಗನಾಂಗ": [{"type": "noun", "defs": ["(zool.) a clasping organ.", "(bot.) the tendril of a plant."]}], "ಆಲಿಂಗಿತ": [{"type": "adjective", "defs": ["embraced; cuddled."]}], "ಆಲಿಂಗಿಸು": [{"type": "verb", "defs": ["to take another person in to one's arms and press to the bosom, as from affection; to embrace; to cuddle."]}], "ಆಲಿಂಗ್ಯ": [{"type": "adjective", "defs": ["fit to be embraced."]}, {"type": "noun", "defs": ["a mode of playing percussion instruments."]}], "ಆಲಿಂದ": [{"type": "noun", "defs": ["an open porch or portico, usually roofed, along the outside of a building; a verandah.", "an open area of the shape of a square or a quadrangle, in front of a house.", "a terrace before a house-door."]}], "ಆಲಿಕಲ್": [{"type": "noun", "defs": ["= ಆಲಿಕಲ್ಲು."]}], "ಆಲಿಕಲ್ಲು": [{"type": "noun", "defs": ["rounded pieces of ice that are larger than 5 mm and sometimes fall during thunderstorms; frozen raindrop; hailstone."]}], "ಆಲಿಕೆ": [{"type": "noun", "defs": ["a vessel, usu. a cone ending in a tube, for pouring fluids; a funnel."]}, {"type": "noun", "defs": ["(correctly, ಆಲಿಸುವಿಕೆ) the act or an instance of hearing (as in comp. ಕದ್ದಾಲಿಕೆ)."]}], "ಆಲಿಕೋಡು": [{"type": "verb", "defs": ["= ಆಲಿಗೋಡು."]}], "ಆಲಿಗಣ್": [{"type": "noun", "defs": ["= ಆಲಿಗಣ್ಣು."]}], "ಆಲಿಗಣ್ಣು": [{"type": "noun", "defs": ["the organ of sight; the eye."]}], "ಆಲಿಗಲ್": [{"type": "noun", "defs": ["= ಆಲಿಕಲ್ಲು."]}], "ಆಲಿಗುಡು": [{"type": "verb", "defs": ["to cause to become cool; to freeze.", "to become cool."]}], "ಆಲಿಗೊಳ್": [{"type": "verb", "defs": ["to see; to behold."]}], "ಆಲಿಗೋಡು": [{"type": "verb", "defs": ["to be or become frozen."]}], "ಆಲಿಡು": [{"type": "verb", "defs": ["to shout aloud; to scream; to utter a shrill sound."]}], "ಆಲಿದೆಱೆ": [{"type": "verb", "defs": ["to open the eye-lid."]}], "ಆಲಿನೀರ್": [{"type": "noun", "defs": ["= ಆಲಿನೀರು1."]}, {"type": "noun", "defs": ["= ಆಲಿನೀರು2."]}], "ಆಲಿನೀರು": [{"type": "noun", "defs": ["ice-cold water."]}, {"type": "noun", "defs": ["the liquid secreted in the eyes; tear."]}], "ಆಲಿನೀರ್ವನಿ": [{"type": "noun", "defs": ["a drop of ice-cold water."]}, {"type": "noun", "defs": ["a drop oftear."]}], "ಆಲಿಪರಿ": [{"type": "verb", "defs": ["to wander (with a purpose).", "to beg humbly; to supplicate.", "to wail; to lament audibly."]}], "ಆಲಿಬಚ್ಚು": [{"type": "verb", "defs": ["to become weak; to lose vigour or vitality; to fail in health; to languish."]}], "ಆಲಿಮೞೆ": [{"type": "noun", "defs": ["= ಆಲಿವೞೆ."]}], "ಆಲಿಯಕ್ದಾರು": [{"type": "noun", "defs": ["an official of relatively higher rank."]}], "ಆಲಿವಟ್ಟಲು": [{"type": "noun", "defs": ["a fan made of scented grass, palm leaves or cloth.", "a screen or shade, usually of cloth stretched over a folding radial frame, carried for protection against the rain or sun; an umbrella."]}], "ಆಲಿವರಲ್": [{"type": "noun", "defs": ["= ಆಲಿಕಲ್ಲು."]}], "ಆಲಿವರಲು": [{"type": "noun", "defs": ["= ಆಲಿಕಲ್ಲು."]}], "ಆಲಿವೞೆ": [{"type": "noun", "defs": ["the falling of rain along with the falling of hailstones."]}], "ಆಲಿವೆಳಗ": [{"type": "noun", "defs": ["he whose light is cool; the moon."]}], "ಆಲಿಷಾಂ": [{"type": "adjective", "defs": ["of a very high class; superior."]}], "ಆಲಿಸು": [{"type": "verb", "defs": ["to hear - a) to perceive or sense (sounds), esp. through stimulation of auditory nerves in the ear by sound waves; b) to listen to and consider, esp. i) to take notice of; to pay attention to; ii) to listen to officially; to give a formal hearing to; iii) to conduct an examination or hearing of (a law case, etc.).", "to think seriously and deeply; to cogitate."]}, {"type": "verb", "defs": ["to cause to shout or cry aloud."]}, {"type": "verb", "defs": ["to see; to look intently; to observe."]}], "ಆಲೀಢ": [{"type": "adjective", "defs": ["tasted; bitten; eaten.", "covered; spread all over; diffused through the whole of."]}, {"type": "noun", "defs": ["a particular stance in fighting or shooting, the right knee being advanced and the left leg retracted.", "(dance) one of the thirty two ಅಂಗಹಾರಗಳು (artistic combination of ಕರಣಗಳು) involving both the feet."]}], "ಆಲೀನ": [{"type": "adjective", "defs": ["resolved (as a soluble in water) 2) lied on the ground; reclined."]}], "ಆಲು": [{"type": "verb", "defs": ["to shout aloud."]}, {"type": "noun", "defs": ["a small vessel; a small water pot."]}, {"type": "noun", "defs": ["the plant Solanum tuberosum of Solanaceae family; potato plant.", "its starchy, brown-skinned tuber used as a vegetable; potato."]}], "ಆಲುಕ": [{"type": "noun", "defs": ["a water jug.", "the tree, black ebony, with hard, heavy dark, durable wood, native to Asia.", "3.Ādi Śeṣa, the mythological king of serpents."]}], "ಆಲುಗಡ್ಡೆ": [{"type": "noun", "defs": ["the brown-skinned tuber of the plant, Solanum tuberosum of Solanaceae family; potato.", "(loosely) the plant itself; potato plant."]}], "ಆಲುತಿ": [{"type": "noun", "defs": ["the Operculina turpethum ( = Ipomoea turpethum) of Convolvulaceae family; Indian jalap."]}], "ಆಲುಹ": [{"type": "noun", "defs": ["the act or instance of crying or shouting aloud."]}], "ಆಲೂಗಡ್ಡೆ": [{"type": "noun", "defs": ["= ಆಲುಗಡ್ಡೆ."]}], "ಆಲೂಗೆಡ್ಡೆ": [{"type": "noun", "defs": ["= ಆಲುಗಡ್ಡೆ."]}], "ಆಲೆ": [{"type": "noun", "defs": ["the sugar-cane mill; the sugar-cane crushing machine.", "a rotary for extracting oil from oil seeds.", "ಆಲೆ ಇಲ್ಲದ ಊರಿಗೆ ಇಪ್ಪೆಹೂವೇ ಸಕ್ಕರೆ āle illada ūrige ippehūvē sakkare in the absence of good, bad looks better."]}, {"type": "noun", "defs": ["(correctly ಹಾಲೆ) the lobe of the ear."]}, {"type": "noun", "defs": ["the plant Chrysophyllum cainito of Sapotaceae family; West Indian star apple."]}], "ಆಲೆದೆಱೆ": [{"type": "noun", "defs": ["a tax levied on sugar-cane mills."]}], "ಆಲೆಬಕೋರಾ": [{"type": "noun", "defs": ["the plant, Prunus domestica of Rosaceae family.", "its plum."]}], "ಆಲೆಮನೆ": [{"type": "noun", "defs": ["a house where sugar cane is crushed (chiefly for making jaggery); a jaggery factory."]}], "ಆಲೆಮಾರ": [{"type": "noun", "defs": ["the tree Memecylon unbellatum ( = M. edule) of Melastomataceae family)."]}], "ಆಲೆಯಾಡು": [{"type": "verb", "defs": ["to run the sugar-cane crushing machine, to extract the juice."]}], "ಆಲೆಹಗ್ಗ": [{"type": "noun", "defs": ["a long rope tied to a post or a fixed point at one end, the other end being tied to the cattle allowing them to graze within a limited area."]}], "ಆಲೇಖ": [{"type": "noun", "defs": ["a symbolic diagram; a curve representing the variation of a quantity; a graph.", "a pen or the like device used for recording such a diagram."]}], "ಆಲೇಖಿಸು": [{"type": "verb", "defs": ["to draw a graph; to record a graph or diagram using a suitable machine."]}], "ಆಲೇಖ್ಯ": [{"type": "adjective", "defs": ["to be written or fit to be written, drawn (as a diagram, graph, etc.)."]}, {"type": "noun", "defs": ["a written, painted symbol, picture, graph or a diagram.", "a sketch, diagram or drawing of a painting and the like drawn by an artist; a form given as the plan or scheme to an artist.", "the art of writing pictures; painting."]}], "ಆಲೇಖ್ಯಗತೆ": [{"type": "noun", "defs": ["a woman who is depicted or portrayed by an artist."]}], "ಆಲೇಖ್ಯಯಂತ್ರ": [{"type": "noun", "defs": ["a machine that records a graph representing the variation of a quantity.", "a small thin metal sheet on which mystical diagrams are carved, worn on the body or kept in the house, to protect against injury or evil or to enchant a person."]}], "ಆಲೇಪ": [{"type": "noun", "defs": ["= ಆಲೇಪನ."]}], "ಆಲೇಪಂಗೆಯ್": [{"type": "verb", "defs": ["to anoint - a) to rub oil or ointment on; b) to put oil on, in a ceremony."]}], "ಆಲೇಪನ": [{"type": "noun", "defs": ["the act of smearing; an anointing.", "that with which anything is smeared; ointment."]}], "ಆಲೇಪನಂಗೆಯ್": [{"type": "verb", "defs": ["= ಆಲೇಪಂಗೆಯ್."]}], "ಆಲೇಪಿಸು": [{"type": "verb", "defs": ["= ಆಲೇಪಂಗೆಯ್."]}], "ಆಲೇಮನೆ": [{"type": "noun", "defs": ["= ಆಲೆಮನೆ."]}], "ಆಲೈಸು": [{"type": "verb", "defs": ["= ಆಲಿಸು1."]}], "ಆಲೋಕ": [{"type": "noun", "defs": ["the act of seeing; beholding; glancing.", "light; lustre.", "all that has been perceived or grasped by the mind; learning; knowledge.", "a praising; commendation or glorification; extolment."]}], "ಆಲೋಕನ": [{"type": "noun", "defs": ["the act of seeing; beholding; a looking at.", "a critical analysing, evaluation; reviewing."]}], "ಆಲೋಕನಂಗೆಯ್": [{"type": "verb", "defs": ["= ಆಲೋಕಿಸು."]}], "ಆಲೋಕನಗೆಯ್": [{"type": "verb", "defs": ["= ಆಲೋಕಿಸು."]}], "ಆಲೋಕನವೆಸಗು": [{"type": "verb", "defs": ["= ಆಲೋಕಿಸು."]}], "ಆಲೋಕಿತ": [{"type": "adjective", "defs": ["that is seen; looked at."]}, {"type": "noun", "defs": ["(dance.) one of the eight kinds of movements of the eye."]}], "ಆಲೋಕಿಸು": [{"type": "verb", "defs": ["to look at; to see.", "to critically analyse; to review."]}], "ಆಲೋಚ": [{"type": "noun", "defs": ["= ಆಲೋಚನೆ - 2."]}], "ಆಲೋಚಕ": [{"type": "adjective", "defs": ["tending to or being capable of, thinking.", "that can be mentally conceived; conceivable."]}, {"type": "noun", "defs": ["one who thinks deeply over; a thinker."]}], "ಆಲೋಚನ": [{"type": "noun", "defs": ["= ಆಲೋಚನೆ - 2."]}], "ಆಲೋಚನೆ": [{"type": "noun", "defs": ["the act of seeing; a looking at; a viewing at.", "the act or process of thinking; a pondering over; reflection; cogitation.", "the result of thinking; thought; idea; opinion.", "the functioning of the sense organs, and the manner."]}], "ಆಲೋಚಿಸು": [{"type": "verb", "defs": ["to weigh mentally; to think deeply about; to consider carefully; to ponder; to cogitate.", "(Jain.) to admit a fault or crime before a teacher or priest."]}], "ಆಲೋಚ್ಯ": [{"type": "adjective", "defs": ["that is to be, needs to be or fit to be thought over; thinkable."]}], "ಆಲೋಡನ": [{"type": "noun", "defs": ["= ಆಲೋಡನೆ."]}], "ಆಲೋಡನಂಗೆಯ್": [{"type": "verb", "defs": ["to stir, beat or shake (milk or cream) in a churn; to churn.", "to turn (something) over in the mind; to meditate (on); to cogitate deeply and repeatedly on the same subject; to ruminate."]}], "ಆಲೋಡನೆ": [{"type": "noun", "defs": ["the act or process of mixing different things together.", "the act or processing of stirring, beating or shaking; churning.", "deep meditation, cogitation or pondering over."]}], "ಆಲೋಡಿತ": [{"type": "adjective", "defs": ["shaken, stirred or agitated vehemently.", "mixed; caused to mingle."]}], "ಆಲೋಡಿಸು": [{"type": "verb", "defs": ["to move, to shake, to agitate, etc., to stir.", "to mix; to cause to mingle.", "to think deeply; to cogitate."]}], "ಆಲೋಲ": [{"type": "adjective", "defs": ["moving to and fro; trembling; not fixed; swinging back and forth.", "rolling; rotating; revolving.", "agitated; stirred; perturbed."]}, {"type": "noun", "defs": ["a man interested or engrossed in.", "a favourable mental bias; interest."]}], "ಆಲೋಲಿಸು": [{"type": "verb", "defs": ["to stir, beat or shake (milk or cream) in a churn; to churn."]}], "ಆಲೋಲೇಕ್ಷಣ": [{"type": "noun", "defs": ["an eye the sight of which keeps moving from one object to another; a rolling eye.", "a man moving his eyes frequently, (as in dancing)."]}], "ಆಲೋಲೇಕ್ಷಣೆ": [{"type": "noun", "defs": ["a woman with frequent movement of eyes (as in dancing)."]}], "ಆಲ್ತಿ": [{"type": "noun", "defs": ["the plant Merremia emarginata ( = Ipomea reniformis) of Convalvulaceae family."]}], "ಆಲ್ಪರಿ": [{"type": "verb", "defs": ["to wander (without a purpose).", "to beg humbly; to supplicate.", "to wail; to lament audibly."]}], "ಆಲ್ಪರೆ": [{"type": "verb", "defs": ["= ಆಲ್ಪರಿ."]}], "ಆಲ್ವರಿ": [{"type": "verb", "defs": ["= ಆಲ್ಪರಿ."]}, {"type": "noun", "defs": ["the plant Cassia sophera of Caesalpiniaceae family."]}], "ಆವ": [{"type": "pronoun", "defs": ["what; which; which person; who.", "(as a relative pronoun) that which."]}], "ಆವಂತಿ": [{"type": "adjective", "defs": ["of or related to Āvanti country or its literary style."]}, {"type": "noun", "defs": ["(rhet.) in Samskřta literature, a style, one of the six styles originated in Āvanti country (a district in present Ujjain.)"]}], "ಆವಕ್": [{"type": "noun", "defs": ["a register in which details of all incoming mail are registered."]}], "ಆವಕ": [{"type": "noun", "defs": ["= ಆವಕ್."]}], "ಆವಗ": [{"type": "adverb", "defs": ["= ಆವಗಂ."]}], "ಆವಗಂ": [{"type": "adverb", "defs": ["always - a) at all times; on all occasions; b) all the time; continuously; forever.", "excessively; in great quantity."]}], "ಆವಗಲು": [{"type": "adverb", "defs": ["= ಆವಗಂ."]}], "ಆವಗೆ": [{"type": "noun", "defs": ["a large oven for drying, burning or baking bricks, pottery, etc.; a kiln.", "a tax levied on kilns."]}], "ಆವಗೆಗಲ": [{"type": "noun", "defs": ["a pot burned or baked in a kiln."]}], "ಆವಗೆಗಿಚ್ಚು": [{"type": "noun", "defs": ["the fire in the kiln.", "(fig.) intense wrath."]}], "ಆವಗೆಯುರಿ": [{"type": "noun", "defs": ["= ಆವಗೆಗಿಚ್ಚು."]}], "ಆವಜ": [{"type": "noun", "defs": ["a kind of percussion instrument."]}], "ಆವಟ": [{"type": "noun", "defs": ["the extent, dimensions, capacity, etc. of anything, esp. as determined by a standard; a measure.", "the act or process of determining, extent, dimensions, quantity, capacity etc."]}, {"type": "noun", "defs": ["an appearance, show or act to deceive; pretentiousness."]}], "ಆವಟಿಗ": [{"type": "noun", "defs": ["one whose profession is measuring the extent, dimension, capacity, etc.; a measurer."]}], "ಆವಡಿ": [{"type": "noun", "defs": ["difficulty; suffering; distress."]}], "ಆವಡಿಗೊಳ್": [{"type": "verb", "defs": ["to undergo distress; to suffer."]}], "ಆವಡಿಗೊಳಿಸು": [{"type": "verb", "defs": ["to cause to undergo distress."]}], "ಆವಣ": [{"type": "noun", "defs": ["a place where certain goods or services are offered for sale; esp., a small store; a shop."]}], "ಆವಣಿ": [{"type": "noun", "defs": ["the fifth month in Tamil Calendar corresponding to the later part of fourth and the early part of fifth months of the lunar calendar."]}], "ಆವತ್ತು": [{"type": "adverb", "defs": ["(correctly, ಆ ಹೊತ್ತು) 1. on that day.", "at that point of time; at that juncture."]}, {"type": "noun", "defs": ["(correctly, ಆ ಹೊತ್ತು) 1.that day.", "that point of time."]}], "ಆವನ್": [{"type": "pronoun", "defs": ["(interrogatively) which man.", "(relatively) that man who (has already been or going to be referred to, meant etc.)."]}], "ಆವನು": [{"type": "pronoun", "defs": ["= ಆವನ್."]}], "ಆವಪನ": [{"type": "noun", "defs": ["the act of scattering or putting seed in the ground; sowing.", "a metal or earthen vessel."]}], "ಆವಯವಿಕ": [{"type": "adjective", "defs": ["relating to organs or different parts of a body or a whole."]}], "ಆವರ್": [{"type": "pronoun", "defs": ["pl. of ಆವನ್ and ಆವಳ್."]}], "ಆವರ": [{"type": "adverb", "defs": ["= ಆವರಂ."]}, {"type": "noun", "defs": ["= ಆವರಿಕೆ."]}], "ಆವರಂ": [{"type": "adverb", "defs": ["till that time; upto that point of time."]}], "ಆವರಕ": [{"type": "noun", "defs": ["anything that covers or conceals, as a veil, lid; a cover."]}], "ಆವರಣ": [{"type": "noun", "defs": ["the act of covering or concealing.", "an enclosed space with a building or group of buildings within it; a compound.", "a small wall, hedge, wire structure, etc. that encloses such a space.", "any piece of cloth used as a concealing or separating screen or curtain; a veil.", "(phil.) the condition or quality of being ignorant; lack of knowledge; ignorance.", "a flat, usually broad, piece of metal, wood, etc., carried in the hand or worn on the forearm to ward off blows or missiles; a shield.", "(in a combat) the act or the knack of, warding off blows or missiles.", "a metal coat to protect oneself from weapon-blows.", "that which charms or bewitches, as an act of magic.", "a sliding bar for locking a door, gate, etc. ; a bolt.", "; any line or thing marking a limit; bound; border; boundary.", "an additional word, clause, etc. placed as an explanation or comment within two curved lines ( ), [ ] or { }.", "a set of two such curved lines."]}], "ಆವರಣಚಿಹ್ನೆ": [{"type": "noun", "defs": ["either or both of the curved lines, ( ) or the like, used to mark off parenthetical words, etc. or to enclose mathematical or logical symbols; parenthesis; bracket."]}], "ಆವರಣಪತ್ರ": [{"type": "noun", "defs": ["(bot.) a sheathing bract, usu. a conspicuous one enclosing a spadix; a spathe."]}], "ಆವರಣಪ್ರತಿಭೀತಿ": [{"type": "noun", "defs": ["an abnormal or morbid fear of being in an enclosed or confined place; claustrophobia."]}], "ಆವರಣಭಂಗ": [{"type": "noun", "defs": ["a removal of anything that encloses.", "(phil.) a removal of spiritual ignorance; enlightenment."]}], "ಆವರಣಶಕ್ತಿ": [{"type": "noun", "defs": ["the capacity of enclosing or hiding within."]}], "ಆವರಣಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["ecology - a) the branch of biology that deals with the relations between living organisms and their environment; b) the study of the relationship and adjustment of human groups to their geographical and social environments."]}], "ಆವರಣಿಸು": [{"type": "verb", "defs": ["to hide; to keep of from the sight; to conceal.", "to encircle with a small wall, hedge or wire structure."]}], "ಆವರಿ": [{"type": "noun", "defs": ["water in the form of gas or vapour; steam.", "heat; temperature."]}], "ಆವರಿಕೆ": [{"type": "noun", "defs": ["the shrub, Cassia articulata of Caesalpiniaceae family; senna; tanner's cassia."]}], "ಆವರಿಸು": [{"type": "verb", "defs": ["to diffuse through the whole of; to spread oneself; to pervade.", "to encircle; to enclose from all sides; to surround.", "to get; to obtain.", "to attack (from all sides).", "to be got, obtained.", "to consider; to verify; to examine."]}], "ಆವರು": [{"type": "pronoun", "defs": ["pl. of ಆವನ್ and ಆವಳ್."]}], "ಆವರೆ": [{"type": "noun", "defs": ["= ಆವರಿಕೆ."]}], "ಆವರೆಗೊಂಬು": [{"type": "noun", "defs": ["a twig of the shrub Cassia articulata."]}], "ಆವರ್ಜನ": [{"type": "noun", "defs": ["a state of reclining; a leaning upon; a slanting.", "an act or instance of giving.", "an act of causing to become favourably inclined; an appeasing; propitiation.", "anything earned by one's labour, rendering service, etc., earning; income."]}], "ಆವರ್ಜಾ": [{"type": "noun", "defs": ["a (government) record containing the details, such as the extent, land tax, ownership, etc. of a revenue land."]}], "ಆವರ್ಜಿ": [{"type": "noun", "defs": ["= ಆವರ್ಜಾ."]}], "ಆವರ್ಜಿಸು": [{"type": "verb", "defs": ["to draw towards or nearer.", "to coax with flattery and insincere talk; to wheedle; to cajole.", "to earn; to gain.", "to include within (oneself); to consist of."]}], "ಆವರ್ಣ": [{"type": "noun", "defs": ["= ಆವರಣ - 2, 3 & 4."]}], "ಆವರ್ತ": [{"type": "noun", "defs": ["a circular current in a river or sea, produced by opposing tides, winds or currents; a whirl pool; an eddy.", "similar circular current in the wind; a whirl.", "a cycle or a lock of curling hairs.", "the act of turning or revolving.", "a period of time in which events happen in a certain order, and which constantly repeats itself; a cycle.", "(mus.) a cycle with definite number of time units."]}], "ಆವರ್ತಕ": [{"type": "adjective", "defs": ["repeating by itself; recurring.", "revolving; rotating; rotary."]}, {"type": "noun", "defs": ["that which causes another to revolve, rotate or oscillate; an oscillator."]}], "ಆವರ್ತಕ ದಶಮಾಂಶ": [{"type": "noun", "defs": ["a decimal fraction in which after certain point one figure or group of figures is repeated to infinity; (e.g. ⅓ = 0.3333….333333)."]}], "ಆವರ್ತಕ ಕಾಲ": [{"type": "noun", "defs": ["the time required by a pendulam for an oscillation; period of oscillation."]}], "ಆವರ್ತಕ ಕೋಷ್ಟಕ": [{"type": "noun", "defs": ["a table of chemical elements in order of atomic number arranged in a horizontal series and vertical groups, showing how similar properties recur at regular intervals; a periodic table."]}], "ಆವರ್ತಜ್ವಾಲಕ": [{"type": "noun", "defs": ["a rotatory burner."]}], "ಆವರ್ತತೇಜ": [{"type": "noun", "defs": ["the aura or splendour that keeps appearing repeatedly."]}], "ಆವರ್ತದರ್ಶಕ": [{"type": "noun", "defs": ["an instrument for studying rotating machinery or other periodic phenomena by means of flashing a lamp which can be synchronised with the frequency of the periodic phenomena so that they appear to be stationary; stroboscope."]}], "ಆವರ್ತದಶಾಂಶ": [{"type": "noun", "defs": ["= ಆವರ್ತಕ ದಶಮಾಂಶ."]}], "ಆವರ್ತನ": [{"type": "noun", "defs": ["rotation - a) a rotating or being rotated; b) the spinning motion around the axis of a celestial body; c) regular and recurring succession of changes; frequency.", "water in rapid, violent, whirling motion caused by two meeting currents, by winds meeting tides, etc. and tending to form a circle into which floating objects are drawn; a whirlpool.", "anything like a whirlpool, as in violent motion.", "a turning oneself in the air and standing erect on ground, a particular stance in wrestling.", "the act or process of mixing metals to form an alloy.", "repeated mental or physical action for the purpose of learning or acquiring proficiency; practice."]}], "ಆವರ್ತನಸಿದ್ಧಿ": [{"type": "noun", "defs": ["the state or quality of being cyclic or curling, coiling.", "the fact of having whirlpools."]}], "ಆವರ್ತನಾಭಿ": [{"type": "noun", "defs": ["a woman with a pleasing, round and tapering-like navel."]}], "ಆವರ್ತನಿ": [{"type": "noun", "defs": ["an earthen pot for melting metals; a crucible.", "a large spoon for lifting and serving liquids; a ladle."]}], "ಆವರ್ತನೆ": [{"type": "noun", "defs": ["= ಆವರ್ತನ."]}], "ಆವರ್ತಪ್ರತಿಮಾರುತ": [{"type": "noun", "defs": ["the wind current moving in circular manner, from a high pressure area to a low pressure area."]}], "ಆವರ್ತಮಾನ": [{"type": "adjective", "defs": ["moving in circular manner; whirling.", "visiting or appearing repeatedly in regular frequencies."]}], "ಆವರ್ತಮಾರುತ": [{"type": "noun", "defs": ["a system of rotating winds over a vast area, spinning spirally inward towards a centre of low barometric pressure; a cyclone."]}], "ಆವರ್ತಯುಕ್ತ": [{"type": "adjective", "defs": ["having cyclic or curling movements.", "having whirlpool or whirlpools."]}], "ಆವರ್ತ ವೆಚ್ಚ": [{"type": "noun", "defs": ["an item of expenditure in a budget, which repeats itself."]}], "ಆವರ್ತಾಂಕ": [{"type": "noun", "defs": ["the number of vibrations, cycles or recurrences in a unit or given time; frequency."]}], "ಆವರ್ತಿ": [{"type": "noun", "defs": ["a rotating or being rotated; b) the spinning motion around the axis of a celestial body.", "number of times or the frequencies the same thing recurs; number of repeated occasions."]}], "ಆವರ್ತಿತ": [{"type": "adjective", "defs": ["moved in circular manner."]}, {"type": "noun", "defs": ["(dance.) a manner of keeping the steps from left to right and right to left."]}], "ಆವರ್ತಿನಿ": [{"type": "noun", "defs": ["(Jain.) a particular art or skill."]}], "ಆವರ್ತಿಸು": [{"type": "verb", "defs": ["to spread out oneself in all direction and widely; to diffuse oneself.", "to cause to come back, happen again.", "to rotate - a) to turn around or cause to turn around a centre point or axis; b) to go or cause to go in a regular and recurring succession of changes; to take or cause to take, turns.", "to re-examine; to review again."]}], "ಆವರ್ಹಿತ": [{"type": "adjective", "defs": ["removed or destroyed completely; rooted out."]}], "ಆವಲ್": [{"type": "noun", "defs": ["a water lily plant, Nelumbo nucifera.", "its red or pink flower used as a religious symbol in Hinduism and Buddhism; red lotus flower."]}, {"type": "noun", "defs": ["an official record of the boundaries of a town, village, etc."]}], "ಆವಲಲರ್": [{"type": "noun", "defs": ["the red or pink flower of the lotus plant, Nelumbo nucifera."]}], "ಆವಲಿ": [{"type": "noun", "defs": ["= ಆವಳಿ1."]}], "ಆವಲಿಕ": [{"type": "noun", "defs": ["(Jain.) a very minute unit of time."]}], "ಆವಲಿತ": [{"type": "adjective", "defs": ["slightly turned or rotated; deviated from the regular path."]}], "ಆವಲು": [{"type": "noun", "defs": ["= ಆವಲ್1."]}, {"type": "noun", "defs": ["a kind of fish that jumps up into the air to catch small birds and insects that fly closer to the water surface."]}], "ಆವಲ್ಗಂಪು": [{"type": "noun", "defs": ["the odour of the red lotus (Nelumbo nucifera) flower."]}], "ಆವಲ್ಗೊಳ": [{"type": "noun", "defs": ["a pond or a lake having abundant red lotus plants."]}], "ಆವಶ್ಯ": [{"type": "adjective", "defs": ["= ಆವಶ್ಯಕ1."]}, {"type": "noun", "defs": ["= ಆವಶ್ಯಕ2."]}], "ಆವಶ್ಯಕ": [{"type": "adjective", "defs": ["necessary - a) that cannot be dispensed with; essential; indispensable; b) resulting from necessity; inevitable; c) i) that must be done; mandatory; not voluntary; required; ii) not free to choose; compelled by circumstances; d) inherent in the situation; undeniable; unavoidable from the premises."]}, {"type": "noun", "defs": ["(Jain.) any of the unavoidable, mandatory acts or duties of a sage, daily."]}], "ಆವಶ್ಯಕತೆ": [{"type": "noun", "defs": ["anything that is inevitable, unavoidable, etc. as a result of natural law; that which is necessary in natural sequence; necessity.", "(used in pl.) a necessary thing; thing essential to life, some purpose, etc.; necessaries."]}], "ಆವಸಥ": [{"type": "noun", "defs": ["a normal place of dwelling; a house; an abode; a habitation."]}], "ಆವಸಥ್ಯ": [{"type": "noun", "defs": ["a sacred fire maintained in the house for giving oblation to the gods."]}], "ಆವಸಿತ": [{"type": "adjective", "defs": ["finished; completed; accomplished.", "decided; determined; settled."]}, {"type": "noun", "defs": ["thrashed ripe corn.", "corn stocked in a store."]}], "ಆವಹ": [{"type": "adjective", "defs": ["causing; being the reason for becoming; bringing forth or about.", "having; including; consisting of."]}], "ಆವಹನ": [{"type": "noun", "defs": ["= ಆವಾಹನೆ."]}], "ಆವಹನವಿಧಾನ": [{"type": "noun", "defs": ["the act or manner of receiving; reception."]}], "ಆವಹಿಸು": [{"type": "verb", "defs": ["to cause to be present or installed in (as a deity in an idol).", "to invite audibly; to call."]}], "ಆವಳ್": [{"type": "pronoun", "defs": ["= ಆವಳು."]}], "ಆವಳಿ": [{"type": "noun", "defs": ["a row or line (esp. a straight one) of persons, things of a particular kind; a single row of words or characters making up a unit of poetry.", "a family; a lineage.", "a collection, multitude of persons, things or animals; a crowd.", "(Jain.) a unit of a very minute duration of time.", "one of the kinds of musical notes.", "a sect among Śaivas, the devotees of Śiva."]}, {"type": "noun", "defs": ["the tree Emblic myrobalan ( = Emblica officinalis).", "its prune-like fruit."]}], "ಆವಳಿಕ": [{"type": "noun", "defs": ["= ಆವಲಿಕ."]}], "ಆವಳಿಕೆ": [{"type": "noun", "defs": ["(dial.) the act of opening the mouth wide, esp. involuntarily, and breathing in deeply, as a result of fatigue, drowsiness or boredom; yawning."]}], "ಆವಳು": [{"type": "pronoun", "defs": ["(interrogatively) which woman.", "(relatively) that woman who (has been already referred to, meant etc.)."]}], "ಆವಳಿಸು": [{"type": "verb", "defs": ["to open the mouth wide, esp. involuntarily, and breathe in deeply, as a result of fatigue, drowsiness or boredom; to yawn."]}], "ಆವಾಗ": [{"type": "pronoun", "defs": ["when - a) at what time? b) on what occasion or under what circumstances?; c) at what point? 2) at that time; then; on that occasion."]}, {"type": "conjunction", "defs": ["when - a) at what time or point; b) at the time that."]}], "ಆವಾಗಲೂ": [{"type": "adverb", "defs": ["= ಆವಾಗಳುಂ."]}], "ಆವಾಗಳು": [{"type": "adverb", "defs": ["= ಆವಾಗಳುಂ."]}], "ಆವಾಗಳುಂ": [{"type": "adverb", "defs": ["at all times; always; ever."]}], "ಆವಾಗಳೂ": [{"type": "adverb", "defs": ["= ಆವಾಗಳುಂ."]}], "ಆವಾಗ್ಗೆ": [{"type": "adverb", "defs": ["at that time; at that point of time.", "in that case; if that be so.", "while; during that time."]}], "ಆವಾಗ್ಯೆ": [{"type": "adverb", "defs": ["= ಆವಾಗ್ಗೆ."]}], "ಆವಾಪ": [{"type": "noun", "defs": ["the act of sowing seeds in the ground.", "a basin or trench round the root of a tree for water.", "an ornamental band or chain worn about the wrist; a bracelet."]}], "ಆವಾಪಕ": [{"type": "noun", "defs": ["= ಆವಾಲ."]}], "ಆವಾರ": [{"type": "noun", "defs": ["an enclosed place; an adjunct place around a building enclosed by a compound or fence."]}], "ಆವಾಲ": [{"type": "noun", "defs": ["a basin or trench round the root of a tree for water."]}], "ಆವಾಸ": [{"type": "noun", "defs": ["a normal place of dwelling; a house; an abode; a habitation."]}]}