{"ಮುರಜಬಂದಕ": [{"type": "noun", "defs": ["= ಮುರಜ - 2."]}], "ಮುರಜೆ": [{"type": "noun", "defs": ["= ಮುರಜ - 1."]}], "ಮುರಡಿ": [{"type": "noun", "defs": ["a kind of ornament for the hand."]}, {"type": "noun", "defs": ["a mound or a small hill; a hillock."]}, {"type": "noun", "defs": ["the medium-sized tree Buchanania anguistifolia of Anacardiaceae family."]}], "ಮುರಡು": [{"type": "adjective", "defs": ["not straight; bent or crooked.", "low or lower in order, status, rank, etc.; inferior."]}, {"type": "noun", "defs": ["the condition or fact of being crooked; crookedness; lack of straightness.", "that which has lost its original shape and has become a shapeless mass (as a wet cloth).", "the inner place close to the point where two walls meet; a corner.", "a portion where something is bent; a bend; a curve."]}], "ಮುರದಾಡಿಶಿಂಗಿ": [{"type": "noun", "defs": ["= ಮುರದಾರಸಿಂಗಿ."]}], "ಮುರದಾರಸಿಂಗಿ": [{"type": "noun", "defs": ["copper sulphate.", "the bushy or small sized plant Helicteres isora of Sterculiaceae family; East Indian screw pine."]}], "ಮುರಬ್ಬ": [{"type": "noun", "defs": ["a food made by boiling fruit with sugar to a thick mixture; jam."]}], "ಮುರಬ್ಬಾ": [{"type": "noun", "defs": ["= ಮುರಬ್ಬ."]}], "ಮುರಮು": [{"type": "noun", "defs": ["a fissile kind of stone (formed by hardening of black soil lumps)."]}], "ಮುರಮುರ": [{"type": "noun", "defs": ["an onomatopoeic word formed to represent the sound made by crisp cloth when touched or by dry leaves when walked on."]}], "ಮುರಮುರಿ": [{"type": "noun", "defs": ["paddy that is soaked and parched; parched rice."]}], "ಮುರರ್ಜಿಲ": [{"type": "noun", "defs": ["a kind of rice."]}], "ಮುರಲಿ": [{"type": "noun", "defs": ["a musical wind instrument consisting of a tube with a series of fingerholes along its length, played, holding it transversely, by blowing the wind through a whole near the closed end; a flute."]}], "ಮುರಲಿಗಾನ": [{"type": "noun", "defs": ["the music produced by playing a fluit."]}], "ಮುರಲೀಧರ": [{"type": "noun", "defs": ["Křṣṇa, who holds (and plays) a flute."]}], "ಮುರವ": [{"type": "noun", "defs": ["a most stupid fellow.", "a very poor man."]}, {"type": "noun", "defs": ["= ಮುರಜ - 1."]}], "ಮುರವತ್ತು": [{"type": "noun", "defs": ["the state of being morally owing some responsibility to another; the feeling of moral responsibility; obligation.", "a restraining, constraining or compelling by force; coersion; compulsion.", "one's personal preference, preconceived liking; predilection.", "fear; apprehension."]}], "ಮುರವು": [{"type": "noun", "defs": ["= ಮುರ1."]}, {"type": "noun", "defs": ["= ಮುರ2."]}], "ಮುರಸು": [{"type": "noun", "defs": ["the mental resistance, opposing or inconvenient feeling."]}], "ಮುರಳಿ": [{"type": "noun", "defs": ["= ಮುರಲಿ."]}, {"type": "noun", "defs": ["a kind of grass."]}], "ಮುರಳಿಗಾನ": [{"type": "noun", "defs": ["= ಮುರಲಿಗಾನ."]}], "ಮುರಳೀಧರ": [{"type": "noun", "defs": ["= ಮುರಲೀಧರ."]}], "ಮುರಾಡ": [{"type": "noun", "defs": ["the state or quality of being obstinate; stubbornness; obstinacy.", "ಮುರಾಡ ಹಾಕಿಕೊಳ್ಳು murāḍa hākikoḷḷu to be or become unreasonably determined to have one's own way; to be or become stubborn not yielding to reason or plea; ಮುರಾಡ ಹೂಡು murāḍa hūḍu = ಮುರಾಡ ಹಾಕಿಕೊಳ್ಳು."]}], "ಮುರಾಲಿ": [{"type": "noun", "defs": ["a kind of ornament for an elephant."]}], "ಮುರಿ": [{"type": "verb", "defs": ["to bend down one's head or bend one's body; to bow.", "to force (an object) into a curved or crooked form; to bend.", "to be turned from a straight line or from some direction or position; to become bent.", "to turn (back or to one side).", "to cause to turn back or aside.", "to move so as not to face somebody or something; to turn (oneself) away.", "to be hanging; to be suspended.", "to stretch one's arms or legs, (as to reactivate oneself from sleepy or drowsy mood).", "to turn (something or oneself) to form a spiral shape; to twist.", "to wind two or more threads or strands of (cotton, silk, etc.) around one another (so as to produce thread or cord); to twist.", "to be intertwined.", "to come back; to return.", "to make a retreat from an earlier commitment or activity or from facing a danger or from undertaking a hard task.", "to cause to turn back, go back, retreat.", "to decrease in size, range, extent (as from cold, fear, etc.); to shrink.", "to become ready; to prepare oneself for.", "to pay no attention to; to treat deliberately with disrespect; to slight.", "to unfold or unroll; to open.", "to come forth into view; to come out and be apparent.", "to press gently as to relieve from pain, tiredness.", "ಮುರಿತುಕೊಳ್ಳು muritukoḷḷu to become stiff and unfriendly. 2. to become angry."]}, {"type": "verb", "defs": ["to remove or divide into parts with a sharp-edged instrument; to sever; to cut.", "to be removed or divided from a whole; to be cut; to be severed.", "to cause to come apart by force; to split sharply into pieces; to break.", "to be broken (into pieces).", "to pull or pull out (as a flower from a plant).", "to be shattered and defeated.", "to be divided into parts or shares (a property among heirs).", "to go away (to a distant place or as not to be seen again).", "to win a victory over; to defeat.", "to damage or destroy.", "to cause to be unsuccessful, futile.", "to cause to die; to put to death; to kill.", "to make a mess of; to spoil the prospects; to be detrimental in the course of success.", "to be spoilt; to become useless or utterly ineffective.", "to transgress, violate, overstep (a norm, limit, law, etc.).", "(the point or blade of a weapon) to become blunt; to lose sharpness.", "(a pointed weapon, instrument, etc.) to pass into or through (an object).", "to be destroyed.", "to become waste; to be spent uselessly or unnecessarily.", "to prevent from doing, going, etc.; to obstruct.", "to cease to live; to die.", "to deduct, on some account, a certain amount from the amount payable to another.", "to be exchanged for something else (as bill of exchange for cash or a currency note of higher denomination for notes or coins of smaller denominations).", "ಮುರಿದು ಮುರಿದು ಮಾತಾಡು muridu muridu mātāḍu to speak with unnatural pauses, as from fear, hesitation, etc.); ಮುರಿದುಕೊಳ್ಳು muridu koḷḷu to be broken (into two or more pieces);", "to deduct a part from the amount payable; 3. to kill; to put to death."]}, {"type": "noun", "defs": ["= ಮುರಿವು."]}, {"type": "noun", "defs": ["(myth.) the mighty male buffalo, the vehicle of Yama, the Death-God and God of Righteousness.", "an opened mouth, that is terrifying.", "a group of people, animals or things, that causes terror.", "the act of stretching one's arms or legs, (as to reactivate oneself from sleepy or drowsy mood).", "a bull; an ox; a bullock."]}], "ಮುರಿಕ": [{"type": "noun", "defs": ["a man of crooked or nefarious nature.", "a man having a tendency to lose his temper for trivial reason; an easily angered man."]}], "ಮುರಿಕಟ್ಟು": [{"type": "noun", "defs": ["the act of deducting, retaining, on some account, a portion of the amount from the amount payable."]}], "ಮುರಿಕಿನಾಡು": [{"type": "noun", "defs": ["a sub clam of Smārta brāhmaṇas (followers of the philosophy of Śankarācārya), whose mother tongue is Telugu.", "originally, a country to which people of this clan belonged."]}], "ಮುರಿಕಿಲು": [{"type": "noun", "defs": ["= ಮುರುಕಿಲು."]}], "ಮುರಿಕಿಸು": [{"type": "verb", "defs": ["to force (an object, esp. a long or thin one) from a straight form into a curved or angular one; to bend.", "to turn both the ends of a thin, lengthy object in different directions; to twist.", "to slip away; to escape from.", "to be reluctant or wait to act because of fear, uncertainty or unwillingness; to hesitate.", "to be disdainfully proud or scornfully arrogant; to be haughty.", "to laugh at in scorn or contempt; to jeer at; to deride.", "to try to attract the attention and admiration of men by moving, talking in a trifling or seductive manner; to flirt or coquet."]}], "ಮುರಿಕೆ": [{"type": "noun", "defs": ["= ಮುರಿಗೆ1."]}, {"type": "noun", "defs": ["= ಮುರಿಗೆ2."]}], "ಮುರಿಕೊಂಬು": [{"type": "noun", "defs": ["a kind of bugle that is bent upward."]}], "ಮುರಿಗಟ್ಟಿಗೆ": [{"type": "noun", "defs": ["a particular part of a loom."]}], "ಮುರಿಗನಾಡು": [{"type": "noun", "defs": ["= ಮುರಿಕಿನಾಡು."]}], "ಮುರಿಗಿನಮರ": [{"type": "noun", "defs": ["= ಮುರುಂಗಿ."]}], "ಮುರಿಗೆ": [{"type": "noun", "defs": ["anything wound or gathered into a series of rings or a spiral; a coil.", "a coiled pad for placing vessels on.", "a kind of bracelet that is in the shape of a snake.", "(fig.) that which is complicated, solving or coming out, of which is difficult.", "a bend; a curve.", "a contracting or hesitating from shyness."]}, {"type": "noun", "defs": ["the tree Grewia vilosa of Tiliaceae family;round leaved Indian linden."]}], "ಮುರಿಗೆಗೊಳ್ಳು": [{"type": "verb", "defs": ["to be entangled in a complicated situation."]}], "ಮುರಿಗೆಡಹು": [{"type": "verb", "defs": ["to cut up or chop up into very small pieces as to ruin completely."]}], "ಮುರಿಗೆಡು": [{"type": "verb", "defs": ["to be broken into pieces and ruined."]}], "ಮುರಿಗೆಡೆ": [{"type": "verb", "defs": ["to turn oneself back or away.", "to go back, withdraw oneself or run away (from facing a danger); to retreat."]}], "ಮುರಿಗೇಶ": [{"type": "noun", "defs": ["a man having curly hair."]}], "ಮುರಿಚು": [{"type": "verb", "defs": ["to turn both the ends in different directions; to twist; to wring.", "to cause to move forward or aside, using force; to push.", "to slip away or escape from."]}], "ಮುರಿತ": [{"type": "noun", "defs": ["the which is bent or curved.", "a moving in a crooked, zigzag path or manner."]}, {"type": "noun", "defs": ["the fact or an instance of being defeated; a defeat.", "the act of breaking or the fact of being broken; break-up; fracture."]}], "ಮುರಿತಾಪ": [{"type": "noun", "defs": ["a kind of musical instrument."]}], "ಮುರಿದಿಟ್ಟಿ": [{"type": "noun", "defs": ["a side glance; a crooked look."]}], "ಮುರಿನೋಟ": [{"type": "noun", "defs": ["= ಮುರಿದಿಟ್ಟಿ.", "a looking within; a concentrating within oneself."]}], "ಮುರಿಪಾತ್ರೆ": [{"type": "noun", "defs": ["a vessel with a curved handle."]}], "ಮುರಿಪು": [{"type": "verb", "defs": ["to turn both the ends of a thin, lengthy object in different directions; to twist.", "to force (an object, esp. a long or thin one) from a straight form into a curved or angular one; to bend.", "to turn aside (from a course, direction, etc.) to divert.", "to cause to become crooked.", "to wind two or more threads or strands of (cotton, silk, etc.) around one another so as to produce thread or cord; to twist.", "to bend one's body; to bow or stoop."]}, {"type": "noun", "defs": ["the act of going of withdrawing back; withdrawal in the face of opposition or from a dangerous situation; a retreat.", "a revolving around one point, while fighting in a physical compat.", "a bent or curving part; the place where change in the direction is made (as in the course of a river).", "a kind of ear ornament.", "(dance.) a moving in a circle."]}], "ಮುರಿಬಡಿ": [{"type": "verb", "defs": ["to cause to go back or retreat; to drive back."]}], "ಮುರಿಮಲಕು": [{"type": "noun", "defs": ["a knot of a twisted cloth."]}], "ಮುರಿವಡೆ": [{"type": "verb", "defs": ["to be twisted (as the threads or strands in a rope)."]}], "ಮುರಿವು": [{"type": "noun", "defs": ["a bent or curving part.", "that which is bent.", "the quality or fact of being crooked or askew; crookedness.", "water in swift, violent, circular motion, as that produced by the meeting of opposing currents, often causing a downward spiraling action that draws floating objects deep under the surface; a whirlpool.", "a kind of ear ornament.", "the act of going back or withdrawing; withdrawal in the face of opposition or from a dangerous situation; a retreat.", "the act of enclosing from all sides; an encircling.", "a structure consisting of something wound in a continuous series of loops.", "a going out of sight; disappearance.", "fluctuation, instability or oscillation (of the mind).", "a thin line joining two points on the same plain.", "a flowing (of a liquid, light, etc.) in a stream.", "a kind of ornament for the wrist.", "an iron rim or circular band used in a sugarcane crushing machine (to keep the pair of rollers together).", "a revolving around one point or moving in a circle, while fighting in a physical compat."]}], "ಮುರಿವೋಗು": [{"type": "verb", "defs": ["to become bent or crooked."]}], "ಮುರಿಸು": [{"type": "verb", "defs": ["to cause to cut, sever.", "to cause to break or cause to be broken.", "to spoil; to ruin.", "to exchange for something else (as bill of exchange for cash or a currency note of higher denomination for notes or coins of smaller denominations).", "to covert by lequefying a gold, silver ornament or article in to mere gold, silver mass.", "to end another's life; to kill."]}, {"type": "noun", "defs": ["a shape that is not straight; a crooked form."]}], "ಮುರಿಹ": [{"type": "noun", "defs": ["the act of twisting, wrenching of winding."]}], "ಮುರಿಹು": [{"type": "verb", "defs": ["= ಮುರಿಪು1."]}], "ಮುರು": [{"type": "noun", "defs": ["= ಮುರಿವು."]}, {"type": "noun", "defs": ["= ಮುರುವು2."]}], "ಮುರುಂಗಿ": [{"type": "noun", "defs": ["the small or medium sized, deciduous tree Moringa Olefera ( = M. pterygosperma, = Hyperanthera moringa) of Moringaceae family, with tripinnate leaves (used as vegetable), and smooth, but weak, wood; drum-stick tree.", "its slender, long fruit, which is used as vegetable; drum stick."]}], "ಮುರುಂಟಿಸು": [{"type": "verb", "defs": ["= ಮುರುಟಿಸು1."]}], "ಮುರುಂಟು": [{"type": "verb", "defs": ["= ಮುರುಟು1."]}, {"type": "verb", "defs": ["= ಮುರುಟು2."]}], "ಮುರುಕ": [{"type": "adjective", "defs": ["cut; severed.", "broken; splintered; fractured."]}, {"type": "noun", "defs": ["a man who breaks, demolishes; a destroyer."]}, {"type": "noun", "defs": ["= ಮುರುಕು2."]}], "ಮುರುಕಲು": [{"type": "adjective", "defs": ["that is broken; shattered."]}, {"type": "noun", "defs": ["that which is broken."]}, {"type": "noun", "defs": ["the tree Buchanania lanzan ( = B. latifolia) of Anacardiaceae family.", "the plant Myrtus communis of Myrtaceae family with evergreen leaves, white or pinkish flowers, and dark, fragrant berries; common myrtle."]}], "ಮುರುಕಳಿ": [{"type": "noun", "defs": ["the state of being broken, dilapidated."]}], "ಮುರುಕಾಟ": [{"type": "noun", "defs": ["the behaviour or act of a coquettee; flirting; coquetry."]}], "ಮುರುಕಿಲು": [{"type": "noun", "defs": ["the evergreen tree Garcinia indica of Guttiferae family.", "its edible fruit."]}], "ಮುರುಕು": [{"type": "verb", "defs": ["to distort one's face (as from abhorrence, dislike, lack of interest, hatred, etc.).", "to act against or provide resistance to; to set oneself as an opponent or adversary; to oppose.", "to be very happy, proud, jubilant; to be in high spirits.", "to cause to turn or change direction.", "to make a deep, rumbling sound; to roar."]}, {"type": "noun", "defs": ["the quality or fact of being bent, crooked; crookedness.", "modest behaviour that befits a woman.", "arrogance; overbearingness; disdainful behaviour.", "a clever or difficult act intended to amuse; a trick.", "the act of pretending; pretension.", "a kind of fried spicy, crispy eatable made of the flour of rice, bengal gram, etc.", "the tendency of being deceitful; crookedness; dishonesty.", "noisy activity; agitation accompanied by heavy sound; a stir.", "beauty; loveliness.", "a form or condition that is distorted.", "proper respect for oneself; sense of one's own dignity or worth; self-respect; pride.", "spirit; courage; ardour; mettle.", "a great supply; more than sufficient quantity; plentifulness.", "the act or mode of moving; movement.", "love; affection.", "the state of being stiff, hard and erect."]}, {"type": "adjective", "defs": ["broken; cut; shortened."]}, {"type": "noun", "defs": ["a piece; a fragment; a part or portion of a whole.", "the state of being broken.", "a thing a part of which is broken.", "a hole; a cavity.", "something that resembles in all or almost all respects another."]}, {"type": "noun", "defs": ["the tree Erythrina stricta of Papilionaceae family."]}], "ಮುರುಕುಕಡ್ಡಿಮರ": [{"type": "noun", "defs": ["the plant Saprosma indicum of Rubiaceae family."]}], "ಮುರುಕೆ": [{"type": "noun", "defs": ["the tree Grewia vilosa of Tiliaceae family; round leaved Indian linden."]}], "ಮುರುಗ": [{"type": "noun", "defs": ["Subrahmaṇya, the son Śiva."]}], "ಮುರುಗಕಾಯಿ": [{"type": "noun", "defs": ["= ಮುರುಗಿಕಾಯಿ."]}], "ಮುರುಗಡೆ": [{"type": "noun", "defs": ["a breaking or being broken.", "the fact of a relation (between two persons) being broken."]}], "ಮುರುಗಿಕಾಯಿ": [{"type": "noun", "defs": ["the bushy or small sized plant Helicteres isora of Sterculiaceae family; East Indian screw pine.", "its fruit."]}], "ಮುರುಗಿನಮರ": [{"type": "noun", "defs": ["= ಮುರುಂಗಿ."]}], "ಮುರುಗುಟ್ಟು": [{"type": "verb", "defs": ["to make a sound as made by crisp cloth when touched or by dry leaves when walked on."]}], "ಮುರುಘ": [{"type": "noun", "defs": ["= ಮುರುಗ."]}], "ಮುರುಚು": [{"type": "verb", "defs": ["= ಮುರಿಚು."]}], "ಮುರುಜ": [{"type": "noun", "defs": ["a shallow, single-headed hand-drum having jingling metal disks in the rim, played by shaking, hitting with the knuckles, etc.; a tambourine."]}], "ಮುರುಜೆ": [{"type": "noun", "defs": ["= ಮುರುಜ."]}], "ಮುರುಟಿಸು": [{"type": "verb", "defs": ["to cause to shrink from fear or cold.", "to cause to become bent or crooked; to twist."]}, {"type": "verb", "defs": ["to pull or pull out (a flower, leaf, etc. from a plant); to pluck.", "to destroy completely; to damage irreparably; to destroy."]}], "ಮುರುಟು": [{"type": "verb", "defs": ["to become twisted, wrinkled or warped (as from drying or from being heated).", "to become bent or crooked.", "to become shrunk; to reduce oneself in size.", "to have wrinkles on (the surface).", "to pull out (a flower, leaf, from a plant); to pluck."]}, {"type": "verb", "defs": ["to light or kindle fire.", "to be burnt, charred by fire or heat.", "to become dry from heat.", "to be ruined or reduced to ruin; to be spoiled."]}, {"type": "adjective", "defs": ["= ಮುರುಡು2."]}, {"type": "noun", "defs": ["= ಮುರುಡು3."]}], "ಮುರುಟುಕೂದಲು": [{"type": "noun", "defs": ["curly hair."]}], "ಮುರುಟುಗಟ್ಟು": [{"type": "verb", "defs": ["to become crooked."]}], "ಮುರುಟುರೋಗ": [{"type": "noun", "defs": ["a kind of disease characterised by the bending of the bones, caused by deficiency of vitamin D; rickets."]}], "ಮುರುಟುಹ": [{"type": "noun", "defs": ["a twisting, bending or being twisted or bent.", "a shrinking or diminishing in size."]}], "ಮುರುಡ": [{"type": "noun", "defs": ["a man with knotty and twisted limbs.", "a man lacking civil or social manners, politeness."]}, {"type": "noun", "defs": ["Śiva."]}], "ಮುರುಡಸೆ": [{"type": "noun", "defs": ["the plant Cassia auriculata of Caesalpiniaceae family; (?)."]}], "ಮುರುಡಿ": [{"type": "noun", "defs": ["a kind of ornament for the hand."]}, {"type": "noun", "defs": ["= ಮುರುದಾರಸಿಂಗಿ."]}], "ಮುರುಡಿಸು": [{"type": "verb", "defs": ["to oppose defiantly or resistantly."]}], "ಮುರುಡು": [{"type": "verb", "defs": ["= ಮುರುಟು1."]}, {"type": "adjective", "defs": ["not straight; bent or crooked.", "low or lower in order, status, rank, etc.; inferior."]}, {"type": "noun", "defs": ["the condition or fact of being crooked; crookedness; lack of straightness.", "that which has lost its original shape and has become a shapeless mass (as a wet cloth).", "the inner place close to the point where two walls meet; a corner.", "a portion where something is bent; a bend; a curve."]}, {"type": "noun", "defs": ["that which is rough, coarse, uneven.", "the quality of being so.", "the knotty part of a piece of wood.", "the act of defying; bold resistance; defiance."]}, {"type": "noun", "defs": ["a kind of fish."]}], "ಮುರುಡುಗಲ್ಲು": [{"type": "noun", "defs": ["a rough, undressed stone."]}], "ಮುರುಡುಗೊಳ್ಳು": [{"type": "verb", "defs": ["to bow forward, backward or sideward or become humped."]}], "ಮುರುಡುಗೋಲ್": [{"type": "noun", "defs": ["a stick that is knotty and crooked."]}], "ಮುರುತಾಪು": [{"type": "noun", "defs": ["a kind of musical instrument."]}], "ಮುರುದಲೆ": [{"type": "noun", "defs": ["the place where a cross road meets or intersects a main road."]}], "ಮುರುದಾರಶೃಂಗಿ": [{"type": "noun", "defs": ["= ಮುರುದಾರಸಿಂಗಿ."]}], "ಮುರುದಾರಸಿಂಗಿ": [{"type": "noun", "defs": ["the tree Helicteres isora of Sterculiaceae family; East Indian screw pine."]}], "ಮುರುಪು": [{"type": "noun", "defs": ["the act of going of withdrawing back; withdrawal in the face of opposition or from a dangerous situation; a retreat.", "a revolving around one point, while fighting in a physical compat.", "a bent or curving part; the place where change in the direction is made (as in the course of a river).", "a kind of ear ornament.", "(dance.) a rythmical moving in a circle."]}], "ಮುರುಮುಚ್ಚಿ": [{"type": "noun", "defs": ["= ಮುರುಮುರಿ."]}], "ಮುರುಮುರಚಿ": [{"type": "noun", "defs": ["= ಮುರುಮುರಿ."]}], "ಮುರುಮುರಿ": [{"type": "noun", "defs": ["the tree Strychnos nux-vomica of Loganiaceae family.", "its poisonous nut containing strychnine, brucine and other alkaloids; nux-vomica."]}], "ಮುರುಮುರುಚಿ": [{"type": "noun", "defs": ["= ಮುರುಮುರಿ."]}], "ಮುರುಲುಬೇನೆ": [{"type": "noun", "defs": ["the plant Desmodium gangeticum of Papilionaceae family."]}], "ಮುರುವ": [{"type": "noun", "defs": ["a most stupid fellow.", "a very poor man."]}], "ಮುರುವತ್ತು": [{"type": "noun", "defs": ["the state of being morally owing some responsibility to another; the feeling of moral responsibiity; obligation.", "a restraining, constraining or compelling by force; coersion; compulsion.", "one's personal preference, preconceived liking; predilection.", "fear; apprehension."]}], "ಮುರುವನಹುಳಿ": [{"type": "noun", "defs": ["the evergreen tree Garcinia indica ( = G. purpurea) of Guttiferae family.", "its edible fruit."]}], "ಮುರವಿಕ್ಕು": [{"type": "verb", "defs": ["= ಮುರವಿಡು."]}], "ಮುರವಿಡು": [{"type": "verb", "defs": ["to feed a cattle with a preparation made by mixing horsegram, cotton seeds, oil-cake, bran, etc. with water or kitchen waste."]}], "ಮುರುವು": [{"type": "noun", "defs": ["a bent or curving part.", "that which is bent.", "the quality or fact of being crooked or askew; crookedness.", "water in swift, violent, circular motion, as produced by the meeting of opposing currents, often causing a downward spiraling action that draws floating objects deep under the surface; a whirlpool.", "a kind of ear ornament.", "the act of going of withdrawing back; withdrawal in the face of opposition or from a dangerous situation; a retreat.", "the act of enclosing from all sides; an encircling.", "a structure consisting of something wound in a continuous series of loops.", "a going out of sight; disappearance.", "fluctuation, instability or oscillation (of the mind).", "a thin line joining two points on the same plain.", "a flowing (of a liquid, light, etc.) in a stream.", "a kind of ornament for the wrist.", "an iron rim or circular band used in a sugarcane crushing machine (to keep the pair of rollers together).", "a revolving around one point or moving in a circle, while fighting in a physical combat."]}, {"type": "noun", "defs": ["a cattle feed made by mixing horsegram, cotton seeds, oil-cake, bran, etc. with water or kitchen waste."]}], "ಮುರುಸು": [{"type": "noun", "defs": ["the mental resistance, opposing or inconvenient feeling."]}], "ಮುರುಹು": [{"type": "verb", "defs": ["to turn both the ends of a thin, lengthy object in different directions; to twist.", "to force (an object, esp. a long or thin one) from a straight form into a curved or angular one; to bend.", "to turn aside (from a course, direction, etc.) to divert.", "to cause to become crooked.", "to wind two or more threads or strands of (cotton, silk, etc.) around one another so as to produce thread or cord; to twist.", "to bend one's body; to bow or stoop."]}, {"type": "noun", "defs": ["the act of going back or withdrawing; withdrawal in the face of opposition or from a dangerous situation; a retreat.", "a revolving around one point, while fighting in a physical compat.", "a bent or curving part; the place where change in the direction is made (as in the course of a river).", "a kind of ear ornament.", "(dance.) a moving in a circle."]}, {"type": "noun", "defs": ["= ಮುರುವು2."]}, {"type": "noun", "defs": ["= ಮುರುಕು2."]}], "ಮುರೆ": [{"type": "noun", "defs": ["a kind of plant.", "a fragrnt substance obtained from this plant."]}], "ಮುರ್ಕಲಿ": [{"type": "noun", "defs": ["the evergreen tree Garcinia indica of Guttiferae family.", "its edible fruit.", "the medium sized, deciduous tree Buhanania latifolia ( = B. angustifolia) of Anacardiaceae family."]}], "ಮುರ್ಗಲ್": [{"type": "noun", "defs": ["= ಮುರ್ಕಲಿ."]}], "ಮುರ್ಗಳ": [{"type": "noun", "defs": ["= ಮುರ್ಕಲಿ."]}], "ಮುರ್ಗಿ": [{"type": "noun", "defs": ["= ಮುರ್ಗಿಕಾಯಿ."]}], "ಮುರ್ಗಿಕಾಯಿ": [{"type": "noun", "defs": ["the bushy or small sized plant Helicteres isora of Sterculiaceae family; East Indian screw pine.", "its fruit."]}], "ಮುರ್ಗಿನಕೋಡು ಸೊಪ್ಪು": [{"type": "noun", "defs": ["the plant Antidesma diandrum of Euphorbiaceae family."]}], "ಮುರ್ಗು": [{"type": "verb", "defs": ["to turn back from a straight line; to bend.", "to bow the upper part of the body in respect, worship, greeting.", "to fall at once losing strength; to collapse.", "to stumble or falter while walking or running.", "to be spoiled and become useless.", "to attack; to fall upon.", "to put up a fight.", "to come to an end; to be over.", "(a plant, leaf, flower, etc.) to dry up from heat; to wither; to shrivel."]}], "ಮುರ್ಚೆ": [{"type": "noun", "defs": ["the state of being deprived of consciousness for temporary period; unconsciousness."]}], "ಮುರ್ಜಿನ": [{"type": "noun", "defs": ["= ಮುರುವನಹುಳಿ."]}], "ಮುರ್ತೆ": [{"type": "noun", "defs": ["the act, occupation of drawing toddy from certain palm trees."]}], "ಮುರ್ದಾರಿ": [{"type": "adjective", "defs": ["lacking normal intelligence; senseless; unwise; silly."]}], "ಮುರ್ದಾರಿಕೆ": [{"type": "noun", "defs": ["lack of normal intelligence or wisdom; senselessness; foolishness."]}], "ಮುರ್ಮುರ": [{"type": "noun", "defs": ["burning paddy-husk."]}], "ಮುಲಕನಾಡು": [{"type": "noun", "defs": ["a sub clan of Smārta brāhmaṇas (followers of the philosophy of Śankarācārya), whose mother tongue is Telugu.", "a country to which people of this clan originally belonged."]}], "ಮುಲಕಿ": [{"type": "adjective", "defs": ["= ಮುಲ್ಕಿ1."]}, {"type": "noun", "defs": ["= ಮುಲ್ಕಿ2.", "ಮುಲಕೀಪರೀಕ್ಷೆ mulakī parīkṣe = ಮುಲ್ಕೀಪರೀಕ್ಷೆ."]}], "ಮುಲಖ": [{"type": "adjective", "defs": ["= ಮುಲ್ಕಿ1."]}, {"type": "noun", "defs": ["= ಮುಲ್ಕಿ2."]}], "ಮುಲಾಖತು": [{"type": "noun", "defs": ["= ಮುಲಾಖತ್ತು."]}], "ಮುಲಾಖತ್ತು": [{"type": "noun", "defs": ["the state of being associated; association.", "a coming together of persons or things; a meeting."]}], "ಮುಲಾಜ್": [{"type": "noun", "defs": ["= ಮುಲಾಜು."]}], "ಮುಲಾಜು": [{"type": "noun", "defs": ["the quality of being shy, bashful; shyness; bashfullness.", "the state of being morally owing some responsibility to another; the feeling of moral responsibility; obligation."]}], "ಮುಲಾಮು": [{"type": "noun", "defs": ["a substance, as a thin coating of gold, silver, etc. applied on a metal surface.", "a fatty substance applied to the skin for healing or cosmetic purposes; an ointment."]}], "ಮುಲಾವು": [{"type": "noun", "defs": ["= ಮುಲಾಮು."]}], "ಮುಲು": [{"type": "noun", "defs": ["(usu. used in dupl. ಮುಲುಮುಲು) an onomatopoeic word formed imitating the sound made by a worm while crawling."]}], "ಮುಲುಕು": [{"type": "verb", "defs": ["to suffer the throes of childbirth; to be in labour.", "to make a plaintive, sad crying sound.", "to make short, emphatic sound while struggling to do something.", "to move aside slowly."]}, {"type": "noun", "defs": ["a short plaintive, crying sound (made by woman from throes of childbirth).", "any such sound made while striving, struggling hard or from severe pain or spasm."]}, {"type": "adjective", "defs": ["= ಮುಲ್ಕಿ1."]}, {"type": "noun", "defs": ["= ಮುಲ್ಕಿ2."]}], "ಮುಲುಖ": [{"type": "adjective", "defs": ["= ಮುಲ್ಕಿ1."]}, {"type": "noun", "defs": ["= ಮುಲ್ಕಿ2."]}], "ಮುಲುಖು": [{"type": "adjective", "defs": ["= ಮುಲ್ಕಿ1."]}, {"type": "noun", "defs": ["= ಮುಲ್ಕಿ2."]}], "ಮುಲುಗು": [{"type": "verb", "defs": ["= ಮುಲುಕು1."]}], "ಮುಲುಗುಟ್ಟು": [{"type": "verb", "defs": ["to crawl, as a worm.", "to cause the feeling as if worms were moving within.", "(fig.) to become restless."]}], "ಮುಲುವುನ್ನೆ": [{"type": "noun", "defs": ["a kind of medicinal herb."]}], "ಮುಲ್ಕಿ": [{"type": "adjective", "defs": ["of relating to tax, tax administration (of a state).", "local; regional; divisional."]}, {"type": "noun", "defs": ["tax administration of a state.", "a school between elementary school and high school, usu. having 5th to 7th grades.", "a region or division of a state.", "ಮುಲ್ಕೀಪರೀಕ್ಷೆ mulkī parīkṣe the last standard or grade in the middle-school education; 7th grade of the present system."]}], "ಮುಲ್ಕಿಖಾತೆ": [{"type": "noun", "defs": ["the revenue department of the state administration."]}], "ಮುಲ್ಗು": [{"type": "verb", "defs": ["= ಮುಲುಕು1."]}], "ಮುಲ್ತಾನಿ": [{"type": "adjective", "defs": ["showy; pompous; ostentatious; gaudy."]}, {"type": "noun", "defs": ["a city in north east Pakistan near the Chenab river.", "an inhabitant of that city.", "in Hindūstāni system of Indian music, name of a musical mode."]}], "ಮುಲ್ಲ": [{"type": "noun", "defs": ["= ಮುಲ್ಲಾ."]}], "ಮುಲ್ಲಂಗಿ": [{"type": "noun", "defs": ["the annual plant Raphanus sativus of Brassicaceae family; radish plant.", "its pungent root eaten either as raw or cooked; radish."]}], "ಮುಲ್ಲಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["= ಮುಲ್ಲಾಶಾಸ್ತ್ರ."]}], "ಮುಲ್ಲಾ": [{"type": "noun", "defs": ["a Muslim teacher or interpreter of the religious law; a mullah.", "a man who teaches languages as Arab, Parsian, etc."]}], "ಮುಲ್ಲಾಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["the sacred book of Islam, which according to Muslims belief, contains revelations made to Mohammed by Allah."]}], "ಮುಲ್ಲಿ": [{"type": "noun", "defs": ["the quality of being a) pleasant in its lightness, mildness, subtlety, etc., b) slight and subtle, c) easily damaged, spoiled or disordered, d) frail in health; e) needing careful handling, tact, etc., f) finely sensitive in feeling, understanding, discriminating or responding, g) finely skilled, h) sensitive or disagreeable to what is considered offensive or improper.", "(fig.) the condition of being difficult."]}], "ಮುಲ್ಲುಕ": [{"type": "noun", "defs": ["a musalman soldier."]}], "ಮುಲ್ಲೂಕ": [{"type": "noun", "defs": ["= ಮುಲ್ಲುಕ."]}], "ಮುಲ್ಲೋಕ": [{"type": "noun", "defs": ["the three worlds, the heaven, earth and nether world."]}], "ಮುವಜ್ಜಲ್": [{"type": "noun", "defs": ["the money that is to be given to the bride's parents by the groom at the time of marriage or within a prescribed date."]}], "ಮುವಾನೆ": [{"type": "noun", "defs": ["an old measure of corn."]}], "ಮುವ್ವತ್ತು": [{"type": "adjective", "defs": ["amounting to thirty."]}, {"type": "noun", "defs": ["the cardinal number thirty; 30."]}], "ಮುಶಲ": [{"type": "noun", "defs": ["a long, round tool for pounding or grinding substances in a mortar; a pestle.", "a pestle or mace-like weapon.", "a short, thick stick; a staff."]}], "ಮುಶಲಿ": [{"type": "noun", "defs": ["Balarāma, an elder brother of Křṣṇa, who uses pestle or mace-like weapon."]}, {"type": "noun", "defs": ["the house lizard.", "the plant Curculigo orchiodes of Zingiberaceae family;(?)."]}], "ಮುಶಲಿಕೆ": [{"type": "noun", "defs": ["= ಮುಶಲಿ2 - 1.", "the lizard Iguana tuberculata, of Iguanidae family (a harmless, moderate-size, tropical lizard that feed on insects or vegetation and have a row of spines from neck to tail, which is known for its grip and used in scaling forts); the common iguana."]}], "ಮುಶಾಯಿರಾ": [{"type": "noun", "defs": ["= ಮುಶೈರಾ."]}], "ಮುಶಿ": [{"type": "noun", "defs": ["a container made of a substance that can resist great heat, for melting, fusing or calcining ores, metals, etc.; a crucible.", "a tube with a small bowl at one end, through which tobacco or ganja is smoked; a pipe."]}], "ಮುಶೈರಾ": [{"type": "noun", "defs": ["a meeting of a number of poets where they read out their poems."]}], "ಮುಷಕರ": [{"type": "noun", "defs": ["= ಮುಷ್ಕರ1."]}], "ಮುಷಿತ": [{"type": "adjective", "defs": ["that is stolen.", "not found; not present at the designated place; lost.", "destroyed or ruined.", "covered from all or or almost all sides."]}, {"type": "noun", "defs": ["that which is stolen; a stolen goods.", "the act or an instance of stealing; larceny; theft."]}], "ಮುಷ್ಕ": [{"type": "noun", "defs": ["either of two oval sex glands in the male that are suspended in the scrotum and secrete spermatozoa; the testis; the testicle.", "the plant Schrebera swietenioides of Oleaceae family.", "the plant Stereospermum suaveolens ( = Bignonia suaveolens) of Bignoniaceae family.", "its flower; trumpet flower."]}], "ಮುಷ್ಕಕ": [{"type": "noun", "defs": ["= ಮುಷ್ಕ - 3 & 4."]}], "ಮುಷ್ಕರ": [{"type": "noun", "defs": ["the state or quality of being obstinate; stubbornness; obstinacy.", "a concerted refusal by employees to go on working, in an attempt to force an employer to grant certain demands; a strike.", "ಮುಷ್ಕರ ಹೂಡು muṣkara hūḍu to become obstinate; to refuse to yield; 2. to refuse to continue to work until certain demands are met; go on strike; to strike; ಮುಷ್ಕರ ಹಿಡಿ muṣkara hiḍi = ಮುಷ್ಕರ ಹೂಡು."]}], "ಮುಷ್ಕರಕಾರ": [{"type": "noun", "defs": ["any of the employees who are on a strike."]}], "ಮುಷ್ಕಿ": [{"type": "noun", "defs": ["a tying of both the hands on the back."]}], "ಮುಷ್ಕಿಲ್": [{"type": "adjective", "defs": ["difficult; hard; intricate; troublesome."]}, {"type": "noun", "defs": ["difficulty; trouble."]}], "ಮುಷ್ಕೀಲು": [{"type": "adjective", "defs": ["= ಮುಷ್ಕಿಲ್1."]}, {"type": "noun", "defs": ["= ಮುಷ್ಕಿಲ್2."]}], "ಮುಷ್ಟ": [{"type": "adjective", "defs": ["that is stolen."]}, {"type": "noun", "defs": ["that which is stolen; a stolen goods.", "the act or an instance of stealing; larceny; theft."]}, {"type": "noun", "defs": ["magic used for evil purposes; witchcraft; sorcery; black magic."]}], "ಮುಷ್ಟಾಮುಷ್ಟಿ": [{"type": "noun", "defs": ["a fight exchanging blows with the fists; fisticuffs."]}], "ಮುಷ್ಟಿ": [{"type": "noun", "defs": ["the tree Strychnos nux-vomica of Loganiaceae family.", "its poisonous nut containing strychnine, brucine and other alkaloids; nux-vomica.", "the plant Argyreia nervosa ( = A. speciosa) of Convolvulaceae family.", "another plant Argyreia malabarica of the samily.", "the grass Panicum italica of Poaceae family."]}, {"type": "noun", "defs": ["a hand with the fingers closed into the palm; a fist.", "a thrusting blow with the fist.", "that much quantity which can be held in the palm with fingers closed over it.", "that part of a weapon, which is to be held by the user; the handle.", "that part of the bow where it is held by the user.", "the length of a fist, used as a unit of measurement.", "food given or received as charity; alms.", "the act or an instance of stealing; theft.", "the male gonad or reproductive gland, either of two oval glands located in the scrotum; the testicle.", "a mystical hymn that is chanted before discharging an arrow for special or more disastrous effects.", "(dance) a single-hand gesture in which the thumb is firmly pressed over other four fingers closed into the palm.", "ಮುಷ್ಟಿಯಲ್ಲಿ ಇಟ್ಟುಕೊಂಡಿರು muṣṭiyalli iṭṭukonḍiru (fig.) to keep someone or something (as power) under one's control."]}], "ಮುಷ್ಟಿಕ": [{"type": "noun", "defs": ["= ಮುಷ್ಟಿ2 - 11.", "a man who makes and sells gold articles; a goldsmith.", "a physical fight in which blows with the fist are exchanged; a pugilistic encounter."]}], "ಮುಷ್ಟಿಕಸ್ವಸ್ತಿಕ": [{"type": "noun", "defs": ["one of the hand gestures in dancing."]}], "ಮುಷ್ಟಿಕಾಳಗ": [{"type": "noun", "defs": ["a kind of fight between two opponents who struggle hand to hand attempting to knock each other down to the ground, striking blows; boxing."]}], "ಮುಷ್ಟಿಕೀಲು": [{"type": "noun", "defs": ["a kind of arthritis in which the wrist becomes stiff and moving it becomes very painful."]}], "ಮುಷ್ಟಿಕೆ": [{"type": "noun", "defs": ["= ಮುಷ್ಟಿ2 - 1."]}], "ಮುಷ್ಟಿಗೆ": [{"type": "noun", "defs": ["the plant Anisochilus carnosus of Lamiaceae family, with thick and fragrant leaves; (?)."]}], "ಮುಷ್ಟಿಗೆಯ್": [{"type": "verb", "defs": ["to close the fingers into the palms (to or as if to hit or punch).", "to bring someone or something under one'ss control."]}], "ಮುಷ್ಟಿಗ್ರಾಹ್ಯ": [{"type": "adjective", "defs": ["that can be held in the palm with fingers closed over."]}, {"type": "noun", "defs": ["that much which can be held in the palm with fingers closed over.", "that which can be held in the hand."]}], "ಮುಷ್ಟಿಘಾತ": [{"type": "noun", "defs": ["the act or an instance of punching with the fist.", "the impact of such a blow."]}], "ಮುಷ್ಟಿಪಾತ": [{"type": "noun", "defs": ["a blow delivered with the fist (that is forbidden in pugilistic encounters)."]}], "ಮುಷ್ಟಿಪ್ರಶ್ನೆ": [{"type": "noun", "defs": ["a challenge posed to another to find out what is kept in one's fist."]}], "ಮುಷ್ಟಿಪ್ರಹಾರ": [{"type": "noun", "defs": ["= ಮುಷ್ಟಿಘಾತ - 1."]}], "ಮುಷ್ಟಿಬಂಧ": [{"type": "noun", "defs": ["= ಮುಷ್ಟಿ2 - 3.", "the closing of the fingers into one's palm (to or as if to hit or punch)."]}], "ಮುಷ್ಟಿಬಲ": [{"type": "noun", "defs": ["the strength of the fist (as measured by the blow delivered with it)."]}], "ಮುಷ್ಟಿಮೈಥುನ": [{"type": "noun", "defs": ["the stimulation or manipulation of one's own genitals, to orgasm; sexual self-gratification; masturbation."]}], "ಮುಷ್ಟಿಯುದ್ಧ": [{"type": "noun", "defs": ["a fight in which blows are exchanged with the fists; a pugilistic encounter."]}], "ಮುಷ್ಟಿಶೂಲೆ": [{"type": "noun", "defs": ["a disease of the testicles."]}], "ಮುಷ್ಟೆ": [{"type": "noun", "defs": ["= ಮುಷ್ಟಿ1."]}], "ಮುಸಂಡಿ": [{"type": "adjective", "defs": ["= ಮುಸುಂಡಿ1."]}, {"type": "noun", "defs": ["= ಮುಸುಂಡಿ2."]}], "ಮುಸಂಡಿತನ": [{"type": "noun", "defs": ["= ಮುಸುಂಡಿತನ."]}], "ಮುಸಂಬಿ": [{"type": "noun", "defs": ["the evergreen citrus plant Citrus aurantium (var. typica) of Rutaceae family.", "its juicy and edible fruit."]}], "ಮುಸಡಿ": [{"type": "noun", "defs": ["the projecting nose and jaws or muzzle, of an animal; the snout.", "(derog.) the face of a human being.", "the mouth.", "the bill of a bird.", "the nose or either of the nostrils of a horse."]}], "ಮುಸದ್ದಿ": [{"type": "noun", "defs": ["(correctly, ಮುತ್ಸದ್ದಿ) a person who is conducting the state affairs or engaged in the business of government.", "a person authorised to carry out something on behalf of anotehr or a state; an agent.", "one who manages a business, institution, etc.; a manager.", "a person who shows wisdom, skill, and vision in conducting state affairs and dealing with public issues; a statesman.", "(gen.) a man possessing high degree of wisdom or skill.", "an expert cheat; a trickster."]}], "ಮುಸರೆ": [{"type": "noun", "defs": ["the pollution caused by touching boiled rice or other cooked food or the vessels in which they are cooked or kept (before being washed).", "a vessel in which food is cooked or cooked food is kept or the one which has come into contact with it (before being washed).", "any cooked food.", "kitchen waste used as a cattle feed."]}], "ಮುಸಲ": [{"type": "noun", "defs": ["a long, round tool for pounding or grinding substances in a mortar; a pestle.", "a pestle-like weapon.", "a heavy medieval war club; a mace.", "the moving part inside a bell, that strikes the side of the bell; a tongue; a clapper.", "a kind of medical implement used in surgery.", "a Northern constellation in the Milky Way, between Cygnus and Andromeda; the Lacerta.", "ಮುಸಲಾಗ್ರ ಬುದ್ಧಿ musalāgra buddhi the quality of being very slow in perceiving, feeling or understanding; lack of intelligence; bluntness."]}, {"type": "noun", "defs": ["= ಮುಸಲ್ಮಾನ."]}], "ಮುಸಲಘಾತ": [{"type": "noun", "defs": ["a blow delivered with a pestle or pestle-like weapon."]}], "ಮುಸಲಧರ": [{"type": "noun", "defs": ["Balarāma, an elder brother of Křṣṇa, who uses pestle or mace-like weapon."]}], "ಮುಸಲಧಾರೆ": [{"type": "noun", "defs": ["a very heavy rain with unusu. larger drops."]}], "ಮುಸಲಪಾಣಿ": [{"type": "noun", "defs": ["= ಮುಸಲಧರ."]}], "ಮುಸಲಮಾನ್": [{"type": "noun", "defs": ["= ಮುಸಲ್ಮಾನ."]}], "ಮುಸಲಮಾನ": [{"type": "noun", "defs": ["= ಮುಸಲ್ಮಾನ."]}], "ಮುಸಲಸ್ನಾನ": [{"type": "noun", "defs": ["a bathing by dipping oneself without washing properly."]}], "ಮುಸಲಹತಿ": [{"type": "noun", "defs": ["= ಮುಸಲಘಾತ."]}], "ಮುಸಲಾಯುಧ": [{"type": "noun", "defs": ["a pestle-like war weapon.", "a mace.", "= ಮುಸಲಧರ."]}], "ಮುಸಲಿ": [{"type": "noun", "defs": ["= ಮುಸಲಧರ.", "a Northern constellation in the Milky Way, between Cygnus and Andromeda; the Lacerta."]}, {"type": "noun", "defs": ["the house lizard.", "a large voracious aquatic reptile having a long snout with massive jaws and sharp teeth and a body covered with bony plates; a crocodile.", "any of various lizards of Chamaeleontidae family with an angular head, prehensile tail, eyes that move independently of each other, the ability to change skin colour rapidly, and a long, agile tongue for catching prey; a chameleon.", "the plant Curculigo orchiodes of Zingiberaceae family(?).", "a male horse lacking normal function of reproduction or a castrated horse."]}, {"type": "noun", "defs": ["= ಮುಸಲ1 - 6."]}], "ಮುಸಲಿಕೆ": [{"type": "noun", "defs": ["the house lizard.", "the animal Iguana tuberculata, of a large family (Iguanidae) of tree or ground, lizards; (a harmless, moderate-size, tropical lizard that feed on insects or vegetation and have a row of spines from neck to tail, which isknown for its grip and used in scaling forts); the common iguana."]}], "ಮುಸಲುಮಾನ": [{"type": "noun", "defs": ["= ಮುಸಲ್ಮಾನ."]}], "ಮುಸಲ್ಮಾನ್": [{"type": "noun", "defs": ["= ಮುಸಲ್ಮಾನ."]}], "ಮುಸಲ್ಮಾನ": [{"type": "noun", "defs": ["an adherent of Islam; a mussulman; a muslim."]}], "ಮುಸಲ್ಮಾನಿ": [{"type": "noun", "defs": ["of Islam or the Muslims; Muslim."]}, {"type": "noun", "defs": ["a language spoken mostly Muslims of India and Pakistan, with the same basic grammar as Hindi but having many words derived from Persian and Arabic, using Arabic script; Urdu."]}], "ಮುಸಳ": [{"type": "noun", "defs": ["= ಮುಸಲ1."]}], "ಮುಸಳಿಕೆ": [{"type": "noun", "defs": ["= ಮುಸಲಿಕೆ."]}], "ಮುಸಾಂಬ್ರ": [{"type": "noun", "defs": ["the aloe plant Aloe vera of Liliaceae family; Barbados aloe."]}], "ಮುಸಾಫರ್‍ಖಾನೆ": [{"type": "noun", "defs": ["= ಮುಸಾಫಿರ್‍ಖಾನೆ."]}], "ಮುಸಾಫರ": [{"type": "noun", "defs": ["= ಮುಸಾಫಿರ."]}], "ಮುಸಾಫರಖಾನೆ": [{"type": "noun", "defs": ["= ಮುಸಾಫಿರ್‍ಖಾನೆ."]}], "ಮುಸಾಫಿರ್‍ಖಾನೆ": [{"type": "noun", "defs": ["a building furnished with facilities for travellers to stay in on their way."]}], "ಮುಸಾಫಿರ": [{"type": "noun", "defs": ["a person who travels; a traveller."]}], "ಮುಸಾಫಿರಿ": [{"type": "noun", "defs": ["= ಮುಸಾಫಿರ."]}], "ಮುಸಾಫಿರಿಬಂಗ್ಲೆ": [{"type": "noun", "defs": ["= ಮುಸಾಫಿರ್‍ಖಾನೆ."]}], "ಮುಸಿ": [{"type": "noun", "defs": ["that which is unnatural or is affected.", "ಮುಸಿ ಮುಸಿ ನಗು musi musi nagu to smile in an artificial, unnatural and affected manner."]}, {"type": "noun", "defs": ["a container made of a substance that can resist great heat, for melting, fusing or calcining ores, metals, etc.; a crucible.", "a tube with a small bowl at one end, in which tobacco, etc. is smoked; a pipe."]}], "ಮುಸಿಗಾರ": [{"type": "noun", "defs": ["an artisan whose occupation is to melt metals in a crucible (and making articles of it); a smith."]}], "ಮುಸಿಗೆ": [{"type": "noun", "defs": ["a tying of both the hands on the back."]}], "ಮುಸಿಗೆಬಿಗಿ": [{"type": "verb", "defs": ["to tie both the hands behind the back."]}], "ಮುಸಿನಗು": [{"type": "noun", "defs": ["a smiling in an unnatural and affected manner; a crooked smile."]}], "ಮುಸಿನಗೆ": [{"type": "noun", "defs": ["= ಮುಸಿನಗು."]}], "ಮುಸಿಮನೆ": [{"type": "noun", "defs": ["the workshop of a goldsmith.", "(fig.) a place where crucial test or tests are conducted.", "(fig.) a crucial and difficult stage."]}], "ಮುಸಿಯ": [{"type": "noun", "defs": ["the lanky, long-tailed monkey Presbytis entellius; common langur."]}], "ಮುಸಿಲ್ಲಮಾನ": [{"type": "noun", "defs": ["= ಮುಸಲ್ಮಾನ."]}], "ಮುಸು": [{"type": "noun", "defs": ["= ಮುಸಿಯ."]}], "ಮುಸುಂಕಿಡು": [{"type": "verb", "defs": ["= ಮುಸುಕಿಡು."]}], "ಮುಸುಂಕು": [{"type": "verb", "defs": ["= ಮುಸುಕು1."]}, {"type": "noun", "defs": ["= ಮುಸುಕು2."]}], "ಮುಸುಂಕುಗಳೆ": [{"type": "verb", "defs": ["to remove the cover or veil."]}], "ಮುಸುಂಕುಗಳ್ತಲೆ": [{"type": "noun", "defs": ["= ಮುಸುಕುಗತ್ತಲೆ."]}], "ಮುಸುಂಡಿ": [{"type": "adjective", "defs": ["bashful; timid; lacking boldness and confidence."]}, {"type": "noun", "defs": ["a dishonest or crooked person.", "a bashful, timid person; a person lacking boldness and confidence."]}, {"type": "noun", "defs": ["a heavy wooden post used as a weapon.", "a kind of plant."]}], "ಮುಸುಂಡಿತನ": [{"type": "noun", "defs": ["lack of boldness and confidence."]}], "ಮುಸುಂಡು": [{"type": "noun", "defs": ["= ಮುಸುಡಿ1."]}], "ಮುಸುಂಡೆ": [{"type": "noun", "defs": ["= ಮುಸುಂಡಿ2."]}], "ಮುಸುಂಬ": [{"type": "noun", "defs": ["= ಮುಸುಂಬು1."]}], "ಮುಸುಂಬಿ": [{"type": "noun", "defs": ["the evergreen citrus plant Citrus aurantium (var. typica) of Rutaceae family.", "its juicy and edible fruit."]}], "ಮುಸುಂಬಿಡು": [{"type": "verb", "defs": ["= ಮುಸುಡಿಕ್ಕು."]}], "ಮುಸುಂಬು": [{"type": "noun", "defs": ["the projecting nose and jaws or muzzle, of an animal; the snout.", "the face of a person."]}, {"type": "noun", "defs": ["that which covers or conceals as a screen, curtain, veil."]}], "ಮುಸುಕ": [{"type": "noun", "defs": ["= ಮುಸುಕು2."]}], "ಮುಸುಕಿ": [{"type": "noun", "defs": ["a network, small basket, bag, etc. tied to the mouth of a horse, cow, ox, etc. to prevent it from eating."]}], "ಮುಸುಕಿಕ್ಕು": [{"type": "verb", "defs": ["= ಮುಸುಕಿಡು."]}], "ಮುಸುಕಿಡು": [{"type": "verb", "defs": ["to keep an object covered with; to place something on, over or in front of, so as to conceal, protect or close.", "to put a veil over one's face.", "to wrap, surroud; to envelop."]}], "ಮುಸುಕು": [{"type": "verb", "defs": ["to cover something with; to veil.", "to veil one's face.", "to wrap up in or as in a covering; to envelop.", "to be spread over a wide area.", "to be or become dense.", "to come together; to assemble.", "to pervade (oneself) all over or through out.", "to happen; to occur; to take place.", "to be hidden, concealed.", "to keep (something) in a secret place; to hide.", "to cover from all sides; to encircle."]}, {"type": "noun", "defs": ["a piece of cloth with which something is covered, concealed; a veil.", "a length of cloth hung from above, with facility to move sideways, that prevents from seeing the objects on the otherside; a screen.", "a piece of light fabric, as of net or gauze, worn by women, over the face or head to conceal, protect or enhance the face; a veil.", "the act of covering, enveloping or capturing completely.", "a boundary; limit.", "a cover, either hinged or unattached, to close a box, trunk, pot, etc.; a lid.", "the case or cover for a weapon as sword; a sheath.", "that which is kept from other's knowledge; a secret.", "a pretending; pretension.", "the condition or quality of being murky, dim or gloomy; murkiness; gloominess.", "the state of not being manifested, expressed or not becoming apparent.", "ಮುಸುಕಿನ ಊಟ musukina ūṭa a customary supply of food in a baskets covered with a piece of cloth by the parents of the bride to the relatives of the bridegroom at marriage; ಮುಸುಕಿನ ಗುದ್ದು musukina guddu (fig.) pain, agony, etc. undergoing without others being aware of it; 2. a pain, agony inflicted indirectly; ಮುಸುಕಿನ ಜೋಳ the cereal plant Zea mays of the Poaceae family, cultivated for its grain; Indian corn; 2. its edible grain; Indian corn; ಮುಸುಕಿನೊಳಗಿನ ಗುದ್ದು musukinoḷa gina guddu = ಮುಸುಕಿನ ಗುದ್ದು; ಮುಸುಕೂಟ musukūṭa = ಮುಸುಕಿನ ಊಟ."]}], "ಮುಸುಕುಗತ್ತಲೆ": [{"type": "noun", "defs": ["an enveloping darkness."]}], "ಮುಸುಕುವಲೆ": [{"type": "noun", "defs": ["a kind of net used to catch wild birds and animals."]}], "ಮುಸುಕೆಳೆ": [{"type": "verb", "defs": ["to cover something with a piece of cloth.", "to cover oneself with a sheet of cloth or veil."]}], "ಮುಸುಕೆೞೆ": [{"type": "verb", "defs": ["= ಮುಸುಕೆಳೆ."]}], "ಮುಸುಕೊಡೆ": [{"type": "noun", "defs": ["a kind of spicy cake made by frying in oil."]}], "ಮುಸುಗರೆ": [{"type": "verb", "defs": ["to make an indistinct, repeated sound from anger, fatigue, etc."]}], "ಮುಸುಗಿಡು": [{"type": "verb", "defs": ["= ಮುಸುಕಿಡು."]}], "ಮುಸುಗಿಸು": [{"type": "verb", "defs": ["= ಮುಸುಕಿಡು -1"]}], "ಮುಸುಗು": [{"type": "verb", "defs": ["= ಮುಸುಕು1."]}, {"type": "noun", "defs": ["= ಮುಸುಕು2."]}], "ಮುಸುಗುಕ್ಕೆ": [{"type": "noun", "defs": ["= ಮುಸುಕಿ."]}], "ಮುಸುಗುಟ್ಟು": [{"type": "verb", "defs": ["= ಮುಸುಗರೆ.", "to utter somethng indistinctly in low tone, as if talking to oneself, from disgut, disappointment, anger, etc."]}], "ಮುಸುಗುಡು": [{"type": "verb", "defs": ["= ಮುಸುಗುಟ್ಟು."]}], "ಮುಸುಗುಬ್ಬಸ": [{"type": "noun", "defs": ["an intense feeling of suffering, acute mental pain that cannot be or is not expressed."]}], "ಮುಸುಟೆ": [{"type": "noun", "defs": ["the tree Strychnos nux-vomica of Loganiaceae family and its poisonous nut containing strychnine, brucine and other alkaloids; nux-vomica.", "the plant Argyreia nervosa ( = A. speciosa) of Convolvulaceae family.", "another plant Argyreia malabarica of the family.", "the grass Panicum italica of Poaceae family."]}], "ಮುಸುಡ": [{"type": "noun", "defs": ["= ಮುಸುಂಡಿ3."]}], "ಮುಸುಡಿ": [{"type": "noun", "defs": ["the projecting nose and jaws or muzzle, of an animal; the snout.", "(derog.) the face of a person.", "the mouth.", "the bill of a bird.", "the nose or either of the nostrils of a horse."]}, {"type": "noun", "defs": ["= ಮುಸುಂಡಿ3."]}], "ಮುಸುಡಿಕ್ಕು": [{"type": "verb", "defs": ["to push one's snout forward (said of an animal)."]}], "ಮುಸುಡಿಡು": [{"type": "verb", "defs": ["= ಮುಸುಡಿಕ್ಕು.", "to put one's face on, forwrd or by the side of."]}], "ಮುಸುಡು": [{"type": "noun", "defs": ["= ಮುಸುಡಿ1."]}], "ಮುಸುಡುದೆಗೆ": [{"type": "verb", "defs": ["to turn one's face aside.", "(fig.) to pay no heed; to reject; to treat with slight."]}], "ಮುಸುಡುದೋಱು": [{"type": "verb", "defs": ["to show one's presence; to appear before."]}], "ಮುಸುಡೆ": [{"type": "noun", "defs": ["= ಮುಸುಡಿ1."]}], "ಮುಸುಣಿ": [{"type": "noun", "defs": ["= ಮುಸುಡಿ1."]}], "ಮುಸುದೆ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಮುಸುಮೊಗ": [{"type": "noun", "defs": ["an ugly face."]}], "ಮುಸುರ್": [{"type": "verb", "defs": ["= ಮುಸುರು1."]}], "ಮುಸುರಿಡು": [{"type": "verb", "defs": ["to encircle on all or nearly all sides; to surround."]}], "ಮುಸುರು": [{"type": "verb", "defs": ["to spread oneself over, on something as to cover it completely.", "(bees, house-flies, etc.) to throng upon somethng in a large number.", "to come to gather together in a large number.", "to cover or envelop all over."]}, {"type": "noun", "defs": ["anything that covers, conceals something by spreading over."]}, {"type": "noun", "defs": ["an incessant rain."]}], "ಮುಸುರುಗಟ್ಟು": [{"type": "verb", "defs": ["the rheum of the eye to be discharged excessively and deposited in the eye."]}], "ಮುಸುರೆ": [{"type": "noun", "defs": ["the pollution caused by touching boiled rice or other cooked food or the vessels in which they are cooked or kept (before being washed).", "a vessel in which food is cooked or cooked food is kept or the one which has come into contact with it (before being washed).", "any cooked food.", "kitchen waste used as a cattle feed."]}], "ಮುಸುರ್ಪು": [{"type": "noun", "defs": ["the cloud that is likely to rain."]}], "ಮುಸುರ್ಪುಗಟ್ಟು": [{"type": "verb", "defs": ["(the rainy clouds) to cover the sky."]}], "ಮುಸುಲಮಾನ": [{"type": "noun", "defs": ["= ಮುಸುಲ್ಮಾನ."]}], "ಮುಸುಲುಮ": [{"type": "adjective", "defs": ["= ಮುಸ್ಲಿಂ1."]}, {"type": "noun", "defs": ["= ಮುಸುಲ್ಮಾನ."]}], "ಮುಸುಲುಮಾನ": [{"type": "noun", "defs": ["= ಮುಸುಲ್ಮಾನ."]}], "ಮುಸುಲ್ಮಾನ": [{"type": "noun", "defs": ["an adherent of Islam; a mussulman; a muslim."]}], "ಮುಸುವ": [{"type": "noun", "defs": ["the lanky, long-tailed monkey Presbytis entellius; common langur."]}], "ಮುಸುವನಭತ್ತ": [{"type": "noun", "defs": ["a kind of paddy ."]}], "ಮುಸುವು": [{"type": "noun", "defs": ["= ಮುಸುವ."]}], "ಮುಸುಳಿ": [{"type": "noun", "defs": ["= ಮುಸುಡಿ1."]}], "ಮುಸುಱ್": [{"type": "verb", "defs": ["= ಮುಸುರು1."]}], "ಮುಸುಱು": [{"type": "verb", "defs": ["= ಮುಸುರು1."]}, {"type": "noun", "defs": ["= ಮುಸುರು2."]}], "ಮುಸುಱುಹ": [{"type": "noun", "defs": ["the act of covering, enveloping, surrounding, etc."]}], "ಮುಸುಱೆ": [{"type": "noun", "defs": ["= ಮುಸುರೆ."]}], "ಮುಸ್ತ": [{"type": "noun", "defs": ["the sedge plant Cyperus rotundus ( = C. hexastachyus) of Cyperaceae family."]}], "ಮುಸ್ತಕ": [{"type": "noun", "defs": ["= ಮುಸ್ತ.", "a kind of vegetable poison."]}], "ಮುಸ್ತಕಿ": [{"type": "noun", "defs": ["= ಮುಸ್ತ."]}], "ಮುಸ್ತಯಿದೆ": [{"type": "noun", "defs": ["= ಮುಸ್ತೈದೆ."]}], "ಮುಸ್ತಾಕಂದ": [{"type": "noun", "defs": ["the root of the sedge plant Cyperus rotundus of Cyperaceae family."]}]}