{"ಪರೆಯ": [{"type": "noun", "defs": ["a man belonging to the mādiga caste.", "the caste itself."]}, {"type": "noun", "defs": ["the condition of being young.", "the time of being young.", "the time that a person has existed since birth; age."]}], "ಪರೆಯಿಸು": [{"type": "verb", "defs": ["to cause to fill the entire area or to become spread over a wide area.", "to remove completely or prevent from happening.", "to scatter to throw around losely.", "to bring to an end; to close."]}], "ಪರೆಯುಚ್ಚು": [{"type": "verb", "defs": ["= ಪರೆಬಿಡು."]}], "ಪರೇಂಗಿತ": [{"type": "noun", "defs": ["a conveying of information, direction, warning, command, etc. through a sign or gesture.", "another's feelings, thought (not explicitly conveyed)."]}], "ಪರೇಂಗಿತಜ್ಞ": [{"type": "noun", "defs": ["he who can understand another's feelings, thoughts etc. without being explicitly told."]}], "ಪರೇಂಗಿತಜ್ಞೆ": [{"type": "noun", "defs": ["she who can understand another's feelings, thoughts etc. without being explicitly told."]}], "ಪರೇಡ್": [{"type": "noun", "defs": ["= ಪರೇಡು."]}], "ಪರೇಡು": [{"type": "noun", "defs": ["any organised procession, march or display, by a military or police force."]}], "ಪರೇತ": [{"type": "adjective", "defs": ["no longer living; having died; dead.", "departed; gone away; bygone."]}, {"type": "noun", "defs": ["the body of a person who has died; corpse.", "a person who has died.", "a supernatural being, esp. one thought of as haunting or possessing a person, house, etc., as a ghost or as inhabiting a certain region; a spirit."]}], "ಪರೇತಕೃತ್ಯ": [{"type": "noun", "defs": ["funeral rites or ceremonies."]}], "ಪರೇತಪತಿ": [{"type": "noun", "defs": ["(myth.) Yama, the God of Death."]}], "ಪರೇತವನ": [{"type": "noun", "defs": ["a cemetery or crematorium; a graveyard; a burial ground."]}], "ಪರೇರಬೇರು": [{"type": "noun", "defs": ["the plant Cissampelos pareira ( = C. convolvulaceae) of Menispermaceae family; false pareira root."]}], "ಪರೇಲ್": [{"type": "noun", "defs": ["a kind of card-game."]}], "ಪರೇಶ": [{"type": "noun", "defs": ["the Supreme Being; the Almighty."]}], "ಪರೇಶ್ವರ": [{"type": "noun", "defs": ["= ಪರೇಶ."]}], "ಪರೇಷ್ಟುಕೆ": [{"type": "noun", "defs": ["a cow that has calved many a time."]}], "ಪರೈಧಿತ": [{"type": "noun", "defs": ["a man fostered by another (other than his parents).", "a servant; an attendant."]}], "ಪರೋಕ್ಷ": [{"type": "adjective", "defs": ["not seen; that cannot be seen or perceived; imperceptible; invisible."]}, {"type": "noun", "defs": ["the quality or fact of being invisible or beyond the power of sight; invisibility.", "that which cannot be seen.", "end of life; death.", "the condition of being secret or concealed; secrecy.", "(jain.) knowledge derived through the mind and sensual organs.", "(Viśiṣṭādvaita phil.) knowledge that cannot be perceived through sensual organs."]}], "ಪರೋಕ್ಷಕ್ರಿಯೆ": [{"type": "noun", "defs": ["= ಪರೇತಕೃತ್ಯ."]}], "ಪರೋಕ್ಷಜ್ಞಾನ": [{"type": "noun", "defs": ["= ಪರೋಕ್ಷ2 - 5.", "knowledge of things that are beyond the range of sensual organs, esp. sight."]}], "ಪರೋಕ್ಷಪ್ರಮಾಣ": [{"type": "noun", "defs": ["= ಪರೋಕ್ಷ2 - 5.", "a proof that cannot be verified by sensual organs."]}], "ಪರೋಕ್ಷವಿನಯ": [{"type": "noun", "defs": ["(jain.) homage paid to a venerable person after his or her death."]}], "ಪರೋಕ್ಷವಿನೆಯ": [{"type": "noun", "defs": ["= ಪರೋಕ್ಷವಿನಯ."]}], "ಪರೋಕ್ಷವಿನೆಯಂಗೆಯ್": [{"type": "verb", "defs": ["(jain.) to pay homage to a venerable person after his or her deth."]}], "ಪರೋಕ್ಷಸಾಕ್ಷ್ಯ": [{"type": "noun", "defs": ["= ಪರೋಕ್ಷಪ್ರಮಾಣ."]}], "ಪರೋಟಾ": [{"type": "noun", "defs": ["a kind of cake made of wheat dough."]}], "ಪರೋಟು": [{"type": "noun", "defs": ["a wood-cutting machine.", "the waste piece of wood remaining after it is sawn for planks."]}], "ಪರೋತ್ತಮ": [{"type": "noun", "defs": ["the superior, pre-eminent being; the Supreme Being."]}], "ಪರೋಪಕಾರ": [{"type": "noun", "defs": ["the act of assisting, helping or working for the welfare of, others without having any selfish motive."]}], "ಪರೋಪಕಾರಿ": [{"type": "noun", "defs": ["a person who helps, assists, works for the benefit, welfare of others without having any selfish motive; an altruistic person."]}], "ಪರೋಪಜೀವಿ": [{"type": "noun", "defs": ["a person, plant or any other organism that relies on another for support, aid, food, etc. without recompensing the host; a parasite."]}], "ಪರೋಪದೇಶಪಾಂಡಿತ್ಯ": [{"type": "noun", "defs": ["the tendency of advising others, without oneself following or adhering to such advices."]}], "ಪರೋಷ್ಣಿ": [{"type": "noun", "defs": ["any of an order (Blattaria) of insects with long antennae and a flat, soft body, some species of which are common household pests; a cockroach."]}], "ಪರ್ಕಟಿ": [{"type": "noun", "defs": ["the ficus tree Ficus virens ( = F. infectoria) of Moraceae family; five-leaved fig tree."]}], "ಪರ್ಕಿಸು": [{"type": "verb", "defs": ["to look at or into critically or methodically in order to find out the facts, condition, etc. of; to examine; to test.", "to employ one's mind rationally and objectively in evaluating or dealing with a given situation; to think.", "to see, watch carefully or with attention.", "to remove impurities, dirt, unwanted adultrants, etc.; to clean."]}], "ಪರ್ಗಣ": [{"type": "noun", "defs": ["an administrative division of a country or state; a district."]}], "ಪರ್ಗನ": [{"type": "noun", "defs": ["= ಪರ್ಗಣ."]}], "ಪರ್ಗುಣ": [{"type": "noun", "defs": ["= ಪರ್ಗಣ."]}], "ಪರ್ಚಿಸು": [{"type": "verb", "defs": ["to utter a slander about."]}, {"type": "verb", "defs": ["to unite two things by or as by welding.", "to get fastened, attached to (another).", "to spread or daub (an oil, grease, ointment, etc.) on or over something; to smear.", "to light a candle, lamp, stove, etc.", "to cause to daub or smear.", "to cause to put a plant firmly into the ground to grow."]}], "ಪರ್ಚು": [{"type": "verb", "defs": ["to talk quietly or furtively, as in telling a secret; to whisper.", "to utter a slander about.", "to utter a soft, rustling sound like a whisper."]}, {"type": "verb", "defs": ["to cause two or more things join together.", "to stick or attach oneself to.", "to daub, smear oneself with.", "to apply, daub (an oil, grease,ointment, etc.) on or over something; to smear.", "to light a lamp, candle, stove, etc.", "to start; to begin; to commence.", "to put a plant into the ground firmly to grow."]}, {"type": "noun", "defs": ["something whispered (as a secret); that which is uttered furtively."]}], "ಪರ್ಚುಕೊಳ್": [{"type": "verb", "defs": ["= ಪರ್ಚುಗೊಳ್."]}], "ಪರ್ಚುಗುಡು": [{"type": "verb", "defs": ["= ಪರ್ಚುಗೊಡು."]}], "ಪರ್ಚುಗೂಂಟ": [{"type": "noun", "defs": ["a nail or hook to hang a photo."]}], "ಪರ್ಚುಗೊಡು": [{"type": "verb", "defs": ["to divide (something) and distribute between or among."]}], "ಪರ್ಚುಗೊಳ್": [{"type": "verb", "defs": ["to divide (something) and distribute among and get a share."]}], "ಪರ್ಜನಿ": [{"type": "noun", "defs": ["the plant Curcuma xanthorrhiza of zingiberaceae family."]}], "ಪರ್ಜನ್ಯ": [{"type": "noun", "defs": ["a cloud.", "the rumbling sound following a flash of lightning, from clouds; thunder.", "rain.", "(myth.) Indra, the Rain-God.", "Viṣṇu.", "(myth.) one of the twelve Ādityās, a class of gods."]}], "ಪರ್ಜನ್ಯಗರ್ಜನ": [{"type": "noun", "defs": ["the rumbling sound of thunder."]}], "ಪರ್ಜನ್ಯಜಪ": [{"type": "noun", "defs": ["a religious service, chanting certain mystic hymns, to please the Rain-God for getting sufficient rain; a prayer for rain."]}], "ಪರ್ಜನ್ಯಾಸ್ತ್ರ": [{"type": "noun", "defs": ["a mystic missile when hurled at brings heavy rain on the target."]}], "ಪರ್ಜಿ": [{"type": "noun", "defs": ["name of one of the Dravidian languages.", "people speaking this language."]}], "ಪರ್ಣ": [{"type": "noun", "defs": ["a wing of a bird.", "a leaf of a plant, in gen.", "in particular, a leaf of betal plant.", "the tree Butea frondosa of Papilionaceae family; bastard teak."]}], "ಪರ್ಣಕುಟಿ": [{"type": "noun", "defs": ["a house made using plant materials (as leaves, twigs, straw, etc.) as of a hermit in a forest."]}], "ಪರ್ಣಕುಟೀರ": [{"type": "noun", "defs": ["= ಪರ್ಣಕುಟಿ."]}], "ಪರ್ಣಗೃಹ": [{"type": "noun", "defs": ["= ಪರ್ಣಕುಟಿ."]}], "ಪರ್ಣದ್ರುಮ": [{"type": "noun", "defs": ["= ಪರ್ಣ - 4."]}], "ಪರ್ಣಪುಟ": [{"type": "noun", "defs": ["a cup made of leaves of a certain plants, used to hold food, water, etc."]}], "ಪರ್ಣಪುಟಿಕೆ": [{"type": "noun", "defs": ["= ಪರ್ಣಪುಟ."]}], "ಪರ್ಣಭವನ": [{"type": "noun", "defs": ["= ಪರ್ಣಕುಟಿ."]}], "ಪರ್ಣಭೋಜನ": [{"type": "noun", "defs": ["the eating of leaves of certain plants as food or food made of only of plant leaves.", "that which lives on plant leaves (as goat)."]}], "ಪರ್ಣಮಂದಿರ": [{"type": "noun", "defs": ["= ಪರ್ಣಕುಟಿ."]}], "ಪರ್ಣಲಘು": [{"type": "noun", "defs": ["a mystic power or art of making, at will, one's body very light."]}], "ಪರ್ಣವಿಕ್ರಯಿ": [{"type": "noun", "defs": ["a woman who sells betal leaves."]}], "ಪರ್ಣಶಾಲೆ": [{"type": "noun", "defs": ["= ಪರ್ಣಕುಟಿ."]}], "ಪರ್ಣಾಸ": [{"type": "noun", "defs": ["the basil plant Ocimum basilicum of Lamiaceae family; sweet basil."]}], "ಪರ್ಣಾಹಾರ": [{"type": "noun", "defs": ["= ಪರ್ಣಭೋಜನ."]}], "ಪರ್ತ": [{"type": "adverb", "defs": ["to or toward the rear.", "to or toward a former position or location.", "into or toward a previous condition."]}], "ಪರ್ತಿ": [{"type": "noun", "defs": ["the soft, white seed hairs filling the seedpods of the plant Gossypium arboreum ( = G. nanking, = G. purpurascence) of Malvaceae family; cotton.", "the plant itself."]}], "ಪರ್ದಿಷ್ಟ": [{"type": "noun", "defs": ["the handing down of statements, beliefs, legends, customs, information, etc., from generation to generation, esp. by word of mouth or by practice; tradition."]}], "ಪರ್ದು": [{"type": "noun", "defs": ["any of various accipitrine birds with long, pointed wings and, usu., a forked tail, which prey esp. on insects, reptiles, and small mammals; a kite.", "the kite, Haliastur indus of Accipitridae family, with whie head, neck and breast, strong, curved beak, bright brown wings , forked tail, (regarded as the vehicle of Viṣṇu); Brahmini kite."]}], "ಪರ್ದುದೇರ": [{"type": "noun", "defs": ["(myth.) Viṣṇu, whose vehicle is Garuḍa, the Brahmini kite."]}], "ಪರ್ದುವೇರ್": [{"type": "noun", "defs": ["the plant Ophiorrhiza mungos of Rubiacee family; Indian snake root.", "the plant Rauvolfia serpentina ( = Ophioxylon serpentium of Apocynaceae family; small moonplant."]}], "ಪರ್ನ": [{"type": "noun", "defs": ["= ಪರ್ಣ."]}], "ಪರ್ನಕರ್ಪೂರ": [{"type": "noun", "defs": ["a variety of camphor that is used in foods and drugs; camphor cinnamon.", "the tree yielding this Cinnamomum camphora of Lauraceae family."]}], "ಪರ್ನಕುಟಿ": [{"type": "noun", "defs": ["= ಪರ್ಣಕುಟಿ."]}], "ಪರ್ನಶಾಲೆ": [{"type": "noun", "defs": ["= ಪರ್ಣಕುಟಿ."]}], "ಪರ್ಪಟ": [{"type": "noun", "defs": ["= ಪರ್ಪಟಕ.", "a small, round sheet made of flours of certain corns using spices, and kept dried, which is used for taste, after frying in oil."]}], "ಪರ್ಪಟಕ": [{"type": "noun", "defs": ["the plant Oldenlandia biflora of Rubiaceae family."]}], "ಪರ್ಪಟಿ": [{"type": "noun", "defs": ["the fig tree Ficus virens ( = F. infectoria) of Moraceae family; five leaved fig tree."]}], "ಪರ್ಪರ": [{"type": "noun", "defs": ["the quality of being harsh or rough."]}], "ಪರ್ಪರಿಕೆ": [{"type": "noun", "defs": ["= ಪರ್ಪರ."]}], "ಪರ್ಪರಿಕೆಗಿಡು": [{"type": "verb", "defs": ["to lose the quality of harshness; to become smooth."]}], "ಪರ್ಪರೀಕ": [{"type": "noun", "defs": ["the sun.", "fire.", "a pond, lake, etc."]}], "ಪರ್ಪಾಟಕ": [{"type": "noun", "defs": ["the plant Glossocardia bosvallea of Asteraceae family.", "the plant Mollugocerviana of Aizoaceae family.", "another plant of the same family Mollugo nudicaulis."]}], "ಪರ್ಪಾಣಿ": [{"type": "noun", "defs": ["= ಪರ್ಪಾಟಕ - 2."]}], "ಪರ್ಪಾಷ್ಟಕ": [{"type": "noun", "defs": ["= ಪರ್ಪಾಟಕ."]}], "ಪರ್ಬ": [{"type": "noun", "defs": ["any of the festivals observed on days of conjunctions, as full moon-day, new moon-day, the days of solstices, etc.", "a time or day of feasting or celebration; a festival day.", "(fig.) joy; delight.", "a feast arranged on festival days, days of social gatherings, etc.", "a joint of the body.", "(fig.) heavy punishment or chastisement."]}], "ಪರ್ಬತ": [{"type": "noun", "defs": ["a naturally raised part of the earth's surface, usu. rising more or less abruptly, and larger than a hill; a mountain."]}], "ಪರ್ಬಿಸು": [{"type": "verb", "defs": ["to cause (fame, a creeper, etc.) to spread, extend over a wide area.", "to cause to happen, occur or come to existence.", "to make publicly known; to promulgate; to publish.", "to spread, extend (oneself) over a wide area."]}], "ಪರ್ಬು": [{"type": "verb", "defs": ["to cause to be spread, distributed over or pervade throughout a relatively large area.", "to spread (information, gossip, etc.) widely.", "to scatter in all directions or in a disorder manner.", "to spread (oneself) widely.", "to drive away or force to go.", "to be disarranged and untidy; to be dishevelled.", "to stretch forward or hold out.", "to extend over; to overlay or cover.", "open or exetend (something as a mat on a flat surface); to unroll.", "to do; to accomplish; to complete.", "to ascend; to climb up.", "to become more in number, degree, extent, inensity, etc.", "to become broader or wider.", "to be elated from excess joy, pride, etc.", "to appear; to be published; to become known.", "to express; to make known.", "to cause to flow (as a liquid); to let something flow."]}, {"type": "noun", "defs": ["the fact of being spread over a wide area.", "the measure of a bounded region on a plane or the surface of a solid; area.", "a wide, open field.", "the act of being distributed.", "the act, fact or manner of following (as a stream); a flow.", "the state or quality of being ample; abundance; amplitude.", "any plant whose stem puts out tendrils by which it can creep along a surface as it grows; a creeper.", "the pepper plant, Piper betle, the leaves of which are chewed with other ingredients; betel plant.", "a rope used to kill by hanging a criminal by tying it about the neck and suddenly suspending the body.", "extent from one end to another; length.", "a territorial range.", "a division of a city; an extension; a ward; a quarter."]}], "ಪರ್ಬುಗೆ": [{"type": "noun", "defs": ["the space, amount or degree to which a thing extends; extent.", "an extended space; vast area.", "the fact of being spread over a vast area.", "a flight of steps; stairway; stairs.", "the process of growing or developing; gradual development toward maturity; growth.", "abundance; copiousness; plentifulness.", "a number of people or things arranged so as to form a line; a row."]}], "ಪರ್ಬುಗೆಡು": [{"type": "verb", "defs": ["to become less in extent.", "(vastness) to be limited."]}], "ಪರ್ಬುಗೊಳ್": [{"type": "verb", "defs": ["to become wider or broader; (vastness) to increase.", "to be stretched; to be held out."]}], "ಪರ್ಯ": [{"type": "noun", "defs": ["a defensive shield made of of the stems of rattan trees."]}], "ಪರ್ಯಂಕ": [{"type": "noun", "defs": ["a piece of furniture with four legs, a flat, rectangular top to lay the bed and sleep on; a cot.", "a box-type rectangular cloth case filled with cotton, coir, feathers, down, foam, rubber, etc. used to sleep on; a bed.", "a passenger conveyance, usu. for one person, consisting of a covered or boxlike litter carried by means of poles resting on the shoulders of several men; a palanquin.", "an oblong, unstitched piece of cloth, used to tie around the waist.", "the place of protection; shelter; refuge.", "a yogic posture of squating on the floor with the shanks crossing each other and the right foot resting on the left thigh and leftfoot on the right thigh."]}], "ಪರ್ಯಂಕಾಸನ": [{"type": "noun", "defs": ["= ಪರ್ಯಂಕ - 6"]}], "ಪರ್ಯಂಕಿಕೆ": [{"type": "noun", "defs": ["= ಪರ್ಯಂಕ - 1."]}], "ಪರ್ಯಂತ": [{"type": "noun", "defs": ["the part or edge of a surface or area that forms its outer boundary; border.", "nearness; proximity.", "the outskirts of a town or city."]}, {"type": "adverb", "defs": ["up to the time of; till (a specified time or occurrence of something); until; till."]}], "ಪರ್ಯಂತಂ": [{"type": "adverb", "defs": ["= ಪರ್ಯಂತ2."]}], "ಪರ್ಯಂತರ": [{"type": "noun", "defs": ["a period of time between points of time, events, etc.; period; interval.", "a space between two things; interval; distance.", "the time following certain point of time or an event."]}, {"type": "adverb", "defs": ["= ಪರ್ಯಂತ2."]}], "ಪರ್ಯಂತರಂ": [{"type": "adverb", "defs": ["= ಪರ್ಯಂತ2."]}], "ಪರ್ಯಟಕ": [{"type": "noun", "defs": ["a man who travels or is travelling.", "a man who has travelled widely abroad; a traveller."]}], "ಪರ್ಯಟನ": [{"type": "noun", "defs": ["the act of going about; wandering.", "the act or process of traveling; travel.", "the trips, journeys, tours, etc. taken by a person or persons; travel.", "(jain.) a going about of a Jaina mendicant for receiving food from householders."]}], "ಪರ್ಯಟನೆ": [{"type": "noun", "defs": ["= ಪರ್ಯಟನ."]}], "ಪರ್ಯಣ": [{"type": "noun", "defs": ["= ಪರ್ಯಾಣ1."]}], "ಪರ್ಯನುಯೋಗ": [{"type": "noun", "defs": ["a cunning, outwitting question."]}], "ಪರ್ಯಯ": [{"type": "noun", "defs": ["the act or an instance of surrounding, enclosing.", "a passing away of time; lapse of time.", "change in the common practices, fashion, vogue, mode, etc. with the passage of time.", "a change in the condition, nature or function of (something) a changing; mutation; alteration.", "the condition of being contrary to the usual, natural order or system.", "the act or an instance of overstepping or breaking of established custom or customs.", "a neglect of or failure in, duty; a being remiss; dereliction."]}], "ಪರ್ಯಯಣ": [{"type": "noun", "defs": ["= ಪರ್ಯಯ - 1.", "a seat for the rider on a horse, usu. padded and of leather."]}], "ಪರ್ಯವಲೋಕನ": [{"type": "noun", "defs": ["a studying thoughtfully and critically as to find the merit, importance, worth, etc."]}], "ಪರ್ಯವಸಾನ": [{"type": "noun", "defs": ["a ceasing or stopping for ever; the end; cessation.", "the act of making up one's mind or taking a firm decision."]}], "ಪರ್ಯವಸಾಯಿ": [{"type": "noun", "defs": ["that which ends or is ending with (something)."]}], "ಪರ್ಯವಸಿತ": [{"type": "adjective", "defs": ["ended; finished; concluded.", "destroyed; defunct; dead; extinct.", "resolved; settled; decided."]}], "ಪರ್ಯವಸ್ಥೆ": [{"type": "noun", "defs": ["the act of opposing; opposition; resistance; hostility."]}], "ಪರ್ಯಷ್ಟಿ": [{"type": "noun", "defs": ["the act or an instance of treating others, esp. guests, in a courteous and hospitable manner; service; hospitality."]}], "ಪರ್ಯಷ್ಟಿಗೆಯ್": [{"type": "verb", "defs": ["to treat courteously and hospitably."]}], "ಪರ್ಯಸ್ತ": [{"type": "adjective", "defs": ["hanging loosely or in disorder; unkempt; dishevelled.", "encircled; surrounded."]}, {"type": "noun", "defs": ["collectively, ten particular co-ordinated movements of hands and feet, performed successively."]}], "ಪರ್ಯಸ್ತಕ": [{"type": "noun", "defs": ["= ಪರ್ಯಸ್ತ2."]}], "ಪರ್ಯಸ್ತಿ": [{"type": "noun", "defs": ["= ಪರ್ಯಂಕ - 1."]}], "ಪರ್ಯಸ್ತಿಕ": [{"type": "noun", "defs": ["= ಪರ್ಯಂಕ - 1."]}], "ಪರ್ಯಸ್ತಿಕೆ": [{"type": "noun", "defs": ["= ಪರ್ಯಂಕ - 1, 2 & 4."]}], "ಪರ್ಯಾಕುಲ": [{"type": "noun", "defs": ["distress or uneasiness of mind caused by fear of danger or misfortune; anxiety."]}], "ಪರ್ಯಾಣ": [{"type": "noun", "defs": ["a smooth, round, flat, relatively thin piece of metal, with a rim of low level around; a plate.", "a big metal container or utensil.", "a food offered to a deity.", "a cover, either hinged or unattached, as for a box, pot, etc."]}, {"type": "noun", "defs": ["a seat for a rider on a horse, usu. padded and of leather."]}], "ಪರ್ಯಾಣಕ": [{"type": "noun", "defs": ["a horse that is made ready with a seat for a rider."]}], "ಪರ್ಯಾತೀತ": [{"type": "adjective", "defs": ["filled excessively with; loaded to the maximum extent; burdened heavily."]}], "ಪರ್ಯಾಪ್ತ": [{"type": "adjective", "defs": ["got; received.", "concluded; ended; finished.", "complete; entire; whole.", "filled to capacity; having absorbed all that can be taken up; full or saturated.", "satiated; sated; over satisfied."]}, {"type": "noun", "defs": ["that which is concluded, finished or ended.", "the quality or state of being filled completely with; fullness.", "a man perfect in all respects.", "a satisfying or being satisfied fully; satisfaction.", "abundance; plenitude; plentfulness."]}], "ಪರ್ಯಾಪ್ತಂ": [{"type": "adverb", "defs": ["immediately; suddenly.", "honestly; sincerely; without deceit, pretence or hypocrisy.", "saturatedly; in a condition not requiring, not being able to take in, any more."]}], "ಪರ್ಯಾಪ್ತಕ": [{"type": "noun", "defs": ["(jain.) a fully developed, matured condition in the physical manifestation of the soul."]}], "ಪರ್ಯಾಪ್ತಜೀವ": [{"type": "noun", "defs": ["= ಪರ್ಯಾಪ್ತಕ."]}], "ಪರ್ಯಾಪ್ತತೆ": [{"type": "noun", "defs": ["the condition of having all that is required in sufficient quantity.", "the state of being fully satisfied; complete satisfaction.", "the quality or state of being fully charged, supplied, filled completely with or having obsorbed (a liquid, etc.) to the maximum capacity."]}], "ಪರ್ಯಾಪ್ತಯೋಗ": [{"type": "noun", "defs": ["he who has completed successfully one's austere meditation."]}], "ಪರ್ಯಾಪ್ತಿ": [{"type": "noun", "defs": ["the act or fact of attaining, obtaining; acquisition.", "an act or instance of concluding; end; conclusion; close.", "the condition or quality of being competent; ability; competence.", "a saturating or being saturated; a being completely satisfied; full satisfaction.", "the condition of being pervaded, diffused or spread throughout.", "abundance; plenitude; plentifulness.", "a guarding or protecting from being hit, damaged, etc.", "a protecting of oneself (from danger, assault, etc.).", "(jain.) a fully developed, matured condition in the physical manifestation of the soul."]}], "ಪರ್ಯಾಯ": [{"type": "noun", "defs": ["a wandering or going to fro.", "the act of succeeding or coming after another in order or sequence; succession.", "a passing away of time; lapse of time.", "the act of periodic recurring; an instance of this; reoccurrence; recurrence.", "the right, duty or opportunity to do something, esp. as coming to each of a number of people in regular order; one's turn.", "an established way of doing something including orderliness or methodical planning and carrying it out; a system.", "a way of doing anything; mode; procedure; a method.", "a word having the same or nearly the same meaning in one or more senses as another in the same language; a synonym.", "the end; termination; conclusion.", "an alternative way, method.", "an alternative form.", "the quality or condition of being peculiar; peculiarity.", "an opportunity; an occasion.", "in Uḍupi in Karnāṭaka, the system of passing the rights of worshipping Křṣṇa, once in two years, among the heads of eight Mādhva maṭhas (the religious monasteries).", "the act and process of constructing; construction.", "anything separated or distinguished from the whole or from the larger unit of which it is a part; a section; a division.", "the act of discriminating or distinguishing differences; discrimination.", "(rhet.) a kind of figure of speech; (write specifics).", "(rhet.); a figure of speech in which the intention is conveyed through an alternate expression without directly refering to the intended one."]}], "ಪರ್ಯಾಯಂದಪ್ಪು": [{"type": "verb", "defs": ["to lose or miss the correct or natural order."]}], "ಪರ್ಯಾಯದ್ವೀಪ": [{"type": "noun", "defs": ["a land area that is covered on all sides, but one, by a water body; a peninsula."]}], "ಪರ್ಯಾಯನಾಮ": [{"type": "noun", "defs": ["an alternative name, title or appellation."]}], "ಪರ್ಯಾಯಪದ": [{"type": "noun", "defs": ["a word or term that can be substituted for another without changing the sense of the total expression; an alternative word or term."]}], "ಪರ್ಯಾಯಪಾಠ": [{"type": "noun", "defs": ["an alternative reading that is available for an old manuscript."]}], "ಪರ್ಯಾಯಪಾರಿತೋಷಕ": [{"type": "noun", "defs": ["a shield, trophy won by a person or team in a sport, competition, etc., that is to be handed over to another person or team that wins in the same event in the following occasion; a rolling shield."]}], "ಪರ್ಯಾಯವಚ": [{"type": "noun", "defs": ["= ಪರ್ಯಾಯ - 19."]}], "ಪರ್ಯಾಯಶಬ್ದ": [{"type": "noun", "defs": ["= ಪರ್ಯಾಯಪದ."]}], "ಪರ್ಯಾಯಸ್ಥ": [{"type": "noun", "defs": ["the head of a Mādhva maṭh, who is having the right to worship Kriṣṇa, for a continuous period of two years, which right passes on to the head of another maṭh after the period."]}], "ಪರ್ಯಾಯಾಲಂಕಾರ": [{"type": "noun", "defs": ["= ಪರ್ಯಾಯ - 18."]}], "ಪರ್ಯಾಯೋಕ್ತ": [{"type": "noun", "defs": ["= ಪರ್ಯಾಯ - 19.", "(rhet.) an expression used as a cover-up concealing the real intention."]}], "ಪರ್ಯಾಯೋಕ್ತಿ": [{"type": "noun", "defs": ["= ಪರ್ಯಾಯೋಕ್ತ."]}], "ಪರ್ಯಾಲೋಚನ": [{"type": "noun", "defs": ["= ಪರ್ಯಾಲೋಚನೆ."]}], "ಪರ್ಯಾಲೋಚನೆ": [{"type": "noun", "defs": ["a concerted and serious thought and deep reflection on a subject; cogitation."]}], "ಪರ್ಯಾಲೋಚಿತ": [{"type": "adjective", "defs": ["considered with serious thought and deep reflection; cogitated."]}], "ಪರ್ಯಾಲೋಚಿಸು": [{"type": "verb", "defs": ["to think seriously and deeply (about); to ponder; to cogitate."]}], "ಪರ್ಯಾಸ": [{"type": "noun", "defs": ["an act or instance of concluding; the end; conclusion.", "a turning or spinning motion of a body around a center or axis; rotation.", "the condition of being contrary to the usual, natural order or system."]}], "ಪರ್ಯಾಹಾರ": [{"type": "noun", "defs": ["a bamboo, split length-wise, with slings on both sides for carrying burden, across the shoulder.", "a burden carried on the head.", "the act of conveying; conveyance."]}], "ಪರ್ಯಾಳ": [{"type": "noun", "defs": ["= ಪರ್ಯಾಣ1."]}], "ಪರ್ಯಾಳೋಚನ": [{"type": "noun", "defs": ["= ಪರ್ಯಾಲೋಚನೆ."]}], "ಪರ್ಯಾಳೋಚನೆ": [{"type": "noun", "defs": ["= ಪರ್ಯಾಲೋಚನೆ."]}], "¥Àರ್ಯಾಳೋಚಿತ": [{"type": "adjective", "defs": ["= ಪರ್ಯಾಲೋಚಿತ."]}], "ಪರ್ಯಾಳೋಚಿಸು": [{"type": "verb", "defs": ["= ಪರ್ಯಾಲೋಚಿಸು."]}], "ಪರ್ಯುತ್ಸುಕ": [{"type": "noun", "defs": ["a man man having or showing anxiety; a worried, anxious man."]}], "ಪರ್ಯುದಂಚ£À": [{"type": "noun", "defs": ["something owed by one person to another or others; a loan."]}], "ಪರ್ಯುಪಾಸ್ತಿ": [{"type": "noun", "defs": ["the work done or duty performed for another; a serving of a deity or a child, venerable or sick person; service."]}], "ಪರ್ಯುಪಾಸ್ಯೆ": [{"type": "noun", "defs": ["= ಪರ್ಯುಪಾಸ್ತಿ."]}], "ಪರ್ಯುಪ್ತಿ": [{"type": "noun", "defs": ["a sowing of seeds for growing."]}], "ಪರ್ಯುಷಿತ": [{"type": "adjective", "defs": ["made or produced some time ago; not new; old."]}, {"type": "noun", "defs": ["a thing that is made or produced some time ago; an old thing."]}], "ಪರ್ಯೂಷಣ": [{"type": "noun", "defs": ["(jain.) a religious observance or rite, observed for ten days from the fifth day to the fourteenth day of the first fortnight of Bhādrapada, the sixth month of Hindu lunar calendar."]}], "ಪರ್ಯೂಷಣಪರ್ವ": [{"type": "noun", "defs": ["= ಪರ್ಯೂಷಣ."]}], "ಪರ್ಯೇಷಣೆ": [{"type": "noun", "defs": ["a searching for a right Brāhmaṇa, for the feast arranged on the day of annual ceremony of a deceased person.", "the duty of a servant to his master; service."]}], "ಪರ್ಲು": [{"type": "noun", "defs": ["(dial.) the various connections between peoples, countries, etc.; relations."]}], "ಪರ್ವ": [{"type": "noun", "defs": ["the act of joining, associating, bringing two or more things together; association.", "the hard joint of the stem of a plant (as of jowar, sugarcane, bamboo, etc.); a node.", "a place or part where two bones or corresponding structures are joined, so that they can move; a joint.", "any of the main divisions of a book; a chapter.", "any of the days of conjunctions, as full moon-day, new moon-day, the days of solstices, etc.", "an oblation, offering made on these festival days.", "a part or division of a whole.", "a time or day of feasting or celebration; a festival day.", "(fig.) joy; delight."]}], "ಪರ್ವಕಾಲ": [{"type": "noun", "defs": ["= ಪರ್ವ - 5.", "a period during which major or important changes take place that affects for a long time the life of an individual or a society, nation, etc.", "a period of festivals.", "the period of progress."]}], "ಪರ್ವಣಿ": [{"type": "noun", "defs": ["= ಪರ್ವ - 3, 5 & 8.", "a right or auspicious time."]}], "ಪರ್ವಣಿಕಾಲ": [{"type": "noun", "defs": ["= ಪರ್ವಣಿ - 4."]}], "ಪರ್ವತ": [{"type": "noun", "defs": ["a naturally raised part of the earth's surface, usu. rising more or less abruptly, and larger than a hill; a mountain.", "the Śrīśaila mountain, a holy pilgrim centre in Andhra Pradesh.", "a large stone detached from the mass; a rock or boulder.", "(math.) a symbol for the number seven."]}], "ಪರ್ವತಕಾಕ": [{"type": "noun", "defs": ["any of various large crows; esp., the largest crow (Corvus corax), with a straight, sharp beak; a jungle-crow; a raven."]}], "ಪರ್ವತನಾಥ": [{"type": "noun", "defs": ["= ಪರ್ವತರಾಜ."]}], "ಪರ್ವತಬಾಣ": [{"type": "noun", "defs": ["a mystical missile, when shot would drop huge rocks on the enemy force."]}], "ಪರ್ವತಬಾಳೆ": [{"type": "noun", "defs": ["the agave Agave americana of Agavaceae family."]}], "ಪರ್ವತರಾಜ": [{"type": "noun", "defs": ["Himālaya, the king of mountains.", "Śiva, the Lord of Kailāsa mountain."]}], "ಪರ್ವತವಳಿ": [{"type": "noun", "defs": ["a sect among Kāḷāmukha Śaivas."]}], "ಪರ್ವತಶ್ರೇಣಿ": [{"type": "noun", "defs": ["= ಪರ್ವತಾವಳಿ1."]}], "ಪರ್ವತಾರೋಹಕ": [{"type": "noun", "defs": ["= ಪರ್ವತಾರೋಹಿ."]}], "ಪರ್ವತಾರೋಹಕಿ": [{"type": "noun", "defs": ["(fem.) a mountain climber (usu. she who climbs for sport or as a hobby)."]}], "ಪರ್ವತಾರೋಹಣ": [{"type": "noun", "defs": ["the act, process or an instance of climbing a mountain or mountains; mountaineering."]}], "ಪರ್ವತಾರೋಹಿ": [{"type": "noun", "defs": ["(masc.) a mountain climber (usu. he who climbs for sport or as a hobby)."]}], "ಪರ್ವತಾವಳಿ": [{"type": "noun", "defs": ["a range of mountains stretching very long."]}, {"type": "noun", "defs": ["= ಪರ್ವತವಳಿ."]}], "ಪರ್ವರ್ಷ": [{"type": "noun", "defs": ["= ಪರ್ವರ್ಷಿ."]}], "ಪರ್ವರ್ಷಿ": [{"type": "noun", "defs": ["a bringing up with care; protective fostering.", "a prospering, thriving; success in life."]}], "ಪರ್ವಷಿ": [{"type": "noun", "defs": ["= ಪರ್ವರ್ಷಿ."]}], "ಪರ್ವಸಂಧಿ": [{"type": "noun", "defs": ["the point of time marking the end of a full-moon day new-moon day when the mooṇs phase starts increasing or decreasing."]}], "ಪರ್ವಳಿಸು": [{"type": "verb", "defs": ["to move or go aside."]}], "ಪರ್ವಾ": [{"type": "noun", "defs": ["anxious concern in a person or a thing that belongs to others.", "thoughtful consideration; careful attention.", "connection or manner of being connected or related; connection."]}], "ಪರ್ವಿಸು": [{"type": "verb", "defs": ["to cause (fame, a creeper, etc.) to spread, extend over a wide area.", "to cause to happen, occur or come to existence.", "to make publicly known; to promulgate; to publish.", "to spread, extend (oneself) over a wide area."]}], "ಪರ್ವು": [{"type": "verb", "defs": ["to cause to be spread, distributed over or pervade throughout a relatively large area.", "to spread (information, gossip, etc.) widely.", "to scatter in all directions or in a disorderly manner.", "to spread (oneself) widely.", "to drive away or force to go.", "to be disarranged and untidy; to be dishevelled.", "to stretch forward or hold out.", "to extend over; to overlay or cover.", "open or exetend (something as a mat on a flat surface); to unroll.", "to do;to accomplish; to complete.", "to ascend; to climb up.", "to become more in number, degree, extent, inensity, etc.", "to become broader or wider.", "to be elated from excess joy, pride, etc.", "to appear; to be published; to become known.", "to express; to make known.", "to cause to flow (as a liquid); to let something flow."]}, {"type": "noun", "defs": ["the fact of being spread over a wide area.", "the measure of a bounded region on a plane or the surface of a solid; area.", "a wide, open field.", "the act of being distributed.", "the act, fact or manner of flowing (as of a stream); a flow.", "the state or quality of being ample; abundance; amplitude.", "any plant whose stem puts out tendrils by which it can creep along a surface as it grows; a creeper.", "the pepper plant, Piper betle, the leaves of which are chewed with other ingredients; betel plant.", "a rope used to kill by hanging a criminal by tying it about the neck and suddenly suspending the body.", "extent from one end to another; length.", "a territorial range.", "a district or division of a city; an extension; a ward; a quarter."]}], "ಪರ್ವುಗೆ": [{"type": "noun", "defs": ["the space, amount or degree to which a thing extends; extent.", "an extended space; vast area.", "the fact of being spread over a a vast area.", "a flight of steps; stairway; stairs.", "the process of growing or developing; gradual development toward maturity; growth.", "abundance; copiousness; plentifulness.", "a number of people or things arranged so as to form a line; a row."]}], "ಪರ್ವುಗೆಡು": [{"type": "verb", "defs": ["to become less in extent; (vastnes) to be limited."]}], "ಪರ್ವುಗೆದೋಱು": [{"type": "verb", "defs": ["= ಪರ್ವು1 - 4."]}], "ಪರ್ವುಗೆವೆಱು": [{"type": "verb", "defs": ["= ಪರ್ವುಗೊಳ್ - 1."]}], "ಪರ್ವುಗೊಳ್": [{"type": "verb", "defs": ["to become wider or broader; to increase one's vastness.", "to be stretched; to be held out."]}], "ಪರ್ಶುಕೆ": [{"type": "noun", "defs": ["in humans, any of the arched bones attached posteriorly to the vertebral column and enclosing the chest cavity; a rib."]}], "ಪರ್ಷ": [{"type": "noun", "defs": ["a number of things, tied, wrapped or otherwise held together; a bundle."]}], "ಪರ್ಸ": [{"type": "noun", "defs": ["the country Iran, situated between the Capsian Sea and the Persian Gulf; Persia."]}], "ಪರ್ಸು": [{"type": "noun", "defs": ["a small bag or pouch for carrying money; a purse."]}], "ಪಲ್": [{"type": "noun", "defs": ["any of a set of hard, bonelike structures set in the jaws of most vertebrates and used for biting, tearing, and chewing: a tooth.", "any of a series of teeth on the rim of a wheel, for transmitting or receiving motion by fitting between the teeth of another wheel; gear tooth; a cog.", "any of the crosspieces constituting the steps of a ladder."]}], "ಪಲ": [{"type": "adjective", "defs": ["consisting of some large, indefinite number (of persons or things); numerous ; many.", "relatively numerous; too many."]}, {"type": "noun", "defs": ["a fruit of any plant, whether edible or not.", "a long,hand-held, sharp-edged, pointed weapon, used for cutting, thrusting, etc. by soldiers; a sword.", "the sharp blade of a sword.", "greediness; covetousness; avariciousness."]}, {"type": "noun", "defs": ["(hist.) a unit of weight (equal to three tolas).", "a unit of time, equal to twenty four seconds.", "(hist.) a unit of capacity.", "the flesh of animals used as food; meat.", "any of several grasses.", "the creeper Trichosanthes cucumerina of Cucurbitaceae family and its gourd."]}], "ಪಲಂಕಷ": [{"type": "noun", "defs": ["a person who eats human flesh; a daemon.", "the tree Ailanthus malabarica of Simaroubaceae family.", "the tree Butea frondosa of Papilionaceae family; bastard teak.", "the plant Hygrophila auriculata ( = H. spinosa, = Asteracantha longifolia) of Acanthaceae family.", "a tiger."]}], "ಪಲಂಕಷೆ": [{"type": "noun", "defs": ["the plant tribulus terrestris of Zygophyllaceae family.", "a resinous substance secreted by the scale insect Laccifer lacca that lives on certain fig, soapberry, and acacia trees; lac."]}], "ಪಲಂಗ": [{"type": "noun", "defs": ["a piece of furniture standing on four legs with a flat rectangular surface to lay the bed and to sleep on; a couch; a cot.", "a structure of canvas, cloth, metal, etc. extended around the body, just above the opening of a chariot, palankeen, etc. either as a protection from the sun, rain, etc. or as a decorative piece; a kind of awning.", "a room in a house wih a couch to sleep on; a bed-room.", "an uncovred litter for carrying an idol of a deity, a venerable person etc. in procession or a covered litter, for one person to sit in, carried by poles on the shoulders of two or more men; a palankeen."]}], "ಪಲಂಗು": [{"type": "noun", "defs": ["= ಪಲಂಗ."]}], "ಪಲಂಬು": [{"type": "verb", "defs": ["to express grief or pain by long, loud cries; to wail.", "to make a plaintive, sad, crying sound."]}], "ಪಲಕ": [{"type": "noun", "defs": ["= ಪಲ3 - 2."]}], "ಪಲಕಾಲ": [{"type": "noun", "defs": ["a long duration of time."]}], "ಪಲಕಾಲಂ": [{"type": "adverb", "defs": ["for a long duration of time."]}], "ಪಲಕಿ": [{"type": "noun", "defs": ["= ಪಲಂಗ."]}], "ಪಲಕೀರೆ": [{"type": "noun", "defs": ["the plant Holostemma annulare ( = H. rheedii) of Asclepiadaceae family; ring coronet swallow wort."]}], "ಪಲಕು": [{"type": "noun", "defs": ["= ಪಲುಕು2."]}], "ಪಲಕ್ಕಿ": [{"type": "noun", "defs": ["= ಪಲಂಗ."]}], "ಪಲಗಂಡ": [{"type": "noun", "defs": ["a man whose work is construction of buildings with brick, concrete, etc.; a mason."]}], "ಪಲಗಣ್": [{"type": "noun", "defs": ["= ಪಲಗಣ್ಣು."]}], "ಪಲಗಣ್ಣ": [{"type": "noun", "defs": ["(myth.) Indra, the head of gods, who is described having eyes all over his body."]}], "ಪಲಗಣ್ಣು": [{"type": "noun", "defs": ["a kind of eye-disease."]}], "ಪಲಗೆ": [{"type": "noun", "defs": ["a long, broad, thick wooden board.", "the board on which chess or dice-game is played.", "one round of any of these games.", "a board made ready for painting on.", "a kind of defensive shield.", "a percussion instrument consisting of a hollow hemisphere with a wide mouth on which a membrane stretched tightly, played by beating with the sticks; a kind of drum."]}], "ಪಲಗೆಗಟ್ಟು": [{"type": "noun", "defs": ["a temporary platform, scaffold, etc. made using wooden planks."]}], "ಪಲಗೆಜೂಜು": [{"type": "noun", "defs": ["the game of gambling played with dice."]}], "ಪಲಗೋರು": [{"type": "noun", "defs": ["a kind of agricultural implement with several cutting blades, for removing the weeds."]}], "ಪಲಟಣ": [{"type": "noun", "defs": ["a large group of soldiers; a battalion."]}], "ಪಲತೀಗೆ": [{"type": "noun", "defs": ["the creeper Leptadenia reticulata of Asclepiadaceae family."]}], "ಪಲಪು": [{"type": "noun", "defs": ["any of the two small nooses on either side of a cord that is to be put through the nose of an ox."]}], "ಪಲಬು": [{"type": "noun", "defs": ["= ಪಲುಬು."]}], "ಪಲರ್ಮೆ": [{"type": "noun", "defs": ["(pl.) a number of times; several occasions."]}, {"type": "adverb", "defs": ["number of times; many times; on several occations."]}], "ಪಲಲ": [{"type": "noun", "defs": ["= ಪಲವಲ."]}, {"type": "noun", "defs": ["the flesh of animals used as food; meat."]}], "ಪಲವಲ": [{"type": "noun", "defs": ["a small lake; a pond."]}], "ಪಲವು": [{"type": "noun", "defs": ["= ಪಲ1."]}], "ಪಲವುಕಾಲಂ": [{"type": "adverb", "defs": ["= ಪಲಕಾಲಂ."]}], "ಪಲಸ": [{"type": "noun", "defs": ["= ಪಲಸು."]}], "ಪಲಸಿಗೆ": [{"type": "noun", "defs": ["the quality or condition of being productive, fruitful; productivenes; fruitfulness."]}], "ಪಲಸು": [{"type": "noun", "defs": ["the tree Artocarpus integra of Moraceae family with yellow, fine-grained wood.", "its large, fruit containing edible segments and seeds; jack fruit."]}], "ಪಲಹಾರ": [{"type": "noun", "defs": ["a taking of fruits only for food.", "a light meal."]}], "ಪಲಾಂಡು": [{"type": "noun", "defs": ["the plant Allium cepa of the Liliaceae family, having an edible bulb with a strong, sharp smell and taste; onion plant.", "the bulb of this plant, formed of close, concentric layers of leaf bases; onion."]}], "ಪಲಾನಾ": [{"type": "adjective", "defs": ["of this kind, sort."]}], "ಪಲಾನೆ": [{"type": "adjective", "defs": ["= ಪಲಾನಾ."]}], "ಪಲಾನ್ನ": [{"type": "noun", "defs": ["rice cooked with flesh."]}], "ಪಲಾಯನ": [{"type": "noun", "defs": ["a running away from.", "an act or instance or escaping.", "(fig.) an escaping from reality, the responsibilities and routine of real life.", "a seat for a rider on a horse, usu. padded and of leather."]}], "ಪಲಾಯನಗೈ": [{"type": "verb", "defs": ["to run away.", "to get away; to break loose (as from a prison).", "(fig.) to escape from reality, the responsibilties and routine of real life, etc."]}], "ಪಲಾಯನಪಂಡಿತ": [{"type": "noun", "defs": ["(fig.) a coward.", "(fig.) one who shuns taking responsibility."]}], "ಪಲಾಯನವಾದ": [{"type": "noun", "defs": ["a tendency to escape from reality, the responsibilities and routine of real life, etc., esp. by unrealistic imaginative activity."]}], "ಪಲಾಯನವಾದಿ": [{"type": "noun", "defs": ["= ಪಲಾಯನಪಂಡಿತ."]}], "ಪಲಾಯನಸೂಱೆಕಾಱ": [{"type": "noun", "defs": ["= ಪಲಾಯನಪಂಡಿತ."]}], "ಪಲಾಯಿಗ": [{"type": "noun", "defs": ["a person who plays 'palage' a kind of drum; a drummer."]}], "ಪಲಾಯಿತ": [{"type": "noun", "defs": ["a man who has run away.", "he who has escaped (as from a prison)."]}], "ಪಲಾರ": [{"type": "noun", "defs": ["= ಪಲಹಾರ."]}], "ಪಲಾಲ": [{"type": "noun", "defs": ["any of various plants of the grass family that are usu. used for food, fodder or grazing and as lawns; grass.", "the main stem of a plant (esp. as of an amaranth plant).", "(fig.) a useless, worthless thing.", "empty, worthless or hollow talk.", "a pretending to be what one is not; a pretentious behaviour."]}], "ಪಲಾವ್": [{"type": "noun", "defs": ["= ಪಲಾವು."]}], "ಪಲಾವು": [{"type": "noun", "defs": ["a kind of dish made of rice boiled in soup and spices."]}], "ಪಲಾಶ": [{"type": "noun", "defs": ["a leaf of any plant.", "the tree Butea frondosa of Papilionaceae family; bastard teak.", "a person who eats human flesh; a cannibal; a daemon.", "the plant Curcuma zeodarina ( = C. zerumbet, = Amomum zerumbet) of Zingiberaeae family.", "the taste that produces a burning sensation in the mouth, throat, etc.", "a taste that is sharp, unpleasant; bitter."]}], "ಪಲಾಶವೃತ್ತಿ": [{"type": "noun", "defs": ["the condition of being covered by or having green leaves.", "the characteristic that is particular to a demon; fiendishness."]}], "ಪಲಾಶಶಾಲೆ": [{"type": "noun", "defs": ["a house made using plant materials (as leaves, twigs, straw, etc ) as of a hermit in a forest."]}], "ಪಲಾಶಿ": [{"type": "noun", "defs": ["a tree (or a plant) that has leaves.", "a kind of climbing plant.", "the tree Spondias pinnata (=S. mangiferra) of Anacardiaceae family.", "its plum used for pickles; Indian hog plum."]}], "ಪಲಾಸ": [{"type": "noun", "defs": ["= ಪಲಾಶ - 2."]}], "ಪಲಾಸಿ": [{"type": "noun", "defs": ["= ಪಲಾಶಿ."]}], "ಪಲಿಕಿನಿ": [{"type": "noun", "defs": ["a grey-haired woman; an aged woman."]}], "ಪಲಿಕ್ನಿ": [{"type": "noun", "defs": ["= ಪಲಿಕಿನಿ.", "a cow having a calf developing in the uterus for the first time."]}], "ಪಲಿತ": [{"type": "adjective", "defs": ["grey-haired.", "aged; grown old; old."]}, {"type": "noun", "defs": ["hair that has turned grey.", "the advanced years of human life; old-age.", "(jain.) a period of time, used as a unit of measure (similar to era, century, etc.)."]}], "ಪಲಿತಕಾಯ": [{"type": "noun", "defs": ["the body of an old person."]}], "ಪಲಿತಾಂಕುರ": [{"type": "noun", "defs": ["= ಪಲಿತ2 - 1."]}], "ಪಲಿತೌಷಧ": [{"type": "noun", "defs": ["a medicine consumption of which is believed to turn the grey hair into black."]}], "ಪಲಿಯಿಸು": [{"type": "verb", "defs": ["to produce fruits, results; to be productive."]}], "ಪಲು": [{"type": "noun", "defs": ["= ಪಲ್."]}], "ಪಲುಂಬು": [{"type": "noun", "defs": ["= ಪಲುಬು."]}], "ಪಲುಕಿಸು": [{"type": "verb", "defs": ["to produce a wavy sound; to undulate the sound while producing."]}], "ಪಲುಕು": [{"type": "verb", "defs": ["to utter a sound; to produce a vocal sound.", "(sound) to be produced in undulated manner; to be wavy.", "to sing or hum a song.", "(fig.) to utter an inauspicious thing or foretell an evil happening."]}, {"type": "noun", "defs": ["the quality of sound, musical note, etc. (produced vocally or by playing on a musical instrument) that is clear, distinct and accurate.", "the sense of a word or expression suggested indirectly as opp. to its literal sense)."]}], "ಪಲುಗಿರಿ": [{"type": "verb", "defs": ["= ಪಲ್ಗಿರಿ."]}], "ಪಲುಗುಣ": [{"type": "noun", "defs": ["(rightly ಫಲ್ಗುಣ) Arjuna, the famous hero in the great Indian epic Mahābhārata."]}], "ಪಲುಚೊಟ್ಟೆ": [{"type": "noun", "defs": ["the large-sized, evergreen tree Palaquium ellipticum ( = Dichopsis elliptica) of Sapotaceae family.", "its crustaceous fruit."]}], "ಪಲುಬಿ": [{"type": "noun", "defs": ["any male peafowl, esp., one of a species (Pavo cristatus) with a crest of plumules and long, brightly colored upper tail coverts; a peacock."]}], "ಪಲುಬು": [{"type": "verb", "defs": ["to express grief or pain by long, loud cries; to wail.", "to make a plaintive, sad, crying sound."]}], "ಪಲುಮೃಗ": [{"type": "noun", "defs": ["any of several animals that have canine tooth or tusk, as lion, tiger, elephant, wild-boar, etc."]}], "ಪಲುಮೊರೆ": [{"type": "verb", "defs": ["= ಪಲ್ಮೊರೆ."]}], "ಪಲುಸುಲಿ": [{"type": "verb", "defs": ["to brush and clean the teeth."]}], "ಪಲ್ಕಡಿ": [{"type": "verb", "defs": ["= ಪಲ್ಗಡಿ."]}], "ಪಲ್ಕಿನಿ": [{"type": "noun", "defs": ["= ಪಲಿಕಿನಿ."]}], "ಪಲ್ಕಿರಿ": [{"type": "verb", "defs": ["= ಪಲ್ಗಿರಿ."]}], "ಪಲ್ಗಚ್ಚು": [{"type": "verb", "defs": ["= ಪಲ್ಗಡಿ - 1.", "to eschew or suppress one's anger."]}], "ಪಲ್ಗಡಿ": [{"type": "verb", "defs": ["to grind or strike (the teeth) together, as in anger or pain; to gnash.", "to shake the jaws from cold, as to make upper set of teeth strike the lower one."]}], "ಪಲ್ಗರ್ಚು": [{"type": "verb", "defs": ["= ಪಲ್ಗಚ್ಚು."]}, {"type": "noun", "defs": ["= ಪಲ್ಗಲೆ."]}], "ಪಲ್ಗಲೆ": [{"type": "noun", "defs": ["a mark left on the skin by the biting with the teeth (either in anger or amorous sport)."]}], "ಪಲ್ಗಳೆ": [{"type": "verb", "defs": ["to take off or extract another's teeth."]}, {"type": "noun", "defs": ["= ಪಲ್ಗಲೆ."]}], "ಪಲ್ಗಿರಿ": [{"type": "verb", "defs": ["to smile broadly as in amusement or pleasure or in embarrassment; to grin.", "to draw back the lips and show the teeth in pain, scorn, etc.; to grin."]}], "ಪಲ್ಗಿರಿಸು": [{"type": "verb", "defs": ["to cause to grin."]}], "ಪಲ್ಗುಣ": [{"type": "noun", "defs": ["= ಪಲುಗುಣ."]}], "ಪಲ್ಟನು": [{"type": "noun", "defs": ["a large group of soldiers; a battalion."]}], "ಪಲ್ಟಾಯಿಸು": [{"type": "verb", "defs": ["to make upside down or inside down."]}], "ಪಲ್ಟಿ": [{"type": "noun", "defs": ["an acrobatic stunt performed by turning the body heels over head.", "anything upside down.", "ಪಲ್ಟಿ ಹಾಕು palṭi hāku = ಪಲ್ಟಿ ಹೊಡೆ; ಪಲ್ಟಿ ಹೊಡೆ palṭi hoḍe to turn one's body heels over head (as in performing an acrobatic stunt); 2. (anything) to turn upside down; 3. (fig.) to fail to succeed (in an examination); 4. (any scheme) to meet with utter failure."]}], "ಪಲ್ತನು": [{"type": "noun", "defs": ["= ಪಲ್ಟನು."]}], "ಪಲ್ದಿನ್": [{"type": "verb", "defs": ["= ಪಲ್ಗಡಿ - 1."]}], "ಪಲ್ದಿನು": [{"type": "verb", "defs": ["= ಪಲ್ಗಡಿ - 1."]}], "ಪಲ್ದೆಱೆ": [{"type": "verb", "defs": ["= ಪಲ್ಲುಗಿರಿ."]}], "ಪಲ್ಮಾಣಿಕ": [{"type": "noun", "defs": ["the thorny shrub Flacourtia indica ( = F. sapida, = F. sepiaria) of Flacourtiaceae family."]}], "ಪಲ್ಮಿಗ": [{"type": "noun", "defs": ["= ಪಲುಮೃಗ."]}], "ಪಲ್ಮøಗ": [{"type": "noun", "defs": ["= ಪಲುಮೃಗ."]}], "ಪಲ್ಮೊರೆ": [{"type": "verb", "defs": ["= ಪಲ್ಗಡಿ - 1.", "to make a humming sound (as bees)."]}], "ಪಲ್ಮೊಳೆ": [{"type": "noun", "defs": ["a tooth that is coming out breaking the gum."]}], "ಪಲ್ಯ": [{"type": "noun", "defs": ["any herbaceous plant that is eaten, raw or cooked.", "the edible part of such a plant, as the root, tuber, seed, fruit, stem or leaf; a vegetable.", "any of several kinds of dishes made using a vegetable or vegetables."]}, {"type": "noun", "defs": ["= ಪಲ್ಲಚೀಲ.", "an astronomical figure.", "(jain.) a large period of time."]}]}