{"ಕೌಂಕುಳ್": [{"type": "noun", "defs": ["= ಕೌಂಕುೞ್."]}], "ಕೌಂಕುೞ್": [{"type": "noun", "defs": ["the hollow under the arm at the shoulder; the armpit; axilla.", "the angle or the space between a branch and the stem at their joint."]}], "ಕೌಂಗು": [{"type": "noun", "defs": ["the palm tree Areca catechu of Arecaceae family with a smooth, slender trunk and feathery compound leaves; betel nut tree; areca nut palm.", "its nut; betel nut; areca nut."]}], "ಕೌಂಗುಮರ": [{"type": "noun", "defs": ["= ಕೌಂಗು - 1."]}], "ಕೌಂಚು": [{"type": "verb", "defs": ["= ಕೌಂಚು1."]}], "ಕೌಂಟರು": [{"type": "noun", "defs": ["a long table, board, cabinet top, etc., as in a store, lunchroom or kitchen, for the sale of goods, the serving of food, etc.; a counter."]}], "ಕೌಂಡೆ": [{"type": "noun", "defs": ["the tree Linociera ramiflora ( = L. intermedia) of Oleaceae family; (?)."]}], "ಕೌಂತಲ": [{"type": "adjective", "defs": ["of, belonging to or from the country Kuntala, corresponding to the northern part of the present Karnāṭaka."]}, {"type": "noun", "defs": ["the language of the country Kuntala corresponding to the northern part of the present Karnāṭaka."]}], "ಕೌಂತಿ": [{"type": "noun", "defs": ["a particular drug or medicinal substance, said to be fragrant, but bitter and slightly pungent in taste, and of greyish colour."]}], "ಕೌಂತಿಕ": [{"type": "noun", "defs": ["a man holding a spear (as a soldier, door-keeper, etc.)."]}], "ಕೌಂದ": [{"type": "noun", "defs": ["relating to, made of jasmine flower."]}], "ಕೌಂದಿ": [{"type": "noun", "defs": ["old worn clothes; a sheet of cloth made by stitching small torn cloth pieces; rags."]}], "ಕೌಂಸಲ": [{"type": "noun", "defs": ["counsel - a) a mutual exchange of ideas, opinions, etc.; discussion and deliberation; b) advice resulting from such an exchange; c) any advice."]}], "ಕೌಂಸಲದಾರ": [{"type": "noun", "defs": ["a member of the counselling committee; any person whose advice is sought; consultant; a counsel."]}], "ಕೌಂಸ್ತುಭ": [{"type": "noun", "defs": ["Viṣṇu, who wears the most precious stone Kaustubha."]}], "ಕೌಕ್ಕುಟಿಕ": [{"type": "noun", "defs": ["a man who sells chicken as his profession; a trader of chicken.", "an ascetic who practices extreme type of non-violence and is very careful in moving also as to avoid small insects being killed by treading on."]}], "ಕೌಕ್ಷೇಯ": [{"type": "adjective", "defs": ["of, in, relating to or near the stomach."]}, {"type": "noun", "defs": ["a sword inserted in to a sheath."]}], "ಕೌಕ್ಷೇಯಕ": [{"type": "noun", "defs": ["a hand weapon having a long, sharp-pointed blade, sometimes with a sharp edge on one or both sides, set in a hilt; a sword."]}], "ಕೌಚಿಕ್ಕು": [{"type": "verb", "defs": ["to assault as to make another fall facing the floor.", "to put (a basket etc.) upside down (over something) or to cover with.", "ಕೌಚಿಕ್ಕಿಕೆಡೆ kaucikki keḍe to be felled facing down."]}], "ಕೌಚಿಮ": [{"type": "noun", "defs": ["a tool with a rough, ridged surface for smoothening or scratching the hide."]}], "ಕೌಚು": [{"type": "verb", "defs": ["to fall upside down; to be placed facing downward.", "to put (a basket etc.) upside down (over something) or to cover with."]}, {"type": "verb", "defs": ["to cover (an object) with (a veil, screen, lid, etc.)."]}], "ಕೌಜಲು": [{"type": "noun", "defs": ["the bird francolin partridge."]}], "ಕೌಜು": [{"type": "noun", "defs": ["= ಕೌಜಲು."]}], "ಕೌಟ": [{"type": "adjective", "defs": ["of the home; domestic; homely.", "having or living in, a house of one's own.", "living without depending on another."]}], "ಕೌಟತಕ್ಷ": [{"type": "noun", "defs": ["a carpenter living on his profession independently."]}], "ಕೌಟಲು": [{"type": "noun", "defs": ["the act of meddling, interfering into another's or otherś affair without being asked to; officiousness causing annoyance to others."]}], "ಕೌಟವಿ": [{"type": "noun", "defs": ["a naked woman", "ಕೌಟವಿಯಾಗು kauṭaviyāgu (said of a woman) to become naked; to take off one's all clothes.", "(fig.) to become non-entity."]}], "ಕೌಟವ್ಯ": [{"type": "noun", "defs": ["the state of not existing; the condition that exists only in the mind or imagination."]}], "ಕೌಟಿಕ": [{"type": "noun", "defs": ["one who catches animals by trapping.", "a man whose work is killing animals or dressing their carcasses for meat, to earn his livelihood; a butcher; a slaughterer.", "a person who cheats; a cheat; a fraud; a deceiver."]}], "ಕೌಟಿಲ್ಯ": [{"type": "noun", "defs": ["the quality or condition of not being straight; crookedness.", "a pretending, make-believe; pretence; hypocrisy.", "a dishonest man; a crook; a fraud; a deceiver.", "name of a sage, known popularly as C āṇakya, the author of the treatise 'Arthaśastra' on civil polity."]}], "ಕೌಟಿಲ್ಯಜ್ಞ": [{"type": "noun", "defs": ["= ಕೌಟಿಲ್ಯ - 3.", "a specialist in civil polity."]}], "ಕೌಟಿಲ್ಯವೃತ್ತಿ": [{"type": "noun", "defs": ["= ಕೌಟಿಲ್ಯ - 1 & 2."]}], "ಕೌಟುಂಬರ": [{"type": "noun", "defs": ["a cloth of great price or value."]}], "ಕೌಟುಂಬಿಕ": [{"type": "noun", "defs": ["having to do with the home or housekeeping; of the house or family; domestic."]}, {"type": "noun", "defs": ["a man who has a wife and children; a family-man.", "a man devoted to his family and home."]}], "ಕೌಟುಂಬಿಕವ್ಯವಹಾರ": [{"type": "noun", "defs": ["internal affairs of a family or group of families."]}], "ಕೌಟೆ": [{"type": "noun", "defs": ["= ಕೌಡೆ1."]}], "ಕೌಡಯಾಲ": [{"type": "noun", "defs": ["the tree Anthocephalus indicus ( = A. cadamba, = Nauclea cadamba) of Rubiaceae family; cadamba tree."]}], "ಕೌಡಿ": [{"type": "noun", "defs": ["the condition or fact of having a fork at one end (as a stick).", "division into two parts, groups or classes, esp. when these are sharply distinguished or opposed; dichotomy.", "a branch of a family.", "a pair of ornamental lines woven at the border of a dhōti, shawl or a blanket."]}], "ಕೌಡಿಕಾರ": [{"type": "noun", "defs": ["a man who cheats others habitually; a cheat; a deceiver."]}], "ಕೌಡಿಕೆ": [{"type": "noun", "defs": ["= ಕೌಡೆ2."]}], "ಕೌಡೆ": [{"type": "noun", "defs": ["the perennial vine Citrullus colocynthus ( = Cucumis colocynthis) of Cucurbitaceae family; colocynth."]}, {"type": "noun", "defs": ["the smooth, glossy, and brightly coloured shell of any gastropod mollusc of the family Cypraeidae, formerly used as currency by primitives; cowrie.", "any of the games played with cowries."]}], "ಕೌಣ": [{"type": "noun", "defs": ["the grass Typha angustifolia of Typhaceae family."]}], "ಕೌಣಕಡ್ಡಿ": [{"type": "noun", "defs": ["the grass Typha angustifolia of Typhaceae family.", "the stem of this grass."]}], "ಕೌಣಪ": [{"type": "noun", "defs": ["one who eats flesh of dead human bodies; a demon.", "(fig.) the regent of the south-west quarter."]}], "ಕೌತ": [{"type": "noun", "defs": ["a false reason or motive put forth to hide the real one; an excuse; a pretext."]}, {"type": "noun", "defs": ["a kind of musical instrument (a percussion instrument ?)."]}], "ಕೌತುಕ": [{"type": "noun", "defs": ["a person, thing or event that causes astonishment and admiration; a wonder.", "an intense desire to learn or know.", "a celebration, a festival; a festive occasion.", "a pleased feeling; enjoyment; delight; satisfaction; pleasure.", "any activity or experience that gives enjoyment or recreation; pastime; a sport.", "anything said or done to arouse laughter; a joke."]}], "ಕೌತುಕಂಗೊಳ್": [{"type": "verb", "defs": ["= ಕೌತುಕಪಡು."]}], "ಕೌತುಕಂಗೊಳಿಸು": [{"type": "verb", "defs": ["to seize or fill with wonder; to cause to be wondered.", "to arouse curiosity."]}], "ಕೌತುಕಂದಾಳ್": [{"type": "verb", "defs": ["= ಕೌತುಕಪಡು."]}], "ಕೌತುಕಂಬಡು": [{"type": "verb", "defs": ["= ಕೌತುಕಪಡು."]}], "ಕೌತುಕಜನಕ": [{"type": "adjective", "defs": ["that causes wonder; wonderful; amazing; marvellous.", "arousing curiosity; curious because of unusual or strange; curious."]}], "ಕೌತುಕಪಡು": [{"type": "verb", "defs": ["to be seized or filled with wonder; to feel amazement; to marvel; to wonder.", "to have curiosity; to be curious."]}], "ಕೌತುಕಪರಾಯಣ": [{"type": "adjective", "defs": ["full of high spirits and good humour; merry; gay; jolly."]}], "ಕೌತುಕಪ್ರೇರಿತ": [{"type": "adjective", "defs": ["seized by wonder; filled with wonder.", "being curious."]}], "ಕೌತುಕಯುಕ್ತಿ": [{"type": "noun", "defs": ["a trick to make (another or others) wonderstruck.", "a trick to make (another or others) become curious."]}], "ಕೌತುಕಸೃಷ್ಟಿ": [{"type": "noun", "defs": ["a wonderful, marvellous creation.", "a strange thing."]}], "ಕೌತೂಹಲ": [{"type": "noun", "defs": ["eagerness to know or learn; curiosity.", "the person, thing, etc. that causes wonder."]}], "ಕೌತೂಹಳ": [{"type": "noun", "defs": ["= ಕೌತೂಹಲ."]}], "ಕೌದ": [{"type": "noun", "defs": ["a thin, fine silk cloth used during winter to cover the shoulders, back and the chest."]}], "ಕೌದಿ": [{"type": "noun", "defs": ["old worn clothes; a sheet of cloth made by stitching small torn cloth pieces; rags."]}], "ಕೌದ್ರವೀಣ": [{"type": "noun", "defs": ["the field growing the millet Paspalum scrobiculatum ( = P. frumentaceum)."]}], "ಕೌಪ": [{"type": "noun", "defs": ["a single long cloth used to cover the privy parts, as by a male ascetic or poormen in warm climates; a loin cloth.", "the external genital organs of the female, including the labia majora, labia minora, clitoris, and the entrance to the vagina.", "in men, the organ of sexual intercourse which is also the organ through which urine is ejected."]}], "ಕೌಪೀನ": [{"type": "noun", "defs": ["= ಕೌಪ.", "that which is despicable, morally contemptible.", "an unfit, improper, immoral act."]}], "ಕೌಪೀನಧಾರಿ": [{"type": "noun", "defs": ["a man wearing but a single long cloth covering his privy parts; an ascetic."]}], "ಕೌಪು": [{"type": "noun", "defs": ["= ಕೌಪ."]}], "ಕೌಪುಗಟ್ಟು": [{"type": "verb", "defs": ["to wear but a single long cloth covering one's privy parts."]}], "ಕೌಪುದಳೆ": [{"type": "verb", "defs": ["= ಕೌಪುಗಟ್ಟು."]}], "ಕೌಬಿನಹುಲ್ಲು": [{"type": "noun", "defs": ["the grass Chloris dolichostachya ( = C. incompleta) of Poaceae family."]}], "ಕೌಬೇರ": [{"type": "adjective", "defs": ["(myth.) of or belonging to Kubēra, the regent of northern quarter."]}, {"type": "noun", "defs": ["(myth.) Kubēra, the regent of northern quarter."]}], "ಕೌಬೇರಿ": [{"type": "noun", "defs": ["the direction to the right of a person facing the sunset; the northern direction."]}], "ಕೌಮಾರ": [{"type": "adjective", "defs": ["of, belonging to, happening in boyhood or girlhood.", "of or relating to Kumāra, the son of Śiva."]}, {"type": "noun", "defs": ["the state or period of being a boy or girl; boyhood or girlhood.", "the state or time of being a youth, from the boyhood or girlhood to maturity."]}], "ಕೌಮಾರತಂತ್ರ": [{"type": "noun", "defs": ["one of the sacred, auxiliary scriptures belonging to the tradition of Lalitāgama."]}], "ಕೌಮಾರದೆಸೆ": [{"type": "noun", "defs": ["= ಕೌಮಾರ2."]}], "ಕೌಮಾರಬ್ರಹ್ಮಚಾರಿಣಿ": [{"type": "noun", "defs": ["a woman abstaining from sexual relations, as a religious vow, through out her life."]}], "ಕೌಮಾರಭೃತ್ಯ": [{"type": "noun", "defs": ["the branch of medical science that deals with childhood and the diseases of children; paediatrics."]}], "ಕೌಮಾರಿ": [{"type": "noun", "defs": ["a girl or a woman not having sexual intercourse; a virgin.", "one of the seven divine mothers (all of whom are considered as partial incarnation of Pārvati).", "the regent goddess of the third musical note 'gāndhāra'."]}], "ಕೌಮಾರ್ಯ": [{"type": "noun", "defs": ["the state or period of being a boy or girl; boyhood or girlhood.", "the state or period of being a youth, from the boyhood or girlhood to maturity; adolescence.", "the state or fact of being a virgin; maidenhood, spinsterhood, etc."]}], "ಕೌಮುದ": [{"type": "adjective", "defs": ["of, relating to or made of the flower or flowers of the plant esculent white water lily, Nymphae esculenta."]}, {"type": "noun", "defs": ["a profuse growth or assemblage of the plant esculent whiter water lily, Nymphae esculenta or its white flower."]}], "ಕೌಮುದಿ": [{"type": "noun", "defs": ["the light of the moon; moon-light."]}], "ಕೌಮುದೀಮಹೋತ್ಸವ": [{"type": "noun", "defs": ["a festival observed in the moon light (on a full-moon day)."]}], "ಕೌಮುದೀವರ್ಣ": [{"type": "noun", "defs": ["pure white colour."]}], "ಕೌಮೋದಕಿ": [{"type": "noun", "defs": ["the mace of Viṣṇu or Křṣṇa."]}], "ಕೌಮೋದಿಕ": [{"type": "noun", "defs": ["a kind of military weapon."]}], "ಕೌರವ": [{"type": "adjective", "defs": ["of or belonging to the lineage of Kuru, in the epic Mahābhārata."]}, {"type": "noun", "defs": ["a descendant of Kuru, a prince of lunar dynasty, esp. any of the two warring parties in the epic Mahābhārata.", "Duryōdhana, the anti-hero in the same epic."]}], "ಕೌವರರೋಷ": [{"type": "noun", "defs": ["(fig.) a mean or evil feeling toward another, characterised by the strong inclination to hurt, humiliate, annoy, frustrate, etc.; spite."]}], "ಕೌರವ್ಯ": [{"type": "noun", "defs": ["= ಕೌರವ2 - 1."]}], "ಕೌರಿ": [{"type": "noun", "defs": ["the shrub or small sized tree Helicteres isora of Sterculiaceae family; East Indian screw pine."]}], "ಕೌರು": [{"type": "verb", "defs": ["to become putrid or rotten and emit rancid smell.", "to lose freshness or strength; to droop, to wither; to fade.", "to be burnt to charcoal."]}, {"type": "verb", "defs": ["to cover from all or almost all sides; to encircle; to attack.", "to scrape the surface of with the teeth."]}, {"type": "noun", "defs": ["bad smell like that of stale fat, oil or completely putrefied vegetable."]}], "ಕೌರುಗಂಪು": [{"type": "noun", "defs": ["= ಕೌರು3."]}], "ಕೌರುವಾಸನೆ": [{"type": "noun", "defs": ["= ಕೌರು3."]}], "ಕೌರ್ಮ": [{"type": "adjective", "defs": ["of, belonging or particular to a tortoise.", "of or relating to the second of ten major incarnations of Viṣṇu."]}, {"type": "noun", "defs": ["= ಕೌರ್ಮಪುರಾಣ."]}], "ಕೌರ್ಮಪುರಾಣ": [{"type": "noun", "defs": ["one of the eighteen Pur āṇas, the mythological and legendary versions of universe, and the Divine Power."]}], "ಕೌರ್ವಿಲ್ಲ": [{"type": "noun", "defs": ["Manmatha, whose bow is made of a sugar-cane."]}], "ಕೌಲ್": [{"type": "noun", "defs": ["= ಕೌಲು2."]}], "ಕೌಲ": [{"type": "noun", "defs": ["the doctrine and practice of a Śaiva sect, that believe in necromancy, as the art of prediction by supposed communication with the dead, black magic, enchantment, conjuration, etc.", "a member of this sect."]}], "ಕೌಲಟಿನೇಯ": [{"type": "noun", "defs": ["the son of a chaste woman beggar.", "a male child born of parents not married to each other; an illegitimate child; a bastard."]}], "ಕೌಲಟೇಯ": [{"type": "noun", "defs": ["= ಕೌಲಟಿನೇಯ."]}], "ಕೌಲಟೇರ": [{"type": "noun", "defs": ["= ಕೌಲಟಿನೇಯ - 2."]}], "ಕೌಲವ": [{"type": "noun", "defs": ["the third of the seven astrological periods."]}], "ಕೌಲಾಚಾರ": [{"type": "noun", "defs": ["the practice of the doctrine by a Śaiva sect, that believe in necromancy, as the art of prediction by supposed communication with the dead."]}], "ಕೌಲಿಕ": [{"type": "adjective", "defs": ["relating to or of, a family; descending from heritage; hereditary."]}, {"type": "noun", "defs": ["a deceiver, a cheat; esp. a person who assumes a false identity in order to deceive others; an impostor.", "an unverified or unconfirmed statement or report circulating in a community."]}], "ಕೌಲೀನ": [{"type": "adjective", "defs": ["coming from, belonging to a noble family."]}, {"type": "noun", "defs": ["= ಕೌಲಿಕ2 - 1.", "a noble descent, family.", "the fact of coming from or belonging to a noble family; high birth.", "an improper act; a bad deed.", "very bad reputation; disgrace; dishonour; notoriety.", "a war; battle.", "the external genitals of either sex; pudenda.", "an animal; a brute.", "a combat of animals.", "gold.", "a sick person.", "a cow.", "that which is black; or the quality of being black."]}], "ಕೌಲು": [{"type": "noun", "defs": ["the condition or fact of having a forked-end (as a stick).", "division into two parts, groups or classes, esp. when these are sharply distinguished or opposed; dichotomy.", "a branch of a family.", "a pair of ornamental lines woven at the border of a dhōti, shawl or a blanket."]}, {"type": "noun", "defs": ["a treaty - a) a formal agreement between two or more nations, relating to peace, alliance, trade, etc. b) the document embodying such an agreement.", "ಕೌಲು ಕಟ್ಟಿಸು kaulu kaṭṭisu to make a solemn declaration or promise of a particular service etc. to a God or any of the gods, daemon, etc.; ಕೌಲು ಬೇಡು kaulu bēḍu (a god or daemon) to demand a service."]}], "ಕೌಲುಕರಾರು": [{"type": "noun", "defs": ["the act or fact of agreeing; an agreement.", "a written document to this effect."]}], "ಕೌಲೆ": [{"type": "noun", "defs": ["a brown cow."]}], "ಕೌಲೆತ್ತು": [{"type": "noun", "defs": ["a bullock or a cow trained or made to nod its head when said something, as by beggars.", "(fig.) one who undiscriminatingly agrees to every suggestion or opinion offered by others or accepts anything offered."]}], "ಕೌಲೇಯ": [{"type": "adjective", "defs": ["coming from, belonging to a noble family.", "of or belonging to a family, lineage, etc."]}, {"type": "noun", "defs": ["any dog, esp. a member of one of the hunting breeds, with drooping ears, a deep-throated bark, and a keen sense of smell."]}], "ಕೌಲೇಯಕ": [{"type": "adjective", "defs": ["= ಕೌಲೇಯ1."]}, {"type": "noun", "defs": ["= ಕೌಲೇಯ2."]}], "ಕೌಲೇಯಕಿ": [{"type": "noun", "defs": ["a female dog; a bitch."]}], "ಕೌಲ್ದಾರ": [{"type": "noun", "defs": ["a man who has entered into an agreement, treaty, with another; a party to an agreement."]}], "ಕೌವರಿ": [{"type": "noun", "defs": ["= ಕೌವರೆ."]}], "ಕೌವರೆ": [{"type": "noun", "defs": ["the act or an instance of moving rapidly in a circular manner; whirling.", "the state of being carried away with joy, love, etc.; excited state of the mind; rapture; ecstasy.", "confusion; agitation of the mind."]}], "ಕೌವರೆಗೊಳ್": [{"type": "verb", "defs": ["to be excited by joy, love, success, etc.; to be carried away by such events.", "to be agitated or confused.", "to be struck by wonder.", "to desire strongly; to be fascinated.", "to extend oneself; to spread oneself within or throughout; to cover an object completely."]}], "ಕೌವರೆಗೊಳಿಸು": [{"type": "verb", "defs": ["to enchant; to charm; to fascinate.", "to cause to cover from all sides; to cause to fill the entire space or room."]}], "ಕೌವುಲೆ": [{"type": "noun", "defs": ["a brown cow."]}], "ಕೌವೇರ": [{"type": "adjective", "defs": ["(myth.) of or belonging to Kubēra, the regent of northern quarter."]}, {"type": "noun", "defs": ["the plant Costus speciosus of Zingiberaceae family, the oil extracted from which is used in perfumery; sweet costus."]}], "ಕೌವೇರಿ": [{"type": "noun", "defs": ["the direction to the right of a person facing the sunset; the northern direction."]}], "ಕೌಶಯ": [{"type": "noun", "defs": ["a long, sharp blade of the grass Desmostachya tripinnata of Poaceae family."]}], "ಕೌಶಲ": [{"type": "noun", "defs": ["ability to do something (esp. manual or physical) well; proficiency; expertness; skill; dexterity.", "happiness, well-being, good health or fortune; welfare."]}], "ಕೌಶಲಂದೋಱು": [{"type": "verb", "defs": ["to exhibit, display one's skill, proficiency, dexterity or expertness."]}], "ಕೌಶಲಮಯ": [{"type": "adjective", "defs": ["having practical ability or skill; expert, clever.", "having a good knowledge of a subject.", "displaying or requiring skill; skilful."]}], "ಕೌಶಲ್ಯ": [{"type": "noun", "defs": ["= ಕೌಶಲ."]}], "ಕೌಶಲ್ಯಾರ್ಥಿ": [{"type": "noun", "defs": ["a man desirous of achieving expertise, skill, dexterity, ability, etc."]}], "ಕೌಶಿಕ": [{"type": "noun", "defs": ["Viśvāmitra, a famous vedic sage, the seer of the most sacred Gāyatri hymn.", "any of a worldwide order (Strigiformes) of predatory night birds distinguished by a large, flat face, eyes surrounded by stiff-feathered disks, a short, hooked beak, feathered legs with sharp talons, and soft plumage which permits noiseless flight; an owl.", "Indra, the god of heaven.", "the tree Commiphora mukul ( = Balsamodendron mukul) of Burseraceae family.", "a myrrhlike gum resin yielded by this tree.", "an entertainer who seems to hypnotise snakes by means of movements or music; a snake-charmer.", "a person, thing or event that causes astonishment and admiration; a wonder; a marvel.", "the mouth of a snake.", "a silk cloth.", "the moon.", "a person who writes or compiles a dictionary; a lexicographer.", "the soft, vascular, fatty tissue that fills the cavities of most bones.", "the sentiment of love (as expressed in a literary work or dance).", "a man who identifies hidden treasure (by a magical method).", "Śiva."]}], "ಕೌಶಿಕಗುಪ್ತ": [{"type": "noun", "defs": ["name of a musical mode."]}], "ಕೌಶಿಕದರ್ಭೆ": [{"type": "noun", "defs": ["a long, sharp blade of the grass Desmostachya tripinnata of Poaceae family."]}], "ಕೌಶಿಕಬ್ರಜ": [{"type": "noun", "defs": ["a multitude of owls."]}], "ಕೌಶಿಕಸಗೋತ್ರ": [{"type": "noun", "defs": ["the lineage of the sage Viśvāmitra."]}], "ಕೌಶಿಕಿ": [{"type": "noun", "defs": ["a musical mode."]}], "ಕೌಶಿಕೆ": [{"type": "noun", "defs": ["a drinking vessel.", "a river in north India, tributary to Gangā.", "expertness in lexicography."]}], "ಕೌಶೀತಕಿ": [{"type": "noun", "defs": ["name of one of the Upanishads."]}], "ಕೌಶೇಯ": [{"type": "noun", "defs": ["the fine, soft, shiny fibre produced by silkworms to form their cocoons; silk thread.", "a silk cloth."]}], "ಕೌಸಲೇಯ": [{"type": "noun", "defs": ["Rāma, the son of Kausalya, and the hero of epic Ramāyaṇa."]}], "ಕೌಸಲ್ಯ": [{"type": "noun", "defs": ["= ಕೌಶಲ."]}], "ಕೌಸಾಳ": [{"type": "noun", "defs": ["a pair of large bronze cymbals."]}], "ಕೌಸಿಕ": [{"type": "noun", "defs": ["any of the varieties of jasmine plants.", "its flower.", "the tree Commiphora mukul ( = Balsamodendron mukul) of Burseraceae family.", "a myrrhlike gum resin yielded by this tree."]}], "ಕೌಸೀದ್ಯ": [{"type": "noun", "defs": ["a living on the interest amount earned on loans lent to others."]}], "ಕೌಸುಂಭ": [{"type": "adjective", "defs": ["of, related to the safflower plant.", "of, related to, resembling, of the colour of, its flower."]}, {"type": "noun", "defs": ["an orange flower of the thistle like, annual safflower plant (Carthamus tinctorius of Asteraceae family); safflower flower.", "the orange colour of this flower."]}], "ಕೌಸುಂಭರಾಗ": [{"type": "noun", "defs": ["= ಕೌಸುಂಭ2 - 2."]}], "ಕೌಸುಮ": [{"type": "adjective", "defs": ["of a flower; being like or resembling a flower.", "having flowers in abundance.", "made of a flower or flowers."]}, {"type": "noun", "defs": ["the seed bearing part of a plant, brightly coloured and conspicuous; a blossom; a boom; a flower.", "sugary fluid produced by plants to attract pollinating insects to their flowers and made into honey by bees; the nectar of flowers."]}], "ಕೌಸೃತಿಕ": [{"type": "noun", "defs": ["a person skilled in or practising magic or sorcery. a magician; a conjuror.", "a man who deceives; a deceiver; an impostor."]}], "ಕೌಸ್ತುಭ": [{"type": "noun", "defs": ["name of a celebrated gem worn by Viṣṇu on his chest.", "a necklace inset with a gem used to adorn the idol of a deity with, in a temple."]}], "ಕೌಸ್ತುಭದ್ಯುತಿ": [{"type": "noun", "defs": ["the lustre of the celebrated gem ಕೌಸ್ತುಭ, worn by Viṣṇu on his chest."]}], "ಕೌಸ್ತುಭಮಣಿ": [{"type": "noun", "defs": ["= ಕೌಸ್ತುಭ."]}], "ಕೌಸ್ತುಭವಕ್ಷ": [{"type": "noun", "defs": ["Viṣṇu who wears on his chest the celebrated gem ಕೌಸ್ತುಭ."]}], "ಕೌಳ": [{"type": "noun", "defs": ["the doctrine and practice of a Śaiva sect, that believe in necromancy, as the art of prediction by supposed communication with the dead, black magic, enchantment, conjuration, etc.", "a member of this sect."]}], "ಕೌಳಿ": [{"type": "noun", "defs": ["= ಕೌಳೇಯ2."]}, {"type": "noun", "defs": ["rice in the husk, the seed of the aquatic cereal grass Oryza sativa of Poaceae family; paddy."]}], "ಕೌಳಿಕ": [{"type": "noun", "defs": ["one who sells meat; a butcher.", "the act of cheating; fraud.", "one who cheats; a deceiver."]}, {"type": "adjective", "defs": ["relating to or of a family; descending from heritage; hereditary."]}, {"type": "noun", "defs": ["a deceiver, a cheat; esp. a person who assumes a false identity in order to deceive others; an impostor.", "an unverified or unconfirmed statement or report circulating in a community."]}], "ಕೌಳಿಕಂದಾಯ": [{"type": "noun", "defs": ["the tax paid in the form of paddy."]}], "ಕೌಳಿಕೆ": [{"type": "noun", "defs": ["= ಕೌಳಿಗೆ1."]}], "ಕೌಳಿಗೆ": [{"type": "noun", "defs": ["a bundle of betel leaves (differing in numbers, being twenty, fifty, hundred etc.).", "a bundle of palmyra leaves written on.", "a line; a row.", "the triangular wall enclosed by the sloping ends of a ridged roof; a gable."]}], "ಕೌಳು": [{"type": "noun", "defs": ["the state of being branched or having branches.", "the state of having a forked end; a 'Y' shaped stick."]}, {"type": "noun", "defs": ["the side of the face below the eye; the cheek."]}], "ಕೌಳುಗೋಲ್": [{"type": "noun", "defs": ["an arrow with a crescent-head.", "a stick with a forked end; a 'Y'-shaped stick."]}], "ಕೌಳುಡೆ": [{"type": "noun", "defs": ["a pillow or soft pad for sitting or kneeling on or reclining against; a cushion."]}], "ಕೌಳೇಯ": [{"type": "adjective", "defs": ["coming from, belonging to a noble family.", "(gen.) of or belonging to a family, lineage, etc."]}, {"type": "noun", "defs": ["any dog, esp. a member of one of the hunting breeds, with drooping ears, a deep-throated bark, and a keen sense of smell; a hound."]}], "ಕೌಳೇಯಕ": [{"type": "adjective", "defs": ["= ಕೌಳೇಯ1."]}, {"type": "noun", "defs": ["= ಕೌಳೇಯ2."]}], "ಕೌಳೇಯಕುಟುಂಬಿನಿ": [{"type": "noun", "defs": ["a female dog used in hunting."]}], "ಕೌಱಿಡು": [{"type": "verb", "defs": ["to give out bad smell."]}], "ಕೌಱು": [{"type": "verb", "defs": ["to become putrid or rotten and emit rancid smell.", "to lose freshness or strength; to droop, to wither; to fade.", "to be burnt to charcoal."]}, {"type": "noun", "defs": ["bad smell like that of stale fat, oil or completely putrefied vegetable."]}], "ಕೌಱುನಾಱು": [{"type": "verb", "defs": ["to emit rancid smell."]}], "ಕೌಱೆಣ್ಣೆ": [{"type": "noun", "defs": ["any oil having bad smell; a rancid oil."]}], "ಕೌಱೇಳ್": [{"type": "verb", "defs": ["(bad smell) to be emitted; (rancid smell) to spread."]}], "ಕೌಱೇೞ್": [{"type": "verb", "defs": ["= ಕೌಱೇಳ್."]}], "ಕ್ಯಾಂಪು": [{"type": "noun", "defs": ["a place where tents, huts, barracks or other more or less temporary structures have been put up, as for soldiers in training.", "a tent, cabin, etc. or a group of these, used for temporary lodging, as by hunters or fishermen."]}], "ಕ್ಯಾಕರಿಸು": [{"type": "verb", "defs": ["to make indistinct sound as to clear the throat (while suffering from cold, phlegm, etc.); to clear the throat audibly; to hawk."]}], "ಕ್ಯಾತೆ": [{"type": "noun", "defs": ["a minor irritation or annoyance; a pinprick."]}], "ಕ್ಯಾದಿಗೆ": [{"type": "noun", "defs": ["the tree Pandanus fascicularis ( = P. odoratissimus, = P. tectorius) of Pandanaceae family; screw pine tree.", "its flower."]}], "ಕ್ಯಾನ್ಸರ್": [{"type": "noun", "defs": ["cancer - a) a malignant new growth anywhere in the body of a person or animal; malignant tumour; b) any of various diseases characterised by the uncontrolled growth of cells that disrupt body tissue.", "(fig.) anything bad or harmful that spreads and destroys something."]}], "ಕ್ಯಾಬೇಜು": [{"type": "noun", "defs": ["a common vegetable (Brassica oleracea var. capitata) of the crucifer family, with thick leaves formed into a round, compact head on a short, thick stalk; cabbage."]}], "ಕ್ಯಾಮರ": [{"type": "noun", "defs": ["a device for taking photographs, consisting essentially of a closed box containing a sensitised plate or film on which an image is formed when light enters the box through a lens or hole; a camera."]}], "ಕ್ಯಾರಟ್ಟು": [{"type": "noun", "defs": ["= ಕ್ಯಾರೆಟ್ಟು."]}], "ಕ್ಯಾರೆಟ್ಟು": [{"type": "noun", "defs": ["the biennial plant Daucus carota (var. sativa) of Umbelliferae family, with fernlike leaves and compound umbels of white flowers, usu. with one red flower in the centre.", "the fleshy orange-red root of this plant eaten as a vegetable; carrot."]}], "ಕ್ಯಾಸತ್ತೆ": [{"type": "noun", "defs": ["the tree Elaeocarpus oblongus of Elaeocarpaceae family.", "another tree of the same family Elaeocarpus serratus."]}], "ಕ್ರಂದನ": [{"type": "noun", "defs": ["the act or an instance of calling, inviting.", "a challenging or inviting for a war, physical combat etc.; a war-cry.", "a long, pitiful cry of grief and pain; wail."]}], "ಕ್ರಂದಿತ": [{"type": "adjective", "defs": ["crying pitifully; wailing."]}], "ಕ್ರಕಚ": [{"type": "noun", "defs": ["a cutting tool, of various shapes and sizes and worked by hand or machinery, consisting essentially of a thin blade or disk of metal, usu. steel, the edge of which is a series of sharp teeth; a saw.", "(myth.) name of a hell."]}, {"type": "noun", "defs": ["the tree Pandanus fascicularis ( = P. odoratissimus, = P. tectorius) of Pandanaceae family; screw pine tree.", "its flower."]}], "ಕ್ರಕಚವಿದಾರಣ": [{"type": "noun", "defs": ["the act of cutting, dividing with a saw."]}], "ಕ್ರಕಚೆ": [{"type": "noun", "defs": ["= ಕ್ರಕಚ2."]}], "ಕ್ರಕಣ": [{"type": "noun", "defs": ["= ಕ್ರಕರ - 2."]}], "ಕ್ರಕರ": [{"type": "noun", "defs": ["= ಕ್ರಕಚ1 -1; 2) a kind of partridge.", "the plant Capparis decidua ( = C. aphylla) of Capparaceae family; caper shrub.", "a man living in complete poverty; a destitute."]}], "ಕ್ರಕರವಕ್ಕಿ": [{"type": "noun", "defs": ["= ಕ್ರಕರ - 2."]}], "ಕ್ರತಕ": [{"type": "noun", "defs": ["the plant Cassia sophera of Caesalpiniaceae family; (?)."]}], "ಕ್ರತು": [{"type": "noun", "defs": ["the act of offering the life of a person or animal or some object, (sometimes, symbolically) in propitiation of or homage to a deity; a sacrifice.", "determination - a) a resolving or determining; deciding b) the thing determined upon; decision as to future action; resolve.", "something one intends to get or do; intention; an aim; a purpose.", "name of a hell.", "the thorny creeper Caesalpinia bonduc of Caesalpinieae family.", "its silver coloured nut.", "(myth.) name of one of the fourteen divine progenitors.", "one of the lower deities or communal gods (Viśvedēvas) of village folks.", "(math.) a number withthirty four zeros following the number 1.", "Viṣṇu.", "intelligence; talent.", "power; ability; capacity.", "a strong wish or craving; a desire.", "the fourth month in the Hindu calendar.", "in animals and plants, a part composed of specialised tissues and adapted to the performance of a specific function or functions; an organ.", "fitness; aptness; appropriateness.", "a deliberating or considering carefully; deliberation; consideration.", "divine inspiration."]}], "ಕ್ರತುಕರ್ತೃ": [{"type": "noun", "defs": ["the performer of a (religious) sacrifice."]}], "ಕ್ರತುಜೀವನ": [{"type": "noun", "defs": ["a life that is resolutely aiming at a specific goal or directed toward a specific end."]}], "ಕ್ರತುಧ್ವಂಸಿ": [{"type": "noun", "defs": ["(myth.) Śiva, the destroyer of a sacrifice (being performed by DakṣaBrahma)."]}], "ಕ್ರತುಪತಿ": [{"type": "noun", "defs": ["the performer of a (religious) sacrifice."]}], "ಕ್ರತುಪುರುಷ": [{"type": "noun", "defs": ["Viṣṇu, the presiding deity of all religious sacrifices."]}], "ಕ್ರತುಬುದ್ಧಿ": [{"type": "noun", "defs": ["the mind that is unwavering.", "a man having or showing a fixed, firm purpose or strong determination, resoluteness."]}], "ಕ್ರತುಭುಗ": [{"type": "noun", "defs": ["a deity who receives the oblations in a sacrifice; any god (in gen.)."]}], "ಕ್ರತುಭುಜ": [{"type": "noun", "defs": ["= ಕ್ರತುಭುಗ."]}], "ಕ್ರತುಮಯ": [{"type": "verb", "defs": ["performing (many or numerous) sacrifices."]}, {"type": "noun", "defs": ["(myth.) the person whose subtle nature is sacrifice; the soul."]}], "ಕ್ರತುಮೂರ್ತಿ": [{"type": "noun", "defs": ["= ಕ್ರತುಪುರುಷ."]}], "ಕ್ರತುರಂಗ": [{"type": "noun", "defs": ["a place, esp. a raised platform, where sacrifices or offerings are made to a god; an altar."]}], "ಕ್ರತುವಿನಾಶ": [{"type": "noun", "defs": ["= ಕ್ರತುಧ್ವಂಸಿ."]}], "ಕ್ರತುಶಕ್ತಿ": [{"type": "noun", "defs": ["determination to do, firmness or steadfastness of purpose in carrying out something."]}], "ಕ್ರತುಹರ": [{"type": "noun", "defs": ["= ಕ್ರತುಧ್ವಂಸಿ."]}], "ಕ್ರಥನ": [{"type": "noun", "defs": ["a killing; slaughter."]}], "ಕ್ರಮ": [{"type": "noun", "defs": ["the act or an instance of moving; movement; a move.", "the act of a person or thing that walks; walking.", "the end part of the leg, on which a person or animal stands or moves; the foot.", "the sequence or arrangement of things or events; a series; succession; an order.", "any property that is inherited from ancestors, in the natural course.", "a social convention carried on by tradition and enforced by social disapproval of any violation; a custom.", "a fixed or definite system.", "a way or method in which something is to be done or happens; a manner; a method.", "a legal proceeding by which one seeks to have a wrong put right.", "a particular manner of reciting Vedic texts, leaving at each time one word and taking up another.", "(rhet.) a figure of speech, in which each element of a group refers respectively to corresponding elements of a previous group.", "a beginning; commencement.", "(pros.) a compound of consonants coming in the beginning of each line of a verse.", "the position assumed by an animal before making a jump on its prey.", "ಕ್ರಮ ಕೈಗೊಳ್ಳು krama kaigoḷḷu to take action to accomplish (something); 2. to take a legal proceeding by which wrong can be put right; ಕ್ರಮ ಜರುಗಿಸು krama jarugisu = ಕ್ರಮ ಕೈಗೊಳ್ಳು."]}], "ಕ್ರಮಂದಪ್ಪು": [{"type": "verb", "defs": ["= ಕ್ರಮತಪ್ಪು."]}], "ಕ್ರಮಗಣನ": [{"type": "noun", "defs": ["= ಕ್ರಮಗಣನೆ."]}], "ಕ್ರಮಗಣನೆ": [{"type": "noun", "defs": ["a counting or taking into consideration in an orderly manner or reckoning in successive order."]}], "ಕ್ರಮಗೆಡಿಸು": [{"type": "verb", "defs": ["to spoil, distort the order, manner, method, routine or discipline."]}], "ಕ್ರಮಗೆಡು": [{"type": "verb", "defs": ["= ಕ್ರಮತಪ್ಪು."]}], "ಕ್ರಮಗೊಳಿಸು": [{"type": "verb", "defs": ["to set or arrange something in an order; to adjust to a particular standard, method, routine, etc."]}], "ಕ್ರಮಗೊಳ್ಳು": [{"type": "verb", "defs": ["to follow a method, manner; to adhere to a discipline."]}], "ಕ್ರಮಣ": [{"type": "noun", "defs": ["the act or an instance of moving; a move; movement."]}], "ಕ್ರಮತಪ್ಪು": [{"type": "verb", "defs": ["to lose or miss the order, manner, method or routine."]}], "ಕ್ರಮದಪ್ಪು": [{"type": "verb", "defs": ["= ಕ್ರಮತಪ್ಪು."]}], "ಕ್ರಮಪಡಿಸು": [{"type": "verb", "defs": ["= ಕ್ರಮಗೊಳಿಸು."]}], "ಕ್ರಮಪ್ರಾಪ್ತ": [{"type": "adjective", "defs": ["received, inherited (a property, authority, title, etc.) by the laws of inheritance (upon the death of an ancestor).", "fit; proper; appropriate."]}], "ಕ್ರಮಪ್ರಾಪ್ತಿ": [{"type": "noun", "defs": ["the fact of receiving, inheriting from one's ancestor.", "a property, authority or title so inherited."]}], "ಕ್ರಮಬದ್ಧ": [{"type": "adjective", "defs": ["following or having followed a method order, etc.", "having legal force; properly executed and binding under the law; legally valid."]}], "ಕ್ರಮಬದ್ಧತೆ": [{"type": "noun", "defs": ["the state, quality or fact of being valid in law or in argument, proof, authority, etc.; validity."]}], "ಕ್ರಮಭಂಗ": [{"type": "noun", "defs": ["the fact or an instance of an order, method, legal validity, etc. being disturbed, violated or damaged."]}], "ಕ್ರಮಭ್ರಷ್ಟ": [{"type": "verb", "defs": ["(said of an order, method, legal validity, etc.) that is violated, missed, damaged."]}, {"type": "noun", "defs": ["a man who has violated, missed, neglected his custom, adherence to a rule or order in which some thing was to be done, etc."]}], "ಕ್ರಮಭ್ರಷ್ಟೆ": [{"type": "noun", "defs": ["a woman who has violated, missed, neglected her custom, adherence to a rule or order in which some thing was to be done, etc."]}], "ಕ್ರಮಮುಕ್ತಿ": [{"type": "noun", "defs": ["final emancipation of an individual soul from the worldly affairs got or to be got passing through successive stages in an orderly manner."]}], "ಕ್ರಮಯಿತ": [{"type": "noun", "defs": ["= ಕ್ರಮಿತ2."]}], "ಕ್ರಮಲೋಪ": [{"type": "noun", "defs": ["= ಕ್ರಮಭಂಗ."]}], "ಕ್ರಮವಳಿ": [{"type": "verb", "defs": ["(the order, method, legal validity, routine, discipline, etc.) to be lost or missed."]}], "ಕ್ರಮವಾಚಿ": [{"type": "noun", "defs": ["(gram.) a word used to mention the order, successiveness, sequence, etc."]}], "ಕ್ರಮವಿಕಾಸ": [{"type": "noun", "defs": ["the development, evolution, etc. that - a) has taken a definite order to come to what it is or b) has to take a definite order to come to be."]}], "ಕ್ರಮವಿಕ್ಷೇಪ": [{"type": "noun", "defs": ["a walking step by step."]}], "ಕ್ರಮವಿಡಿ": [{"type": "verb", "defs": ["to follow a method, manner or established custom; to adhere to a discipline."]}], "ಕ್ರಮವಿಪರ್ಯಯ": [{"type": "noun", "defs": ["= ಕ್ರಮಭಂಗ."]}], "ಕ್ರಮವಿರಹಿತ": [{"type": "adjective", "defs": ["wanting a method order, system,etc."]}], "ಕ್ರಮವಿಹಿತ": [{"type": "adjective", "defs": ["adhering to a custom order, method, system, etc."]}], "ಕ್ರಮಶ:": [{"type": "adverb", "defs": ["one after another in order; point by point; serially; seriatim.", "gradually; in the course of."]}], "ಕ್ರಮಸಂಖ್ಯೆ": [{"type": "noun", "defs": ["a number that is one of a series; serial number."]}], "ಕ್ರಮಸಂಧಾನ": [{"type": "noun", "defs": ["the act of putting in the correct, proper or suitable order."]}], "ಕ್ರಮಾಗತ": [{"type": "adjective", "defs": ["traditionally followed; handed from generation to generation.", "occurring or has occured as per a definite or the correct, proper order."]}], "ಕ್ರಮಾಧಿಕ": [{"type": "noun", "defs": ["a man of excellent behaviour.", "a honey-bee (that has many feet)."]}], "ಕ್ರಮಾನುಸರಣೆ": [{"type": "noun", "defs": ["a following of or adherence to, a law, rule, custom order, discipline, etc."]}], "ಕ್ರಮಾಲಂಕಾರ": [{"type": "noun", "defs": ["(rhet.) arrangement of words of a verse, in the natural prose order, as to elucidate the meaning in a lucid manner."]}], "ಕ್ರಮಿಕ": [{"type": "adjective", "defs": ["arranged in, conforming to or exhibiting some regular order; systematic; orderly.", "hereditary - a) of or passed down by, inheritance from an ancestor to a legal heir; ancestral b) having title, right, etc. by inheritance."]}], "ಕ್ರಮಿತ": [{"type": "adjective", "defs": ["moved; passed ahead; gone."]}, {"type": "noun", "defs": ["a man who has studied Vedas in a formal or customary manner."]}], "ಕ್ರಮಿಸು": [{"type": "verb", "defs": ["to move (ahead); to advance; to travel.", "to pass over; to go from one side to the other of; to go across; to cross."]}], "ಕ್ರಮುಕ": [{"type": "noun", "defs": ["the tree Areca catechu of Arecaceae family; areca nut tree.", "its nut; areca nut.", "the evergreen tree Symplocos laurina of Symplocaceae family.", "the mulberry tree Morus indica of Moraceae family."]}], "ಕ್ರಮುಕಸಮಿತಿ": [{"type": "noun", "defs": ["a group of areca nut trees."]}], "ಕ್ರಮೇಣ": [{"type": "adverb", "defs": ["taking or taken place by almost imperceptible steps or degrees; developing or developed little by little, not sharply or suddenly; gradually."]}], "ಕ್ರಮೇಣಕ": [{"type": "noun", "defs": ["= ಕ್ರಮೇಲಕ."]}], "ಕ್ರಮೇಲಕ": [{"type": "noun", "defs": ["a large cud-chewing mammal, domesticated in parts of Africa and Asia, with slender legs, broad cushioned feet, and either one or two fatty humps on the back; a camel."]}], "ಕ್ರಮೇಳಕ": [{"type": "noun", "defs": ["= ಕ್ರಮೇಲಕ."]}], "ಕ್ರಯ": [{"type": "noun", "defs": ["the act or an instance of buying; a purchase.", "price - a) the amount of money or goods for which a thing is bought or sold; b) value or worth. ಕ್ರಯ ಕೊಡು kraya koḍu to pay the price (for a thing purchased); ಕ್ರಯಕ್ಕೆ ಕೊಡು krayakke koḍu to sell (something) for a price; ಕ್ರಯ ಮಾಡು kraya māḍu to get by paying or agreeing to pay money or some equivalent; to purchase; to buy."]}], "ಕ್ರಯಂಗೊಳ್": [{"type": "verb", "defs": ["to purchase (something) for a price."]}], "ಕ್ರಯಚೀಟು": [{"type": "noun", "defs": ["a document evidencing a sale."]}], "ಕ್ರಯದಾರ": [{"type": "noun", "defs": ["a purchaser - a) a man who acquires or aims to acquire possessions; b) a person who purchases something for money; a buyer."]}], "ಕ್ರಯಪಟ್ಟಿ": [{"type": "noun", "defs": ["a list of current prices of items on sale; a price list."]}], "ಕ್ರಯರೂಪ": [{"type": "noun", "defs": ["= ಕ್ರಯ - 1."]}], "ಕ್ರಯವಿಕ್ರಯ": [{"type": "noun", "defs": ["(pl.) the transactions or instances of buying and selling."]}], "ಕ್ರಯವಿಕ್ರಯಿಕ": [{"type": "noun", "defs": ["a man who buys and sells; a trader; a merchant."]}], "ಕ್ರಯಶಕ್ತಿ": [{"type": "noun", "defs": ["a person's financial ability to make purchases.", "the amount that a sum of money etc. can purchase."]}], "ಕ್ರಯಿಕ": [{"type": "noun", "defs": ["= ಕ್ರಯದಾರ."]}], "ಕ್ರಯ್ಯ": [{"type": "noun", "defs": ["a thing kept for sale."]}], "ಕ್ರವಿಂತ": [{"type": "noun", "defs": ["= ಕ್ರಮಿತ2."]}], "ಕ್ರವಿತ": [{"type": "noun", "defs": ["= ಕ್ರಮಿತ2."]}], "ಕ್ರವಿತ್ರ": [{"type": "noun", "defs": ["= ಕ್ರಮಿತ2."]}], "ಕ್ರವ್ಯ": [{"type": "noun", "defs": ["raw flesh of animals."]}], "ಕ್ರವ್ಯಾದ": [{"type": "noun", "defs": ["a flesh-eating man; a demon.", "any carnivorous animal."]}], "ಕ್ರಾಂತ": [{"type": "adjective", "defs": ["gone; passed; crossed (over to another side)."]}, {"type": "noun", "defs": ["the act of moving, walking, etc.", "(dance.) one of the nine sitting postures, keeping the hands on the chin and the head on the shoulder blade (as in shedding tears, expressing grief).", "(dance.) one of the ten movements of the feet; a moving in a circle keeping one foot after another differently off the ground."]}], "ಕ್ರಾಂತದರ್ಶನ": [{"type": "noun", "defs": ["the supposed ability to perceive things that are not in sight or that cannot be seen.", "a man with such ability."]}], "ಕ್ರಾಂತದರ್ಶಿ": [{"type": "noun", "defs": ["= ಕ್ರಾಂತದರ್ಶನ - 2."]}], "ಕ್ರಾಂತದರ್ಶಿತ್ವ": [{"type": "noun", "defs": ["= ಕ್ರಾಂತದರ್ಶನ - 1."]}], "ಕ್ರಾಂತದೃಷ್ಟಿ": [{"type": "noun", "defs": ["= ಕ್ರಾಂತದರ್ಶನ - 1."]}], "ಕ್ರಾಂತಿ": [{"type": "noun", "defs": ["the act of moving, going, advancing.", "any hostile offensive action, esp. with armed forces; an onslaught; an attack; an invasion.", "the actual or imaginary path taken by a celestial body during its periodic revolution around another body.", "a complete or radical change of any kind.", "a large scale movement that can overthrow or has overthrown a government; a revolution.", "any revival of art, literature or learning."]}], "ಕ್ರಾಂತಿಕಾತಿ": [{"type": "noun", "defs": ["a woman whoworks for, characterised by, favours a revolution in a government or social system; a revolutionary woman.", "a woman bringing or causing to bring, about great or radical change."]}], "ಕ್ರಾಂತಿಕಾರ": [{"type": "noun", "defs": ["a man who favours, instigates, advocates or takes part in a revolution; a man bringing or causing to bring, about great or radical change."]}], "ಕ್ರಾಂತಿಕಾರಕ": [{"type": "adjective", "defs": ["pertaining to, characterised by or of the nature of revolution; involving or constituting radical change; pertaining to or advocating political revolution; revolutionary."]}], "ಕ್ರಾಂತಿಕಾರಿ": [{"type": "adjective", "defs": ["= ಕ್ರಾಂತಿಕಾರಕ."]}, {"type": "noun", "defs": ["= ಕ್ರಾಂತಿಕಾರ."]}], "ಕ್ರಾಂತಿಕಾಲ": [{"type": "noun", "defs": ["the period of passing from one condition, form, stage, activity, place, etc. to another.", "the period of a political or social revolution."]}], "ಕ್ರಾಂತಿಜೀವಿ": [{"type": "noun", "defs": ["a person who favours, instigates, advocates or takes part in a revolution; a person bringing or causing to bring, about great or radical change."]}], "ಕ್ರಾಂತಿಪಕ್ಷ": [{"type": "noun", "defs": ["a group of persons or a party who intend or work for radical changes in political or social systems; a revolutionary party; leftists."]}], "ಕ್ರಾಂತಿಪಥ": [{"type": "noun", "defs": ["the actual or imaginary path taken by a celestial body during its periodic revolution around another body; an orbit.", "the course of a revolutionary or revolutionaries."]}], "ಕ್ರಾಂತಿಯುಗ": [{"type": "noun", "defs": ["the period of a political or social revolution.", "the period of great changes (as in art, literature, etc.)."]}], "ಕ್ರಾಂತಿವಾದಿ": [{"type": "noun", "defs": ["= ಕ್ರಾಂತಿಕಾರ."]}], "ಕ್ರಾಂತಿವೃತ್ತ": [{"type": "noun", "defs": ["= ಕ್ರಾಂತಿಪಥ - 1."]}], "ಕ್ರಾಪು": [{"type": "noun", "defs": ["a cutting short of the hair of a person."]}], "ಕ್ರಾಯಕ": [{"type": "noun", "defs": ["a person who buys; a purchaser; a buyer."]}], "ಕ್ರಿ": [{"type": "noun", "defs": ["the doing of something; action.", "an act or thing done.", "behaviour; habitual conduct.", "habitual activity characterised by energy and boldness.", "a usual method or custom; convention; practice.", "religious, ceremonial act, rite, etc.; observance.", "any act of reparation, self-punishment, etc. done in repentance for a sin or wrongdoing; penance."]}], "ಕ್ರಿಜ್ಞಾನ": [{"type": "noun", "defs": ["= ಕ್ರಿಯಾಜ್ಞಾನ."]}], "ಕ್ರಿತ್ತಿ": [{"type": "noun", "defs": ["the tree Betula alba of Betulaceae family, having smooth bark easily peeled off in thin sheets, and hard, close-grained wood; Indian birch tree."]}], "ಕ್ರಿಮಿ": [{"type": "noun", "defs": ["any of several small arthropod animals of the class Insecta, characterised, in the adult state, by division of the body into head, thorax, and abdomen, three pairs of legs on the thorax, and, usu., two pairs of membranous wings.", "(gen.) any small arthropod, usu. wingless, including spiders, centipedes, pill bugs, and mites.", "a resinous substance secreted by various scale insects, esp. by a species (Laccifer lacca, that live on certain fig, soapberry, and acacia trees; lac.", "(fig.) an abject, wretched or contemptible person."]}], "ಕ್ರಿಮಿಕುಲ": [{"type": "noun", "defs": ["(myth.) name of a hell.", "(zool.) a category in the classification of animals, that covers a large class of insecticides; family of insecticides."]}], "ಕ್ರಿಮಿಘ್ನ": [{"type": "noun", "defs": ["the creeper Erycibe paniculata (var. Wightiana) of Convulvulaceae."]}], "ಕ್ರಿಮಿಜ": [{"type": "noun", "defs": ["anything (as a disease) that is caused by insects, worms, etc.", "the fine, soft, shiny fibre produced by silkworms to form their cocoons; silk."]}], "ಕ್ರಿಮಿದಂತ": [{"type": "noun", "defs": ["a tooth having caries; a carious tooth."]}], "ಕ್ರಿಮಿನಾಶಕ": [{"type": "adjective", "defs": ["that kills insects; insecticidal."]}, {"type": "noun", "defs": ["any substance used to kill insects; an insecticide."]}], "ಕ್ರಿಮಿನಾಶಿ": [{"type": "adjective", "defs": ["= ಕ್ರಿಮಿನಾಶಕ1."]}, {"type": "noun", "defs": ["= ಕ್ರಿಮಿನಾಶಕ2; 2) the plant Chrysanthemum cinerariaefolium ( = Pyrethrum cinerariae folium) of Asteraceae family.", "the plant Derris scandens of Papilionaceae family; hog creeper.", "the plant Derris uliginosa of the same family."]}], "ಕ್ರಿಮಿನಾಶಿನಿ": [{"type": "noun", "defs": ["the plant Drosera indica of Droseraceae family, having leaves covered with adhesive hairs that trap insects, which are digested by the plant; sundew plant."]}], "ಕ್ರಿಮಿಬಂಧ": [{"type": "noun", "defs": ["the plant akin to sundew plant, Drosera burmanni of Droseraceae family, having leaves covered with adhesive hairs that trap insects, which are digested by the plant."]}], "ಕ್ರಿಮಿರಾಗ": [{"type": "noun", "defs": ["the dark red colour of lac."]}], "ಕ್ರಿಮಿರೋಗ": [{"type": "noun", "defs": ["any disease or disorder caused by the presence of parasitic worms in the intestines, etc.; worms."]}], "ಕ್ರಿಮಿವಿದೂಷಿತ": [{"type": "adjective", "defs": ["(said of wood and wood articles) eaten away, rendered strengthless by any of a family Bostrychiacae (order Coleopotera) of insects."]}], "ಕ್ರಿಮಿಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["the branch of zoology that deals with insects; entomology."]}], "ಕ್ರಿಮಿಶಾಸ್ತ್ರಜ್ಞ": [{"type": "noun", "defs": ["(masc.) a specialist in entomology, the branch of zoology that deals with insects; entomologist."]}], "ಕ್ರಿಮಿಶಾಸ್ತ್ರಜ್ಞೆ": [{"type": "noun", "defs": ["(fem.) a specialist in entomology, the branch of zoology that deals with insects; entomologist."]}], "ಕ್ರಿಮಿಶುದ್ಧಿಸಂಸ್ಕರಣ": [{"type": "noun", "defs": ["the act of making something free from living micro organisms, as by subjecting to great heat or chemical action; sterilisation."]}], "ಕ್ರಿಮಿಸಂಘ": [{"type": "noun", "defs": ["a host of insects, worms, etc.", "(myth.) name of a hell."]}], "ಕ್ರಿಮಿಹರಣ": [{"type": "noun", "defs": ["the act of killing, destroying insects."]}]}