{"ಕಂಜನಾಳ": [{"type": "noun", "defs": ["the stalk of a lotus plant."]}], "ಕಂಜನೇತ್ರ": [{"type": "noun", "defs": ["Viṣṇu, whose eyes are wide and beautiful like lotus flower (or its petal)."]}], "ಕಂಜನೇತ್ರೆ": [{"type": "noun", "defs": ["a woman having beautiful lotus-like eyes."]}], "ಕಂಜಪತ್ರ": [{"type": "noun", "defs": ["a petal of a lotus flower."]}], "ಕಂಜಪತ್ರಾಂಬಕೆ": [{"type": "noun", "defs": ["a woman having beautiful eyes like lotus-petals."]}], "ಕಂಜಪ್ರಿಯ": [{"type": "noun", "defs": ["the sun, as a friend of lotus flowers."]}], "ಕಂಜಬಾಣ": [{"type": "noun", "defs": ["(myth.) Manmata, who uses lotus flower as an arrow."]}], "ಕಂಜಭವ": [{"type": "noun", "defs": ["Brahma, who manifested himself on a lotus."]}], "ಕಂಜಮುಖಿ": [{"type": "noun", "defs": ["a woman having beautiful face resembling a fully blown lotus flower."]}], "ಕಂಜರ": [{"type": "noun", "defs": ["the sun.", "an elephant.", "the belly.", "Brahma.", "a peacock.", "a hermit; a religious ascetic."]}, {"type": "noun", "defs": ["a short, stabbing weapon whose blade has two curves."]}], "ಕಂಜರಜ": [{"type": "noun", "defs": ["the sugary substance in the lotus flowers."]}], "ಕಂಜರಿ": [{"type": "noun", "defs": ["a small drum that is played by holding in one hand and striking with the other."]}], "ಕಂಜರೀಟ": [{"type": "noun", "defs": ["any small bird of the genus Motacilla with a long tail in frequent up and down motion; a wagtail."]}], "ಕಂಜಲೋಚನ": [{"type": "noun", "defs": ["= ಕಂಜನೇತ್ರ."]}], "ಕಂಜವೈರಿ": [{"type": "noun", "defs": ["the moon, as an enemy of or a person disliked by, lotus."]}], "ಕಂಜಶರ": [{"type": "noun", "defs": ["= ಕಂಜಬಾಣ."]}], "ಕಂಜಸಂಭವ": [{"type": "noun", "defs": ["= ಕಂಜಭವ."]}], "ಕಂಜಸಖ": [{"type": "noun", "defs": ["the sun, as a friend of lotus flowers."]}], "ಕಂಜಸದ್ಮೆ": [{"type": "noun", "defs": ["Goddess Lakṣmi, whose abode is lotus flower."]}], "ಕಂಜಾಕರ": [{"type": "noun", "defs": ["a multitude of lotus flowers.", "a lake or pond abounding with lotus plants."]}], "ಕಂಜಾತ": [{"type": "noun", "defs": ["the lotus plant, which is born in water.", "the upper part of the human body, containing the brain, mouth, and sense organs; the head.", "the hair (growing on the head)."]}], "ಕಂಜಾತನಯನ": [{"type": "noun", "defs": ["= ಕಂಜನೇತ್ರ."]}], "ಕಂಜಾತಪತ್ರ": [{"type": "noun", "defs": ["= ಕಂಜಪತ್ರ."]}], "ಕಂಜಾತಪೀಠ": [{"type": "noun", "defs": ["= ಕಂಜಾಸನ."]}], "ಕಂಜಾಪ್ತ": [{"type": "noun", "defs": ["= ಕಂಜಸಖ."]}], "ಕಂಜಾರಿ": [{"type": "noun", "defs": ["= ಕಂಜವೈರಿ."]}], "ಕಂಜಾಲಯ": [{"type": "noun", "defs": ["a pond or lake where lotus plants have grown.", "ಕಂಜಾಲಯಳ್ kanjālayaḷ Goddess Lakṣmi, whose abode is lotus flower."]}], "ಕಂಜಾಸನ": [{"type": "noun", "defs": ["Brahma, who has a lotus as his seat."]}], "ಕಂಜಾಸ್ತ್ರ": [{"type": "noun", "defs": ["= ಕಂಜಬಾಣ."]}], "ಕಂಜಾಸ್ಯೆ": [{"type": "noun", "defs": ["a woman having beautiful face resembling a fully blown lotus flower."]}], "ಕಂಜಾಳಿ": [{"type": "noun", "defs": ["a multitude of lotus flowers."]}], "ಕಂಜಿ": [{"type": "noun", "defs": ["(dial.) a young bovine animal (as of a cow); a calf."]}, {"type": "noun", "defs": ["(dial.) a club-shaped instrument for pounding substances in a mortar; a pestle."]}], "ಕಂಜೂಷ್": [{"type": "noun", "defs": ["= ಕಂಜೂಷಿ."]}], "ಕಂಜೂಷಿ": [{"type": "noun", "defs": ["a mean or stingy person who hoards wealth and lives miserably; a miser."]}], "ಕಂಜೂಷಿತನ": [{"type": "noun", "defs": ["the characteristic of a miser; greediness; stinginess; miserliness."]}], "ಕಂಜೂಸ್": [{"type": "noun", "defs": ["= ಕಂಜೂಷಿ."]}], "ಕಂಜೇಕ್ಷಣೆ": [{"type": "noun", "defs": ["a woman having beautiful lotus-like eyes."]}], "ಕಂಜೊಡರ್": [{"type": "noun", "defs": ["(fig.) lustre of the eye."]}], "ಕಂಜೋದಯ": [{"type": "noun", "defs": ["= ಕಂಜಭವ."]}], "ಕಂಜೋದರ": [{"type": "noun", "defs": ["= ಕಂಜನಾಭ."]}], "ಕಂಜೋದ್ಭವ": [{"type": "noun", "defs": ["= ಕಂಜಭವ."]}], "ಕಂಟ": [{"type": "noun", "defs": ["an ancient writing implement, a small metal rod with a pointed end for scratching letters on palm leaves; the Indian style.", "that portion of a vessel above its neck."]}, {"type": "noun", "defs": ["(a corrupt form of karaṭa ) the hard outer case of a coconut-kernel; coconut shell."]}, {"type": "noun", "defs": ["a male cat; a tom-cat."]}], "ಕಂಟಕ": [{"type": "noun", "defs": ["a stiff sharp-pointed projection on a plant; a thorn.", "(fig.) a constant annoyance or the person causing it.", "(fig.) a person or thing that obstructs progress; an obstacle.", "erection of hair of the head or body, as from fear; goose flesh; horripilation.", "a man who hunts animals for his living; a hunter; a fowler.", "(astrol.) any of the first, fourth, seventh or tenth houses in the astrological diagram of a person.", "the plant Solanum surattense (=S. xanthocarpum) of Solanaceae family; wild brinjal.", "armed hostilities between two nations; conflict; a war."]}], "ಕಂಟಕಂಬಡೆ": [{"type": "verb", "defs": ["to have, possess thorns on the body (as a plant).", "(fig.) to be involved in a trouble or troubles."]}], "ಕಂಟಕಚಕ್ರ": [{"type": "noun", "defs": ["a wheel having a series of projections, like teeth, on the edge for transferring or receiving motion through a chain, belt or another similar wheel; a cogged wheel."]}], "ಕಂಟಕಚರ್ಮಿ": [{"type": "noun", "defs": ["any marine invertebrate of the phylum Echinodermata, which includes starfishes, sea urchins, brittle-stars, crinoids, and sea cucumbers, typically having five-fold symmetry, a calcareous skeleton, and tube feet operated by water pressure; echinoderm."]}], "ಕಂಟಕಟಿ": [{"type": "noun", "defs": ["determination - a) the quality of being resolute; b) a firm intention."]}], "ಕಂಟಕದ್ವಾರ": [{"type": "noun", "defs": ["a thick door (as of a fort or as the main entrance of a town, temple etc.) strengthened with horn-like metal projections."]}], "ಕಂಟಕನಾಶ": [{"type": "noun", "defs": ["(fig.) the state of being free or freed from obstacles, difficulties or dangers.", "(fig.) he who has overcome obstacles, difficulties or dangers on his way."]}], "ಕಂಟಕಫಲ": [{"type": "noun", "defs": ["the fruit of the tree Artocarpus integra of Moraceae family, with thick skin having thorn-like hard projections; jackfruit."]}], "ಕಂಟಕಭೂಪ": [{"type": "noun", "defs": ["(fig.) a hostile king."]}], "ಕಂಟಕರೂಪ": [{"type": "noun", "defs": ["(fig.) he who causes, is causing annoyance, danger; a man who is unfriendly, antagonistic."]}], "ಕಂಟಕವಕ್ರಿಮ": [{"type": "noun", "defs": ["the condition or fact of (a thorn) being crooked (as of the thorn on rose plant).", "the quality or tendency of a person who annoys another or others constantly."]}], "ಕಂಟಕಸ್ಥಿತಿ": [{"type": "noun", "defs": ["the state or fact of being full of thorns; a thorny condition.", "the condition of being full of obstacles, vexations, pain, etc."]}], "ಕಂಟಕಾಂಕುರ": [{"type": "noun", "defs": ["(fig.) the erection of hair of the head or body, as from fear, sudden surprise or joy; horripilation."]}], "ಕಂಟಕಾರಿ": [{"type": "noun", "defs": ["the plant Solanum surattense (=S. xanthocarpum) of Solanaceae family.", "its fruit; wild brinjal.", "foot coverings, as shoes, boots, slippers, etc.; footwear."]}], "ಕಂಟಕಾರಿಕೆ": [{"type": "noun", "defs": ["= ಕಂಟಕಾರಿ.", "the plant Solanum surattense (=S. xanthocarpum) of Solanaceae family.", "its fruit; wild brinjal.", "the tree, Sapindus emarginatus, of Sapindaceae family; soapnut tree, nuts of which are used as soap."]}], "ಕಂಟಕಿ": [{"type": "noun", "defs": ["=ಕಂಟಕಫಲ.", "the state or fact of being full of thorns; a thorny condition.", "a fish (in gen.) 4) a plant that has thorns.", "a woman who is troublesome or vexatious.", "a man who annoys, bothers or irritates."]}], "ಕಂಟಕಿತ": [{"type": "adjective", "defs": ["having the hair of the body erected from fear, surprise or excessive joy."]}], "ಕಂಟಜವಾಬು": [{"type": "noun", "defs": ["an irrelevant, arrogant or haughty reply."]}], "ಕಂಟಣಿಸು": [{"type": "verb", "defs": ["= ಕಂಟಳಿಸು."]}], "ಕಂಟಣೆ": [{"type": "noun", "defs": ["= ಕಂಟಲೆ."]}], "ಕಂಟಣೆಯೆತ್ತು": [{"type": "noun", "defs": ["= ಕಂಟಲೆಯೆತ್ತು."]}], "ಕಂಟಪುಚ್ಚೆ": [{"type": "noun", "defs": ["(dial.) a male cat."]}], "ಕಂಟಮೊನೆ": [{"type": "noun", "defs": ["the pointed end of a small metal rod used in ancient times for writing on palm leaves."]}], "ಕಂಟಯ": [{"type": "noun", "defs": ["= ಕಂಟಿಯ."]}], "ಕಂಟಲಿ": [{"type": "noun", "defs": ["= ಕಂಟಲೆ."]}], "ಕಂಟಲೆ": [{"type": "noun", "defs": ["a twin large jute bags joined together hung on both side of an ox for carrying load.", "a long woven jute sheet used to make bags; ನೆಂಟರೆಲ್ಲಾ ಖರೆ, ಕಂಟಲೆ ಚೀಲಕ್ಕೆ ಕೈಹಾಕಬೇಡಿ neṇṭarella khare, kaṇṭale cīlakke kaihākabēḍi I love you well, but touch not my pocket."]}], "ಕಂಟಲೆಯೆತ್ತು": [{"type": "noun", "defs": ["an ox used for carrying loads in ಕಂಟಲೆ on its back."]}], "ಕಂಟವಣ": [{"type": "noun", "defs": ["a tax levied on the profession of clerks."]}], "ಕಂಟಳಿಸು": [{"type": "verb", "defs": ["to become smaller or contract oneself as by the action of moisture, heat, cold or fear; to shrink; to recoil.", "to shrink from disgust, hatred, etc.; to detest; to abhor; to abominate.", "to get excited as from excessive happiness or encouragement.", "to have an involuntary spasm of the diaphragm and respiratory organs, with sudden closure of the glottis and characteristic cough-like sound; to hiccup.", "to fear; to be afraid (of).", "to express or feel grief for or about; to lament; to grieve."]}], "ಕಂಟಾಲ": [{"type": "noun", "defs": ["the plant Echinops echinatus of Asteraceae family.", "the hedge plant Agave cantala of Amaryllidaceae family."]}], "ಕಂಟಾಳ": [{"type": "noun", "defs": ["= ಕಂಟಲೆ."]}], "ಕಂಟಿ": [{"type": "noun", "defs": ["a string (usu. with black glass beads) worn round the neck as an ornament; a necklace."]}, {"type": "adjective", "defs": ["having (many) thorns."]}, {"type": "noun", "defs": ["a thorny plant having many stems branching out low instead of one main stem or trunk; a thorny shrub.", "a group of trees or other plants.", "the tree Acacia catechu var. typica of Mimosae family.", "a kind weapon having horn-like metal projections.", "a village servant whose duty is to regulate and manage water supply to the irrigated lands.", "(fig.) molestation; vexation; annoyance."]}], "ಕಂಟಿಕೆ": [{"type": "noun", "defs": ["a ball of thread put into the weaveṛs shuttle."]}, {"type": "noun", "defs": ["= ಕಂಟಿ1."]}, {"type": "noun", "defs": ["an ancient writing implement, a small metal rod with a pointed end for scratching letters on palm leaves; the Indian style."]}], "ಕಂಟಿಗ": [{"type": "noun", "defs": ["= ಕಂಟಿ3 - 6."]}], "ಕಂಟಿಯ": [{"type": "noun", "defs": ["a stiff sharp-pointed projection on a plant; a thorn.", "(fig.) a constant annoyance, impediment; a person causing it."]}], "ಕಂಟಿಯದಾರ": [{"type": "noun", "defs": ["a thick door (as of a fort or as the main entrance of a town, temple etc.) strengthened with horn-like metal projections."]}], "ಕಂಟಿಯಬಾರ": [{"type": "noun", "defs": ["= ಕಂಟಿಯದಾರ."]}], "ಕಂಟಿರಾಯಿ": [{"type": "noun", "defs": ["an old gold coin (now obs.)."]}], "ಕಂಟಿಸು": [{"type": "verb", "defs": ["to irritate especially by repeated acts; to harass; to annoy; to molest."]}], "ಕಂಟು": [{"type": "noun", "defs": ["a sloping ledge in a wall etc. where the thickness of the part above is diminished; an offset in the wall of a well or at the foot of a wall of a building.", "the portion of a vessel that is above its neck.", "a stairway set on the wall of a well to go down and up."]}, {"type": "noun", "defs": ["the bad smell or taste of stale fats or oils; rancidity.", "the burnt portion of a wick.", "intense dislike or ill will; hatred.", "the dried coconut meat of inferior quality, oil extracted from which is used in making soaps.", "a violent contention or altercation between individuals; a quarrel."]}, {"type": "noun", "defs": ["a thin and weak wooden beam."]}], "ಕಂಟೆಯದರ": [{"type": "noun", "defs": ["= ಕಂಟಿಯದಾರ."]}], "ಕಂಟೆಯದಾರ": [{"type": "noun", "defs": ["= ಕಂಟಿಯದಾರ."]}], "ಕಂಟೆಯಬಾರ": [{"type": "noun", "defs": ["= ಕಂಟಿಯದಾರ."]}], "ಕಂಟೆರು": [{"type": "noun", "defs": ["= ಕಂಟೆರುಗು."]}], "ಕಂಟೆರುಗು": [{"type": "noun", "defs": ["(dial.) a large, biting, black ant, Formica compressa."]}], "ಕಂಠ": [{"type": "noun", "defs": ["that part of a human or animal joining the head to the body; the neck.", "the front part of the neck.", "the upper part of the passage leading from the mouth and nose to the stomach and lungs; the throat.", "a narrow part between the top portion or mouth and the body or base, of a vessel.", "sound made through the mouth by human beings in singing, talking etc.; voice.", "the whole physical structure of human beings or animals; the body.", "the state or quality of being near; nearness in space; proximity.", "a stretch of rising land at the edge of a body of water, as on either sides of a river, all the sides of a lake, pond, etc.", "an ancient writing implement, a small metal rod with a pointed end for scratching letters on palm leaves; the Indian style.", "ಕಂಠಚಾಮೀಕರ ನ್ಯಾಯ kaṇṭha cāmīkara nyāya the maxim of a person searching for the ornament which he is wearing around his neck; a looking for one's ass sitting on his back; ಕಂಠ ಬಿಗಿದುಬರು (one's throat) to get choked from emotions as joy, grief, etc.; to become strained with emotion; ಕಂಠಮಟ್ಟ ಕುಡಿದಿರು kaṇṭhamaṭṭa kuḍidiru to be very drunk; to be as drunk as a lord; ಕಂಠ ಶೋಷಿಸಿಕೊಳ್ಳು kaṇṭha śoṣisikoḷlu to speak, teach or advice in vain; ಕಂಠ ಶೋಸಿಕೊಳ್ಳು kaṇṭhaśosikoḷḷu = ಕಂಠ ಶೋಷಿಸಿಕೊಳ್ಳು."]}], "ಕಂಠಕಚ್ಚರ": [{"type": "noun", "defs": ["a leather bag, that can be hung across the shoulder, used for carrying water."]}], "ಕಂಠಕಾರಿ": [{"type": "noun", "defs": ["the plant Solanum surattense (= S. xanthocarpum) of Solanaceae family; wild brinjal."]}], "ಕಂಠಕುಬ್ಜ": [{"type": "noun", "defs": ["an acutely disordered state of mind involving incoherent speech, hallucinations, and frenzied excitement, occurring in metabolic disorders, intoxication, fever, etc; a kind of delirium."]}], "ಕಂಠಗತ": [{"type": "adjective", "defs": ["reaching the neck or being neck-high.", "being in an inescapable, dangerous situation."]}, {"type": "noun", "defs": ["a bad or dangerous situation that cannot be escaped from or avoided."]}], "ಕಂಠಗವಾಯು": [{"type": "noun", "defs": ["a person in the last stage of his or her life; a dying person."]}], "ಕಂಠಗತಾಸು": [{"type": "noun", "defs": ["= ಕಂಠಗವಾಯು."]}], "ಕಂಠಗರಲ": [{"type": "noun", "defs": ["Śiva, who drank poison, but which stayed at his throat and turned it black."]}], "ಕಂಠಗ್ರಹ": [{"type": "noun", "defs": ["a holding of another's neck (as to stifle by suffocation)."]}], "ಕಂಠಣಿಸು": [{"type": "verb", "defs": ["= ಕಂಟಳಿಸು."]}], "ಕಂಠಣೆಯೆತ್ತು": [{"type": "noun", "defs": ["= ಕಂಟಲೆಯೆತ್ತು."]}], "ಕಂಠತಾಲವ್ಯ": [{"type": "adjective", "defs": ["pronounced using both the throat and the palate; velar-palatal."]}, {"type": "noun", "defs": ["the letter (L) which is pronounced using both the throat and the palate; the sound so produced; a velar-palatal sound."]}], "ಕಂಠತ್ರಾಣ": [{"type": "noun", "defs": ["the strength of one's voice.", "a gorget - a) a piece of armor to protect the throat; b) an article of clothing covering the neck and breast of a woman."]}], "ಕಂಠದಾನ": [{"type": "noun", "defs": ["the act of delivering the dialogues or rendering a song for another in a cinema."]}], "ಕಂಠನಾಳ": [{"type": "noun", "defs": ["the structure of muscle and cartilage at the upper end of the human trachea, containing the vocal cords and serving as the organ of voice; the larynx."]}], "ಕಂಠಪಟ್ಟಿ": [{"type": "noun", "defs": ["a cloth or a band worn around the neck; a tie or scarf."]}], "ಕಂಠಪಟ್ಟಿಕೆ": [{"type": "noun", "defs": ["= ಕಂಠಪಟ್ಟಿ."]}], "ಕಂಠಪತ್ರ": [{"type": "noun", "defs": ["a palm leaf used, in ancient times, to write on with a style."]}], "ಕಂಠಪಾಠ": [{"type": "noun", "defs": ["the act of reading repeatedly as to commit the subject so read to one's memory; a learning by heart."]}], "ಕಂಠಪಾವಡ": [{"type": "noun", "defs": ["a handkerchief or scarf worn around the neck."]}], "ಕಂಠಪೂರ್ತಿ": [{"type": "adverb", "defs": ["till one's neck; neck-high.", "(eating or drinking) to one's full."]}], "ಕಂಠಬಂಧ": [{"type": "noun", "defs": ["= ಕಂಠಪಟ್ಟಿಕೆ."]}], "ಕಂಠಭೂಷೆ": [{"type": "noun", "defs": ["a kind of ornament for the neck."]}], "ಕಂಠಮಣಿ": [{"type": "noun", "defs": ["the projection formed in the front of the throat by the thyroid cartilage (seen chiefly in men).", "a gem at the centre of a neck-ornament."]}], "ಕಂಠಮಾಲೆ": [{"type": "noun", "defs": ["a string or garland worn around the neck."]}], "ಕಂಠರುತಿ": [{"type": "noun", "defs": ["the sound produced by human beings while talking or singing."]}], "ಕಂಠಲಗ್ನ": [{"type": "adjective", "defs": ["fastened or clasped to one's neck; embraced."]}, {"type": "noun", "defs": ["a person who has embraced another."]}], "ಕಂಠವಣ": [{"type": "noun", "defs": ["a tax levied on the profession of clerks."]}], "ಕಂಠವಸ್ತ್ರ": [{"type": "noun", "defs": ["a handkerchief or scarf worn around the neck."]}], "ಕಂಠವ್ಯ": [{"type": "adjective", "defs": ["= ಕಂಠ್ಯ1."]}, {"type": "noun", "defs": ["= ಕಂಠ್ಯ2."]}], "ಕಂಠಶಾಲೂಕ": [{"type": "noun", "defs": ["a throat disease caused by the phlegm."]}], "ಕಂಠಶುದ್ಧಿ": [{"type": "noun", "defs": ["clarity in one's voice."]}], "ಕಂಠಶೋಷ": [{"type": "noun", "defs": ["= ಕಂಠಶೋಷಣೆ."]}], "ಕಂಠಶೋಷಣೆ": [{"type": "noun", "defs": ["(fig.) the act or an instance of speaking, teaching or advising in vain."]}], "ಕಂಠಶ್ರೀ": [{"type": "noun", "defs": ["a very good clear and melodious voice."]}], "ಕಂಠಸೂತ್ರ": [{"type": "noun", "defs": ["a string or necklace for the neck.", "the thread worn by a few religious community men over the left shoulder and under the right arm; sacred thread.", "(erotics) a particular kind in embracing."]}], "ಕಂಠಸ್ಥ": [{"type": "adjective", "defs": ["being, settled in the throat.", "(fig.) learnt by-heart by repeated and concentrated reading; committed to memory."]}, {"type": "noun", "defs": ["(fig.) the act of reading repeatedly as to commit the subject so read to one's memory; a learning by heart."]}], "ಕಂಠಾಭರಣ": [{"type": "noun", "defs": ["any ornament for the neck."]}], "ಕಂಠಾಲ": [{"type": "noun", "defs": ["a small, open vessel or watercraft propelled by oars; a boat.", "anything that is carried; a load; a burden.", "a physical combat between two hostile individuals, group of persons, nations, etc.; a war.", "a large cud-chewing mammal, of the genus of Camelus, domesticated in some parts, with slender legs, broad cushioned feet, and a fatty hump on the back; a camel.", "any of esculent roots.", "a churning vessel.", "a receptacle of flexible material with an opening at the top and with or without handles; a bag."]}], "ಕಂಠಿ": [{"type": "noun", "defs": ["that part of a human or animal joining the head to the body; the neck.", "the front part of the neck.", "the upper part of the passage leading from the mouth and nose to the stomach and lungs; the throat.", "a necklace; an ornament for the neck.", "a rope round the neck of a horse."]}, {"type": "noun", "defs": ["the tree Acacia catechu var. typica of Mimoseae family.", "the leguminous twining shrub Clitoria ternatea of Papilionaceae family with blue flowers, the root of which is used as a dieretic and demulcent; butterfly-pea."]}], "ಕಂಠಿಕಾಬಂಧ": [{"type": "noun", "defs": ["the act or an occasion of wearing or causing to wear a neck ornament (as observed in royal families)."]}], "ಕಂಠಿಕಾಳಾಯಿ": [{"type": "noun", "defs": ["the internal shell of cuttlefish, used as a food supplement for caged birds or as a polishing agent; cuttlefish-bone."]}], "ಕಂಠಿಕೆ": [{"type": "noun", "defs": ["a single stringed pearl-necklace."]}], "ಕಂಠಿತ": [{"type": "adjective", "defs": ["wailed; grieved.", "eager; enthusiastic."]}], "ಕಂಠಿಸರ": [{"type": "noun", "defs": ["a necklace made using ಕಂಠೀರಾಯಿ, an erstwhile gold coin."]}], "ಕಂಠೀರವ": [{"type": "noun", "defs": ["lion (as the roaring animal).", "an elephant in rut.", "any of several large usu. grey and white birds of the family Columbidae, esp. Columba livia, often domesticated and bred and trained to carry messages etc.; a dove; a pigeon."]}], "ಕಂಠೀರವಗುಳಿಗೆ": [{"type": "noun", "defs": ["= ಕಂಠೀರಾಯಿ."]}], "ಕಂಠೀರವಮಧ್ಯೆ": [{"type": "noun", "defs": ["a woman with a very slender waist."]}], "ಕಂಠೀರವವಾಹನೆ": [{"type": "noun", "defs": ["Goddess Pārvati, whose vehicle is a lion."]}], "ಕಂಠೀರವಾಸಂದಿ": [{"type": "noun", "defs": ["the chair on which a king, monarch sits on formal or ceremonial occasions and which is usu. is on a dais, covered with a canopy, and highly decorated; a throne.", "a prominent seat for a deity."]}], "ಕಂಠೀರಾಯಿ": [{"type": "noun", "defs": ["an old gold coin (now obs.)."]}], "ಕಂಠೀಸರ": [{"type": "noun", "defs": ["= ಕಂಠಿಸರ."]}], "ಕಂಠೆ": [{"type": "noun", "defs": ["the plant Solanum surattense (= S. xanthocarpum) of Solanaceae family; wild brinjal."]}], "ಕಂಠೋಕ್ತ": [{"type": "adjective", "defs": ["clearly uttered; clearly spoken."]}], "ಕಂಠೋಷ್ಠ್ಯ": [{"type": "adjective", "defs": ["articulated with the back of the tongue touching or near the soft palate and with one or both lips; velar and labial."]}, {"type": "noun", "defs": ["a letter articulated with the back of the tongue touching or near the soft palate and with one or both lips; a velar and labial letter (ಔ).", "its sound."]}], "ಕಂಠ್ಯ": [{"type": "adjective", "defs": ["articulated with the back of the tongue touching or near the soft palate; velar."]}, {"type": "noun", "defs": ["any of the letters (ಅ, ಆ, ಕ, ಖ, ಗ, ಘ, ಙ, ಹ) articulated with the back of the tongue touching or near the soft palate, and the sound so produced; a velar."]}], "ಕಂಠ್ಯೀಕರಣ": [{"type": "noun", "defs": ["the act or an instance of modifying the pronunciation of (a sound) by having the back of the tongue raised toward the velum during articulation."]}], "ಕಂಡ": [{"type": "noun", "defs": ["a portion broken off from a larger object; a bit; a part; a piece.", "the soft substance of the body (of a person or animal) between the skin and the bones; flesh."]}], "ಕಂಡಗರಿಕೆ": [{"type": "noun", "defs": ["the red cedar tree, Cedrela toona of Coniferae family, that grows upto 100 ft. high."]}], "ಕಂಡಗೆ": [{"type": "noun", "defs": ["the act of cutting, gathering in of a crop; harvest."]}], "ಕಂಡಡೊಕ್ಕರ": [{"type": "noun", "defs": ["a particular kind of lock or grip in wrestling."]}], "ಕಂಡಣಿಸು": [{"type": "verb", "defs": ["= ಕಂಡರಿಸು."]}], "ಕಂಡಣೆ": [{"type": "noun", "defs": ["the final agreement, arrangement or adjustment."]}], "ಕಂಡಣೆಪತ್ರ": [{"type": "noun", "defs": ["a document evidencing the final agreement, arrangement or settlement."]}], "ಕಂಡಣೆಹಣ": [{"type": "noun", "defs": ["the money paid as the consideration for the final agreement or settlement."]}], "ಕಂಡನಿ": [{"type": "noun", "defs": ["a very hard wooden bowl in which corn, grain or other substances are ground or pounded to a powder with a pestle; a mortar.", "a tool, usu. club-shaped, used to pound or grind substances in a mortar; a pestle."]}], "ಕಂಡನೆ": [{"type": "noun", "defs": ["= ಕಂಡಣೆ."]}], "ಕಂಡಪಟ": [{"type": "noun", "defs": ["= ಕಂಡವಡ."]}], "ಕಂಡಪಿಳ್ಳೆ": [{"type": "noun", "defs": ["an unborn young human being in its later stages, from about eighth week after conception (until birth); a foetus."]}], "ಕಂಡಬಟ್ಟೆ": [{"type": "adverb", "defs": ["= ಕಂಡಾಬಟ್ಟೆ."]}], "ಕಂಡಬತ್ತ": [{"type": "noun", "defs": ["the grass Dichanthium caricosum of Poaceae family, that grows as a weed in paddy fields."]}], "ಕಂಡಭೂಮಿ": [{"type": "noun", "defs": ["a portion of a paddy field."]}], "ಕಂಡರಣೆ": [{"type": "noun", "defs": ["the act or art of carving wood, chiselling stone, casting or welding metal, moulding clay or wax, etc. into three-dimensional representations, as statues, figures, forms, etc. sculpture.", "that which is sculptured; any work of sculpture."]}], "ಕಂಡರಣೆಕಾರ": [{"type": "noun", "defs": ["a man who models, carves or otherwise fashions figures or forms of clay, stone, metal, wood, etc.; artist who creates three-dimensional representations; a sculptor."]}], "ಕಂಡರಣೆಗೆಯ್": [{"type": "verb", "defs": ["= ಕಂಡರಿಸು."]}], "ಕಂಡರಿಸು": [{"type": "verb", "defs": ["to make or shape by or as by cutting, chipping, hewing, etc.; to sculpture; to carve.", "to divide, cut or severe with or as with a knife, sword etc."]}], "ಕಂಡರೆ": [{"type": "noun", "defs": ["any one of the system of thick-walled blood vessels that carry blood away from the heart; an artery."]}], "ಕಂಡಲಿ": [{"type": "noun", "defs": ["a tool with a curved or hooked blade at one end, for pruning and cutting; a bill-hook."]}], "ಕಂಡಲೆ": [{"type": "noun", "defs": ["the aquatic tree Rhizophora mucronata of Rhizophoraceae family; mangrove."]}], "ಕಂಡವಡ": [{"type": "noun", "defs": ["any piece of cloth used as a concealing or separating screen; a veil."]}], "ಕಂಡವರು": [{"type": "noun", "defs": ["see under ಕಾಣ್."]}], "ಕಂಡವಿಡು": [{"type": "verb", "defs": ["(the body) to have well-developed muscles; to become robust."]}], "ಕಂಡಸಕ್ಕರೆ": [{"type": "noun", "defs": ["sugar cast into flat pieces; candied sugar."]}], "ಕಂಡಸಿ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಕಂಡಳಿಸು": [{"type": "verb", "defs": ["= ಕಂಡರಿಸು."]}], "ಕಂಡಾಪಟ್ಟೆ": [{"type": "adverb", "defs": ["= ಕಂಡಾಬಟ್ಟೆ."]}], "ಕಂಡಾಬಟ್ಟೆ": [{"type": "adverb", "defs": ["(acting, talking etc.) as one pleases; without check or restraint; wildly."]}], "ಕಂಡಾಲ": [{"type": "noun", "defs": ["a twin large jute bags joined together hung on both side of an ox for carrying load."]}], "ಕಂಡಾಳು": [{"type": "noun", "defs": ["a small plant Commelina paludosa (=C. obliqua) of commelinaceae family."]}], "ಕಂಡಿ": [{"type": "noun", "defs": ["an opening in or through anything; a break; a gap; a hole; an aperture.", "something unexplained, unknown or kept secret; mystery.", "the usu. path wild animals use to cross over from one forest to another.", "a path (usu. a secret one).", "ಕಂಡಿಮಾಡು kaṇḍimāḍu to make a hole in or into."]}, {"type": "noun", "defs": ["an old measure of weight (which was varying from place to place).", "an extent of agricultural land that requires one kaṇḍi (ಕಂಡಿ2 -sense 1) for being sown.", "an area (of land) equal to ten thousand squares of one hundred ft. each (totally 10,00,000 sq ft.)."]}], "ಕಂಡಿಕೆ": [{"type": "noun", "defs": ["a ball of thread put into the weaveṛs shuttle.", "ಕಂಡಿಕೆಮುಳ್ಳು k aṇḍikemuḷḷu a pin in the weaveṛs shuttle that holds a ball of thread."]}, {"type": "noun", "defs": ["a portion broken off from a larger object; a bit; a part; a piece.", "a main division of a book; a chapter.", "a stalk - a) the main stem of a herbaceous plant; b) the slender attachment or support of a leaf, flower, fruit, etc."]}], "ಕಂಡಿತ": [{"type": "noun", "defs": ["a firm belief or opinion; doubtlessnes."]}, {"type": "adverb", "defs": ["definitely; certainly; surely; positively; undoubtedly."]}], "ಕಂಡಿತಂ": [{"type": "adverb", "defs": ["= ಕಂಡಿತ2."]}], "ಕಂಡಿತವಾಚೆ": [{"type": "noun", "defs": ["a definite and unambiguous opinion."]}], "ಕಂಡಿತವಾದಿ": [{"type": "noun", "defs": ["a man who speaks out the truth or his opinion in plain words without any fear or favour.", "ಕಂಡಿತವಾದಿ ಲೋಕವಿರೋಧಿ kaṇḍitavādi lōkavirōdhi world hates him who speaks truth in plain words."]}], "ಕಂಡಿಬೀೞ್": [{"type": "verb", "defs": ["to have a hole; to become porous; to be broken."]}], "ಕಂಡಿವಲ್": [{"type": "noun", "defs": ["(pl.) teeth (of a human being) that do not have closeness but gap in between."]}], "ಕಂಡಿವಲೆ": [{"type": "noun", "defs": ["a net composed of different pieces."]}], "ಕಂಡಿಸು": [{"type": "verb", "defs": ["to divide, break or make separate, esp. by cutting; to sever.", "to destroy; to spoil.", "to be divided, broken; to be cut."]}, {"type": "verb", "defs": ["to make or shape by or as by cutting, chipping, hewing, etc.; to sculpture; to carve."]}], "ಕಂಡು": [{"type": "noun", "defs": ["a ball of thread."]}, {"type": "noun", "defs": ["a portion broken off from a larger object; a bit; a part; a piece."]}, {"type": "noun", "defs": ["= ಕಂಡೂತಿ."]}, {"type": "noun", "defs": ["a mark left on the skin when tied fast.", "a slight hollow made in a surface by a blow or pressure; a hallowed out place, cavity etc. made on the surface of a wood piece."]}, {"type": "noun", "defs": ["(dial.) a man who steals, esp. secretly and without violence; a thief."]}], "ಕಂಡುಕ": [{"type": "noun", "defs": ["= ಕಂಡುಗ."]}], "ಕಂಡುಕಟ್ಟು": [{"type": "verb", "defs": ["to evade or avoid doing (something that should be done); to shirk."]}], "ಕಂಡುಗ": [{"type": "noun", "defs": ["an old measure of capacity which was equal to twenty koḷagas.", "the act of cutting, gathering of a crop; harvest.", "(fig.) anything being in excess; substantial quantity.", "ಕಂಡುಗವನ್ನು ಬಳ್ಳದಲ್ಲಿ ಅಳೆ kaṇḍugavannu baḷḷadalli aḷe (fig.) to accomplish a big or hard work, easily."]}], "ಕಂಡುವೋಗು": [{"type": "verb", "defs": ["to be cut; to be broken; to break (oneself) into pieces."]}], "ಕಂಡೂತಿ": [{"type": "noun", "defs": ["an irritating sensation on the skin causing desire to scratch the affected part; itch."]}], "ಕಂಡೂಯನ": [{"type": "noun", "defs": ["= ಕಂಡೂತಿ."]}], "ಕಂಡೂಲ": [{"type": "adjective", "defs": ["itching; having irritating sensation."]}], "ಕಂಡೂಹೃತಿ": [{"type": "noun", "defs": ["the act or process of curing itching.", "gratifying one's desire by indulgence."]}], "ಕಂಡೂಳ": [{"type": "adjective", "defs": ["= ಕಂಡೂಲ."]}], "ಕಂಡೆ": [{"type": "noun", "defs": ["= ಕಂಡೆಯ1."]}], "ಕಂಡೆಕುತ್ತೆ": [{"type": "adverb", "defs": ["(dial.) upside down; in a reversed condition; topsy-turvy."]}], "ಕಂಡೆಯ": [{"type": "noun", "defs": ["a weapon usu. of metal with a blade and hilt with a hand guard, used esp. for thrusting or striking; a short sword."]}, {"type": "noun", "defs": ["a firm belief or opinion; doubtlessnes."]}], "ಕಂಡೋಲ": [{"type": "noun", "defs": ["a big, thick, closely knit basket of bamboo splints or cane splits, used to store grains.", "a building or a room in a building where grains are stored.", "a large cud-chewing mammal, domesticated in parts, with slender legs, broad cushioned feet, and a fatty hump on the back; a camel."]}], "ಕಂಡ್ರಿಕೆ": [{"type": "noun", "defs": ["(dial.) a mark left on the skin when tied fast."]}], "ಕಂಡ್ಲಾ": [{"type": "noun", "defs": ["the evergreen tree Rhizophora mucronata of Rhizophoraceae family."]}], "ಕಂತ": [{"type": "noun", "defs": ["(dial.) a surface having gradual slope; downward gradient.", "(dial.) a deep place or any of the deepest parts, as in water or earth.", "(dial.) steep descent."]}], "ಕಂತಕ": [{"type": "noun", "defs": ["= ಕಂತು2 - 1."]}], "ಕಂತರಿಸು": [{"type": "verb", "defs": ["to divide, break or make separate, esp. by cutting; to sever; to cut."]}], "ಕಂತಿ": [{"type": "noun", "defs": ["a cow that has calved recently."]}, {"type": "noun", "defs": ["a black oil used to anoint some stone idols.", "a female Jaina ascetic."]}], "ಕಂತಿಕೆ": [{"type": "noun", "defs": ["a female Jaina ascetic."]}], "ಕಂತಿತ್ವ": [{"type": "noun", "defs": ["the state of being, life or conditions of, a female Jaina ascetic."]}], "ಕಂತಿಸು": [{"type": "verb", "defs": ["to extinguish a burning lamp, fire, etc."]}], "ಕಂತು": [{"type": "verb", "defs": ["(the sun, moon, etc.) to appear to move towards and below the earth's horizon (as the earth rotates); to make an apparent descent; to set.", "(dial.) (a thorn, needle, etc.) to pierce into (the flesh)."]}, {"type": "noun", "defs": ["a set date, as for payment, termination of tenancy, etc.; a term.", "a premium; an instalment - a) the amount payable or paid, in one sum or periodically, for an insurance policy; b) any of the parts of a debt or other sum of money to be paid at regular times over a specified period."]}, {"type": "noun", "defs": ["Manmatha, the Love-God.", "the organ maintaining the circulation of blood in the body; the heart.", "fellow-feeling or sorrow for sufferings of another; compassion; favour; mercy; love.", "a storehouse for threshed grain; a granary."]}], "ಕಂತುಕ": [{"type": "noun", "defs": ["a solid or hollow sphere, esp. for use in a game; a ball."]}], "ಕಂತುಕಕೇಳಿ": [{"type": "noun", "defs": ["any of the games played with a ball."]}], "ಕಂತುಕಕ್ರೀಡೆ": [{"type": "noun", "defs": ["= ಕಂತುಕಕೇಳಿ."]}], "ಕಂತುಕಖೇಲನ": [{"type": "noun", "defs": ["= ಕಂತುಕಕೇಳಿ."]}], "ಕಂತುಕಳಂಬ": [{"type": "noun", "defs": ["any of the five arrows of Manmata, the Love-God.", "mental agony, arising from unfulfilled sexual desire; pain suffered from longing for sexual union."]}], "ಕಂತುಕುಂತ": [{"type": "noun", "defs": ["Śiva, as the enemy of the Love-God, Manmata."]}], "ಕಂತುಕೇಳಿ": [{"type": "noun", "defs": ["the amorous sport."]}], "ಕಂತುಚೇತ": [{"type": "noun", "defs": ["the excessive desire for sexual union."]}], "ಕಂತುಧೇನು": [{"type": "noun", "defs": ["(myth.) Kāmadhēnu, the wish-yielding celestial cow."]}], "ಕಂತುಪಿತ": [{"type": "noun", "defs": ["Viṣṇu, the father of Love-God, Manmatha."]}], "ಕಂತುಮಥನ": [{"type": "noun", "defs": ["Śiva, as the destroyer of the Love-God, Manmata."]}], "ಕಂತೆ": [{"type": "noun", "defs": ["a bundle of hay, harvested crop, etc.", "a false statement or statements made with an intention to deceive another or others;ಕಂತೆಕಟ್ಟು k antekaṭṭu to make into a bundle; wrap or tie together.", "(fig.) to move from or leave one's place."]}, {"type": "noun", "defs": ["a waste piece of cloth, esp. one that is old or torn; a mendicaṇṭs coat made of rags.", "a long side-bag, hung on a shoulder by a beggar or mendicant.", "the human body.", "a mud-wall (of a house).", "(fig.) useless chat, discussion, etc.", "(fig.) (pl.) trivial or mundane things; ಕಂತೆಕಟ್ಟು k antekaṭṭu (fig.) to die; to kick the bucket; ಕಂತೆಬೊಂತೆ k antebonte (dupl.) of ಕಂತೆ2; ಕಂತೆವೊಗೆ k antevoge (fig.) to die; to kick the bucket; ಕಂತೆಬಿಚ್ಚು k antebiccu (fig.) to begin narrating unnecessary details in a boring manner; ಕಂತೆಮಾತು k ante mātu idle or useless talk; ಕಂತೆಗೆ ತಕ್ಕ ಬೊಂತೆ k antege takka bonte only people of like character mingle together."]}], "ಕಂತೆಕಾಯಿಕ": [{"type": "noun", "defs": ["a living by begging."]}], "ಕಂತೆಗ": [{"type": "noun", "defs": ["a mendicant or a beggar."]}], "ಕಂತೆಪುರಾಣ": [{"type": "noun", "defs": ["a useless and boring narration.", "ಕಂತೆಪುರಾಣ ಬಿಚ್ಚು kante purāṇa biccu (fig.) to narrate past and unnecessary details in a boring manner."]}], "ಕಂತೆಭಿಕ್ಷ": [{"type": "noun", "defs": ["alms received (by a mendicant) in the long side-bag.", "a living by or the act of begging."]}], "ಕಂತೆವೊರೆ": [{"type": "verb", "defs": ["(fig.) to narrate unnecessary details in a boring manner."]}], "ಕಂತ್ರಾಟ": [{"type": "noun", "defs": ["an agreement between two or more people to do something, esp. one formally set forth in writing and enforceable by law; a contract.", "a secret, usu. evil, project or scheme; a conspiracy; a plot."]}], "ಕಂತ್ರಾಟದಾರ": [{"type": "noun", "defs": ["a person who contracts to supply certain materials or do certain work for a stipulated sum; a contractor."]}], "ಕಂತ್ರಾಟು": [{"type": "noun", "defs": ["= ಕಂತ್ರಾಟ."]}], "ಕಂತ್ರಾಟುದಾರ": [{"type": "noun", "defs": ["= ಕಂತ್ರಾಟದಾರ."]}], "ಕಂತ್ರಿ": [{"type": "adjective", "defs": ["rustic - a) lacking refinement, elegance, polish or sophistication; b) rough, awkward, uncouth or boorish.", "bad - a) effective in quality; below standard; b) wicked; immoral; not behaving properly; mischievous; c) causing injury; harmful.", "base - a) of a menial or degrading kind; b) contemptible; mean; ignoble."]}, {"type": "noun", "defs": ["a person who cheats or commits fraud; a cheat; a fraud.", "that which belongs to, made in country-side."]}], "ಕಂತ್ರಿಸು": [{"type": "verb", "defs": ["to express dissatisfaction, anger, etc. by squeezing or distorting one's face."]}], "ಕಂಥಾರಿ": [{"type": "noun", "defs": ["the shrub Capparis sepiaria (= C. grandiflora) of Capparaceae family; caper shrub."]}], "ಕಂಥೆ": [{"type": "noun", "defs": ["a coat or a blanket of a mendicant or beggar, made of rags.", "a long side-bag of a mendicant or beggar.", "a useless and boring narration.", "ಕಂಥೆಗೆ ಚಳಿ ಬರುವ ಮಾತು kanthege caḷi baruva mātu a saying which narrates some unnatural happening or impractical event."]}], "ಕಂಥೆಗುಪ್ಪಸ": [{"type": "noun", "defs": ["a jacket, overcoat made of rags."]}], "ಕಂದ": [{"type": "noun", "defs": ["a young child.", "a young of cow or of any other animal.", "a term of affection used in addressing a younger person."]}, {"type": "noun", "defs": ["the portion of the human body from the neck to the arm joint; the shoulder.", "(pros.) a metre having four lines of which first and third have three groups of four units each and the second and fourth have five groups of four units each.", "a body of organised soldiers trained to protect esp. the land of a nation or to attack another country; an army.", "a group of people; a multitude."]}, {"type": "noun", "defs": ["a bulbous rout, as of lotus plant, etc.", "the strong-smelling bulb of the herb (Allium sativum) of the lily family, made up of small sections called cloves, used as seasoning in meats, salads, etc. garlic.", "the edible, starchy, tuberous root of Amorphophallus campanulatus; elephant yam.", "a visible mass of tiny, condensed water droplets or ice crystals suspended in the atmosphere; cloud.", "a volatile, crystalline ketone, with a strong characteristic odour, derived from the wood of the camphor tree or synthetically from pinene; camphor.", "an abnormally swollen part of the body; a swelling.", "a kind of disease of the male sexual glands."]}], "ಕಂದಕ": [{"type": "noun", "defs": ["a deep, broad ditch dug around a fortress or castle, and often filled with water, for protection against invasion; a moat."]}], "ಕಂದಗಡ್ಡೆ": [{"type": "noun", "defs": ["the edible, starchy, tuberous root of Amorphophallus campanulatus (araceae family); elephant yam.", "the plant itself.", "another plant of the same family Amorphophalus dubius.", "its yam.", "the plant Typhonium trilobatum of Araceae family."]}], "ಕಂದಗೆಡ್ಡೆ": [{"type": "noun", "defs": ["= ಕಂದಗಡ್ಡೆ."]}], "ಕಂದಡಿ": [{"type": "noun", "defs": ["a kind of deadly poisonous snake; a viper."]}], "ಕಂದಣಿಕೆ": [{"type": "noun", "defs": ["a seat for a rider on a horse, usu. padded and of leather, and generally straddled in riding; a saddle."]}], "ಕಂದನಾಡಿ": [{"type": "noun", "defs": ["ಸುಷುಮ್ನೆ, one of the main mystic veins of the body."]}], "ಕಂದನೆ": [{"type": "noun", "defs": ["a thick lubricant used to reduce friction of the wheels of machines or vehicles."]}], "ಕಂದಮುೂಲ": [{"type": "noun", "defs": ["a bulbous root of any plant."]}], "ಕಂದಮ್ಮ": [{"type": "noun", "defs": ["a very young child."]}], "ಕಂದಯ್ಯ": [{"type": "noun", "defs": ["= ಕಂದಮ್ಮ."]}], "ಕಂದರ": [{"type": "noun", "defs": ["that part of a human or animal joining the head to the body; the neck."]}, {"type": "noun", "defs": ["a stretch of low land lying between hills or mountains; a valley.", "a hollow place inside the earth, usu. an opening, as in a hillside, extending back horizontally; a cave.", "a deep, narrow pass between steep heights; a gorge.", "an elephant driveṛs hook to urge and control it.", "the dried aromatic rhizome of Zingiber officinale of Zingeraceae family, used as a spice or perfume and in medicine."]}], "ಕಂದರಕ್ಕರೆ": [{"type": "noun", "defs": ["the plant Ximenia americana of OLacaceae family; mountain plum tallow wood."]}], "ಕಂದರಾಲ": [{"type": "noun", "defs": ["= ಕಂದರೊಳ."]}], "ಕಂದರಿ": [{"type": "noun", "defs": ["a hollow place inside the earth, usu. an opening, as in a hillside, extending back horizontally; a cave."]}], "ಕಂದರೆ": [{"type": "noun", "defs": ["= ಕಂದರಿ."]}], "ಕಂದರೊಳ": [{"type": "noun", "defs": ["the tree Aleurites triloba of Euphorbiaceae family; walnut tree.", "the tree Juglans regia of Juglandaceae family; English (=Persian) walnut tree.", "the tree Thespesia populnea (= Hibiscus populnea) of Malvaceae family; umbrella tree; Indian tulip tree.", "the deciduous tree Careya arborea of Lecythidaceae family, usu. of medium size with obovate leaves."]}], "ಕಂದರೋದರ": [{"type": "noun", "defs": ["a vast piece of land having hills and valleys."]}], "ಕಂದರ್ಪ": [{"type": "noun", "defs": ["Manmatha, the Love-God.", "a strong, usu. passionate, affection of one person for another, based in part on sexual attraction love."]}], "ಕಂದರ್ಪಕ": [{"type": "noun", "defs": ["Manmatha, the Love-God."]}], "ಕಂದರ್ಪರಿಪು": [{"type": "noun", "defs": ["Śiva, as the enemy of the Love-God, Manmata."]}], "ಕಂದರ್ಪಾಂಧಕ": [{"type": "noun", "defs": ["a man who has lost his rational faculty due to his irrepressible lust."]}], "ಕಂದಲ್": [{"type": "noun", "defs": ["= ಕಂದಲು."]}, {"type": "noun", "defs": ["= ಕಂದಲ- 1."]}], "ಕಂದಲ": [{"type": "noun", "defs": ["a sprout - a) a new growth from a bud, rootstock, germinating seed, etc.; b) a young growth on a plant, as a stem or branch; shoot.", "a blaming or reproving; rebuke; an expression of blame or reproof; reproach; censure.", "either side of the face between the nose and ear, below the eye; the cheek.", "something that portends an event about to occur, esp. an unfortunate event; an omen; a portent.", "an agreeable or melodious sound.", "the plantain tree (Musa paradesiaca of Musaceae family) and its flower.", "a group of persons; a multitude; crowd.", "a heavy, yellow, inert, metallic chemical element with a high degree of ductility and malleability; gold.", "a fight, esp. a large-scale engagement, between armed forces; a war; battle."]}], "ಕಂದಲಿ": [{"type": "noun", "defs": ["a cutting tool consisting of a crescent-shaped wide blade with a short handle, used for cutting heavy objects."]}, {"type": "noun", "defs": ["a kind of deer.", "the plantain tree (Musa paradesiaca of Musaceae family).", "a piece of cloth or bunting, often attached to a staff, with distinctive colours, patterns or symbolic devices, used as a national or state symbol; a banner; a standard; a flag.", "a seed of lotus."]}], "ಕಂದಲು": [{"type": "noun", "defs": ["a small earthenware."]}], "ಕಂದಲೆ": [{"type": "noun", "defs": ["the plant Lobelia nicotianaefolia of Companulaceae family; wild tobacco."]}], "ಕಂದವಕ್ಕರಿಕೆ": [{"type": "noun", "defs": ["a defensive or ornamental sheet spread over the body of a horse or elephant."]}], "ಕಂದವಕ್ಕರೆ": [{"type": "noun", "defs": ["= ಕಂದವಕ್ಕರಿಕೆ."]}], "ಕಂದವಟ್ಟಿಗೆ": [{"type": "noun", "defs": ["a wooden piece used to join two or more wooden pieces together while manufacturing.", "a belt attached to a musical instrument for hanging on to the shoulder."]}], "ಕಂದವಾಹನ": [{"type": "noun", "defs": ["Indra, one of the vehicles of whom is cloud."]}], "ಕಂದಳ": [{"type": "noun", "defs": ["= ಕಂದಲ."]}], "ಕಂದಳಿ": [{"type": "noun", "defs": ["= ಕಂದಲ - 1."]}], "ಕಂದಳಿಕೆ": [{"type": "noun", "defs": ["the plantain tree (Musa paradesiaca of Musaceae family).", "a seat for a rider on a horse, bicycle, etc., usu. padded and of leather, and gen. straddled in riding; a saddle.", "a piece of cloth or bunting, often attached to a staff, with distinctive colours, patterns or symbolic devices, used as a national or state symbol; a banner; a standard; a flag."]}], "ಕಂದಳಿತ": [{"type": "adjective", "defs": ["put forth young leaves; given off shoots or buds; sprouted; germinated.", "developed; blown; grown."]}], "ಕಂದಳಿಸು": [{"type": "verb", "defs": ["to begin to grow or germinate; to give off shoots or buds; to sprout.", "(a flower) to blow; to open; to be develop.", "(fig.) to shine; to be sparkling."]}], "ಕಂದಾಚಾರ": [{"type": "noun", "defs": ["a division of armed soldiers in an army or police system.", "an armed soldier or policeman.", "an armed servant, doorkeeper, etc.", "any belief or observation based on mere tradition, blind faith, fear or ignorance, that is inconsistent with the known laws of science or with what is generally considered in the particular society as true and rational.", "ಕಂದಾಚಾರ ಕಚೇರಿ kandācāra kacēri one of the eighteen government departments, that looked after the military or police service, in erstwhile system; ಕಂದಾಚಾರ ಕಛೇರಿ kandācāra kachēri = ಕಂದಾಚಾರ ಕಚೇರಿ; ಕಂದಾಚಾರದ ದಫೇದಾರ kandācārada daphēdāra a police or military superintendent over a contingent of armed forces; ಕಂದಾಚಾರದ ಭಂಟ kandācārada bhaṇṭa = ಕಂದಾಚಾರದ ವಾಲೆಕಾರ; ಕಂದಾಚಾರದ ಭಕ್ಷಿ kandācārada bhakṣi the chief officer of the military or police department of a government in erstwhile system; ಕಂದಾಚಾರದವ kandācāradava a man in the service of police or military department of a government; 2. a man of superstititions, blind faith; ಕಂದಾಚಾರದ ವಾಲೆಕಾರ kandācārada vālekāra an armed soldier or policeman; ಕಂದಾಚಾರದ ಸೇರ್ವೆಗಾರ kandācārada sērvegāra = ಕಂದಾಚಾರದ ದಫೇದಾರ; ಕಂದಾಚಾರದ ಹೋಬಳಿದಾರ kandācārada hōbaḷidāra = ಕಂದಾಚಾರದ ದಫೇದಾರ."]}], "ಕಂದಾಯ": [{"type": "noun", "defs": ["a compulsory payment, usu. a percentage, levied on property value for the support of a government; land or property tax.", "(astrol.) a period of four months."]}], "ಕಂದಾರಿ": [{"type": "adjective", "defs": ["of Afghanistan, its people, its language or culture."]}, {"type": "noun", "defs": ["a country in south central Asia, between Iran and Pakistan with Kabul as its capital; Afghanistan.", "a native or inhabitant of Afghanistan."]}], "ಕಂದಾರೆ": [{"type": "noun", "defs": ["= ಕಂದಾರಿ2."]}], "ಕಂದಾಲೆ": [{"type": "noun", "defs": ["= ಕಂದಾಳೆ."]}], "ಕಂದಾವುಜ": [{"type": "noun", "defs": ["a drum played by hanging to the neck or shoulder."]}], "ಕಂದಾಳ": [{"type": "noun", "defs": ["the plant Artabotrys hexapetalus (= A. odoratissimus) of Annonaceae family;", "its flower; Cupid's plant.", "the aquatic tree Rhizophora mucronata of Rhizophoraceae family; mangrove."]}], "ಕಂದಾಳಸಂಪಿಗೆ": [{"type": "noun", "defs": ["= ಕಂದಾಳ-1 & 2."]}], "ಕಂದಾಳಿ": [{"type": "noun", "defs": ["the tree Garcinia xanthochymus (= G. pictoria, = G. tinctoria) of Guttiferae family; Mysore gamboge."]}], "ಕಂದಾಳೆ": [{"type": "noun", "defs": ["the tree Sonneratia caseolaris (= S. acida) of Sonneratiaceae family."]}], "ಕಂದಿ": [{"type": "noun", "defs": ["a cow that has calved recently.", "love; affection; emotional attachment."]}, {"type": "noun", "defs": ["the black colour."]}], "ಕಂದಿಕೆ": [{"type": "noun", "defs": ["the state of having lost colour, freshness, strength, etc.; listlessness."]}, {"type": "noun", "defs": ["a fleshy, enlarged, vertical, underground stem, usu. having annual segments with a bud at the tip, thin external scale leaves, and roots at the base, differing from bulbs in having much more stem tissue and fewer scale leaves; a corm."]}], "ಕಂದಿಸು": [{"type": "verb", "defs": ["to cause to lose one's colour, freshness, strength, etc."]}], "ಕಂದೀಲ": [{"type": "noun", "defs": ["= ಕಂದೀಲು."]}], "ಕಂದೀಲು": [{"type": "noun", "defs": ["a cylindrical mass of tallow or wax with a wick through its centre, which gives light when burned; a candle.", "a portable, transparent or translucent case for holding a light and protecting it from wind and weather; a lantern."]}], "ಕಂದು": [{"type": "verb", "defs": ["to lose colour, brilliance, freshness or strength; to wither; to wane; to fade.", "to become black; to be charred.", "to lose one's calmness, temper; to become angry."]}, {"type": "adjective", "defs": ["having the combined colour of red, black, and yellow; brown."]}, {"type": "noun", "defs": ["brown colour.", "anything that spoils or mars, esp. by providing an unpleasant contrast; a stain; a blot; a scar; a blemish.", "any of the sixteen stages of the moon, from the new moon day to the full moon day.", "any substance consumption of which causes death; poison.", "lowness of spirit; grief; sorrow."]}, {"type": "noun", "defs": ["a cylindrical, dressed stone used to pulverise or to make paste in a mortar; a pestle."]}, {"type": "noun", "defs": ["the grass Holcus spicatus.", "its grain, for which it is cultivated."]}, {"type": "noun", "defs": ["a young cow; a calf.", "the foetus of an animal that has been expelled from the womb before it is sufficiently developed to survive; ಕಂದು ಹಾಕು kandu hāku (a female animal) to expel from the womb a foetus before it is sufficiently developed to survive."]}, {"type": "noun", "defs": ["a frying pan."]}], "ಕಂದುಕ": [{"type": "noun", "defs": ["a solid or hollow sphere, esp. for use in a game; a ball.", "a cloth case filled with cotton, feathers, down, foam rubber, air, etc., used as a support, as for the head in sleeping; a pillow; ಕಂದುಕದಾಗಮ kandukadāgama the systematised learning of the games played with balls."]}], "ಕಂದುಕಕೇಳಿ": [{"type": "noun", "defs": ["any of the games played with a ball."]}], "ಕಂದುಕಕ್ರೀಡೆ": [{"type": "noun", "defs": ["= ಕಂದುಕಕೇಳಿ."]}], "ಕಂದುಕಕ್ರೀಡಿತ": [{"type": "noun", "defs": ["= ಕಂದುಕಕೇಳಿ."]}], "ಕಂದುಕಸರಿಕೆ": [{"type": "noun", "defs": ["dejection and ill-humours."]}], "ಕಂದುಕುಂದು": [{"type": "noun", "defs": ["(pl.) stains, blemishes and deficiencies."]}], "ಕಂದುಗ": [{"type": "noun", "defs": ["= ಕಂದುಕ."]}], "ಕಂದುಗೊರಲ್": [{"type": "noun", "defs": ["a neck that is black."]}], "ಕಂದುಗೊರಲ": [{"type": "noun", "defs": ["Śiva, who drank poison, but which stayed at his throat and turned it black."]}], "ಕಂದುಬೆಳ್ಳಿ": [{"type": "noun", "defs": ["= ಕಂದುವೆಳ್ಳಿ."]}], "ಕಂದುಮಲ್ಲಿಗೆ": [{"type": "noun", "defs": ["the tropical climbing flowering plant, Jasminum heyneanum (= J. sambac) of Oleaceae family; sambac jasmine."]}], "ಕಂದುಮೋಱೆ": [{"type": "noun", "defs": ["the face of a person who is spiritless, suffering from dejection, dishonour, loss of hope, etc. or has lost freshness."]}]}