{"ಕುಮ್ಮಾರ": [{"type": "noun", "defs": ["= ಕುಮ್ಮರ."]}], "ಕುಮ್ಮಿ": [{"type": "noun", "defs": ["a girl's dance with clapping of hands to time and singing."]}], "ಕುಮ್ಮಿಯಾಟ": [{"type": "noun", "defs": ["= ಕುಮ್ಮಿ."]}], "ಕುಮ್ಮಿಸು": [{"type": "verb", "defs": ["to crush, powder by pounding."]}], "ಕುಮ್ಮು": [{"type": "verb", "defs": ["to crush, powder by pounding.", "to collapse losing one's strength.", "to punch or pierce heavily.", "to demolish, spoil completely.", "to spread oneself around, all over or throughout.", "to rush with great force.", "(sl.) sexual intercourse; copulation."]}, {"type": "noun", "defs": ["a pounding or beating with a pestle or a heavy object."]}], "ಕುಯ್": [{"type": "verb", "defs": ["= ಕುಯಿ1."]}], "ಕುಯಂತ್ರ": [{"type": "noun", "defs": ["a machine, instrument or implement that is defective or useless.", "a sham amulet which is not as effective as it made to believe."]}], "ಕುಯಂತ್ರಕ": [{"type": "noun", "defs": ["a useless engineer or mechanic.", "a treacherous man; a machinator."]}], "ಕುಯಕ": [{"type": "noun", "defs": ["the act or an instance of cheating.", "a ridiculing; derision; a looking down.", "a cheat; a deceiver.", "one who derides another."]}], "ಕುಯಲು": [{"type": "noun", "defs": ["the reaping of crops; harvest.", "a cut, as caused by the stroke of a sharp-edged instrument."]}], "ಕುಯಲುಗಾರ": [{"type": "noun", "defs": ["a man who reaps; a harvester.", "a man who cuts, severes."]}], "ಕುಯಿ": [{"type": "verb", "defs": ["to cut (with or as with a knife, sword, etc.).", "to pull off or out (as a flower from a plant).", "(sneeringly) to play a violin.", "(sneeringly) to talk boringly."]}, {"type": "noun", "defs": ["the sound uttered by dogs in pain."]}], "ಕುಯಿಕೀರೆ": [{"type": "noun", "defs": ["the potherb Amaranthus tenuifolius of Amaranthaceae."]}], "ಕುಯಿಗುಟ್ಟು": [{"type": "verb", "defs": ["to utter sound similar to the one uttered by a dog in pain.", "(fig.) to talk timidly in a low tone (as from fear)."]}], "ಕುಯಿಲಾಳು": [{"type": "noun", "defs": ["a person who is appointed for reaping."]}], "ಕುಯಿಲು": [{"type": "noun", "defs": ["= ಕುಯಲು.", "a wooden piece that can be fitted into a hole made in another wooden piece.", "a religious observation on the tenth day of child-birth."]}], "ಕುಯಿಸು": [{"type": "verb", "defs": ["to cause to cut.", "to cause to harvest."]}], "ಕುಯೀ": [{"type": "noun", "defs": ["a Dravidian language prevalent in parts of Madhya Pradesh, in Central India."]}], "ಕುಯುಕ್ತಿ": [{"type": "noun", "defs": ["a conspiracy or secret plan, esp. to achieve an unlawful end; an underhand plot; an evil design; machination."]}], "ಕುಯುಕ್ತಿವಂತ": [{"type": "noun", "defs": ["a man of wicked devices; a man who works with evil intent; a machinator."]}], "ಕುಯೋನಿ": [{"type": "noun", "defs": ["the class of animals other than human, considered as a kingdom of inferior birth.", "a low-birth; a low woman's womb (considered as dishonourable birth)."]}], "ಕುಯ್ಗುರಿ": [{"type": "noun", "defs": ["= ಕುಯ್ಗುಱಿ."]}], "ಕುಯ್ಗುಱಿ": [{"type": "noun", "defs": ["a sheep kept for killing either as in a sacrifice or for food.", "a stupid person who has become a prey or is victimised."]}], "ಕುಯ್ಯಲ್": [{"type": "noun", "defs": ["= ಕುಯಿಲು."]}], "ಕುಯ್ಯಿಸು": [{"type": "verb", "defs": ["= ಕುಯಿಸು."]}], "ಕುಯ್ಯೋ": [{"type": "independent clause", "defs": ["the sound uttered by dogs in pain.", "(in gen.) a wailing sound; a plaintive cry."]}], "ಕುಯ್ಲು": [{"type": "noun", "defs": ["= ಕುಯಿಲು."]}], "ಕುಯ್ಲುಗಾರ": [{"type": "noun", "defs": ["= ಕುಯಲುಗಾರ."]}], "ಕುಯ್ಲುಗಾಲ": [{"type": "noun", "defs": ["the time of the year when matured grain, fruit, vegetables, etc. are reaped and gathered in; harvest."]}], "ಕುರ": [{"type": "noun", "defs": ["an inflamed pus-filled swelling caused by infection; a boil; an abscess.", "something that pains, irritates a person; an irritant."]}, {"type": "noun", "defs": ["the horny part of the foot of a horse, antelope, and other ungulates; the hoof."]}], "ಕುರಂಗ": [{"type": "noun", "defs": ["= ಕುರಂದ."]}, {"type": "noun", "defs": ["any of a family (Cervidae) of ruminants, including the elk, moose, and reindeer; a deer, esp. the smaller species, as the white-tailed deer and mule deer.", "a small, hornless deer (Moschus moschiferus) the male of which secretes musk and has tusk like upper canines; the musk deer.", "the black-spot on the moon."]}], "ಕುರಂಗಕ": [{"type": "noun", "defs": ["= ಕುರಂಗ2."]}], "ಕುರಂಗಧರ": [{"type": "noun", "defs": ["the Moon-God, holding the sign of a deer in his hand."]}], "ಕುರಂಗನಾಭಿ": [{"type": "noun", "defs": ["a substance with a strong, penetrating odour, obtained from a small sac (musk bag) under the skin of the abdomen in the male musk deer, used as the basis of numerous perfumes; musk."]}], "ಕುರಂಗನೇತ್ರೆ": [{"type": "noun", "defs": ["a woman whose eyes resemble that of a deer (which do not concentrate on one object)."]}], "ಕುರಂಗಮುದ್ರೆ": [{"type": "noun", "defs": ["a holding of one's palm with the fore-finger and the little finger stretched up and other two fingers resting on the thumb."]}], "ಕುರಂಗರಿಪು": [{"type": "noun", "defs": ["a tiger, considered as an enemy of deers."]}], "ಕುರಂಗಾಂಬಕಿ": [{"type": "noun", "defs": ["= ಕುರಂಗನೇತ್ರೆ."]}], "ಕುರಂಗು": [{"type": "noun", "defs": ["any of several families of primates usu. having a flat, hairless face and a long tail; a monkey."]}], "ಕುರಂಗುಕಟ್ಟು": [{"type": "noun", "defs": ["a binding or tying firmly with a rope."]}], "ಕುರಂಜಿ": [{"type": "noun", "defs": ["= ಕುರಂದ."]}, {"type": "noun", "defs": ["(mus.) a mode, in Karnāṭaka system, derived from the main mode Dhīra Śankarābharaṇa."]}], "ಕುರಂಜೆ": [{"type": "noun", "defs": ["= ಕುರಂಜಿ2."]}], "ಕುರಂಟ": [{"type": "noun", "defs": ["= ಕುರಟಿಕೆ."]}], "ಕುರಂಟಕ": [{"type": "noun", "defs": ["= ಕುರಟಿಕೆ."]}], "ಕುರಂಟಿಕ": [{"type": "noun", "defs": ["= ಕುರಟಿಕೆ."]}], "ಕುರಂಟಿಕೆ": [{"type": "noun", "defs": ["= ಕುರಟಿಕೆ."]}], "ಕುರಂಟಿಗೆ": [{"type": "noun", "defs": ["= ಕುರಟಿಕೆ."]}], "ಕುರಂಟೆ": [{"type": "noun", "defs": ["= ಕುರಟಿಕೆ."]}], "ಕುರಂಡಿಕೆ": [{"type": "noun", "defs": ["= ಕುರಟಿಕೆ."]}], "ಕುರಂದ": [{"type": "noun", "defs": ["a common mineral, aluminium oxide, Al2O3, second only to the diamond in hardness, a dark, granular variety of which is used for grinding and polishing; corundum."]}], "ಕುರಕ್": [{"type": "noun", "defs": ["name of a language belonging to Dravidian family."]}], "ಕುರಕ": [{"type": "noun", "defs": ["any of the birds Gracula religiosa, Acridotheres tristis, Eulabes religiosa, Tumenuchus pagodarum and Sturnopastor contra, a few of them are able to mimic the human voice, often kept as pet; myna."]}], "ಕುರಕಿಸು": [{"type": "verb", "defs": ["to inflict pain; to cause to undergo grief; to torment."]}], "ಕುರಕು": [{"type": "verb", "defs": ["to undergo sufferings, pain, agony; to grieve."]}], "ಕುರಕುರಿ": [{"type": "noun", "defs": ["unpleasantness; mental irritation.", "annoyance caused by a repeated action.", "unduly or overbearingly confident and presuming; arrogance; effrontery.", "ಕುರಕುರಿಮಾಡು kurakuri māḍu to show disagreement or create conflict because of differences of opinion, temperment; to embarrass; to trouble."]}], "ಕುರಗ": [{"type": "noun", "defs": ["an iron or steel block on which goldsmiths hammer gold or silver objects into shape; an anvil."]}], "ಕುರಚಿ": [{"type": "adjective", "defs": ["of small stature; undersized; stunted; dwarfish."]}, {"type": "noun", "defs": ["the quality or state of being dwarfish; dwarfishness.", "a group of under-bush and shrubs."]}], "ಕುರಚಿಕಾಡು": [{"type": "noun", "defs": ["a thick growth of small trees and underbrush covering an extensive tract of land."]}], "ಕುರಚಿಗಿಡ": [{"type": "noun", "defs": ["any bush or small tree."]}], "ಕುರಜು": [{"type": "noun", "defs": ["a decorated frame work on a slightly raised platform for putting idols or for the bride and bridegroom to sit in.", "a small tower on the fort-wall or building.", "a measure of weight for weighing camphor.", "a heap; pile."]}], "ಕುರಟಿಕೆ": [{"type": "noun", "defs": ["the Barleria prionites of Acanthaceae family; thorny nail dye.", "its flower.", "the plant Ammania vesicatoria of Lythraceae family.", "the tree Lannea coromandelica ( = Odina woodier) of Anacardiaceae family; Indian ash tree."]}], "ಕುರಟಿಗೆ": [{"type": "noun", "defs": ["= ಕುರಟಿಕೆ."]}], "ಕುರಡಿ": [{"type": "noun", "defs": ["a condiment or seasoning of vermicelli with chillies, salt, etc. dried and fried in oil."]}, {"type": "noun", "defs": ["a kind of fish."]}], "ಕುರಡೀಕುಠಾರ": [{"type": "noun", "defs": ["any of various families of winged hymenopteran insects, characterised by a slender body with the abdomen attached by a narrow stalk, biting mouthparts, and, in the females and workers, a vicious sting that can be used repeatedly; a wasp."]}], "ಕುರಣಿ": [{"type": "noun", "defs": ["a thick cord made of intertwisted woollen threads."]}], "ಕುರತಿರುಗಿ": [{"type": "noun", "defs": ["the annual plant Lepidium sativum of Brassicaceae family, used as a salad plant; garden cress."]}], "ಕುರಪುಟ": [{"type": "noun", "defs": ["the horny part of the foot of a horse, antelope, and other ungulates; the hoof."]}], "ಕುರಮಾವು": [{"type": "noun", "defs": ["the plant Phoebe wightii of Lauraceae family.", "another plant of the same family Phoebe paniculata."]}], "ಕುರರ": [{"type": "noun", "defs": ["the male, large, black-and-white diving bird of prey, Pandion haliaetus of Pandionidae family which feeds mainly on fish; an osprey."]}], "ಕುರರಿ": [{"type": "noun", "defs": ["the female, large, black-and-white diving bird of prey, Pandion haliaetus of Pandionidae family which feeds mainly on fish; an osprey.", "a female sheep; an ewe."]}], "ಕುರಲ್": [{"type": "verb", "defs": ["to cry out loudly; to scream; to yell."]}], "ಕುರವ": [{"type": "noun", "defs": ["= ಕುರರ.", "a calling out noisily; an outcry; bellowing; bawling.", "the plant Barleria buxifolia (var. roseaflora) of Acanthaceae family; prickly purple nail dye."]}], "ಕುರವಂಜಿ": [{"type": "noun", "defs": ["a woman belonging to a nomadic sect among tribal people in Karnāṭaka, who gen. is a fortune-teller on traditional lines.", "a system of dance prevalent in South India."]}], "ಕುರವಂಜಿನೃತ್ಯ": [{"type": "noun", "defs": ["= ಕುರವಂಜಿ - 2."]}], "ಕುರವಕ": [{"type": "noun", "defs": ["= ಕುರವ."]}], "ಕುರವಿ": [{"type": "noun", "defs": ["the small finchlike bird, Passer domesticus, of the family Ploceidae, with brown and grey plumage; a house sparrow."]}, {"type": "noun", "defs": ["a kind of plant (=ಕುರವ - 3 ?)."]}], "ಕುರಳಿಗದ್ದಿಗೆ": [{"type": "noun", "defs": ["a long-handled tool with a thin metal blade, used for turning up the soil, weeding etc; a hoe; (?)."]}], "ಕುರಳು": [{"type": "noun", "defs": ["a curl of hair."]}], "ಕುರಾಡ": [{"type": "noun", "defs": ["a usu. cylindrical, thick peg of wood, metal, etc., attached perpendicular to a wall and used for hanging garments etc. on."]}], "ಕುರಾನ್": [{"type": "noun", "defs": ["= ಕುರಾನು."]}], "ಕುರಾನು": [{"type": "noun", "defs": ["the sacred book of Islam believed to contain revelations made to Mohammed by Allah; Koran."]}], "ಕುರಿ": [{"type": "verb", "defs": ["to mark - a) to put or make a mark or marks on; b) to identify or designate by or as by a mark or marks.", "to take note of; to give attention to.", "to direct one's mind to; to mind.", "to direct (spoken or written words) to; to speak or write to; to address.", "to apply oil, ointment etc. on skin etc.; to anoint."]}, {"type": "verb", "defs": ["to turn oneself from a straight line or from some direction or position; to bend; to become crooked."]}, {"type": "noun", "defs": ["the bovid ruminant mammal, Ovis aries, of the genus Ovis with a thick woolly coat, domesticated and kept in flocks for its wool or meat, and is proverbial for its timidity; a sheep.", "(fig.) a simple, very timid or stupid person.", "ಕುರಿ ಕಾಯು kuri kāyu (derog.) (having proved one's stupidity) to do a job that does not require judgement or reasoning; ಕುರಿಕಾಯುತ್ತೀಯಾ ತೋಳ ಅಂದರೆ, ಸಂಬಳವೇ ಬೇಡ ಎಂದಿತಂತೆ kuri kāyuttīya tōḷa a ndare, sambaḷavē bēḍa enditante (prov.) a prudent man does not make the goat his gardener; ಕುರಿ ಕೊಬ್ಬಿದಷ್ಟೂ ಕುರುಬನಿಗೆ ಲಾಭ kuri kobbidaṣtū kurubanige lābha (prov.) the more fleshier the sheep grows, the more profitable for the slaughterer; ಕುರಿ(ಗಳನ್ನು) ತುಂಬಿದ ಹಾಗೆ ತುಂಬು kuri(gaḷannu) tumbida hāge tumbu to pack like sardine; to jam pack; ಕುರಿ ನಂಬುವುದು ಕಟುಕನನ್ನೇ kuri nambuvudu kaṭuknannē (prov.) people believe those who cheat them, not the honest one; fish follow the bait; ಒಂದು ಕುರಿ ಹಳ್ಳಕ್ಕೆ ಬಿದ್ದರೆ ಎಲ್ಲ ಕುರಿಗಳೂ ಬೀಳುತ್ತವೆ ondu kuri haḷḷakke biddare, ella kurigaḷū bīḷuttave (prov.) ignorants act blindly; If one sheep leaps over the dyke, all the rest will follow."]}, {"type": "noun", "defs": ["= ಕುರಿಬಳ್ಳಿ."]}], "ಕುರಿಂಜಿ": [{"type": "noun", "defs": ["a kind of plant which flowers once in twelve years.", "(fig.) a very rare thing."]}], "ಕುರಿಕಿಸು": [{"type": "verb", "defs": ["= ಕುರಕಿಸು."]}], "ಕುರಿಕು": [{"type": "verb", "defs": ["to chew slowly steadily (a crisp piece of food), with a crunching sound.", "to peck and pick up with the beak."]}], "ಕುರಿಕುರಿ": [{"type": "noun", "defs": ["unpleasantness; mental irritation.", "annoyance caused by a repeated action."]}], "ಕುರಿಕೆ": [{"type": "noun", "defs": ["a making of harsh sounds in breathing, while asleep as caused by vibration of the soft palate usu. with the mouth open; the act or sound of snoring.", "the loud, deep sound made by an animal, etc. that roars; roaring."]}, {"type": "noun", "defs": ["a small village."]}], "ಕುರಿಗಾಯಿ": [{"type": "noun", "defs": ["a person who herds and takes care of sheep; a shepherd."]}], "ಕುರಿಗಿಡ": [{"type": "noun", "defs": ["the plant Aristolochia bracteata of Aristolochiaceae family; worm killer plant."]}], "ಕುರಿಗೆಲೆ": [{"type": "noun", "defs": ["the plant Debregeasia longifolia ( = D. uelutina) of Urticaceae family."]}], "ಕುರಿಗೊಲೆ": [{"type": "noun", "defs": ["a killing of a sheep.", "a killing of helpless people; a brutal murder."]}], "ಕುರಿಜು": [{"type": "noun", "defs": ["= ಕುರಜು."]}], "ಕುರಿಟಗ": [{"type": "noun", "defs": ["the creeper Pergularia daemia ( = P. extensa, = Daemia extensa) of Asclepiadaceae family."]}], "ಕುರಿತನ": [{"type": "noun", "defs": ["want of intelligence; slow-wittedness, foolishness."]}], "ಕುರಿತೆರಿಗೆ": [{"type": "noun", "defs": ["a tax levied on shepherds based on the number of sheep they have."]}], "ಕುರಿದರಿ": [{"type": "verb", "defs": ["to kill a sheep.", "(fig.) to kill or destroy in a violent way; to slaughter."]}, {"type": "noun", "defs": ["the act of killing violently; a slaughtering."]}], "ಕುರಿದೊಡ್ಡಿ": [{"type": "noun", "defs": ["an enclosure for sheep; a pen.", "(fig.) a congested, unhealthy room for relatively a large number of persons.", "(derog.) a school where the number of students is large, but quality of education is poor."]}], "ಕುರಿಬಳ್ಳಿ": [{"type": "noun", "defs": ["the creeper Tiliacora acuminata ( = T. racemosa) of Menispermaceae family)."]}], "ಕುರಿಬುದ್ಧಿ": [{"type": "noun", "defs": ["= ಕುರಿತನ."]}], "ಕುರಿಬೆಳ್ಳಿ": [{"type": "noun", "defs": ["silver in its pure form."]}], "ಕುರಿಮೀನು": [{"type": "noun", "defs": ["the fish Labeo nigrescens of Cyprinidae family."]}], "ಕುರಿಮುಸುಡೆ": [{"type": "noun", "defs": ["= ಕುರಿಬಳ್ಳಿ."]}], "ಕುರಿಯಾದಿ": [{"type": "noun", "defs": ["the creeper Ventilago calyculata of Rhamnaceae family."]}], "ಕುರು": [{"type": "noun", "defs": ["an inflamed pus-filled swelling caused by infection; a boil; an abscess.", "something that pains, irritates a person; an irritant.", "ಕುರುವಿನ ಮೇಲೆ ಬೊಕ್ಕೆ kuruvina mēle bokke (fig.) a difficult or irritant condition worsening by another such difficulty or irritation."]}, {"type": "adjective", "defs": ["small; little; tiny."]}, {"type": "noun", "defs": ["boiled rice."]}], "ಕುರುಂಕುರುಂ": [{"type": "noun", "defs": ["the sound of biting or chewing crispy food, parched pulse, etc.; the crunching sound."]}], "ಕುರುಂಗ": [{"type": "noun", "defs": ["a kind of bird."]}], "ಕುರುಂಜಿಗೆ": [{"type": "noun", "defs": ["a long tool with one end being flattened, and sharpened used for loosening the surface soil, weeding etc."]}], "ಕುರುಂಟು": [{"type": "noun", "defs": ["(dial.) an agricultural implement used for breaking up and levelling ploughed land and for rooting up weeds; a harrow.", "(dial.) a small, tight bundle of grain or a lump as of tamarind."]}], "ಕುರುಂಟುಕಟ್ಟು": [{"type": "verb", "defs": ["(dial.) to become stiff, hard, rigid or firm; to be stiffened."]}], "ಕುರುಂದ": [{"type": "noun", "defs": ["a common mineral, aluminum oxide, Al2O3, second only to the diamond in hardness, a dark, granular variety of which is used for grinding and polishing."]}], "ಕುರುಂಬ": [{"type": "noun", "defs": ["a man who herds and takes care of sheep; a shepherd.", "the caste of shepherds.", "a slow-witted, foolish man.", "an old experienced man."]}], "ಕುರುಂಬಳೆ": [{"type": "noun", "defs": ["= ಕುರುಂಬಾಳೆ."]}], "ಕುರುಂಬಾಳೆ": [{"type": "noun", "defs": ["the sheath of the betel nut or coconut flower."]}], "ಕುರುಂಬಿಕೆ": [{"type": "noun", "defs": ["the profession, work or status of a shepherd.", "the quality of being obstinate, unreasonably resolute; stubbornness."]}], "ಕುರುಂಬು": [{"type": "noun", "defs": ["the envious or resentful attitude towards another's advantages, merits, wealth, status, etc.; jealousy; envy."]}], "ಕುರುಂಬುಲ್ಲು": [{"type": "noun", "defs": ["a kind of grass growing as a weed."]}], "ಕುರುಂಬೆ": [{"type": "noun", "defs": ["a very young coconut."]}], "ಕುರುಕಲು": [{"type": "noun", "defs": ["any of the foods or parched pulses, that is crisp and eaten slowly and steadily in small quantities, with a crunching sound."]}], "ಕುರುಕಲುತಿಂಡಿ": [{"type": "noun", "defs": ["= ಕುರುಕಲು."]}], "ಕುರುಕು": [{"type": "verb", "defs": ["= ಕುರಿಕು."]}, {"type": "verb", "defs": ["to speak very softly without vibration of the vocal cords; to talk or say in a barely audible tone or in a secret or confidential way; to whisper.", "to sing in a very low tone."]}, {"type": "noun", "defs": ["a low, murmuring sound."]}], "ಕುರುಕುತಿಂಡಿ": [{"type": "noun", "defs": ["= ಕುರುಕಲು."]}], "ಕುರುಕುಪದ": [{"type": "noun", "defs": ["a song sung in a very low tone."]}], "ಕುರುಕುರಿ": [{"type": "noun", "defs": ["unpleasantness; mental irritation.", "annoyance caused by a repeated action.", "unduly or overbearingly confident and presuming; arrogance; effrontery."]}], "ಕುರುಕುರಿರೋಗ": [{"type": "noun", "defs": ["a stomach-disease of horses."]}], "ಕುರುಕುರಿಸು": [{"type": "verb", "defs": ["to annoy or pester (a person) in a hostile or injurious way; to molest."]}], "ಕುರುಕುರು": [{"type": "noun", "defs": ["= ಕುರುಕುರಿ."]}, {"type": "noun", "defs": ["= ಕುರುಂಕುರುಂ."]}], "ಕುರುಕುರುಕಾರ": [{"type": "noun", "defs": ["a worker in gold, a manufacturer of gold articles."]}], "ಕುರುಕ್ಷೇತ್ರ": [{"type": "noun", "defs": ["the place where the great war between Pāṇḍavas and Kauravas took place ( near the present Delhi).", "a clash of wills, temperaments or opinions; mutual animosity arising from disagreement.", "a place (a house, working place, etc.) where wrangling, quarrel takes place (esp. continuously and seriously)."]}], "ಕುರುಗಂಟು": [{"type": "noun", "defs": ["a small bundle or parcel (usu. tied in a piece of cloth)."]}], "ಕುರುಗಡ್ಡ": [{"type": "noun", "defs": ["a short beard."]}], "ಕುರುಗಣ್": [{"type": "noun", "defs": ["a small eye; an eye smaller than the usual one."]}], "ಕುರುಗು": [{"type": "verb", "defs": ["to reduce (oneself) in size; to shrink; to contract (oneself).", "to bend (from a straight position).", "to feel dejected; to cast down in spirit; to get disheartened; to be depressed."]}], "ಕುರುಗುಟ್ಟು": [{"type": "verb", "defs": ["to move suddenly and rapidly up; to spring up (as from joy, surprise, etc.)."]}], "ಕುರುಗುಡಿ": [{"type": "noun", "defs": ["a kind of plant.", "its fruit."]}], "ಕುರುಚಲು": [{"type": "adjective", "defs": ["low in growth; shrubby."]}, {"type": "noun", "defs": ["a low, woody plant with several permanent stems instead of a single trunk; an under shrub."]}], "ಕುರುಚಲುಗೂದಲು": [{"type": "noun", "defs": ["thick, short hairs."]}], "ಕುರುಚಿಗೆ": [{"type": "noun", "defs": ["= ಕುರುಜಿಗೆ."]}], "ಕುರುಚು": [{"type": "adjective", "defs": ["of small stature; undersized; stunted; dwarfish."]}, {"type": "noun", "defs": ["the quality or state of being dwarfish; dwarfishness.", "a group of under-bush and shrubs."]}], "ಕುರುಚುಕಾಡು": [{"type": "noun", "defs": ["a thick growth of small trees and underbrush covering an extensive tract of land."]}], "ಕುರುಚೆ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಕುರುಜ": [{"type": "noun", "defs": ["= ಕುರುಜು."]}], "ಕುರುಜಾತು": [{"type": "noun", "defs": ["an archaic monetary coin."]}], "ಕುರುಜಿಗೆ": [{"type": "noun", "defs": ["a long tool with one end being flattened, and sharpened used for loosening the surface soil, weeding etc."]}], "ಕುರುಜು": [{"type": "noun", "defs": ["a decorated frame work on a slightly raised platform for putting idols or for the bride and bridegroom to sit in.", "a small tower on the fort-wall or building.", "a measure of weight for weighing camphor.", "a heap; pile."]}], "ಕುರುಜುತೋರಣ": [{"type": "noun", "defs": ["the buntings, decorative festoon of leaves hung on the small tower on the fort-wall or building."]}], "ಕುರುಜುಮಾಡ": [{"type": "noun", "defs": ["a building with a small tower on it."]}], "ಕುರುಜೆ": [{"type": "noun", "defs": ["= ಕುರುಜು."]}, {"type": "noun", "defs": ["any low-growing, woody, bushy plant; an under shrub."]}], "ಕುರುಟನತೊಪ್ಪಲು": [{"type": "noun", "defs": ["the herb Pergularia daemia ( = P. extensa, = Daemia extensa) of Asclepiadaceae family."]}], "ಕುರುಟಿ": [{"type": "noun", "defs": ["a kind of bird."]}], "ಕುರುಟಿಕೆ": [{"type": "noun", "defs": ["the Barleria prionites of Acanthaceae family; thorny nail dye.", "its flower.", "the plant Ammania vesicatoria of Lythraceae family.", "the tree Lannea coromandelica ( = Odina woodier) of Anacardiaceae family; Indian ash tree.", "the plant Wrightia zeylanica ( = W. antidysentrica) of Apocynaceae family.", "its seed, used to expel worms and other parasites from the intestinal tract."]}], "ಕುರುಟಿಗ": [{"type": "noun", "defs": ["= ಕುರುಟಿಕೆ."]}], "ಕುರುಟಿಗೆ": [{"type": "noun", "defs": ["= ಕುರುಟಿಕೆ."]}], "ಕುರುಟು": [{"type": "noun", "defs": ["(dial.) a measure of grain."]}, {"type": "noun", "defs": ["the state or condition of growth being stunted; a stunted or dwarfish growth; ಕುರುಟು ಬೀಳು k uruṭu bīḷu to be deprived of one's natural growth; to be stunted; to become dwarfish."]}], "ಕುರುಡ": [{"type": "noun", "defs": ["a man without the power of sight; a sightless man; a blind man.", "(fig.) an ignorant man.", "ಕುರುಡನ ಕೈಯಲ್ಲಿ ಕನ್ನಡಿ ಕೊಟ್ಟ ಹಾಗೆ kuruḍana kaiyalli kannaḍi koṭṭa hāge (prov.) (proverbial simile) like a blindman holding a mirror; ಕುರುಡನಿಗೆ ಕಣ್ಣು ಬಂದಂತೆ kuruḍanige kaṇṇu bandante (simile) getting a help, advice, etc. at the time of desperation, (like a blindman getting sight); ಕುರುಡನಿಗೆ ಹಗಲೇನು, ಇರುಳೇನು? kuruḍanige hagalēnu, iruḷēnu? (prov.) what use a lantern to a blind person? A mole wants no lanthorn; ಕುರುಡರ ರಾಜ್ಯದಲ್ಲಿ ಒಕ್ಕಣ್ಣನೇ ರಾಜ kuruḍara rājyadalli okkaṇṇanē rāja (prov.) (prov.) he is a giant who has many dwarfs about him; ಕುರುಡರೊಳಗೆ ಮೆಳ್ಳನೇ ಶ್ರೇಷ್ಠ kuruḍaroḷage meḷḷanē śrēṣṭha (prov.) = ಕುರುಡರ ರಾಜ್ಯದಲ್ಲಿ ಒಕ್ಕಣ್ಣನೇ ರಾಜ."]}], "ಕುರುಡಕ್ಕಿ": [{"type": "noun", "defs": ["husked, but not polished rice."]}], "ಕುರುಡಾಗು": [{"type": "verb", "defs": ["to become blind; to lose one's sight.", "(blindness) to happen.", "to be ignorant to (the fact, spiritual knowledge, etc.).", "to refuse to look at a problem; to be negligent about; to close one's eyes to."]}], "ಕುರುಡಾವು": [{"type": "noun", "defs": ["a blind cow."]}], "ಕುರುಡಿ": [{"type": "noun", "defs": ["a woman deprived of sight; a blind woman; ಕುರುಡಿಯ ಪುಳು kuruḍiya puḷu = ಕುರುಡಿಕುಠಾರ; ಕುರುಡಿ ಮದುವೆಯಾದರೆ ಮನೆ ಗಡಿಗೆಗೆ ಮೂಲ kuruḍi maduveyādare mane gaḍigege mūla (prov.) a worker having no knowledge, would only spoil the implements."]}, {"type": "noun", "defs": ["the plant Scutia circumcissa ( = S. myrtina, = S. indica) of Rhamnaceae family; small jujube.", "its fruit."]}], "ಕುರುಡಿಗೆ": [{"type": "noun", "defs": ["a condiment or seasoning of grain or pulse made with chillies, salt, etc. dried and fried in oil."]}, {"type": "noun", "defs": ["the Barleria prionites of Acanthaceae family; thorny nail dye.", "its flower.", "the plant Ammania vesicatoria of Lythraceae family.", "the tree Lannea coromandelica ( = Odina woodier) of Anacardiaceae family; Indian ash tree."]}], "ಕುರುಡಿಕುಠಾರ": [{"type": "noun", "defs": ["any of various families of winged insects that undergo complete metamorphosis, having a slender body with the abdomen attached by a narrow stalk, biting mouthparts, and, in the females and workers, a vicious sting that can be used repeatedly; a wasp."]}], "ಕುರುಡಿಹಣ್ಣಿನಗಿಡ": [{"type": "noun", "defs": ["= ಕುರುಡಿ2-1."]}], "ಕುರುಡೀಕುಠಾರ": [{"type": "noun", "defs": ["= ಕುರುಡಿಕುಠಾರ."]}], "ಕುರುಡು": [{"type": "noun", "defs": ["the condition of being sightless; blindness.", "that which is blind.", "a blind man.", "(fig.) the condition or quality of being ignorant esp. lack of spiritual knowledge.", "ಕುರುಡು ಓದು kuruḍu ōdu a reading without understanding the meaning; ಕುರುಡು ಕಣ್ಣಿಗೆ ಕಾಡಿಗೆಯಿಟ್ಟಂತೆ kuruḍu kaṇṇige kāḍige iṭṭante (prov.) to do utterly useless thing; to decorate a corpse; ಕುರುಡುಗಣ್ಣುಮಾಡು kuruḍugaṇṇu māḍu to refuse to look at a problem; to be negligent about; to close one's eyes to; ಕುರುಡುಗಣ್ಣಿಗಿಂತ ಮೆಳ್ಳೆಗಣ್ಣು ಮೇಲು kuruḍugaṇṇiginta meḷḷegaṇṇu mēlu (prov.) a single slice of bread is preferred to starving; better a barefoot than no foot at all."]}], "ಕುರುಡುಕವಡೆ": [{"type": "noun", "defs": ["a broken, hence useless, cowrie.", "a coin not in currency.", "(fig.) a worthless thing."]}], "ಕುರುಡುಕಾಂಚಾಣ": [{"type": "noun", "defs": ["a coin not in currency.", "wealth not being used in a wise way."]}], "ಕುರುಡುಗಜ್ಜಿಗ": [{"type": "noun", "defs": ["the plant Caesalpinia sepiaria of Caesalphiniaceae family; Mysore thorn."]}], "ಕುರುಡುಗಜ್ಜಿಗೆ": [{"type": "noun", "defs": ["= ಕುರುಡುಗಜ್ಜಿಗ."]}], "ಕುರುಡುಗಣ್ಣು": [{"type": "noun", "defs": ["an eye which is deprived of sight; a blind eye."]}], "ಕುರುಡುಗತ್ತಲು": [{"type": "noun", "defs": ["absolute darkness."]}], "ಕುರುಡುಗಪ್ಪಟೆ": [{"type": "noun", "defs": ["a variety of nocturnal flying mammals having membranous wings and no sight, navigating by echo-location and which feed on insects, nectar, fruit, flesh or blood; a chiropter: a blind-bat."]}], "ಕುರುಡುಗಲ್ಲಿ": [{"type": "noun", "defs": ["an alley or passage shut off at one end; a blind alley."]}], "ಕುರುಡುಗಳೆ": [{"type": "verb", "defs": ["to give sight to; to enable to see.", "(fig.) to give intellectual or spiritual light to; to give the light of fact and knowledge to; to enlighten."]}], "ಕುರುಡುಗಳ್ತಲೆ": [{"type": "noun", "defs": ["= ಕುರುಡುಗತ್ತಲು."]}], "ಕುರುಡುಗಾಜು": [{"type": "noun", "defs": ["a glass not letting light pass through; an opaque glass.", "a murky mirror that cannot give the image."]}], "ಕುರುಡುಗಾಸು": [{"type": "noun", "defs": ["= ಕುರುಡುಕಾಂಚಾಣ."]}], "ಕುರುಡುಗುರಿ": [{"type": "noun", "defs": ["a target hit, success achieved, by chance, without aiming at; a random shot."]}], "ಕುರುಡುಗೆ": [{"type": "noun", "defs": ["= ಕುರುಡಿಗೆ1."]}], "ಕುರುಡುಗೈಯು": [{"type": "verb", "defs": ["to make (another) sightless; to blind.", "to make unable to see temporarily; to dazzle."]}], "ಕುರುಡುಚಿತ್ತೆ": [{"type": "noun", "defs": ["a continuously pouring rain."]}], "ಕುರುಡುತನ": [{"type": "noun", "defs": ["the condition of being sightless; blindness.", "(fig.) the condition or quality of being ignorant esp. lack of spiritual knowledge.", "(fig.) negligence or a deliberate overlooking."]}], "ಕುರುಡುದರಬಾರು": [{"type": "noun", "defs": ["an irrational governance; indiscreet, injudicious, imprudent management."]}], "ಕುರುಡುದರ್ಬಾರು": [{"type": "noun", "defs": ["= ಕುರುಡುದರಬಾರು."]}], "ಕುರುಡುನಂದಿ": [{"type": "noun", "defs": ["the medium-sized, evergreen tree Gelonium lanceolatum of Euphorbiaceae family; small leaved cluster croton."]}], "ಕುರುಡುನಂಬಿಕೆ": [{"type": "noun", "defs": ["any belief, based on fear or ignorance, that is inconsistent with the known laws of science or with what is generally considered in the particular society as true and rational; esp., such a belief in charms, omens, the supernatural, etc.; a superstition."]}], "ಕುರುಡುನಂಬುಗೆ": [{"type": "noun", "defs": ["= ಕುರುಡುನಂಬಿಕೆ."]}], "ಕುರುಡುಪಾಠ": [{"type": "noun", "defs": ["a reading without understanding or without trying to understand."]}], "ಕುರುಡುಬಿಂದು": [{"type": "noun", "defs": ["the small area, insensitive to light, in the retina of the eye where the optic nerve enters; the blind spot."]}], "ಕುರುಡುಮೀನು": [{"type": "noun", "defs": ["any of various small fishes with functionless eyes, found in underground streams, caves, etc.; a blind fish."]}], "ಕುರುಡುಸನ್ನಿ": [{"type": "noun", "defs": ["a temporary state of extreme mental excitement, marked by restlessness, confused speech, and hallucinations, which sometimes occurs during a fever or in some forms of insanity and causes blindness."]}], "ಕುರುಡುಹುಳು": [{"type": "noun", "defs": ["the legless lizard Anguis fraglis with a snakelike body and very small eyes."]}], "ಕುರುಡೇಟು": [{"type": "noun", "defs": ["a blind shot that hits the target; a random shot; an effort yielding result by chance."]}], "ಕುರುಣಿ": [{"type": "noun", "defs": ["a thick cord made of intertwisted woollen threads."]}, {"type": "noun", "defs": ["a measure of grain."]}], "ಕುರುಣೆ": [{"type": "adjective", "defs": ["being in an early period of life or growth; not old; young."]}, {"type": "noun", "defs": ["a young animal (including bird).", "a young child; a baby."]}, {"type": "noun", "defs": ["waste matter excreted by mouse, dog, bird etc. from the bowels."]}], "ಕುರುಣೆವಱಿ": [{"type": "noun", "defs": ["= ಕುರುಣೆ2 - 1."]}], "ಕುರುದೆ": [{"type": "noun", "defs": ["a young person in serfdom or bondage."]}], "ಕುರುನಾಣ": [{"type": "noun", "defs": ["the tree Maba busifolia of Ebenaceae family; satin ebony."]}], "ಕುರುಪದ": [{"type": "noun", "defs": ["a song sung in a very low tone."]}], "ಕುರುಪಾಟ": [{"type": "noun", "defs": ["a hitting the target."]}], "ಕುರುಪಿ": [{"type": "noun", "defs": ["= ಕುರುಪೆ1."]}], "ಕುರುಪು": [{"type": "noun", "defs": ["a sign, symbol or indication; a mark.", "fame; good reputation; renown."]}], "ಕುರುಪೆ": [{"type": "noun", "defs": ["an apparatus to cut down the standing grass and level the lawn.", "a kitchen apparatus with a long handle and flattened at the other end, used to mix, overturn, hot stuff being cooked."]}, {"type": "noun", "defs": ["kindness in excess of what may be expected or demanded by fairness; benediction; mercy."]}], "ಕುರುಬ": [{"type": "noun", "defs": ["a man who herds and takes care of sheep; a shepherd.", "the caste of shepherds.", "a slow-witted, foolish man.", "an old experienced man.", "ಕುರುಬನ ಮಂದೆಯನ್ನು ತೋಳ ಕಾದ ಹಾಗೆ kurubana mandeyannu tōḷa kāda hāge (prov.) (proverbial simile, as) making a goat one's gardener."]}], "ಕುರುಬಗಿತಿ": [{"type": "noun", "defs": ["= ಕುರುಬಿತಿ."]}], "ಕುರುಬಗಿತ್ತಿ": [{"type": "noun", "defs": ["= ಕುರುಬಿತಿ."]}], "ಕುರುಬತನ": [{"type": "noun", "defs": ["the profession, work or status of a shepherd.", "want of wisdom, judgement; stupidity; foolishness."]}], "ಕುರುಬನಗಡ್ಡೆ": [{"type": "noun", "defs": ["the plant Lepidagathis cristata of Acanthaceae family."]}], "ಕುರುಬಹೆಗ್ಗಡೆ": [{"type": "noun", "defs": ["a chief among shepherds."]}], "ಕುರುಬಾಗಿಲು": [{"type": "noun", "defs": ["a door smaller than the main one of a building or the smallest one of all the doors, usu. at the backside; a small backdoor."]}], "ಕುರುಬಾನಿ": [{"type": "noun", "defs": ["the act of offering the life of a person or animal or some object, in propitiation of or homage to a deity; a sacrifice.", "something so sacrificed.", "the act of giving up, permitting injury to or forgoing something valued for the sake of something having a more pressing claim; a sacrifice.", "a thing so given up, etc."]}], "ಕುರುಬಿತಿ": [{"type": "noun", "defs": ["a woman belonging to the shepherd caste."]}], "ಕುರುಬಿತ್ತಿ": [{"type": "noun", "defs": ["= ಕುರುಬಿತಿ."]}], "ಕುರುಬು": [{"type": "noun", "defs": ["the envious or resentful attitude towards another's advantages, merits, wealth, status, etc.; jealousy; envy."]}, {"type": "noun", "defs": ["a very young coconut."]}], "ಕುರುಬೆ": [{"type": "noun", "defs": ["= ಕುರುಬು2."]}, {"type": "noun", "defs": ["an inflamed pus-filled swelling caused by infection; a boil; an abscess.", "something that pains, irritates a person; an irritant.", "the yellowish, wax like secretion found in the canal of the external ear; cerumen; earwax."]}], "ಕುರುಮಾಮ": [{"type": "noun", "defs": ["an aboriginal of Andhra Pradesh, also found in Karnāṭaka, the main occupation of the members of which is fortune telling."]}], "ಕುರುಲು": [{"type": "noun", "defs": ["hair that is or tends to curl; curly hair."]}], "ಕುರುವ": [{"type": "noun", "defs": ["a piece of land surrounded by water; an island.", "a raised mass of earth, stones; a small hill or mound."]}], "ಕುರುವಂಜಿ": [{"type": "noun", "defs": ["a woman belonging to a nomadic sect among tribal people in Karnāṭaka, who gen. is a fortune-teller on traditional lines.", "a system of dance prevalent in South India."]}], "ಕುರುವಕ": [{"type": "noun", "defs": ["the plant Barleria buxifolia (var. roseaflora) of Acanthaceae family; prickly purple nail dye."]}], "ಕುರುವಗೆಯ್": [{"type": "noun", "defs": ["a field for growing dark species of paddy or inferior reddish paddy."]}], "ಕುರುವಾಯಿ": [{"type": "noun", "defs": ["any of a large order (Coleoptera) of insects, including weevils, with biting mouthparts; a beetle."]}], "ಕುರುವಾಳು": [{"type": "noun", "defs": ["a small sword or a dagger."]}], "ಕುರುವಿಂಗಿ": [{"type": "noun", "defs": ["the plant Ehretia microphylla ( = E. buxifolia) of Ehretiaceae family."]}], "ಕುರುವಿಂದ": [{"type": "noun", "defs": ["bright-red mercuric sulphide used as a pigment; vermilion.", "the bright red colour (as of vermilion).", "the fragrant grass Cyperus haspan of Cyperaceae family.", "a common mineral, aluminium oxide, Al2O3, second only to the diamond in hardness, a dark, granular variety of which is used for grinding and polishing."]}], "ಕುರುವಿಂದಕ": [{"type": "noun", "defs": ["= ಕುರುವಿಂದ - 3."]}], "ಕುರುವಿಸ್ತ": [{"type": "noun", "defs": ["a very small unit in the system of weights, used to weigh gold, equal to about seven hundred Troy grains."]}], "ಕುರುವು": [{"type": "noun", "defs": ["an inflamed pus-filled swelling caused by infection; a boil; an abscess.", "something that pains, irritates a person; an irritant."]}, {"type": "noun", "defs": ["a sign, symbol or indication; a mark.", "fame; good reputation; renown."]}], "ಕುರುವೆ": [{"type": "noun", "defs": ["a container made of interwoven cane, bamboo splits, etc.; a basket."]}, {"type": "noun", "defs": ["= ಕುರುವ."]}, {"type": "noun", "defs": ["the plant Abutilon indicum of Malvaceae family; country mallow; Indian abutilon."]}], "ಕುರುವೇರು": [{"type": "noun", "defs": ["a grass of Poaceae family, akin to vetiver, with fragrant roots."]}], "ಕುರುವೇಲು": [{"type": "noun", "defs": ["= ಕುರುವೇರು."]}], "ಕುರುಸಾನಿ": [{"type": "noun", "defs": ["the 'Khurasān' province, situated in the north east of Iran.", "a person belonging to this province.", "the plant Ziziphus vulgaris ( = Z. sativa) of Rhamnaceae family growing in warm climates.", "its edible fruit."]}], "ಕುರುಹ": [{"type": "noun", "defs": ["= ಕುರುಹು1."]}], "ಕುರುಹು": [{"type": "noun", "defs": ["a sign, symbol or indication; a mark.", "fame; good reputation; renown."]}, {"type": "noun", "defs": ["= ಕುರುಪೆ1."]}], "ಕುರುಳ್": [{"type": "noun", "defs": ["ಕುರುಳು1."]}, {"type": "noun", "defs": ["dried cow-dung (usu. in the form of a cake)."]}], "ಕುರುಳ": [{"type": "noun", "defs": ["a kind of variation of sound by pulling a string of a musical instrument, in a measured manner."]}], "ಕುರುಳಿ": [{"type": "noun", "defs": ["a very small earthenware."]}, {"type": "noun", "defs": ["a young animal (including bird).", "a young child; a baby."]}], "ಕುರುಳಿಗೊಳ್": [{"type": "verb", "defs": ["to shrink (oneself) as to form wrinkles on the surface."]}], "ಕುರುಳಿಡು": [{"type": "verb", "defs": ["to offer one's hair on the head to a deity, as an oath."]}], "ಕುರುಳು": [{"type": "noun", "defs": ["the hair growing on the hair.", "hair that is or tends, to curl; curly hair."]}, {"type": "noun", "defs": ["the condition of being sightless; blindness.", "that which is blind.", "a blind man.", "(fig.) the condition or quality of being ignorant esp. lack of spiritual knowledge."]}, {"type": "noun", "defs": ["= ಕುರುಳ್2."]}, {"type": "noun", "defs": ["= ಕುರುಳ."]}], "ಕುರುಳುಗೂದಲು": [{"type": "noun", "defs": ["a curl or lock of hairs."]}], "ಕುರುಳುಪಾದಿ": [{"type": "noun", "defs": ["any of saltwater crustaceans of Cirripedia class that are attached or parasitic in the adult stage, with slender, bristly appendages for gathering food; cirriped."]}], "ಕುರುಳುವಳಿ": [{"type": "noun", "defs": ["= ಕುರುಳ; (?)."]}], "ಕುರುಳೆ": [{"type": "noun", "defs": ["a woman with curly lock of hairs."]}, {"type": "noun", "defs": ["(dial.) a baby or child.", "(dial.) a young plant (esp. a plantain sapling)."]}], "ಕುರುಳ್ಕಟ್ಟು": [{"type": "noun", "defs": ["a combing of hair and forming it into a lump and tying together."]}], "ಕುರಳ್ಗೂದಲ್": [{"type": "noun", "defs": ["= ಕುರುಳುಗೂದಲು."]}], "ಕುರುಳ್ಗೊಯ್": [{"type": "verb", "defs": ["to cut the hair."]}], "ಕುರುಳ್ಚು": [{"type": "verb", "defs": ["to handle and use (a weapon)."]}], "ಕುರುಳ್ತಿದ್ದು": [{"type": "verb", "defs": ["to tidy the hair."]}], "ಕುರುಳ್ದಲೆ": [{"type": "noun", "defs": ["a head having curly hairs."]}], "ಕುರೂಪ": [{"type": "noun", "defs": ["the quality of being unpleasing to look at; the form that aesthetically offensive or unsightly; ugliness.", "an ugly man."]}], "ಕುರೂಪತೆ": [{"type": "noun", "defs": ["the condition or quality of being ugly."]}], "ಕುರೂಪಿ": [{"type": "adjective", "defs": ["unpleasing or repulsive to see; ugly; aesthetically offensive."]}, {"type": "noun", "defs": ["an ugly person."]}], "ಕುರೂಪಿತನ": [{"type": "noun", "defs": ["= ಕುರೂಪತೆ."]}], "ಕುರೂಪು": [{"type": "noun", "defs": ["an ugly or repulsive form to look at; want of beauty."]}], "ಕುರೆ": [{"type": "noun", "defs": ["a sound used in calling a dog.", "a sound imitating that."]}, {"type": "noun", "defs": ["silver in its pure form."]}, {"type": "noun", "defs": ["(dial.) a miserly, stingy person."]}], "ಕುರೊ": [{"type": "noun", "defs": ["= ಕುರೆ1."]}], "ಕುರ್ಕ": [{"type": "noun", "defs": ["the large, feline mammal, Panthera pardus, with either a black-spotted yellowish-fawn or all-black coat; a leopard; a panther."]}], "ಕುರ್ಕರ": [{"type": "noun", "defs": ["a domesticated carnivorous mammal, Canis familiaris, usu. having a long snout and non-retractile claws, and occurring in many different breeds kept as pets or for work or sport; a dog."]}], "ಕುರ್ಕೀಲು": [{"type": "noun", "defs": ["a container made of interwoven cane, bamboo splits, etc.; a basket."]}], "ಕುರ್ಕು": [{"type": "noun", "defs": ["any of large gruiform wading birds of Gruidae family, with very long legs and neck, and a long, straight bill; a crane."]}, {"type": "verb", "defs": ["to chew slowly steadily (a piece of crisp food), with a crunching sound.", "to peck and pick up with the beak."]}], "ಕುರ್ಕುಟ": [{"type": "noun", "defs": ["the male of the chicken; a rooster; a cock.", "the female of the domesticated chicken; a hen."]}], "ಕುರ್ಕುಟಾಹಿ": [{"type": "noun", "defs": ["an animal believed to have serpent like hood and rooster like body."]}], "ಕುರ್ಕುರ": [{"type": "noun", "defs": ["= ಕುರ್ಕರ.", "the plant Mucuna prurita ( = M. puriens) of Papilionaceae family; cat-bean."]}], "ಕುರ್ಕುರಧ್ವನಿ": [{"type": "noun", "defs": ["the sharp, abrupt sound made by a dog; bark."]}], "ಕುರ್ಕುರಿ": [{"type": "noun", "defs": ["a female dog."]}], "ಕುರ್ಕುರಿರೋಗ": [{"type": "noun", "defs": ["a stomach-disease of horses."]}], "ಕುರ್ಕುರೊಟ್ಟಿ": [{"type": "noun", "defs": ["a crisp pan-cake."]}], "ಕುರ್ಕೆ": [{"type": "noun", "defs": ["a kind of fish."]}], "ಕುರ್ಗಿಸು": [{"type": "verb", "defs": ["to cause to contract or reduce in size.", "to make another despondent; to cause to grieve."]}], "ಕುರ್ಗು": [{"type": "verb", "defs": ["to reduce (oneself) in size; to shrink; to contract (oneself).", "to bend (from one's straight position).", "to feel dejected; to cast down in spirit; to get disheartened; to be depressed."]}, {"type": "noun", "defs": ["the condition or quality of being dwarfish or having stunted growth; dwarfishness."]}], "ಕುರ್ಚಿ": [{"type": "noun", "defs": ["a piece of furniture for one person to sit on, having a back and, usu. four legs; a chair.", "a seat of authority or dignity.", "ಕುರ್ಚಿ ಖಾಲಿಮಾಡು kurci khāli māḍu = ಕುರ್ಚಿ ಬಿಡು; ಕುರ್ಚಿ ಬಿಡು kurci biḍu to give up one's authority, position, etc."]}, {"type": "noun", "defs": ["(dial.) a kind of fish."]}, {"type": "noun", "defs": ["the small-sized, deciduous tree Holarrhena antidysentrica of Apocynaceae family, with soft wood, which is used for photo-frames, toys, etc."]}], "ಕುರ್ಚಿಮಂಚ": [{"type": "noun", "defs": ["a chair that can be opened into a bed; a chair-bed."]}], "ಕುರ್ಜು": [{"type": "noun", "defs": ["a decorated frame work on a slightly raised platform for putting idols or for the bride and bridegroom to sit in.", "a small tower on the fort-wall or building.", "a measure of weight for weighing camphor.", "a heap; pile."]}], "ಕುರ್ಜುಗಲ್ಲು": [{"type": "noun", "defs": ["a raised platform with a superstructure and a roof, built using stone."]}], "ಕುರ್ಣಿ": [{"type": "noun", "defs": ["the plant Ecbolium viride ( = E. linneanum) of Acanthaceae family."]}], "ಕುರ್ತಾ": [{"type": "noun", "defs": ["a short, sleeveless garment worn over the upper garment; a waistcoat.", "a knee-length, collarless, loose shirt worn over pyjamas by men; kurta."]}], "ಕುರ್ತಿಕೆ": [{"type": "noun", "defs": ["the annual plant Lepidium sativum of Brassicaceae family, used as a salad plant; garden cress."]}], "ಕುರ್ತಿಗೆ": [{"type": "noun", "defs": ["= ಕುರ್ತಿಕೆ."]}], "ಕುರ್ದೆ": [{"type": "noun", "defs": ["a young person in serfdom or bondage."]}], "ಕುರ್ನಿಸಾತ್": [{"type": "noun", "defs": ["a formal mode of paying obeisance to a man in high office."]}], "ಕುರ್ನೀಸಾತು": [{"type": "noun", "defs": ["= ಕುರ್ನಿಸಾತ್."]}], "ಕುರ್ಬಾನೀಸ್": [{"type": "noun", "defs": ["= ಕುರ್ನಿಸಾತ್."]}], "ಕುರ್ರಮಾಮ": [{"type": "noun", "defs": ["a sect originally from Andhra Pradesh, the profession of the members of which is fortune-telling.", "a man belonging to the sect."]}], "ಕುರ್ವ": [{"type": "noun", "defs": ["a piece of land surrounded by water; an island.", "a raised mass of earth, stones; a small hill or mound."]}], "ಕುರ್ವಾಣ": [{"type": "adjective", "defs": ["making; doing."]}], "ಕುರ್ವಾಣತೆ": [{"type": "noun", "defs": ["the quality or fact of making, doing (something)."]}], "ಕುರ್ವು": [{"type": "verb", "defs": ["to become more in number, increase.", "to become bigger in size; to become fat; to develop (oneself).", "to be excited (from joy, success, etc.).", "to become arrogant, overbearing."]}], "ಕುಲ": [{"type": "noun", "defs": ["a crowd; a group; an assemblage.", "direct descent from an ancestor; lineage; family.", "a noble descent or family.", "the normal place of dwelling; a house.", "(coll.) a man or boy; a fellow.", "a country; a region.", "the body (of a human or animal).", "the front part; fore-ground.", "the blue gem.", "(biol.) category in the classification of plants or animals, ranking above a genus and below an order and including one or more similar genera; a family.", "ಕುಲವನ್ನು ನಾಲಗೆ ಹೇಳುತ್ತದೆ kulavannu nālge hēḷuttade (prov.) the family teaches one how to behave in the society; 2. a bird is known by its note and a man by his talk; 3. the tongue is the mirror of one's culture; ಕುಲವಿದ್ದರೂ ಮಲ ಹೋಗದು kulaviddarū mala hōgadu (prov.) one's high-birth does not guarantee high-culture."]}], "ಕುಲಂಕರ": [{"type": "noun", "defs": ["(Jain.) any of the fourteen Manus, who are the progenitors of the mankind."]}], "ಕುಲಂಗೆಡು": [{"type": "verb", "defs": ["= ಕುಲಗೆಡು."]}], "ಕುಲಂಜ": [{"type": "noun", "defs": ["the plant Alpinia galangas of Zingiberaceae family, whose dried rhizomes yield aromatic substances used in medicines and flavourings; java galangal."]}], "ಕುಲಂಜನ": [{"type": "noun", "defs": ["= ಕುಲಂಜ."]}], "ಕುಲಕ": [{"type": "noun", "defs": ["a man coming from or belonging to (such and such a family).", "that which is related to one's family, lineage.", "the fact of belonging to, coming from a good family.", "the tree Diospyros tomentosa of Ebenaceae family.", "the plant Trichosanthes dioca of Cucurbitaceae family.", "its gourd; wild snake gourd.", "(rhet.) a group of verses that have grammatically, a single subject connected with several predicates."]}], "ಕುಲಕಂಟಕ": [{"type": "noun", "defs": ["a man who brings agony, great pain or shame to his family."]}], "ಕುಲಕಂಟಕತನ": [{"type": "noun", "defs": ["the quality of person who brings or the fact of a person bringing, agony, great pain or shame to one's family."]}], "ಕುಲಕಂಟಕಿ": [{"type": "noun", "defs": ["a woman who brings agony, great pain or shame to his family."]}], "ಕುಲಕರ": [{"type": "noun", "defs": ["= ಕುಲಂಕರ."]}], "ಕುಲಕರಣಿ": [{"type": "noun", "defs": ["a village accountant (profession of which usu. is got hereditarily)."]}], "ಕುಲಕರಣಿಕೆ": [{"type": "noun", "defs": ["the hereditary profession, duty of a village accountant."]}], "ಕುಲಕರ್ಕಟಿ": [{"type": "noun", "defs": ["a species of gourd."]}], "ಕುಲಕರ್ಣಿ": [{"type": "noun", "defs": ["= ಕುಲಕರಣಿ."]}]}