{"ಗರುಡಲೇಖಣಿ": [{"type": "noun", "defs": ["the horny stem of the feather of the bird Brahminee kite (Garuḍa) used as pen for writing with."]}], "ಗರುಡವಾಯು": [{"type": "noun", "defs": ["a kind of yogic breathing and the air held so within."]}], "ಗರುಡವಾಹನ": [{"type": "noun", "defs": ["Viṣṇu, who uses Garuḍa, the king of birds, as his vehicle.", "a metal idol of Garuḍa, on which the idol of Viṣṇu is taken on procession.", "(fig.) the condition of a vehicle being overcrowded with passengers."]}], "ಗರುಡವಾಹಿನಿ": [{"type": "noun", "defs": ["a particular kind of military array."]}], "ಗರುಡವೇಗ": [{"type": "noun", "defs": ["an unbelievably high speed."]}], "ಗರುಡವ್ಯೂಹ": [{"type": "noun", "defs": ["a particular kind of military array."]}], "ಗರುಡಾಂಕ": [{"type": "noun", "defs": ["= ಗರುಡಧ್ವಜ- 2."]}], "ಗರುಡಾಗಮ": [{"type": "noun", "defs": ["one of holy scriptures of Hindus."]}], "ಗರುಡಾಸನ": [{"type": "noun", "defs": ["the kneeling on one knee, one of the yogic postures."]}], "ಗರುಡಾಸ್ತ್ರ": [{"type": "noun", "defs": ["= ಗರುಡಪತತ್ರಿ - 2."]}], "ಗರುಡಿ": [{"type": "noun", "defs": ["a place for living; a shelter; an abode.", "a room or building equipped for physical training and athletic games and sports; a gymnasium.", "physical or mental exertion; work; toil; labour.", "a shrine in a village for the departed soul."]}], "ಗರುಡಿಕಾರ": [{"type": "noun", "defs": ["an expert in gymnastics.", "a master who give training in gymnastics."]}], "ಗರುಡಿಕಾಱ": [{"type": "noun", "defs": ["= ಗರುಡಿಕಾರ."]}], "ಗರುಡಿಗೆಯ್ತ": [{"type": "noun", "defs": ["the training or labour involved in being trained in gymnastics."]}], "ಗರುಡಿಗೆಯ್ಮೆ": [{"type": "noun", "defs": ["= ಗರುಡಿಗೆಯ್ತ."]}], "ಗರುಡಿಮನೆ": [{"type": "noun", "defs": ["= ಗರುಡಿ -2 & 4."]}], "ಗರುಡಿಶ್ರಮ": [{"type": "noun", "defs": ["= ಗರುಡಿಗೆಯ್ತ."]}], "ಗರುಡಿಸಾಧಕ": [{"type": "noun", "defs": ["an expert in gymnastics."]}], "ಗರುಡಿಸಾಧನೆ": [{"type": "noun", "defs": ["physical training as in a gymnasium."]}], "ಗರುಡಿಸಾಮು": [{"type": "noun", "defs": ["= ಗರುಡಿಸಾಧನೆ."]}], "ಗರುಡೋದ್ಗಾರ": [{"type": "noun", "defs": ["a gem the touch of which is believed to act as a remedy for venomous snake-bites."]}], "ಗರುತ": [{"type": "noun", "defs": ["= ಗರುತ್ತು."]}], "ಗರುತ್ತು": [{"type": "noun", "defs": ["any of the growths covering the body of a bird or making up a large part of the wing surface, as down or contour feathers; a feather."]}], "ಗರುತ್ಮ": [{"type": "noun", "defs": ["Brahminee kite (Haliastur indus), a accipitrine bird with long, pointed wings, forked tail and white neck.", "(myth.) the king of birds, which is used by Viṣṇu as his vehicle.", "fire."]}], "ಗರುತ್ಮಂತ": [{"type": "noun", "defs": ["that which has feathers; a bird.", "Brahminee kite (haliastur indus), a accipitrine bird with long, pointed wings, forked tail and white neck.", "(myth.) the king of birds, which is used by Viṣṇu as his vehicle."]}], "ಗರುತ್ಮಶರ": [{"type": "noun", "defs": ["an arrow shot with a mystic hymns that was believed to counteract the effect of an arrow shot by one's enemy, that would inflict the snake venom."]}], "ಗರುದ್ಯೋಧಿ": [{"type": "noun", "defs": ["the bird Perdix chinensis, a kind of quail."]}], "ಗರುವ": [{"type": "adjective", "defs": ["having enough worth or merit; worthy."]}, {"type": "noun", "defs": ["a respectable, elderly man.", "a strong man."]}, {"type": "noun", "defs": ["a high or overbearing opinion of one's worth or importance; inordinate self-esteem; haughty behaviour resulting from this; arrogance; pride."]}], "ಗರುವತನ": [{"type": "noun", "defs": ["distinction; recognised superiority; a special quality, feature, point, characteristic, etc."]}], "ಗರುವಲಿ": [{"type": "noun", "defs": ["wind.", "the Wind-God."]}], "ಗರುವಾಯ್": [{"type": "noun", "defs": ["= ಗರುವಾಯಿ."]}], "ಗರುವಾಯ": [{"type": "noun", "defs": ["a showy having no real value, worth; a hollow man."]}], "ಗರುವಾಯಿ": [{"type": "noun", "defs": ["the quality of being worthy of esteem or honour; dignified behaviour; worthiness; dignity.", "loftiness of appearance or manner; stateliness."]}], "ಗರುವಾಯಿಕಾರ": [{"type": "noun", "defs": ["a man of dignity, high repute or honour."]}], "ಗರುವಾಯಿಕಾಱ": [{"type": "noun", "defs": ["= ಗರುವಾಯಿಕಾರ."]}], "ಗರುವಾಯಿಗೆಡಿಸು": [{"type": "verb", "defs": ["to hurt the pride or dignity or self-respect of; to cause to feel shame, humiliation; to mortify; to humiliate."]}], "ಗರುವಾಯಿಗೆಡು": [{"type": "verb", "defs": ["(one's dignity, honour, repute) to be injured or lost.", "to lose one's pride, honour, dignity, etc."]}], "ಗರುವಾಯ್ಲ": [{"type": "adjective", "defs": ["distinguished; notable; of high standing; excellent; eminent."]}], "ಗರುವಾಹಿ": [{"type": "noun", "defs": ["= ಗರುವಾಯ್ಲ."]}], "ಗರುವಿ": [{"type": "noun", "defs": ["a man given to vanity, worthless pride, pomp, etc."]}], "ಗರುವಿಕೆ": [{"type": "noun", "defs": ["dignified, proper behaviour or manner."]}, {"type": "noun", "defs": ["a feeling of elation or satisfaction at achievements or qualities or possessions etc. that make one proud; pride.", "a proper sense of what befits one's position; self-respect.", "a high or overbearing opinion of one's worth or importance; personal vanity; conceit."]}], "ಗರುವಿಕೆಗೆಡು": [{"type": "noun", "defs": ["= ಗರುವಾಯಿಗೆಡು."]}], "ಗರುವಿಕೆದಾಳು": [{"type": "verb", "defs": ["to gain honour; to become respectable."]}], "ಗರುವಿತ": [{"type": "adjective", "defs": ["having or showing an overweening opinion of oneself, one's position, etc.; arrogant; haughty."]}, {"type": "noun", "defs": ["a man having overweening opinion of himself, his position or possession, etc."]}], "ಗರುವಿತೆ": [{"type": "noun", "defs": ["a woman having overweening opinion of herself, her position or possession, etc."]}], "ಗರುವಿಸು": [{"type": "verb", "defs": ["to show arrogance; to behave in a haughty manner regarding or treating (another or others) as unworthy or beneath one's dignity; to disdain."]}], "ಗರುವು": [{"type": "noun", "defs": ["= ಗರುವ3."]}], "ಗರುವೆ": [{"type": "noun", "defs": ["a respectable, dignified woman.", "a woman of vanity or haughtiness."]}], "ಗರುಹಣ": [{"type": "noun", "defs": ["a condemning (of another or something); condemnation; denunciation."]}], "ಗರುಹಣೆ": [{"type": "noun", "defs": ["= ಗರುಹಣ."]}], "ಗರೂರಿ": [{"type": "noun", "defs": ["= ಗರುವ3."]}], "ಗರೆ": [{"type": "noun", "defs": ["a stain discolouring a cloth or the skin.", "a mark or sign of disgrace or discredit; a stigma."]}, {"type": "noun", "defs": ["a woven material, either stitched or not, used to wear on or cover the body; a cloth."]}], "ಗರ್ಕಾಗು": [{"type": "verb", "defs": ["to be interested greatly; to be wholly occupied; to be absorbed deeply in; to become engrossed in."]}], "ಗರ್ಕು": [{"type": "noun", "defs": ["the quality of being rough, hard; lack of smoothness; roughness."]}, {"type": "adjective", "defs": ["absorbed deeply; engrossed (in)."]}], "ಗರ್ಗ": [{"type": "noun", "defs": ["the adult male of cattle; an ox; a bull.", "any of a number of oligochaetous worms that burrow in the soil, esp. any of a genus (Lumbricus) very important in aerating and fertilising the soil; an earthworm.", "(myth.) name of a sage."]}, {"type": "noun", "defs": ["the plant Eclipta prostrata ( = E. alba) of Asteraceae family; weed-ham."]}], "ಗರ್ಗತ್ತಿ": [{"type": "noun", "defs": ["the tree Ficus asperrima of Moraceae family, with soft wood, leaves of which are used for softening the surface of other woods, by rubbing on; sand-paper tree."]}], "ಗರ್ಗರ": [{"type": "noun", "defs": ["an indistinct, repeated sound of as made in sawing or by anklets while walking, etc.", "a kind ofnklet with small bells."]}, {"type": "noun", "defs": ["a current of water, etc. moving against the main current and with a circular motion; a little whirlpool; an eddy.", "a kind of cymbal attached with small bells or metal plates.", "a kind of fish.", "a churn stick."]}], "ಗರ್ಗರಿ": [{"type": "noun", "defs": ["= ಗರ್ಗರ2 -1, 2 & 4."]}, {"type": "noun", "defs": ["the plant Eclipta prostrata ( = E. alba) of Asteraceae family; weed-ham."]}, {"type": "noun", "defs": ["the plant Wedelia calendulaceae of Asteraceae family."]}], "ಗರ್ಗರಿಕೆ": [{"type": "noun", "defs": ["= ಗರ್ಗರ1 -1."]}], "ಗರ್ಗರಿಗೋಲು": [{"type": "noun", "defs": ["a stick attached with small bells or metal plates that make clinking sound when shaken."]}], "ಗರ್ಗರಿಸು": [{"type": "verb", "defs": ["to make an indistinct sound (as in sawing) repeatedly."]}], "ಗರ್ಘರ": [{"type": "noun", "defs": ["= ಗರ್ಗರ1."]}], "ಗರ್ಘರಿ": [{"type": "noun", "defs": ["a round, metal vessel for holding water; a pitcher."]}, {"type": "noun", "defs": ["= ಗರ್ಗರ1."]}], "ಗರ್ಘರಿಕೆ": [{"type": "noun", "defs": ["= ಗರ್ಗರ2 -3."]}], "ಗರ್ಚ": [{"type": "noun", "defs": ["= ಗರ್ಜಿ1."]}], "ಗರ್ಜನ": [{"type": "noun", "defs": ["= ಗರ್ಜನೆ."]}], "ಗರ್ಜನೆ": [{"type": "noun", "defs": ["a loud, a rumbling or roaring sound.", "a loud crashing noise heard after a lightning flash and due to the expansion of rapidly heated air; thunder.", "extreme anger; wrath.", "a prolonged fight between large organised armed forces; battle.", "the act or words of rebuking; reproach."]}], "ಗರ್ಜನೆಗುಡು": [{"type": "verb", "defs": ["to utter a roaring sound; to shout angrily; to roar."]}], "ಗರ್ಜರಿ": [{"type": "noun", "defs": ["the strong-smelling bulb of the herb Allium sativum of Liliaceae family; garlic."]}], "ಗರ್ಜಿ": [{"type": "noun", "defs": ["the plant Carissa carandas of Apocynaceae family.", "its fruit."]}, {"type": "noun", "defs": ["= ಗರ್ಜು."]}], "ಗರ್ಜಿತ": [{"type": "adjective", "defs": ["roared; shouted loudly."]}, {"type": "noun", "defs": ["= ಗರ್ಜನೆ - 2.", "a showy, often vain, display, to impress others.", "an elephant that is enraged or sexually excited."]}], "ಗರ್ಜಿಸು": [{"type": "verb", "defs": ["to utter a loud, deep, rumbling sound, as a lion or a person in excitement, pain, anger, etc.; to roar.", "to shout at; to reprimand; to rebuke severely.", "to shout (as to frighten)."]}, {"type": "verb", "defs": ["to join (one thing to another); to attach; to fasten."]}], "ಗರ್ಜು": [{"type": "noun", "defs": ["anything that is inevitable, unavoidable, etc.; necessity; need."]}], "ಗರ್ತ": [{"type": "noun", "defs": ["a chair of State for a sovereign; a throne.", "a two or four-wheeled vehicle drawn by horses, used in ancient warfare; a chariot.", "the seat in a chariot for a warrior to sit on.", "a chequered cloth, which the game of dice is played on.", "a hole; a hollow or depressed place.", "the hollow of the loins.", "a deep wound.", "a large hollow in the side of a cliff, hill, etc. or underground; a cave.", "water moving rapidly in a circle so as to produce a depression in the centre into which floating objects may be drawn; a whirlpool; an eddy.", "a building for people to live in; a house."]}], "ಗರ್ದತೋಯ": [{"type": "noun", "defs": ["(Jain.) a class of gods."]}], "ಗರ್ದಭ": [{"type": "noun", "defs": ["the Equus hemionus, the four-legged, long-eared, short-maned mammal of the horse genus; an ass."]}], "ಗರ್ದಭಾಂಡ": [{"type": "noun", "defs": ["the tree Thespesia populenoides ( = Hibiscus populnea) of Malvaceae family."]}], "ಗರ್ದಭೆ": [{"type": "noun", "defs": ["a female ass (Equus hemionus)."]}], "ಗರ್ದಾಳ": [{"type": "noun", "defs": ["the plant Entada phaseoloides ( = E. scandens) of Mimosaceae family."]}], "ಗರ್ದಿ": [{"type": "adjective", "defs": ["large, huge; very big."]}, {"type": "noun", "defs": ["a noise and unruly situation.", "a loud and confusing noise; clamour; din.", "a condition marked by excited or enthusiastic movements."]}], "ಗರ್ದಿಸು": [{"type": "verb", "defs": ["to shout at; to reprimand; to rebuke severely.", "to shout (as to frighten cattle)."]}], "ಗರ್ದುಂಡಿ": [{"type": "noun", "defs": ["the tree Ochrocarpus longifolius of Guttiferae family."]}], "ಗರ್ದುಗ": [{"type": "noun", "defs": ["= ಗರ್ದುಗು."]}], "ಗರ್ದುಗು": [{"type": "noun", "defs": ["the creeper Caesalpinia bonduc of Caesalpiniaceae family.", "the hard, round, grey seed of this plant, used as marble to play with; nicker.", "the game played with these seeds.", "an eye-disease, characterised by the eye-ball protuberating and look like this seed.", "the creeper Wagatea spicata of Caesalpinaceae family."]}], "ಗರ್ದುಗೆ": [{"type": "noun", "defs": ["a round vessel of any size, made of earthenware, with a small mouth, used for holding liquids; a pot."]}, {"type": "noun", "defs": ["a piece of furniture for one person to sit on; a chair; a seat."]}], "ಗರ್ದೆ": [{"type": "noun", "defs": ["an irrigated, agricultural land, usu. where paddy, sugarcane, etc. are cultivated."]}], "ಗರ್ಧನ": [{"type": "noun", "defs": ["too great a desire to have something; greed; avarice.", "a greedy, covetous man."]}], "ಗರ್ಧನೆ": [{"type": "noun", "defs": ["= ಗರ್ಧನ - 1."]}], "ಗರ್ನಾಲು": [{"type": "noun", "defs": ["a cannon-cracker used on festive occasions.", "a short-barrelled cannon."]}], "ಗರ್ನಾಲುಬಿಡು": [{"type": "verb", "defs": ["to shot a cannon-cracker.", "(fig.) to tell a hyperbolic lie."]}], "ಗರ್ಬ": [{"type": "noun", "defs": ["a high or overbearing opinion of one's worth or importance; inordinate self-esteem; haughty behaviour resulting from this; arrogance; pride."]}], "ಗರ್ಬಂಗೆಡಿಸು": [{"type": "verb", "defs": ["to hurt the pride, dignity or self-respect of; to cause to feel shame, humiliation; to mortify; to humiliate."]}], "ಗರ್ಬಾನೃತ್ಯ": [{"type": "noun", "defs": ["a mass dance popular in Gujarat performed during the first nine days ofāśvayuja month."]}], "ಗರ್ಬಿ": [{"type": "noun", "defs": ["an arrogant, haughty man."]}], "ಗರ್ಬಿತ": [{"type": "noun", "defs": ["= ಗರ್ಬಿ."]}], "ಗರ್ಬಿಸು": [{"type": "verb", "defs": ["to show arrogance; to behave in a haughty manner regarding or treating (another or others) as unworthy or beneath one's dignity; to disdain."]}], "ಗರ್ಬು": [{"type": "noun", "defs": ["a strong, offensive smell or odour; stink; stench.", "any dirty, stinking material."]}], "ಗರ್ಭ": [{"type": "noun", "defs": ["the organ of conception and gestation in a woman and other female mammals; the uterus; the womb.", "the unborn young of human in its later stage, esp. from about the eighth week after conception until birth; an embryo or foetus.", "the large, saclike organ of vertebrates into which food passes from the oesophagus or gullet for storage while undergoing the early processes of digestion; the stomach.", "a very young child; a baby.", "the central or innermost part of anything; the core.", "(rhet.) one of the five stages in a drama, in which the cause for the major or main effect is found out or is sought to be known.", "one of the forty-five means of achieving the intended effect of a hymn (?)."]}], "ಗರ್ಭಕ": [{"type": "noun", "defs": ["a flower worn in the tress of hair, with its pedicel in the braid."]}], "ಗರ್ಭಕಟ್ಟು": [{"type": "verb", "defs": ["(the female reproductive cell) to be impregnated successfully."]}], "ಗರ್ಭಕರಗು": [{"type": "verb", "defs": ["(pregnancy) to fail; (the embryo or foetus) to be expelled from the womb before it is sufficiently developed to survive."]}], "ಗರ್ಭಕೋಶ": [{"type": "noun", "defs": ["a hollow, muscular organ of female mammals in which the ovum is deposited and the embryo and foetus are developed; the womb; the uterus."]}], "ಗರ್ಭಗಳಿತ": [{"type": "adjective", "defs": ["having a miscarriage; miscarried."]}, {"type": "noun", "defs": ["(fig.) a man who has last courage or self-confidence."]}], "ಗರ್ಭಗುಡಿ": [{"type": "noun", "defs": ["the inner sanctuary of Hindu temples where the main idol is installed, and symbolically the birth place of the universe; sanctum sanctorum."]}], "ಗರ್ಭಗೃಹ": [{"type": "noun", "defs": ["= ಗರ್ಭಗುಡಿ.", "an inner chamber of a house; a place of utmost privacy and inviolability."]}], "ಗರ್ಭಚಿಹ್ನ": [{"type": "noun", "defs": ["= ಗರ್ಭಚಿಹ್ನೆ."]}], "ಗರ್ಭಚಿಹ್ನೆ": [{"type": "noun", "defs": ["any of the apparent, external features of pregnancy in a woman."]}], "ಗರ್ಭಚೀಲ": [{"type": "noun", "defs": ["= ಗರ್ಭಕೋಶ."]}], "ಗರ್ಭಚ್ಛೇದ": [{"type": "noun", "defs": ["any deliberate procedure that removes or induces the expulsion of, a living or dead embryo or foetus; abortion.", "any spontaneous expulsion of an embryo or a foetus before it is sufficiently developed to survive; miscarriage."]}], "ಗರ್ಭಜ": [{"type": "adjective", "defs": ["viviparous - a) bearing or bringing forth living young, as most mammals and some other animals do; b) designating or of this type of reproduction."]}, {"type": "noun", "defs": ["a son; a male offspring."]}], "ಗರ್ಭದಾಸಿ": [{"type": "noun", "defs": ["a woman whois slave by birth (often used as an abusive term)."]}], "ಗರ್ಭದೀಕ್ಷೆ": [{"type": "noun", "defs": ["any of the vows that a man undertakes during the pregnancy of his wife.", "(vīr.) the act or fact of initiating an unborn child into Vīraśaiva religion."]}], "ಗರ್ಭದೋಷ": [{"type": "noun", "defs": ["any defect that makes a woman unable to bear a child.", "an inner hole or cavity formed at the first formation of a coral or pearl; a flaw in coral or pearl."]}], "ಗರ್ಭದೋಹಳ": [{"type": "noun", "defs": ["any of the strong desires of a pregnant woman (it is believed that such desires must be fulfilled for the welfare of the unborn child)."]}], "ಗರ್ಭದ್ವಾರ": [{"type": "noun", "defs": ["the entrance of a sanctum sanctorum of a temple or an inner chamber of a house."]}], "ಗರ್ಭಧಾರಣ": [{"type": "noun", "defs": ["= ಗರ್ಭಧಾರಣೆ."]}], "ಗರ್ಭಧಾರಣೆ": [{"type": "noun", "defs": ["a conceiving or being conceived; the condition of being pregnant; conception."]}], "ಗರ್ಭನಾಶನ": [{"type": "noun", "defs": ["= ಗರ್ಭಚ್ಛೇದ."]}], "ಗರ್ಭನಿರೋಧ": [{"type": "noun", "defs": ["the intentional prevention of fertilisation of an ovum, as by special devices, drugs, etc.; contraception."]}], "ಗರ್ಭನಿರೋಧಕ": [{"type": "adjective", "defs": ["of or used for contraception; preventing fertilisation of an ovum; contraceptive."]}, {"type": "noun", "defs": ["any contraceptive device, drug or agent; a contraceptive."]}], "ಗರ್ಭನಿಲ್ಲು": [{"type": "verb", "defs": ["= ಗರ್ಭಕಟ್ಟು."]}], "ಗರ್ಭನಿವಾಸ": [{"type": "noun", "defs": ["an inner chamber of a house; a place of utmost privacy and inviolability."]}], "ಗರ್ಭಪತನ": [{"type": "noun", "defs": ["= ಗರ್ಭಪಾತ."]}], "ಗರ್ಭಪದಿ": [{"type": "noun", "defs": ["any of a large class (Gastropoda) of molluscs having one-piece, straight or spiral shells, as snails, limpets, etc. or having no shells or greatly reduced shells, as certain slugs, and which move by means of a broad, muscular, ventral foot; a gastropod."]}], "ಗರ್ಭಪರಿಶೋಧನೆ": [{"type": "noun", "defs": ["= ಗರ್ಭಶೋಧನೆ."]}], "ಗರ್ಭಪಾತ": [{"type": "noun", "defs": ["any deliberate procedure that removes or induces the expulsion of, a living or dead embryo or foetus; abortion."]}], "ಗರ್ಭಪಿಂಡ": [{"type": "noun", "defs": ["the unborn young of human in its later stage, esp. from about the eighth week after conception until birth; an embryo or foetus."]}], "ಗರ್ಭಪಿಂಡಾಸನ": [{"type": "noun", "defs": ["a posture in yogic exercises that resembles the posture of an unborn baby, in its later stage, in its motheṛs womb."]}], "ಗರ್ಭಮೋಚನ": [{"type": "noun", "defs": ["the act of giving birth to a child; childbirth."]}], "ಗರ್ಭಲಿಂಗ": [{"type": "noun", "defs": ["(vīr.) the linga, the symbol of Śiva, tied to a pregnant woman while initiating her unborn child into Vīraśaiva religion."]}], "ಗರ್ಭವತಿ": [{"type": "noun", "defs": ["a woman having an offspring or offsprings developing in her uterus; a pregnant woman."]}], "ಗರ್ಭವಾಸ": [{"type": "noun", "defs": ["the condition or fact of being in the embryo stage.", "the inner sanctuary of Hindu temples where the main idol is installed, and symbolically the birth place of the universe; sanctum sanctorum."]}], "ಗರ್ಭವಿಕ್ಕು": [{"type": "verb", "defs": ["to have a spontaneous expulsion of an embryo or a foetus before it is sufficiently developed to survive; to have a miscarriage."]}], "ಗರ್ಭವಿಜ್ಞಾನ": [{"type": "noun", "defs": ["the branch of biology dealing with the formation and development of embryos; embryology."]}], "ಗರ್ಭವಿನ್ಯಾಸ": [{"type": "noun", "defs": ["the first rite performed by putting the holy vessel with pearls, metals etc. under the earth, on which a temple is to be created signifying the conceptualisation of the building."]}], "ಗರ್ಭವಿಭ್ರಮ": [{"type": "noun", "defs": ["the beauty of a woman attained on her becoming pregnant.", "a psychiatric condition characterised by emotional excitability, excessive anxiety, sensory and motor disturbances or the unconscious simulation of organic disorders, etc. caused during pregnancy; pregnancy hysteria."]}], "ಗರ್ಭವಿಳಿ": [{"type": "verb", "defs": ["(pregnancy) to fail; (the embryo or foetus) to be expelled from the womb before it is sufficiently developed to survive."]}], "ಗರ್ಭವೇಷ್ಟನ": [{"type": "noun", "defs": ["a vascular organ, developed within the uterus of most mammals during gestation from the chorion of the embryo and a part of the maternal uterine wall, that is connected to the embryo by the umbilical cord and that is discharged shortly after birth, which serves as the structure through which nourishment for the foetus is received from, and wastes of the foetus are eliminated into, the circulatory system of the mother; the placenta."]}], "ಗರ್ಭವ್ಯೂಹ": [{"type": "noun", "defs": ["a particular kind of military array."]}], "ಗರ್ಭಶಯನ": [{"type": "noun", "defs": ["the inner hollow place of the womb of a woman where the embryo and foetus are developed."]}], "ಗರ್ಭಶಾಸ್ತ್ರ": [{"type": "noun", "defs": ["= ಗರ್ಭವಿಜ್ಞಾನ."]}], "ಗರ್ಭಶೂಲೆ": [{"type": "noun", "defs": ["the pain that a woman suffers during the process of childbirth caused by the muscular contractions; pangs of child-birth."]}], "ಗರ್ಭಶೋಧನೆ": [{"type": "noun", "defs": ["(Jain. myth.) the purification of a woman's womb before she conceives the soul that would become one of the highest spiritual teachers."]}], "ಗರ್ಭಶ್ರೀಮಂತ": [{"type": "noun", "defs": ["a man born to affluence."]}], "ಗರ್ಭಷಷ್ಠಿ": [{"type": "adjective", "defs": ["(said of plants) bearing an ear of corn in sixty days from the day of sowing."]}], "ಗರ್ಭಸಂಧಿ": [{"type": "noun", "defs": ["(Jain.) the period of development of the embryo of a spiritual soul.", "(rhet.) one of the five stages in a drama, in which the cause for the major or main effect is found out or is sought to be known."]}], "ಗರ್ಭಸಂಸ್ಕಾರ": [{"type": "noun", "defs": ["= ಗರ್ಭಾಧಾನ.", "a purificatory rite performed at the first pregnancy of a woman."]}], "ಗರ್ಭಸೂತ್ರ": [{"type": "noun", "defs": ["an imaginary line drawn round the surface of the earth passing through the north and south poles, dividing the globe into two hemispheres."]}], "ಗರ್ಭಸ್ಖಲನ": [{"type": "noun", "defs": ["= ಗರ್ಭಪಾತ."]}], "ಗರ್ಭಸ್ತಂಭನ": [{"type": "noun", "defs": ["a preventing of abortion from happening."]}], "ಗರ್ಭಸ್ಥ": [{"type": "adjective", "defs": ["being in the foetus or embryo stage.", "being within."]}, {"type": "noun", "defs": ["an unborn baby; a soul in the embryo stage.", "that which is within."]}], "ಗರ್ಭಸ್ಥಿತ": [{"type": "adjective", "defs": ["= ಗರ್ಭಸ್ಥ1."]}, {"type": "noun", "defs": ["any person who is born from the womb; a common man."]}], "ಗರ್ಭಸ್ರಾವ": [{"type": "noun", "defs": ["= ಗರ್ಭಪಾತ."]}], "ಗರ್ಭಸ್ರಾವಕ": [{"type": "adjective", "defs": ["= ಗರ್ಭನಿರೋಧಕ1."]}, {"type": "noun", "defs": ["= ಗರ್ಭನಿರೋಧಕ2; 2) a man (esp. a doctor) who performs an abortion."]}], "ಗರ್ಭಾಂಕ": [{"type": "noun", "defs": ["(drama.) a sub-division or sub-plot in a main division of a drama."]}], "ಗರ್ಭಾಂಕುರ": [{"type": "noun", "defs": ["(in a female) a male gamete being fruitfully pollinated with the female germ cell; fertilisation; impregnation."]}], "ಗರ್ಭಾಂಗಣ": [{"type": "noun", "defs": ["the room adjacent to and in front of the sanctum sanctorum of a temple."]}], "ಗರ್ಭಾಗಾರ": [{"type": "noun", "defs": ["the inner sanctuary of temples where the main idol is installed, and symbolically the birth place of the universe; sanctum sanctorum.", "an inner chamber of a house; a place of utmost privacy and inviolability."]}], "ಗರ್ಭಾಡಳಿತ": [{"type": "noun", "defs": ["the administration of the internal affairs, esp. law and order, of a state."]}], "ಗರ್ಭಾಣು": [{"type": "noun", "defs": ["the male germ cell, found in semen, which penetrates the ovum or egg, of the female to fertilise it; a spermatozoon."]}], "ಗರ್ಭಾಧಾನ": [{"type": "noun", "defs": ["a fertilising of a ovum or egg of the female by a male germ cell (as may happen in a sexual intercourse); impregnation.", "a rite observed before the first sexual contact between a man and the woman married to each other; the nupital ceremony."]}], "ಗರ್ಭಾನ್ವಯಕ್ರಿಯೆ": [{"type": "noun", "defs": ["(Jain.) a series of fifty-three rites that an enlightened jaina spiritual teacher performs during his life."]}], "ಗರ್ಭಾವತರಣ": [{"type": "noun", "defs": ["the act of a soul being formed in the womb of its mother.", "(Jain.) the auspicious occasion of a great soul being formed in the womb of its mother."]}], "ಗರ್ಭಾವತಾರ": [{"type": "noun", "defs": ["= ಗರ್ಭಾವತರಣ."]}], "ಗರ್ಭಾಶಯ": [{"type": "noun", "defs": ["a hollow, muscular organ of female mammals in which the ovum is deposited and the embryo and foetus are developed; the womb; the uterus."]}], "ಗರ್ಭಾಷ್ಟಕ": [{"type": "noun", "defs": ["= ಗರ್ಭಾಷ್ಟಮ - 1."]}], "ಗರ್ಭಾಷ್ಟಮ": [{"type": "noun", "defs": ["the eighth year reckoning from conception.", "the eighth month of uterine gestation."]}], "ಗರ್ಭಿಣಿ": [{"type": "noun", "defs": ["a woman having an offspring or offspring's developing in her uterus; a pregnant woman."]}], "ಗರ್ಭಿಣಿಹೆನ್ನೆತ್ತರು": [{"type": "noun", "defs": ["a disease of pregnant women characterised by heavy bleeding."]}], "ಗರ್ಭಿತ": [{"type": "verb", "defs": ["having an offspring or offspring's developing in the uterus; that has conceived; with young or with child; pregnant.", "contained within; being inside."]}], "ಗರ್ಭೀಕರಿಸು": [{"type": "verb", "defs": ["to have within; to contain, include, enclose (something)."]}], "ಗರ್ಭೀಕೃತ": [{"type": "adjective", "defs": ["having been included, enclosed.", "imbued or indoctrinated ( as a meaning, significance, doctrine, theory, belief, etc.)."]}], "ಗರ್ಭೇಶ್ವರ": [{"type": "noun", "defs": ["a man born to affluence."]}], "ಗರ್ಭೇಶ್ವರಿ": [{"type": "noun", "defs": ["a woman born to affluence."]}], "ಗರ್ಮಿ": [{"type": "noun", "defs": ["much hotness; great warmth; heat.", "a disease transmitted only or chiefly by sexual intercourse with an individual infected with, as syphilis or gonorrhoea."]}], "ಗರ್ವ": [{"type": "noun", "defs": ["a high or overbearing opinion of one's worth or importance; inordinate self-esteem; haughty behaviour resulting from this; arrogance; pride.", "(rhet.) pride, considered as one of the thirty-three subordinate feelings.", "(pros.) a metre having two long syllables in each foot.", "(phil.) the principle of individuality; ಗರ್ವ ಇಳಿಸು garva iḷisu to make some pay for his arrogance; to make an (arrogant) person humble."]}], "ಗರ್ವಪಡು": [{"type": "verb", "defs": ["= ಗರ್ವಿಸು."]}], "ಗರ್ವಭಂಗ": [{"type": "noun", "defs": ["the act or an instance of one's pride, arrogance, conceit being hurt or injured."]}], "ಗರ್ವವಿನಾಶಿ": [{"type": "adjective", "defs": ["bringing down, hurting, damaging a person's pride."]}], "ಗರ್ವವಿಭ್ರಮ": [{"type": "noun", "defs": ["haughty, pretentious behaviour or fraudulent assumption caused by undue pride."]}], "ಗರ್ವವಿಳಿಸು": [{"type": "verb", "defs": ["to bring down another's undue pride, arrogance etc."]}], "ಗರ್ವವ್ಯಾಲೆ": [{"type": "noun", "defs": ["a haughty, arrogant woman."]}], "ಗರ್ವವ್ಯಾಳಿ": [{"type": "noun", "defs": ["an excited, wild elephant.", "a haughty, wicked man."]}], "ಗರ್ವಹೀನ": [{"type": "noun", "defs": ["a man who is free from pride, self-conceit; a humble, modest man."]}], "ಗರ್ವಾಂಧ": [{"type": "noun", "defs": ["a man not able to judge, reason etc. owing to his arrogance, self-conceit."]}], "ಗರ್ವಾಂಧೆ": [{"type": "noun", "defs": ["a woman not able to judge, reason etc. owing to her arrogance, self-conceit."]}], "ಗರ್ವಾಟ": [{"type": "noun", "defs": ["a watchman at the gate, outer door, etc.; a door-keeper."]}], "ಗರ್ವಿ": [{"type": "noun", "defs": ["an arrogant person."]}], "ಗರ್ವಿಕೆ": [{"type": "noun", "defs": ["personal vanity; pride; arrogance."]}], "ಗರ್ವಿಗ": [{"type": "noun", "defs": ["an arrogant man."]}], "ಗರ್ವಿತ": [{"type": "adjective", "defs": ["behaving arrogantly; arrogant."]}, {"type": "noun", "defs": ["an arrogant man.", "a proud man."]}], "ಗರ್ವಿತತನ": [{"type": "noun", "defs": ["the quality of a haughty, arrogant person; haughtiness; insolence."]}], "ಗರ್ವಿತೆ": [{"type": "noun", "defs": ["an arrogant woman.", "a proud woman."]}], "ಗರ್ವಿಷ್ಠ": [{"type": "adjective", "defs": ["full of undue pride; overbearing; arrogant; head-strong."]}, {"type": "noun", "defs": ["an arrogant man."]}], "ಗರ್ವಿಷ್ಠೆ": [{"type": "noun", "defs": ["an arrogant woman."]}], "ಗರ್ವಿಸು": [{"type": "verb", "defs": ["to show arrogance; to behave in a haughty manner regarding or treating (another or others) as unworthy or beneath one's dignity; to disdain."]}], "ಗರ್ವೀಕರಿಸು": [{"type": "verb", "defs": ["to become arrogant; to have exaggerated opinion of oneself, one's status, wealth, talent, etc.; to disdain another."]}], "ಗರ್ವು": [{"type": "noun", "defs": ["a high or overbearing opinion of one's worth or importance; inordinate self-esteem; haughty behaviour resulting from this; arrogance; pride."]}], "ಗರ್ವೋಕ್ತಿ": [{"type": "noun", "defs": ["arrogant words or speech."]}], "ಗರ್ವೋದ್ಧತ": [{"type": "adjective", "defs": ["intolerably arrogant; highly haughty."]}, {"type": "noun", "defs": ["an intolerably arrogant or highly haughty man."]}], "ಗರ್ಹಕ": [{"type": "noun", "defs": ["a small, open container, usu. with a handle, for drinking beverages."]}], "ಗರ್ಹಣ": [{"type": "noun", "defs": ["= ಗರ್ಹಣೆ."]}], "ಗರ್ಹಣೀಯ": [{"type": "adjective", "defs": ["fit to be condemned, denunciated."]}], "ಗರ್ಹಣೆ": [{"type": "noun", "defs": ["a condemning (of another or something); condemnation; denunciation."]}], "ಗರ್ಹಿತ": [{"type": "adjective", "defs": ["condemned; denunciated."]}, {"type": "noun", "defs": ["a man who is condemned or denunciated."]}], "ಗರ್ಹಿತೆ": [{"type": "noun", "defs": ["a woman whois condemned or denunciated."]}], "ಗರ್ಹಿಸು": [{"type": "verb", "defs": ["to rebuke with strong words; to denunciate."]}], "ಗರ್ಹೆ": [{"type": "noun", "defs": ["the act of rebuking; denunciation."]}], "ಗಹ್ರ್ಯ": [{"type": "adjective", "defs": ["= ಗರ್ಹಣೀಯ."]}, {"type": "noun", "defs": ["a man, animal or thing that is fit to be or must be condemned."]}], "ಗಹ್ರ್ಯವಾದಿ": [{"type": "noun", "defs": ["one who uses harsh words or speech (as in rebuking, condemning etc.); a denunciator."]}], "ಗಹ್ರ್ಯಾಧೀನ": [{"type": "noun", "defs": ["a man who is or is subjected to be, condemned or denunciated."]}], "ಗಹ್ರ್ಯಾಧೀನೆ": [{"type": "noun", "defs": ["a woman whois or is subjected to be , condemned or denunciated."]}], "ಗಲ": [{"type": "noun", "defs": ["the front portion of the part of the body connecting the head to the shoulders; the neck.", "the resin of the sāla tree (Shorea talura = S. robusta of Dipterocarpaceae family).", "a stout cord made by twisting together strands of hemp, sisal, flax, cotton, nylon, wire or similar material; a rope.", "ಗಲಸ್ಯ ಕಂಠಸ್ಯ galasya kaṇṭhasya (a wrong form of ಗಲಶ್ಚ ಕಂಠಶ್ಚ, but accepted in usage) the condition or fact of (two persons) being very intimate.", "an intimate friend."]}, {"type": "noun", "defs": ["(pros.) a foot of two syllables, a long one followed by a short one; trochee."]}], "ಗಲಂತಿ": [{"type": "noun", "defs": ["= ಗಲಂತಿಕೆ."]}], "ಗಲಂತಿಕೆ": [{"type": "noun", "defs": ["a water-jug with a handle and a snout to pour water.", "a water container, with a small hole at the bottom, hung above the linga, used for dropping water in a regulated manner."]}], "ಗಲಕಂಬಲ": [{"type": "noun", "defs": ["a loose fold of skin hanging from the throat of cattle and certain other animals; the dewlap.", "a long or broad piece of cloth worn about the neck; a scarf."]}], "ಗಲಕು": [{"type": "noun", "defs": ["= ಗಲಗಲ."]}, {"type": "noun", "defs": ["the grass Saccharum fuscum of Poaceae family.", "its reed, used for writing with; a reed-pen."]}], "ಗಲಕುಹುಲ್ಲು": [{"type": "noun", "defs": ["= ಗಲಕು2 -1."]}], "ಗಲಗಂಡ": [{"type": "noun", "defs": ["an enlargement of the thyroid gland, often visible as a swelling in the lower part of the front of the neck; goitre."]}], "ಗಲಗಲ": [{"type": "noun", "defs": ["a loud, continuous, indistinct sound (as the incessant chattering sound made by large number of children at the same time or the one made by the bells attached to the anklets)."]}], "ಗಲಗಲನೆ": [{"type": "adverb", "defs": ["with an incessant chattering sound; with the sound made by the bells of the anklet."]}], "ಗಲಗಲಿಸು": [{"type": "verb", "defs": ["to make an incessant chattering sound or cause to make the bells of one's anklets clinking sounds.", "to burn with relatively big flames."]}], "ಗಲಗು": [{"type": "noun", "defs": ["= ಗಲಗಲ."]}, {"type": "noun", "defs": ["= ಗಲಕು2."]}], "ಗಲಗುವಡಿಸು": [{"type": "verb", "defs": ["= ಗಲಗಲಿಸು -1."]}], "ಗಲಗೆಸಗು": [{"type": "verb", "defs": ["= ಗಲಗಲಿಸು -1."]}], "ಗಲಗ್ರಾಹಿತ್ವ": [{"type": "noun", "defs": ["a holding of another's throat; a seizing of another's neck with (something).", "(fig.) the act of causing trouble to others with an intention to taking advantage for oneself."]}], "ಗಲತಿ": [{"type": "noun", "defs": ["a fault in understanding, perception, interpretation, performing, etc; a mistake."]}], "ಗಲತಿಗೆ": [{"type": "noun", "defs": ["= ಗಲಂತಿಕೆ."]}], "ಗಲಧ್ವನಿ": [{"type": "noun", "defs": ["any sound produced from the throat.", "the sound made in copulation."]}], "ಗಲನ": [{"type": "noun", "defs": ["the act of a liquid that drops; an instance of this.", "the act of falling, sliding etc."]}], "ಗಲಪಟ್ಟಿ": [{"type": "noun", "defs": ["the part of a shirt, dress, coat, etc., that goes round the neck, either upright or turned over; collar."]}], "ಗಲಬರಿಕೆ": [{"type": "noun", "defs": ["the act of washing dishes."]}], "ಗಲಬರಿಸು": [{"type": "verb", "defs": ["to wash the dishes.", "to wash (one's) face."]}], "ಗಲಬಲಿ": [{"type": "noun", "defs": ["= ಗಲಿಬಿಲಿ."]}], "ಗಲಬಲಿಸು": [{"type": "verb", "defs": ["to make a clamour; to cry out incessantly."]}], "ಗಲಬಿಲಿ": [{"type": "noun", "defs": ["= ಗಲಿಬಿಲಿ."]}], "ಗಲಬು": [{"type": "verb", "defs": ["= ಗಲಬಲಿಸು."]}], "ಗಲಬೆ": [{"type": "noun", "defs": ["= ಗಲಭೆ."]}], "ಗಲಭೆ": [{"type": "noun", "defs": ["loud or vehement shouting or noise; clamour.", "an agitated disturbance; a violent motion or stirring."]}], "ಗಲಭೆಕಾಱ": [{"type": "noun", "defs": ["a man who shouts loudly or makes a vehement cry continuously.", "a man who tries to stir up people in support of a cause, esp. against a system.", "a man who deliberately creates commotion to take away something valuable."]}], "ಗಲಭೆಕೋರ": [{"type": "noun", "defs": ["a man who habitually engages himself in antisocial activities or creates commotion in the society."]}], "ಗಲಮೀಸೆ": [{"type": "noun", "defs": ["the moustachewho has grown in curls on either side of the face."]}], "ಗಲರವ": [{"type": "noun", "defs": ["= ಗಲಧ್ವನಿ."]}], "ಗಲವಾರ": [{"type": "noun", "defs": ["the plant Actinodaphane hookeri of Lauraceae family."]}], "ಗಲವಿದ್ರಧಿ": [{"type": "noun", "defs": ["a tumour and abscess in the throat."]}], "ಗಲಸಾಧನೆ": [{"type": "noun", "defs": ["a jugglery consisting of swallowing and taking out stones, scorpions, etc."]}], "ಗಲಹಸ್ತ": [{"type": "noun", "defs": ["a knocking down of one's opponent by seizing his neck, in wrestling."]}], "ಗಲಾಟೆ": [{"type": "noun", "defs": ["a loud uproar, as from a crowd; any loud and continued noise.", "the condition or movement marked by joy and excitement; busy and noisy activity.", "an annoying, vexing, bothersome condition; an instance of this.", "a wild disorder caused by violent motion of a crowd of people; turbulence."]}], "ಗಲಾಯು": [{"type": "noun", "defs": ["a throat disease characterised by the formation of a tumour that makes breathing and uttering of sounds difficult."]}], "ಗಲಾಸು": [{"type": "noun", "defs": ["a hard, brittle substance made by fusing silicates with soda or potash, lime, and, sometimes, various metallic oxides into a molten mass that is cooled rapidly to prevent crystallization or annealed to eliminate stresses; glass.", "a drinking container made of glass or (in gen.) any material; a glass."]}], "ಗಲಿತ": [{"type": "adjective", "defs": ["that is slipped, fallen down.", "fallen in drops; leaked out slowly in drops."]}, {"type": "noun", "defs": ["that which has fallen or slipped down.", "the act of seeping of leaking (as a liquid)."]}], "ಗಲಿಬಿಲಿ": [{"type": "noun", "defs": ["a continuous, confusing sound.", "the fact or condition of being bewildered.", "the condition of being confused utterly."]}], "ಗಲಿಯಿಸು": [{"type": "verb", "defs": ["to flow or leak out slowly, as through very small holes.", "to fall or slide down.", "to hang or suspend oneself from above.", "to elapse or pass (as time)."]}], "ಗಲೀಜು": [{"type": "noun", "defs": ["any unclean or soiling matter, as mud, dust, dung, trash, etc.; dirt; filth."]}], "ಗಲೀತ": [{"type": "noun", "defs": ["a beating, whipping or thrashing; a blow."]}], "ಗಲುಕು": [{"type": "noun", "defs": ["the grass Saccharum fuscum of Poaceae family.", "its reed, used for writing with; a reed-pen."]}], "ಗಲುಗಲನೆ": [{"type": "adverb", "defs": ["with an incessant chattering sound; with the sound made by the bells of the anklet."]}], "ಗಲುಗು": [{"type": "noun", "defs": ["a loud, continuous, indistinct sound (as the incessant chattering sound made by large number of children at the same time or the one made by the bells attached to the anklets)."]}], "ಗಲೇಫು": [{"type": "noun", "defs": ["a cover or case for a pillow or cushion of a chair, etc."]}], "ಗಲೋದ್ದೇಶ": [{"type": "noun", "defs": ["the portion around the neck."]}], "ಗಲೌಘ": [{"type": "noun", "defs": ["a tumour in the throat."]}], "ಗಲ್ಕು": [{"type": "noun", "defs": ["= ಗಲುಗು."]}], "ಗಲ್ಗಲನೆ": [{"type": "adverb", "defs": ["= ಗಲುಗಲನೆ."]}], "ಗಲ್ಲ": [{"type": "noun", "defs": ["either side of the face between the nose and ear, below the eye; the cheek.", "the part of the face below the lower lip; projecting part of the lower jaw; the chin."]}, {"type": "noun", "defs": ["= ಗಲ್ಲು."]}, {"type": "noun", "defs": ["= ಗಲ್ಲಾ."]}], "ಗಲ್ಲಂಬಿಡಿ": [{"type": "verb", "defs": ["= ಗಲ್ಲಹಿಡಿ."]}], "ಗಲ್ಲಗಿವಿ": [{"type": "noun", "defs": ["an ear the lobe of which hangs down considerably."]}], "ಗಲ್ಲಗುಗ್ಗುರಿ": [{"type": "noun", "defs": ["a lock or locks of hair hanging loosely on the cheeks."]}], "ಗಲ್ಲಗುಳಿ": [{"type": "noun", "defs": ["a small, natural hollow on the cheek or chin; a dimple."]}], "ಗಲ್ಲಗೈಗೊಳ್": [{"type": "verb", "defs": ["to place the palm below one's chin.", "to be in a pensive mood."]}], "ಗಲ್ಲಟಕ": [{"type": "noun", "defs": ["a thick, flat or slightly hallowed, iron plate used to fry, toast, etc. dishes; an iron pan."]}], "ಗಲ್ಲಣ": [{"type": "noun", "defs": ["= ಗಲ್ಲಣೆ."]}], "ಗಲ್ಲಣೆ": [{"type": "noun", "defs": ["an annoyance, trouble; a vexing, irritating act.", "a sound or a person's voice that causes bewilderment or panic.", "a heavy blow or stroke."]}], "ಗಲ್ಲತಗ್ಗು": [{"type": "noun", "defs": ["= ಗಲ್ಲಗುಳಿ."]}], "ಗಲ್ಲಮೀಸೆ": [{"type": "noun", "defs": ["= ಗಲ್ಲಿಮೀಸೆ."]}], "ಗಲ್ಲವಿಡಿ": [{"type": "verb", "defs": ["= ಗಲ್ಲಹಿಡಿ."]}], "ಗಲ್ಲಹಿಡಿ": [{"type": "verb", "defs": ["to touch the chin in a tender or loving manner."]}], "ಗಲ್ಲಾ": [{"type": "noun", "defs": ["the cash-table or cash-pit of a shop, hotel, etc.", "a cash box of a shop or hotel-keeper."]}], "ಗಲ್ಲಾಗುಲ್ಲಿ": [{"type": "noun", "defs": ["a woman of mean, despicable qualities."]}], "ಗಲ್ಲಾಪೆಟ್ಟಿಗೆ": [{"type": "noun", "defs": ["= ಗಲ್ಲಾ - 2.", "(coll.) receipts from a play or a film; box-office."]}], "ಗಲ್ಲಿ": [{"type": "noun", "defs": ["a narrow way between the two rows of buildings; a very narrow street."]}, {"type": "noun", "defs": ["= ಗಲ್ಲು."]}], "ಗಲ್ಲಿಮಣೆ": [{"type": "noun", "defs": ["= ಗಲ್ಲುಗಂಬ."]}], "ಗಲ್ಲಿಮೀಸೆ": [{"type": "noun", "defs": ["the moustachewho has grown in curls on either side of the face."]}], "ಗಲ್ಲಿಸು": [{"type": "verb", "defs": ["to shake vehemently; to stir well.", "to trouble; to annoy; to irritate.", "to fall upon violently; to attack."]}], "ಗಲ್ಲೀಪ": [{"type": "noun", "defs": ["= ಗಲೇಫು."]}], "ಗಲ್ಲೀಪು": [{"type": "noun", "defs": ["= ಗಲೇಫು."]}], "ಗಲ್ಲು": [{"type": "noun", "defs": ["penalty of death by hanging a criminal by a rope about the neck; capital punishment.", "ಗಲ್ಲಿಗೆ ಹಾಕು gallige hāku to put to death, as a punishment for a crime, by tying a rope about the neck and suddenly suspending the body so as to snap the neck or cause strangulation; to hang.", "(fig.) to destroy the vital, essential qualities of; to destroy completely; ಗಲ್ಲಿಗೇರಿಸು galligērisu = ಗಲ್ಲಿಗೆ ಹಾಕು; ಗಲ್ಲಿಗೇರು galligēru to be put to death by hanging; to be hanged (as a capital punishment)."]}], "ಗಲ್ಲುಗಂಬ": [{"type": "noun", "defs": ["an upright frame with a crossbeam and a rope, for hanging condemned persons; gallows."]}], "ಗಲ್ಲುಗಾರ": [{"type": "noun", "defs": ["a man who hangs condemned persons to death."]}], "ಗಲ್ಲುಮಣೆ": [{"type": "noun", "defs": ["= ಗಲ್ಲುಗಂಬ."]}], "ಗಲ್ಲುಮರ": [{"type": "noun", "defs": ["= ಗಲ್ಲುಗಂಬ."]}], "ಗಲ್ಲೆ": [{"type": "noun", "defs": ["a soft, shapeless clotted mass; a lump; a clot."]}, {"type": "noun", "defs": ["= ಗಲ್ಲಾ."]}, {"type": "noun", "defs": ["a pit filled with the juice of the leaves of the plant tanneṛs cassia (Cassia auriculata), made for tanning the leather."]}], "ಗಲ್ಲೆಗಟ್ಟು": [{"type": "verb", "defs": ["to become thickened and be formed into clot or clots.", "to come together in large group; to throng; to crowd."]}], "ಗಲ್ಲೆಗೆಡೆ": [{"type": "verb", "defs": ["to fall down as a shapeless mass, losing one's vital strength."]}], "ಗಲ್ಲೆಮೊಸರ್": [{"type": "noun", "defs": ["coagulated milk; curds."]}], "ಗಲ್ಲೆಯೊಡೆ": [{"type": "verb", "defs": ["(a crowd) to break up and disperse."]}], "ಗಲ್ವರ್ಕ": [{"type": "noun", "defs": ["a small container used for drinking beverages.", "a clear, transparent quartz; crystal; a piece of this cut in the form of an ornament."]}], "ಗವ್": [{"type": "noun", "defs": ["a sound that creates an atmosphere of fear (as the incessant sounds made by insects in a very dark area).", "the sharp, abrupt sound made by a dog.", "ಗವ್ ಎನ್ನು gav ennu to be very dark and have insects making incessant sounds (creating a sense of fear)."]}], "ಗವ": [{"type": "noun", "defs": ["a female cattle; a cow."]}], "ಗವಡಿಗ": [{"type": "noun", "defs": ["a man whose profession is making of baskets from bamboo, rattan, strips of wood etc."]}], "ಗವಡು": [{"type": "noun", "defs": ["(dial.) the quality or condition of being unable to hear; deafness."]}]}