{"ಫಕ್ಕನೆ": [{"type": "adverb", "defs": ["immediately; suddenly."]}], "ಫಕ್ಕಿ": [{"type": "noun", "defs": ["a practice so long established that it has the force of law; a custom."]}], "ಫಕ್ತ": [{"type": "adjective", "defs": ["= ಫಕತ1."]}, {"type": "adverb", "defs": ["= ಫಕತ2."]}], "ಫಜೀತಿ": [{"type": "noun", "defs": ["a troublesome or embarrassing situation.", "ಫಜೀತಿ ಪಡು phajīti paḍu to undergo a troublesome or embarrassing situation; ಫಜೀತಿ ಬೀಳು phajīti bīḷu to get entangled into a troublesome or embarrassing situation; ಫಜೀತಿ ಮಾಡು phajīti māḍu to cause (another) to undergo a troublesome or embarrassing situation."]}], "ಫಟಕ": [{"type": "noun", "defs": ["transparent, colourless or slightly tinged quartz; a crystal.", "something resembling crystal in transparency, colourlessness and clarity.", "a solidified form of a substance in which the atoms or molecules are arranged in a definite pattern that is repeated regularly in three dimensions.", "the plant Barleria cristata of Acanthaceae family; purple nail dye plant.", "its flower.", "the plant Rhinacanthus nasuta ( = R. communis) of Acanthaceae family.", "a camphor crystal.", "a glow of reflected light; a lustre."]}], "ಫಟಕಿ": [{"type": "noun", "defs": ["a stroke with a whip or cane stick; a lash."]}], "ಫಟಕಿಶಿಕ್ಷೆ": [{"type": "noun", "defs": ["a lashing with a whip or cane stick (as a punishment)."]}], "ಫಟಾಕಿ": [{"type": "noun", "defs": ["= ಫಟಕಿ."]}], "ಫಟಾಕಿಶಿಕ್ಷೆ": [{"type": "noun", "defs": ["= ಫಟಕಿಶಿಕ್ಷೆ."]}], "ಫಟಾಕ್ಷಿ": [{"type": "noun", "defs": ["a paper or cardboard cylinder filled with an explosive and having a fuse, for discharging to make a noise, as during a celebration, festivals, etc.; a firecracker."]}], "ಫಟಿಂಗ": [{"type": "noun", "defs": ["a man who acts on his own disregarding accepted rules and standards and in a way that is harmful to others.", "a boy or man who playfully causes petty annoyance; a mischief-maker."]}], "ಫಟಿಂಗತನ": [{"type": "noun", "defs": ["the tendency of a person who is maliciously annoying.", "the quality of a person who playfully annoys others."]}], "ಫಟಿಂಗಿ": [{"type": "noun", "defs": ["a girl or woman who acts on her own, disregarding accepted rules and standards and in a way that is harmful to others.", "a girl or woman who playfully causes petty annoyance; a mischief-maker."]}], "ಫಟಿಕಿ": [{"type": "noun", "defs": ["= ಫಟಕಿ."]}], "ಫಟಿಕೆ": [{"type": "noun", "defs": ["= ಫಟಕಿ."]}], "ಫಟೆ": [{"type": "noun", "defs": ["the fold of skin near a cobra's head that expands when the snake is excited; a cobra's hood."]}, {"type": "noun", "defs": ["a kind of fibrous plant that grows up to eight the leaves of which are used as fodder."]}], "ಫಡ": [{"type": "noun", "defs": ["a crop (as sugarcane, sorghum) that has grown to its full height."]}, {"type": "independent clause", "defs": ["a term used to express one's anger, disregard, slight, etc."]}], "ಫಡಕು": [{"type": "noun", "defs": ["the movable structure fixed to the door-frame, window-frame, etc., usu. with hinges, for opening or closing entrance to a building, room, etc. or to allow air, light to enter or avoid them from doing so; a door.", "an opening caused by or as if by splitting; a cleft; a fissure; a rift.", "a piece of a plantain leaf."]}], "ಫಡಗಳ್ಳಿ": [{"type": "noun", "defs": ["the cactus plant Opuntia dillenii of Cactaceae family; prickly pear."]}], "ಫಡಣೀಸ": [{"type": "noun", "defs": ["= ಫಡನವೀಸ."]}], "ಫಡನವೀಸ": [{"type": "noun", "defs": ["a keeper of registers in public offices."]}], "ಫಡನೀಸ": [{"type": "noun", "defs": ["= ಫಡನವೀಸ."]}], "ಫಡಪೋಶಿ": [{"type": "adjective", "defs": ["without worth or merit; worthless; useless.", "done or made without enough attention, precision, etc.; careless."]}, {"type": "noun", "defs": ["the quality of being worthless, useless; worthlessness.", "the quality or tendency of doing something without required attention, precision, etc.; carelessness.", "a man of no importance or consequence; a contemptible man."]}], "ಫಡಪೋಶಿತನ": [{"type": "noun", "defs": ["= ಫಡಪೋಶಿ2 - 1 & 2."]}], "ಫಡಪೋಸಿ": [{"type": "adjective", "defs": ["= ಫಡಪೋಶಿ1."]}, {"type": "noun", "defs": ["= ಫಡಪೋಶಿ2."]}], "ಫಡಾಳಿ": [{"type": "noun", "defs": ["a fairly large piece of cloth.", "a piece of cloth, in gen."]}], "ಫಡಿ": [{"type": "noun", "defs": ["a long, narrow cleft or crack in a rock or between two rocks.", "a piece of stone that is flat, broad and fairly thick; a slab of stone.", "a depression in the ground where water may get stagnated."]}], "ಫಡಿಕೆ": [{"type": "noun", "defs": ["a piece of torn cloth.", "an ablong cloth worn by men in single fold, to cover their body from navel to feet."]}], "ಫಡ್ಜ": [{"type": "noun", "defs": ["the act of demolishing or being demolished completely; destruction; ruin.", "a repaying of a loan completely.", "the act or an instance of utilising or consuming the stock of something completely; exhaustion."]}], "ಫಡ್ಡಳಿ": [{"type": "noun", "defs": ["the evergreen shrub Nerium indicum ( = N. odorum, =N. oleander) of Apocynaceae family.", "its flower."]}], "ಫಣ": [{"type": "noun", "defs": ["any substance or article used as money, as bank notes, checks, etc.; money.", "a usu. round piece of metal with a distinctive stamp, and of a fixed value and weight, issued by a government as money; a coin.", "the money in circulation in any country."]}, {"type": "noun", "defs": ["the sensation resulting from stimulation of the retina of the eye by light waves of certain lengths; a colour.", "the colour that resembles blood; red.", "a pigment suspended in a liquid medium and applied with or as with a brush, roller, etc. as a protective or decorative coating to various surfaces or to canvas or other materials in producing a work of art; a paint.", "a picture painted on a canvas, paper, etc. applying paints; a painting.", "any coloured cloth or clothing.", "a colourful flower.", "sort; variety; class; kind.", "the original form or state of being.", "the quality of a thing that attracts; beauty.", "brightness; lustre; shininess.", "pretentious behaviour or speech; pretension; hypocrisy.", "a song in praise of.", "the power to do something, grasp immediately and comprehensively, etc.; mental ability.", "a person whose achievement or merit excels another or others.", "purity of gold, silver (as expressed with the unit 'carat').", "that which is apt, appropriate.", "any of the four major classes (brāhmaṇa, kṣatriya, vaiśya and śudra) of old Hindu society.", "the quality of being pleasant to the ears; melody.", "a group, faction, clan."]}, {"type": "noun", "defs": ["the fold of skin near a cobra's head that expands when it is excited; a cobra's hood."]}], "ಫಣಕಟ್ಟು": [{"type": "noun", "defs": ["the customs or rules of a caste.", "a large number of people belonging to a social, professional or religious class."]}], "ಫಣಗೆಲಸ": [{"type": "noun", "defs": ["a family vocation."]}], "ಫಣಭೃತ್ತು": [{"type": "noun", "defs": ["that which has a hood; a cobra.", "(in gen.) a snake."]}], "ಫಣಮಣಿ": [{"type": "noun", "defs": ["= ಫಣಾಮಣಿ."]}], "ಫಣಸ್ತ": [{"type": "noun", "defs": ["a number of people grouped together because of certain likenesses or common traits; a class."]}], "ಫಣಾಧರ": [{"type": "noun", "defs": ["= ಫಣಭೃತ್ತು."]}], "ಫಣಾಮಣಿ": [{"type": "noun", "defs": ["a jewel supposed to be in the crown of a cobra."]}], "ಫಣಾರತ್ನ": [{"type": "noun", "defs": ["= ಫಣಾಮಣಿ."]}], "ಫಣಿ": [{"type": "noun", "defs": ["a snake that can expand the fold of skin near its head when excited (as a cobra).", "Nāgai, the presiding deity of the asterismāślēṣa (Epsilon Hydra).", "Rāhu, the serpent-demon, eighth of the nine astrological planets.", "a kind of acute, inflammatory virus disease, characterised of blisters on the back.", "(arith.) a huge number having thirty-three digits (one followed by thirty two zeros)."]}, {"type": "noun", "defs": ["a thin, long plank of wood.", "a stick; a staff.", "a short staff used by boys in playing 'cinni-dāṇḍu."]}], "ಫಣಿಗೃಹ": [{"type": "noun", "defs": ["the soil carried away by ants in digging their underground nest, heaped in a mound around its entrance, but occupied by snakes; an anthill."]}], "ಫಣಿಗೇಹ": [{"type": "noun", "defs": ["= ಫಣಿಗೃಹ."]}], "ಫಣಿಜ್ಝಕ": [{"type": "noun", "defs": ["= ಫಣಿರ್ಜಕ."]}], "ಫಣಿತಿ": [{"type": "noun", "defs": ["expression or communication of thoughts and feelings by spoken words; speech."]}], "ಫಣಿನಿ": [{"type": "noun", "defs": ["a deified female snake (supposed to have human body above the navel and snake's tail."]}], "ಫಣಿನಿಲಯ": [{"type": "noun", "defs": ["= ಫಣಿಗೃಹ."]}], "ಫಣಿಪಾಶ": [{"type": "noun", "defs": ["one of the kinds of coital embrace, in which both the man and woman twist their bodies together, like two snakes in coition."]}], "ಫಣಿಭುಕ್ಕು": [{"type": "noun", "defs": ["a kind of big snake that eats small snakes.", "a peacock, that eats snakes.", "a kite, esp. garuḍa, (the Brahminee kite, Haliastur indus) that eats snakes."]}], "ಫಣಿಭೋಗ": [{"type": "noun", "defs": ["a coiled snake."]}], "ಫಣಿರ್ಜಕ": [{"type": "noun", "defs": ["the perennial plant Origanum majorana of Lamiaceae family."]}], "ಫಣಿಲೋಕ": [{"type": "noun", "defs": ["(myth.) the world of snakes and serpents, believed to be below the earth."]}], "ಫಣಿವೇಣಿ": [{"type": "noun", "defs": ["a woman having long braided hair."]}], "ಫಣೆ": [{"type": "noun", "defs": ["the part of the face above the eyebrows; the forehead.", "the top part of the skull or head; the crown."]}, {"type": "noun", "defs": ["the fold of skin near a cobra's head that expands when it is excited; a cobra's hood."]}], "ಫಣೆಕಟ್ಟು": [{"type": "noun", "defs": ["an ornamental band tied on the forehead."]}], "ಫಣೆಗಣ್ಣು": [{"type": "noun", "defs": ["the fiery eye on the forehead of Śiva."]}], "ಫಣೇರಪೆಟ್ಟಿಗೆ": [{"type": "noun", "defs": ["a small box in which women keep their cosmetic items."]}], "ಫತ್ತೆ": [{"type": "noun", "defs": ["success in a war, physical combat, etc.; triumph; victory."]}], "ಫತ್ತೆಮಾರಿ": [{"type": "noun", "defs": ["a large sailing vessel."]}], "ಫತ್ತೇಮಾರಿ": [{"type": "noun", "defs": ["= ಫತ್ತೆಮಾರಿ."]}], "ಫನ": [{"type": "noun", "defs": ["total destruction; annihilation."]}], "ಫರ": [{"type": "noun", "defs": ["a broad, metal plate used by soldiers to ward off blows or missiles; a shield."]}], "ಫರಂಗಿ": [{"type": "noun", "defs": ["a native or inhabitant of Europe; an European.", "a large, mounted piece of artillery; sometimes, esp. a large gun with a relatively short barrel; a cannon.", "a disease, as syphilis or gonorrhea, transmitted by sexual intercourse with an infected individual; a venereal disease.", "the tree Carica papaya of Caricaceae family, having a bunch of large leaves at the top; papaya tree.", "its large, oblong, yellowish-orange melon-like fruit, which is eaten raw or cooked and also used for its juice; papaya.", "the plant Ananas comosus ( = A. sativus) of Bromeliaceae family, have a short stem and spiny-edged, recurved leaves; pineapple plant.", "its juicy, edible fruit; pineapple."]}], "ಫರಂಗಿಮಣೆ": [{"type": "noun", "defs": ["a punishment given in schools making an erring student to stand by bending his knees and bring the thighs parallel to the floor, imitating the shape of a chair."]}], "ಫರಕ": [{"type": "noun", "defs": ["= ಫರಕು."]}], "ಫರಕು": [{"type": "noun", "defs": ["condition, quality, fact or instance of being different; difference.", "the way in which two things or people are different from each other; difference.", "the extent or degree of difference."]}], "ಫರಜು": [{"type": "noun", "defs": ["(mus.) a musical mode in Karnāṭaka system, derived from the main mode 'Māyamālavagauḷa'.", "corresponding mode in Hindūstāni system."]}], "ಫರದೆ": [{"type": "noun", "defs": ["a set of hanging drapery for concealing all or part of the stage or set from the view of the audience; a curtain.", "a specially prepared, light-reflecting surface on which motion pictures, slides, etc., may be projected; a screen.", "a net hung over a bed to keep mosquitoes off.", "painted screens, backdrops, hangings, etc., used on the stage to represent places and surroundings in a play; scenery.", "a piece of light fabric, as of net or gauze, worn, by women, over the face; a veil.", "the skin of a tamarind seed."]}], "ಫರಫರೆ": [{"type": "noun", "defs": ["flags or strips of thin paper made of different bright colours for decorating a stage, inside a building, etc.; paper buntings."]}], "ಫರಮಾನಾ": [{"type": "noun", "defs": ["= ಫರ್ಮಾನು."]}], "ಫರಮಾನು": [{"type": "noun", "defs": ["= ಫರ್ಮಾನು."]}], "ಫರಮಾಯಿಶಿ": [{"type": "adjective", "defs": ["= ಫರಮಾಯಿಷಿ1."]}, {"type": "noun", "defs": ["= ಫರಮಾಯಿಷಿ2."]}], "ಫರಮಾಯಿಷಿ": [{"type": "adjective", "defs": ["made or prepared as per orders or at one's behest.", "very fine; superior; excellent."]}, {"type": "noun", "defs": ["that which is liked (by a person) very much.", "a thing characterised by its fineness, superiority or excellence."]}], "ಫರಮಾಯಿಸು": [{"type": "verb", "defs": ["= ಫರ್ಮಾಯಿಸು."]}], "ಫರಮಾಶಿ": [{"type": "adjective", "defs": ["= ಫರಮಾಯಿಷಿ1."]}, {"type": "noun", "defs": ["= ಫರಮಾಯಿಷಿ2."]}], "ಫರವಾನೆ": [{"type": "noun", "defs": ["an order, command or direction backed by authority, either verbal or written.", "a letter issued by an authority authorising a person to have possession of something."]}], "ಫರಶಿ": [{"type": "noun", "defs": ["= ಫರಸಿ."]}], "ಫರಶಿಕಲ್ಲು": [{"type": "noun", "defs": ["= ಫರಸಿ - 2."]}], "ಫರಸಿ": [{"type": "noun", "defs": ["a floor that is levelled, hardened and covered with a layer of cement concrete.", "a thin, usu. rectangular piece of stone used for flooring."]}], "ಫರಸು": [{"type": "noun", "defs": ["= ಫರಸಿ."]}], "ಫರಸುಗಲ್ಲು": [{"type": "noun", "defs": ["= ಫರಸಿ - 2."]}], "ಫರಮೋಷಿ": [{"type": "noun", "defs": ["an unintentional, careless mistake or omission; an oversight."]}], "ಫರಾರಿ": [{"type": "noun", "defs": ["an act or instance or escaping."]}, {"type": "noun", "defs": ["a piece of cloth, tied at one side to something, that is fluttering in the wind.", "any of the shaped sheets of canvas or other strong material spread to catch or deflect the wind, by means of which vessels are driven forward; a sail."]}], "ಫರಾರೆ": [{"type": "noun", "defs": ["= ಫರಾರಿ1."]}], "ಫರಾಶೀಸ": [{"type": "noun", "defs": ["a man belonging to the country Franch; a French man."]}], "ಫರಾಷೀಸ": [{"type": "noun", "defs": ["= ಫರಾಶೀಸ."]}], "ಫರಾಸಿಸ": [{"type": "noun", "defs": ["= ಫರಾಶೀಸ."]}], "ಫರಾಳ": [{"type": "noun", "defs": ["= ಫಲಾಹಾರ."]}], "ಫರುಜು": [{"type": "noun", "defs": ["the cutting edge of a sword.", "the handle of a sword; the hilt.", "a sword."]}], "ಫರೆ": [{"type": "noun", "defs": ["a measure of capacity (for grain)."]}], "ಫರ್ಜಿ": [{"type": "noun", "defs": ["a pawn known as 'minister' at chess."]}], "ಫರ್ಜು": [{"type": "noun", "defs": ["= ಫರಜು."]}], "ಫರ್ನಾದಿ": [{"type": "noun", "defs": ["a variety of mango trees.", "its fruit."]}], "ಫರ್ಮಾನ್": [{"type": "noun", "defs": ["= ಫರ್ಮಾನು."]}], "ಫರ್ಮಾನ": [{"type": "noun", "defs": ["= ಫರ್ಮಾನು."]}], "ಫರ್ಮಾನು": [{"type": "noun", "defs": ["an order; a command.", "a written order or command."]}], "ಫರ್ಮಾಯಿಸು": [{"type": "verb", "defs": ["to instruct to do something; to give an order to; to order; to command."]}], "ಫರ್ಲಾಂಗು": [{"type": "noun", "defs": ["a unit of linear measure equal to one eighth of a mile or 220 yards (201.2 meters); a furlong."]}], "ಫರ್ಲೋ": [{"type": "noun", "defs": ["a leave of absence, granted with full salary; paid-leave."]}], "ಫಲ": [{"type": "noun", "defs": ["any plant product, as grain, flax, vegetables, etc; a fruit.", "the edible plant structure of a mature ovary of a flowering plant, usu. eaten raw; a fruit.", "the result, product or consequence of any action.", "the object, end or purpose for which something is used; a use.", "a strong wish or craving; a desire.", "the periodic flow of blood and sloughed-off tissue from the uterus, discharged through the genital tract; menstrual flow; menses.", "the cutting edge of a sword, knife, etc.", "a long, broad, thick wooden board; a plank.", "a broad, metal plate used by soldiers, policemen, to ward of blow and missiles; a shield.", "a kind of flat percussion instrument, with a short brim, on which a skin membrane is tightly spread, and usu. played with two sticks.", "the long wooden shaft of a plough.", "the share of a plough; a plough-share.", "the measure of a bounded region on a plane; area.", "(math.) the quantity obtained by multiplying two or more quantities together; the product.", "(math.) the quantity obtained by dividing a quantity from another quantity; quotient.", "(math.) the second of the three quantities, used to find the fourth one.", "the condition, quality or period of being pregnant; pregnancy.", "a large, smooth, usu. dark surface of slate or other material on which to write or draw with chalk; chalkboard; a black-board.", "ಫಲವಾಗು phalavāgu to bear fruit or fruits; 2. to become useful; to become beneficial; 3. to be accomplished, fulfilled; 4. (an embryo or foetus) to be conceived; ಫಲ ನಿಲ್ಲು phala nillu (an embryo or foetus) to be conceived."]}, {"type": "noun", "defs": ["an archaic gold coin."]}], "ಫಲಂಗುಡು": [{"type": "verb", "defs": ["= ಫಲಕೊಡು."]}], "ಫಲಂದೋಱು": [{"type": "verb", "defs": ["= ಫಲಕೊಡು - 2 & 3"]}], "ಫಲಕ": [{"type": "noun", "defs": ["a flat piece of wood or similar material, often rectangular, for some special use; a board.", "a large, smooth, usu. dark surface of slate or other material on which to write or draw with chalk; chalkboard; a black-board.", "one side of a leaf of a book, newspaper, letter, etc.; a page.", "a broad, metal sheet held by policemen, soldiers to ward off blows, missiles, etc.; a shield.", "a fruit."]}], "ಫಲಕಾರಿ": [{"type": "adjective", "defs": ["effective; efficient in bringing a result, esp. good or favourable result."]}, {"type": "noun", "defs": ["that which brings the result, product or consequence of an action.", "any thing that is useful or brings favourable result."]}], "ಫಲಕೊಡು": [{"type": "verb", "defs": ["to give or furnish as a natural process or as the result of cultivation; to yield.", "(said of plants) to bear a fruit or fruits.", "to give in return; produce as a result, profit, etc.", "to be accomplished; to be achieved.", "(an embryo or foetus) to be conceived."]}], "ಫಲಜೀವಿ": [{"type": "noun", "defs": ["any plant that gives edible fruits."]}], "ಫಲಜ್ಞಾನ": [{"type": "noun", "defs": ["the knowledge of the Supreme Being; the supreme knowledge."]}], "ಫಲಜ್ಯೋತಿಷ": [{"type": "noun", "defs": ["(astrol.) a division of astrology, in which predictions are based on the horoscope of a person."]}], "ಫಲತ್ರಿಕ": [{"type": "noun", "defs": ["a set of three fruits, gooseberry (Phyllanthus emblica), myrobalan (Terminalia chebulan) and Belleric myrobalan (terminalia bellirica), used for medicinal purpose."]}], "ಫಲದ": [{"type": "adjective", "defs": ["giving fruits or that gives fruits.", "useful; bringing favourable results."]}, {"type": "noun", "defs": ["that which gives fruits (as a fruit).", "that which brings or causes favourable results."]}], "ಫಲದಾಯಕ": [{"type": "adjective", "defs": ["= ಫಲದ1."]}, {"type": "noun", "defs": ["= ಫಲದ2 - 2.", "the Supreme Being, who awards the consequences based on individuaḷs deeds."]}], "ಫಲದಾಯಿ": [{"type": "noun", "defs": ["= ಫಲದ2 - 2.", "the Supreme Being, who awards the consequences based on individuaḷs deeds."]}], "ಫಲದೋಱು": [{"type": "verb", "defs": ["= ಫಲಕೊಡು - 2 & 3"]}], "ಫಲನಿ": [{"type": "noun", "defs": ["the creeper Cyclea peltata of Menispermaceae family."]}], "ಫಲಪೂಜೆ": [{"type": "noun", "defs": ["a worshipping of fruits (as plantain fruit, coconut, etc.) which will be distributed among the persons assembled.", "a worshipping of corn after threshing, in the threshing floor.", "a worshipping of ripe fruits newly plucked."]}], "ಫಲಪೂರ": [{"type": "noun", "defs": ["the small, spiny, semitropical, evergreen tree, Citrus medica of Limonum family.", "its edible, fruit."]}], "ಫಲಪೂರಕ": [{"type": "noun", "defs": ["= ಫಲಪೂರ."]}], "ಫಲಪ್ರದ": [{"type": "adjective", "defs": ["bearing much fruit; fruitful.", "producing muich; productive; prolific; fruitful."]}, {"type": "noun", "defs": ["= ಫಲದ2 - 2.", "the Supreme Being, who awards the consequences based on individuaḷs deeds."]}], "ಫಲಭದ್ರ": [{"type": "noun", "defs": ["a kind of cotton plant."]}], "ಫಲಮಂಜರಿ": [{"type": "noun", "defs": ["a bunch of fruits.", "(mus.) a musical mode in Karnāṭaka system, derived from the main mode Kharaharapriya."]}], "ಫಲವಂತ": [{"type": "noun", "defs": ["that bears, gives fruits."]}], "ಫಲವತಿ": [{"type": "noun", "defs": ["a pregnant woman.", "a plant that is bearing fruits."]}], "ಫಲವತ್ತು": [{"type": "noun", "defs": ["the quality, state of being fertile; fertility; fecundity.", "the condition of bearing fruits plentifully."]}], "ಫಲವಳಿಗೆ": [{"type": "noun", "defs": ["a decoration made to a maṇṭapa with fruits, leaves, cloths, etc."]}], "ಫಲಶೋಭನ": [{"type": "noun", "defs": ["the instance of the married couple having sexual intercurse for the first time.", "a ceremony observed on that day.", "(fig.) the end; termination; death."]}], "ಫಲಶ್ರುತಿ": [{"type": "noun", "defs": ["the favourable result or results that occur to those who read or listen to, scriptures or holy books.", "the result, effect of one's deeds."]}], "ಫಲಸಿದ್ಧಿ": [{"type": "noun", "defs": ["a getting of, achieving the desired result.", "a favourable result or effect (of a deed, action, etc.)."]}], "ಫಲಹಾರ": [{"type": "noun", "defs": ["= (rightly) ಫಲಾಹಾರ."]}], "ಫಲಹೀನÀ": [{"type": "adjective", "defs": ["bearing no fruit; barren; fruitless.", "without results; useless; vain."]}], "ಫಲಹೀನತೆ": [{"type": "noun", "defs": ["the quality of being unable to produce offspring; barrenness; sterility.", "the fact of being without results, profit or use; fruitlessness; vainness."]}], "ಫಲಾತನ್": [{"type": "noun", "defs": ["a physically strong and courageous man."]}], "ಫಲಾದನ": [{"type": "noun", "defs": ["an eating of fruits.", "the fact of eating fruits for food."]}], "ಫಲಾಧ್ಯಕ್ಷ": [{"type": "noun", "defs": ["the plant Mimusops elengi of Sapotaceae family."]}], "ಫಲಾನ": [{"type": "adjective", "defs": ["of this kind, sort."]}], "ಫಲಾನಾ": [{"type": "adjective", "defs": ["= ಫಲಾನ."]}], "ಫಲಾನುಮೇಯ": [{"type": "adjective", "defs": ["that can be judged, analysed based on the result or the final effect."]}, {"type": "noun", "defs": ["that which can be judged, analysed based on the result or the final effect."]}], "ಫಲಾನೆ": [{"type": "noun", "defs": ["= ಫಲಾನ."]}], "ಫಲಾಭಿಸಂಧಿ": [{"type": "noun", "defs": ["the intention of getting the desired result (while performing an act)."]}], "ಫಲಾರ": [{"type": "noun", "defs": ["= ಫಲಾಹಾರ."]}], "ಫಲಾಸಿ": [{"type": "noun", "defs": ["a tree (or a plant) that has leaves.", "a kind of climbing plant.", "the tree Spondias pinnata ( =S. mangiferra) of Anacardiaceae family.", "its plum used for pickles; Indian hog plum."]}], "ಫಲಾಹಾರ": [{"type": "noun", "defs": ["a taking of fruits only for food.", "a light meal."]}], "ಫಲಾಹಾರಮಂದಿರ": [{"type": "noun", "defs": ["a place where light eatables and meals can be bought and eaten; a restaurant."]}], "ಫಲಿ": [{"type": "adjective", "defs": ["bearing fruits."]}, {"type": "noun", "defs": ["a tree bearing fruits."]}, {"type": "noun", "defs": ["the plant Gloriosa superba of Liliaceae family; (?).", "the creemer Clypea peltata of Menispermaceae family."]}], "ಫಲಿತ": [{"type": "adjective", "defs": ["having or bearing fruits."]}, {"type": "noun", "defs": ["a tree that has born fruits.", "something accomplished or done successfully; achievement; accomplishment.", "anything brought about by a cause or agent; result; effect."]}], "ಫಲಿತಾಂಶ": [{"type": "noun", "defs": ["anything that comes about as a consequence or outcome of some action, process, etc.; result.", "the result of an academic examination; result.", "the way something turns out (as from a research work)."]}], "ಫಲಿತಾರ್ಥ": [{"type": "noun", "defs": ["the effect of a result."]}], "ಫಲಿನ": [{"type": "adjective", "defs": ["giving fruits.", "producing a definite or desired result; efficient; effective."]}, {"type": "noun", "defs": ["a tree bearing fruits.", "the tree Artocarpus integra ( = A. heterophyllus) of Moraceae family; jackfruit tree."]}], "ಫಲಿನಿ": [{"type": "noun", "defs": ["= ಫಲಿ3.", "the creeper Tinosporia cordifolia ( = Menispermum cordifolium, = Cocculus cordifolius) of Menispermaceae family."]}], "ಫಲಿಯಿಸು": [{"type": "verb", "defs": ["= ಫಲಿಸು."]}], "ಫಲಿಸಿಕೆ": [{"type": "noun", "defs": ["the quality that makes a thing useful or suitable for a given purpose; advantage; usefulness; worth; utility."]}], "ಫಲಿಸು": [{"type": "verb", "defs": ["to yield a fruit or fruits.", "to occur; to take place; to happen.", "to become useful.", "to be accomplished; to be completed.", "to cause or help something become useful.", "to bring about a result."]}], "ಫಲೀನ": [{"type": "noun", "defs": ["a fruit (of a plant).", "a sincere honest man.", "a wise, ascetic man; a sage.", "final liberation of an individual soul from the cycle of birth and death; salvation.", "hair growing on the head.", "deep mud; wet, soggy earth; slush; mire."]}], "ಫಲುಗುಣ": [{"type": "noun", "defs": ["= ಫಲ್ಗುಣ."]}], "ಫಲೇರುಹ": [{"type": "noun", "defs": ["te plant Stereospermum suaveolens ( = Bignonia suaveolens) of Bignoniaceae family."]}], "ಫಲ್ಗು": [{"type": "adjective", "defs": ["trivial; trifling; little.", "not interesting or satisfying; dull or empty; uninteresting; jejune."]}, {"type": "noun", "defs": ["a small, little thing.", "an uninteresting thing.", "ficus tree Ficus hispida ( = F. oppositifolia) of Moraceae family; crow fig tree.", "its fruit."]}], "ಫಲ್ಗುಣ": [{"type": "noun", "defs": ["Arjuna, the famous hero in the great Indian epic Mahābhārata."]}], "ಫಲ್ಗುನ": [{"type": "noun", "defs": ["= ಫಲ್ಗುಣ.", "the twelfth month in the Hindu lunar calendar.", "Indra, the lord of gods."]}], "ಫಲ್ಗುನಿ": [{"type": "noun", "defs": ["the cluster of two lunar mansions a) Zosma & Theta Leo and b) 93 Leo and Denebola."]}], "ಫಲ್ಲು": [{"type": "noun", "defs": ["= ಫಲ್ಗು2 - 3."]}], "ಫವುಚಾಯಿಸು": [{"type": "verb", "defs": ["to carry to the destination.", "to give an unlawful, illegal advice."]}], "ಫವುಜು": [{"type": "noun", "defs": ["the military forces of a nation, exclusive of the navy and the air force; army."]}], "ಫಶಿ": [{"type": "noun", "defs": ["the act of deceiving or swindling; deception; fraud; cheat.", "ಫಶಿ ಹಾಕು phaśi hāku to deceive; to cheat."]}], "ಫಸಗಿ": [{"type": "noun", "defs": ["= ಫಶಿ.", "ಫಸಗಿ ಹಾಕು phasagi hāku = ಫಶಿ ಹಾಕು."]}], "ಫಸಲ್": [{"type": "noun", "defs": ["= ಫಸಲು."]}], "ಫಸಲಿ": [{"type": "noun", "defs": ["a Muslim year."]}], "ಫಸಲು": [{"type": "noun", "defs": ["crop grown in a field."]}], "ಫಸಾದ": [{"type": "noun", "defs": ["revolt against and, forcible resistance to constituted authority; a mutiny."]}], "ಫಸಾಯಿಸು": [{"type": "verb", "defs": ["to cheat; to deceive."]}], "ಫಸಾಸು": [{"type": "verb", "defs": ["= ಫಸಾಯಿಸು."]}], "ಫಸ್ಲಿ": [{"type": "noun", "defs": ["= ಫಸಲಿ."]}], "ಫಳ": [{"type": "noun", "defs": ["= ಫಲ1."]}], "ಫಳಕ": [{"type": "noun", "defs": ["= ಫಲಕ."]}], "ಫಳಕಾರ": [{"type": "noun", "defs": ["a man who is helpful to others."]}], "ಫಳಣಿ": [{"type": "noun", "defs": ["= ಫಾಳಣಿ."]}], "ಫಳಪಾಕಾಂತತೆ": [{"type": "noun", "defs": ["the fact of (some plants) dying immediately after they bear fruits for the first time; the nature of being an annual plant."]}], "ಫಳಫಳನೆ": [{"type": "adverb", "defs": ["glitteringly; splendidly.", "with speed; not slowly."]}], "ಫಳಫಳಿಸು": [{"type": "verb", "defs": ["to shine sparkingly; to sparkle."]}], "ಫಳಮಂಜರಿ": [{"type": "noun", "defs": ["= ಫಲಮಂಜರಿ."]}], "ಫಳವತಿ": [{"type": "noun", "defs": ["= ಫಲವತಿ."]}], "ಫಳವಳಿಗೆ": [{"type": "noun", "defs": ["= ಫಲವಳಿಗೆ."]}], "ಫಳಸ": [{"type": "noun", "defs": ["the tree deciduous tree Butea frondosa ( = B. monosperma) of Papilionaceae family."]}], "ಫಳಹೀನ": [{"type": "adjective", "defs": ["ಫಲಹೀನ."]}], "ಫಳಹೀನತೆ": [{"type": "noun", "defs": ["ಫಲಹೀನತೆ."]}], "ಫಳಾರ": [{"type": "noun", "defs": ["= ಫಲಾಹಾರ."]}], "ಫಳಿ": [{"type": "noun", "defs": ["a kind of superior quality cloth."]}, {"type": "noun", "defs": ["a thin, long plank of wood.", "a stick; a staff.", "a short staff used by boys in playing 'cinni-dāṇḍua'."]}], "ಫಳಿತ": [{"type": "adjective", "defs": ["having or bearing fruits."]}, {"type": "noun", "defs": ["a tree that has born fruits.", "something accomplished or done successfully; achievement; accomplishment.", "anything brought about by a cause or agent; result; effect."]}], "ಫಳಿದ್ಯ": [{"type": "noun", "defs": ["a kind of liquid dish made using curd or buttermilk and vegetables, used to mix with rice."]}], "ಫಳಿನ": [{"type": "adjective", "defs": ["= ಫಲಿನ1."]}, {"type": "noun", "defs": ["= ಫಲಿನ2."]}], "ಫಳಿನಿ": [{"type": "noun", "defs": ["= ಫಲಿ3."]}], "ಫಳಿಯಿಸು": [{"type": "verb", "defs": ["= ಫಲಿಸು."]}], "ಫಳಿಸು": [{"type": "verb", "defs": ["= ಫಲಿಸು."]}], "ಫಳಿಹತ": [{"type": "noun", "defs": ["a man acting or serving in place of another; a substitute.", "the compensation or recompense that a substitute gets for this act."]}], "ಫಳೆಯಕಾಱ": [{"type": "noun", "defs": ["a man holding a shield (to avoid blows or missiles, as a policeman or soldier)."]}], "ಫಾಂಟ": [{"type": "noun", "defs": ["any thing (as a decoction, solution etc.) that can be prepared by easy methods as filtering)."]}], "ಫಾಕಡ": [{"type": "adjective", "defs": ["= ಫಾಕಡಾ1."]}, {"type": "noun", "defs": ["= ಫಾಕಡಾ2."]}], "ಫಾಕಡಾ": [{"type": "adjective", "defs": ["skillful or clever, esp. in achieving a purpose; artful.", "sly or cunning; crafty.", "good; pleasant; enjoyable."]}, {"type": "noun", "defs": ["a skilful or clever person.", "a sly, cunning, crafty person."]}], "ಫಾಜಿಲ್": [{"type": "adjective", "defs": ["more than usual or expected."]}, {"type": "noun", "defs": ["produce, income, etc. got more than usual or expected."]}], "ಫಾಜೀಲ": [{"type": "adjective", "defs": ["morally offensive; indecent; obscene."]}], "ಫಾಜೀಲತನ": [{"type": "noun", "defs": ["the quality of being morally offensive, indecent or obscene; obscenity; indecency."]}], "ಫಾಜೆ": [{"type": "noun", "defs": ["(dial.) (in games) the point to be reached, touched (as a target)."]}], "ಫಾಜೆಗಟ್ಟಿ": [{"type": "noun", "defs": ["= ಫಾಜೆ."]}], "ಫಾಣಾಫಾಣ": [{"type": "noun", "defs": ["the condition of things being strewn in a loose and disorderly manner.", "a running of people helter-skelter."]}], "ಫಾಣಿ": [{"type": "noun", "defs": ["unrefined sugarcane juice.", "a meal prepared by mixing flour of parched rāgi (sometimes, of rice) with curds."]}], "ಫಾಣಿತ": [{"type": "noun", "defs": ["unrefined sugarcane juice.", "a dark, crude sugar from the sugarcane juice.", "a kind of eatable made of milk."]}], "ಫಾನಾಫಾನ": [{"type": "noun", "defs": ["= ಫಾಣಾಫಾಣ."]}], "ಫಾಯದೆ": [{"type": "noun", "defs": ["= ಫಾಯಿದೆ."]}], "ಫಾಯದೇಶೀರ": [{"type": "adverb", "defs": ["= ಫಾಯಿದೇಶೀರ."]}], "ಫಾಯಿದೆ": [{"type": "noun", "defs": ["advantage; profit; benefit."]}], "ಫಾಯಿದೇಶೀರ": [{"type": "adverb", "defs": ["profitably; beneficially; advantageously."]}], "ಫಾಯಿಷ್": [{"type": "noun", "defs": ["an announcement made in public, for making it widely known."]}], "ಫಾರಮ್ಮು": [{"type": "noun", "defs": ["a printed document with blank spaces to be filled in; a form.", "a group of students taught together according to standing, subject, etc.; a class.", "the type, engravings, etc. locked in a frame or chase, for printing or plating ; a form."]}], "ಫಾರೀಕತ್ತು": [{"type": "noun", "defs": ["a sharing of something.", "that which is got as a share.", "a deed of partition entered into between two or more persons, legally dividing a property into two or more divisions."]}], "ಫಾಲ": [{"type": "noun", "defs": ["the cutting blade of a plough; a plough share.", "a collection of things usu. of the same kind tied, bundled or grouped together and considered as a single unit; a bunch.", "the part of the face above the eyebrows; the forehead.", "a garment of cotton."]}], "ಫಾಲದಿವ್ಯ": [{"type": "noun", "defs": ["a crude ordeal, in which the accused would seize a red-hot plough-share to prove his or her innocence (it was supposed that the accused would come out of the ordeal unscathed if innocent)."]}], "ಫಾಲ್ಗುಣ": [{"type": "noun", "defs": ["the twelfth month of a Hindu lunar year."]}], "ಫಾಲ್ಗುನ": [{"type": "noun", "defs": ["= ಫಾಲ್ಗುಣ."]}], "ಫಾಲ್ಗುನಿಕ": [{"type": "noun", "defs": ["= ಫಾಲ್ಗುಣ."]}], "ಫಾಶಾ": [{"type": "noun", "defs": ["= ಫಾಸೆ."]}], "ಫಾಶಿ": [{"type": "noun", "defs": ["= ಫಾಸಿ."]}], "ಫಾಸಲೆ": [{"type": "noun", "defs": ["a measurable distance between two points or things.", "surrounding, adjoining region or regions."]}], "ಫಾಸಿ": [{"type": "noun", "defs": ["the death sentence by hanging."]}], "ಫಾಸಿಕಂಬ": [{"type": "noun", "defs": ["an upright frame with a crossbeam and a rope, for hanging condemned persons; gallows."]}], "ಫಾಸಿಖಾನೆ": [{"type": "noun", "defs": ["the place where condemned person are hanged to death."]}], "ಫಾಸಿಲ್": [{"type": "noun", "defs": ["= ಫಾಸಲೆ."]}], "ಫಾಸಿಶಿಕ್ಷೆ": [{"type": "noun", "defs": ["= ಫಾಸಿ."]}], "ಫಾಸೆ": [{"type": "noun", "defs": ["small cubes of bone, plastic, etc. marked on each side with a different number of spots (from one to six) and used, usu. in pairs, in games of chance; dice.", "the number or score indicated by dice, in the game of chance, when rolled on the floor."]}], "ಫಾಳ": [{"type": "noun", "defs": ["a part or fragment broken or separated from the whole; a piece."]}], "ಫಾಳಣಿ": [{"type": "noun", "defs": ["the act of dividing, separating; division; separation.", "a piece of divided or fragmented land."]}], "ಫಾಳು": [{"type": "noun", "defs": ["= ಫಾಳ."]}], "ಫಾಳೆ": [{"type": "noun", "defs": ["a sum of money or a portion of the produce a lessee has to give to the owner of the agricultural land as rent."]}], "ಫಿಕೀರು": [{"type": "noun", "defs": ["interest; concern (as in a matter of importance, profit, emotion, etc.).", "worry; anxiety; anxious concern."]}], "ಫಿತೂರಿ": [{"type": "noun", "defs": ["a planning and acting together secretly, esp. for an unlawful or harmful purpose, such as murder or treason; a conspiracy."]}], "ಫಿದವಿ": [{"type": "noun", "defs": ["employment, esp. public employment; service."]}], "ಫಿದಿವಿ": [{"type": "noun", "defs": ["= ಫಿದವಿ."]}], "ಫಿದ್ವಿ": [{"type": "noun", "defs": ["= ಫಿದವಿ."]}], "ಫಿನಾಯಿಲ್ಲು": [{"type": "noun", "defs": ["a white crystalline compound, C6H5OH, with a characteristic odour, used as an antiseptic, disinfectant, etc.; phenol."]}], "ಫಿರಂಗಿ": [{"type": "noun", "defs": ["a native or inhabitant of Europe; an European.", "a large, mounted piece of artillery; sometimes, esp. a large gun with a relatively short barrel; a cannon.", "a disease, as syphilis or gonorrhea, transmitted by sexual intercourse with an infected individual; a venereal disease.", "the tree Carica papaya of Caricaceae family, having a bunch of large leaves at the top; papaya tree.", "its large, oblong, yellowish-orange melon-like fruit, which is eaten raw or cooked and also used for its juice; papaya.", "the plant Ananas comosus ( = A. sativus) of Bromeliaceae family, have a short stem and spiny-edged, recurved leaves; pineapple plant.", "its juicy, edible fruit; pineapple."]}], "ಫಿರಂಗಿಉಬ್ಬೆ": [{"type": "noun", "defs": ["= ಫಿರಂಗಿರೋಗ."]}], "ಫಿರಂಗಿಚಕ್ಕಿ": [{"type": "noun", "defs": ["the plant Rourea santaloides of Connaraceae family."]}], "ಫಿರಂಗಿಚೆಕ್ಕೆ": [{"type": "noun", "defs": ["the weed Argygeia nervosa ( = A. speciosa) of Convolvulaceae family; Linden silver weed.", "the vine Smilax aspera of Liliaceae family; prickly ivy."]}], "ಫಿರಂಗಿರೋಗ": [{"type": "noun", "defs": ["a chronic infectious disease, caused by a spirochete, Treponema pallidum, usu. venereal in origin but often congenital, and affecting almost any organ or tissue in the body, esp. the genitals, skin, mucous membranes, aorta, brain, liver, bones, and nerves; syphilis."]}], "ಫಿರಂಗಿಶೂಲೆ": [{"type": "noun", "defs": ["= ಫಿರಂಗಿರೋಗ."]}], "ಫಿರಂಗಿಹುಣ್ಣು": [{"type": "noun", "defs": ["= ಫಿರಂಗಿ - 3."]}], "ಫಿರಕ": [{"type": "noun", "defs": ["= ಫಿರ್ಕಾ."]}], "ಫಿರತಿ": [{"type": "noun", "defs": ["= ಫಿರ್ತಿ."]}], "ಫಿರಿಕಟ್ಟು": [{"type": "noun", "defs": ["a lessening or reduction of anger, evil effect, etc. by satisfying, appeasing, etc."]}], "ಫಿರಿಯಾದಿ": [{"type": "noun", "defs": ["= ಫಿರ್ಯಾದು."]}], "ಫಿರಿಯಾದು": [{"type": "noun", "defs": ["= ಫಿರ್ಯಾದು."]}], "ಫಿರ್ಕಾ": [{"type": "noun", "defs": ["a revenue sub-division within a hōbli, that comes under a particular śanubhoga, village-accountant."]}], "ಫಿರ್ಖಾ": [{"type": "noun", "defs": ["= ಫಿರ್ಕಾ."]}], "ಫಿರ್ತಿ": [{"type": "noun", "defs": ["the act or an instance of traveling from one place to another; trip; journey."]}], "ಫಿರ್ಯಾದಿ": [{"type": "noun", "defs": ["= ಫಿರ್ಯಾದು.", "ಫಿರ್ಯಾದಿ ಹೋಗು phiryādi hōgu to make a petition (to a judicial authority); to petition."]}], "ಫಿರ್ಯಾದು": [{"type": "noun", "defs": ["a formal request in writing addressed to a judicial authority requesting for redressing, compensation etc.; a petition.", "a pleading setting forth the plaintiff's case or cause of action; formal charge or accusation; a complaint.", "a person who has petitioned for compensation, redress, etc.; a petitioner.", "a man who has lodged a formal complaint against; a complainant."]}], "ಫಿರ್ಯಾದುಕಛೇರಿ": [{"type": "noun", "defs": ["a department (in erstwhile Maisūru government) that would receive petitions from public."]}], "ಫಿರ್ಯಾದುದಾರ": [{"type": "noun", "defs": ["= ಫಿರ್ಯಾದು - 3 & 4."]}], "ಫಿಲಮ್ಮು": [{"type": "noun", "defs": ["a sheet or roll of a flexible cellulose material coated with an emulsion sensitive to light and used to capture an image for a photograph; a film.", "a sequence of photographs or drawings projected on a screen in such rapid succession that they create the optical illusion (because of the persistence of vision) of moving persons and objects; a film; a cinema."]}], "ಫೀಜು": [{"type": "noun", "defs": ["= ಫೀಸು."]}], "ಫೀಸು": [{"type": "noun", "defs": ["payment asked or given for professional services, admissions, licenses, tuition, etc.; charge; fee."]}], "ಫುಕ್ಕಟೆ": [{"type": "noun", "defs": ["without cost of payment; free.", "serving no purpose; uselessly."]}], "ಫುಗಡಿ": [{"type": "noun", "defs": ["a turning round fast standing at the same place (a children's play)."]}], "ಫುಟ್‍ಲಾಯರಿ": [{"type": "noun", "defs": ["= ಫುಟ್‍ಲಾಯರು.", "his profession."]}], "ಫುಟ್‍ಲಾಯರು": [{"type": "noun", "defs": ["a man, not having required qualification or not being chartered, carrying on the profession of or acting as a lawyer or legal adviser."]}], "ಫುಟಾಫುಟಿ": [{"type": "noun", "defs": ["minced pieces; fragments.", "the condition of things being strewn in disorderly manner."]}], "ಫುಪ್ಪುಸ": [{"type": "noun", "defs": ["(wrong form of ಪುಪ್ಪುಸ) either of the two saclike respiratory organs in the thorax of humans; the lung."]}], "ಫುರೋಕ್ತು": [{"type": "noun", "defs": ["the act of selling (something) for a sum of money or other valuable consideration; a sale."]}], "ಫುಲ್ಗರ": [{"type": "noun", "defs": ["a kind of jowar (millet)."]}], "ಫುಲ್ಲ": [{"type": "adjective", "defs": ["blown or expanded (as a flower).", "flowering.", "wide open ((as eyes)."]}, {"type": "noun", "defs": ["a flower.", "(dance.) cheek that is blown in joy."]}], "ಫುಲ್ಲಕ": [{"type": "noun", "defs": ["a worm."]}], "ಫುಲ್ಲೈಸು": [{"type": "verb", "defs": ["(a flower) to expand; to open."]}], "ಫುಸಲತ್ತು": [{"type": "noun", "defs": ["(dial.) free and intimate behavior; absence of formality and ceremony; mamiliarity.", "aninspiring with courage; encouragement."]}], "ಫೂಟ್‍ಲಾಯರಿ": [{"type": "noun", "defs": ["= ಫುಟ್‍ಲಾಯರಿ."]}], "ಫೂಟ್‍ಲಾಯರು": [{"type": "noun", "defs": ["= ಫುಟ್‍ಲಾಯರು."]}], "ಫೂಟಮಾಗಣಿ": [{"type": "noun", "defs": ["a portion of an agricultural land, as divided between two or among many persons."]}], "ಫೂಟಲಾಯರಿ": [{"type": "noun", "defs": ["= ಫುಟ್‍ಲಾಯರಿ."]}], "ಫೂಟಲಾಯರು": [{"type": "noun", "defs": ["= ಫುಟ್‍ಲಾಯರು."]}], "ಫೂಟು": [{"type": "adjective", "defs": ["small; tiny.", "excluding all but what is specified; exclusive."]}, {"type": "noun", "defs": ["something that is separated or excluded from.", "a brief statement containing the essential content; an abstract."]}, {"type": "noun", "defs": ["a unit of linear measure equal to 12 inches; a foot."]}], "ಫೂಟುತೀರ್ಮಾನ": [{"type": "noun", "defs": ["an ajudication given by a court taking only important points or aspects of a legal case."]}], "ಫೂಟುದೊರೆ": [{"type": "noun", "defs": ["a chief or leader, of a small state (usu. being under the protection of a king)."]}], "ಫೂತ್ಕರಿಸು": [{"type": "verb", "defs": ["to eject water (or other liquid) from the mouth; to spit.", "to make a sound like that of a prolonged s, as of a goose or snake when provoked or alarmed or of escaping steam, air, etc. through a narrow nozzle; to hiss.", "to speak in great anger."]}], "ಫೂತ್ಕಾರ": [{"type": "noun", "defs": ["the act of making a prolonged sound as of goose or snake when provoked or alarmed or of escaping steam, air, through a nozzle, etc.; a hissing sound."]}], "ಫೂತ್ಕೃತಿ": [{"type": "noun", "defs": ["= ಫೂತ್ಕಾರ."]}], "ಫೂಲ್‍ಸ್ಕೇಪು": [{"type": "noun", "defs": ["a size of writing paper measuring 11.5 inches by 8 inches."]}], "ಫೂಲ್ಸ್‍ಕೇಪು": [{"type": "noun", "defs": ["= ಫೂಲ್‍ಸ್ಕೇಪು."]}], "ಫೇಡೆ": [{"type": "noun", "defs": ["a kind of sweet made of condensed milk and sugar or jaggery."]}], "ಫೇಣಿ": [{"type": "noun", "defs": ["a kind of sweet dish made of thinner strings, usu. eaten by mixing with milk and sugar."]}], "ಫೇನ": [{"type": "noun", "defs": ["the whitish mass of bubbles formed on or in liquids by agitation, fermentation, etc.; foam."]}], "ಫೇನಿಲ": [{"type": "adjective", "defs": ["having foam (on the surface, as the sea-water)."]}, {"type": "noun", "defs": ["the tree Sapindus emarginatus of Sapindaceae family; soap-nut tree.", "its fruit.", "the tree Clerodendrum phlomidis of Verbenaceae family."]}], "ಫೇರಂಡ": [{"type": "noun", "defs": ["the wild dog Canis aureus, (smaller than the wolf), which offten hunt prey in pack at night and eat carrion and certin plants, believed to be sly; jackal."]}], "ಫೇರಣೆ": [{"type": "noun", "defs": ["a loose, sleeved garment worn by men on the upper part of the body; a loose shirt."]}], "ಫೇರವ": [{"type": "noun", "defs": ["= ಫೇರಂಡ.", "a mean, immoral or wicked person; a scoundrel.", "a devil; evil spirit; a demon."]}], "ಫೇರಿ": [{"type": "noun", "defs": ["the movement of an orbiting celestial object, as a star or planet, completely around another object; a revolving or a rovolution.", "a wandering from place to place; a roaming."]}], "ಫೇರಿಸ್ತ್": [{"type": "noun", "defs": ["= ಫೇರಿಸ್ತು."]}], "ಫೇರಿಸ್ತಾ": [{"type": "noun", "defs": ["= ಫೇರಿಸ್ತು."]}], "ಫೇರಿಸ್ತು": [{"type": "noun", "defs": ["a list, catalogue containing the details of inventory etc."]}], "ಫೇರೀಸ್ತು": [{"type": "noun", "defs": ["= ಫೇರಿಸ್ತು."]}], "ಫೇರು": [{"type": "noun", "defs": ["= ಫೇರಂಡ."]}], "ಫೇಲ": [{"type": "noun", "defs": ["leavings in a dining plate."]}], "ಫೇಲಿ": [{"type": "noun", "defs": ["= ಫೇಲ."]}], "ಫೇಲಿಕೆ": [{"type": "noun", "defs": ["= ಫೇಲ."]}], "ಫೇಲಿಪಾತ್ರೆ": [{"type": "noun", "defs": ["a receptacle for spit; a spittoon; a cuspidor."]}], "ಫೇಲು": [{"type": "noun", "defs": ["a not succeeding; the act, state or fact of failing; failure."]}]}