{"ಉಡುತೊವಲ್": [{"type": "noun", "defs": ["the skin of common iguana (Iguana tuberculata), either tanned or raw."]}], "ಉಡುದಾರ": [{"type": "noun", "defs": ["a string of cotton or metal tied round the waist.", "a metal belt-like ornament for the waist (worn by women)."]}], "ಉಡುದೇವ": [{"type": "noun", "defs": ["the Moon, as the lord of the stars."]}], "ಉಡುನಾಥ": [{"type": "noun", "defs": ["= ಉಡುದೇವ."]}], "ಉಡುಪ": [{"type": "noun", "defs": ["a man having disabled or under-developed legs and arms; a cripple."]}, {"type": "noun", "defs": ["= ಉಡುದೇವ.", "a flat structure of fastened bamboos, logs, etc. used to move on a water body; a raft.", "a snake.", "the bird Cuculus melanoleucus, fabled to live only upon rain drops.", "Varuna, the Lord of Oceans.", "a surname used by a sect of brāhmaṇas in the western districts of Karnāṭaka."]}], "ಉಡುಪಖಂಡ": [{"type": "noun", "defs": ["a phase of the moon, when it appears to have one concave edge and one convex edge; the crescent moon."]}], "ಉಡುಪಖಂಡಶಿಖಂಡ": [{"type": "noun", "defs": ["Śiva, who has the crescent moon in his crest."]}], "ಉಡುಪತಿ": [{"type": "noun", "defs": ["= ಉಡುದೇವ."]}], "ಉಡುಪತಿಜೂಟ": [{"type": "noun", "defs": ["Śiva, who has the moon in his crest."]}], "ಉಡುಪತಿಸುತ": [{"type": "noun", "defs": ["Budha, a planet in the Solar system, mythologically considered to be the son of Moon; (Budha is one of the nine planets which are considered in astrology as influencing human life, based on their position at the time the birth)."]}], "ಉಡುಪಥ": [{"type": "noun", "defs": ["the sky as the path for stars movement."]}], "ಉಡುಪಮುಖಿ": [{"type": "noun", "defs": ["a woman whose face shines like the full moon; a comely woman."]}], "ಉಡುಪು": [{"type": "noun", "defs": ["cloth, clothing or apparel worn to cover the body; a dress."]}], "ಉಡುಪುಗಾರ": [{"type": "noun", "defs": ["a person who makes, repairs or alters clothes; a tailor."]}], "ಉಡುಪುತೊಡಪು": [{"type": "noun", "defs": ["(pl.) dress and ornaments."]}], "ಉಡುಬೆ": [{"type": "noun", "defs": ["an animal akin to squirrel."]}], "ಉಡುಬೆಂಚೆ": [{"type": "noun", "defs": ["a small pond or lake."]}], "ಉಡುಮಾರ್ಗ": [{"type": "noun", "defs": ["= ಉಡುಪಥ."]}], "ಉಡುಮೊಗ": [{"type": "noun", "defs": ["a face as delicate and comely as the flower of the tree Indian walnut tree (Albizzia lebbeck)."]}], "ಉಡುರಾಜ": [{"type": "noun", "defs": ["= ಉಡುದೇವ."]}], "ಉಡುರಾಜಧರ": [{"type": "noun", "defs": ["Śiva, who has the moon in his crest."]}], "ಉಡುರಾಜಾನನೆ": [{"type": "noun", "defs": ["= ಉಡುಪಮುಖಿ."]}], "ಉಡುರು": [{"type": "noun", "defs": ["the short, deep, hoarse and reverberating, roar of a bull; bellow; grunt."]}], "ಉಡುರುಹಾಕು": [{"type": "verb", "defs": ["to roar with a powerful, reverberating sound, as a bull; (a bull) to bellow."]}], "ಉಡುವರ": [{"type": "noun", "defs": ["the Moon, as the lord of the stars."]}], "ಉಡುವಲಿ": [{"type": "noun", "defs": ["something that is presented to show friendship, affection, support, etc.; a gift; a present."]}], "ಉಡುವಸನ": [{"type": "noun", "defs": ["cloth, clothing or apparel worn to cover the body; a dress."]}], "ಉಡುವಳ್ಳಿ": [{"type": "noun", "defs": ["the plant Canscora decussata of Gentianceae family; (?)."]}], "ಉಡುವೆ": [{"type": "noun", "defs": ["a place, relatively vast expanse of land, covered or overgrown with bushes."]}, {"type": "noun", "defs": ["an animal akin to squirrel."]}], "ಉಡುಸಾರಣೆ": [{"type": "noun", "defs": ["a washing of the floor of a house with the mixture of cow dung and water."]}], "ಉಡುಸೀರೆ": [{"type": "noun", "defs": ["a long unsewn cloth worn by women round the waist, one end of which covers the upper portion also; a sari."]}], "ಉಡುಹ": [{"type": "noun", "defs": ["the moon, as the lord of the stars."]}, {"type": "noun", "defs": ["a man deprived of natural physical ability; a disabled man."]}], "ಉಡುಹು": [{"type": "verb", "defs": ["to break into pieces; to separate two or more words that make a conjugated or compound word; to disintegrate."]}], "ಉಡೆ": [{"type": "noun", "defs": ["the part of the humanbody between the ribs and the hips; the waist.", "the part of a garment that covers the waist.", "a pouch made in front by women by folding or doubling a part of their sari, (the loose, long cloth worn round the waist loosely covering the chest and one shoulder also), to hold something."]}, {"type": "noun", "defs": ["cloth, clothing or apparel worn to cover the body; a dress; an apparel."]}, {"type": "noun", "defs": ["a lord; a king; an owner; a master."]}], "ಉಡೆಗಂಟೆ": [{"type": "noun", "defs": ["an ornamental bell tied to the waist of a child."]}], "ಉಡೆದಾರ": [{"type": "noun", "defs": ["a string of cotton or metal tied round the waist.", "a belt-like metal ornament for the waist (worn by women)."]}], "ಉಡೆದೊವಲ್": [{"type": "noun", "defs": ["an animal's tanned skin used as a cloth for covering the portion below the navel (usu. upto the knees)."]}], "ಉಡೆದೋಲ್": [{"type": "noun", "defs": ["= ಉಡೆದೊವಲ್."]}], "ಉಡೆನಿಱಿ": [{"type": "noun", "defs": ["the fold of a sari (of a woman) in front."]}], "ಉಡೆನೂಲ್": [{"type": "noun", "defs": ["= ಉಡೆನೂಲು."]}], "ಉಡೆನೂಲು": [{"type": "noun", "defs": ["= ಉಡೆದಾರ."]}], "ಉಡೆನೇಣ್": [{"type": "noun", "defs": ["= ಉಡೆದಾರ."]}], "ಉಡೆಮಣಿ": [{"type": "noun", "defs": ["a string with a small ornamental bell tied to the waist of a child."]}], "ಉಡೆಯ": [{"type": "noun", "defs": ["a lord; a king; an owner; a master."]}], "ಉಡೆಯುೞ್ಚು": [{"type": "verb", "defs": ["to remove (the clothing) of (a person); to make naked; to undress."]}], "ಉಡೆವಣಿ": [{"type": "noun", "defs": ["= ಉಡೆಮಣಿ."]}], "ಉಡೆವಣಿಗಟ್ಟು": [{"type": "verb", "defs": ["to tie an ಉಡೆವಣಿto the waist."]}], "ಉಡೆವಣಿಗಳೆ": [{"type": "verb", "defs": ["to untie an ಉಡೆವಣಿ that is tied to the waist."]}], "ಉಡೆಸುತ್ತು": [{"type": "verb", "defs": ["to tie a dhoti or a sari round the waist."]}], "ಉಡೆಹೀನ": [{"type": "noun", "defs": ["one without (proper) dress to wear."]}], "ಉಡ್ಡಯನ": [{"type": "noun", "defs": ["the act, manner or power of flying or moving through space; a flight.", "the act or process of launching a spacecraft, plane, etc.; a launch.", "a trip by a spacecraft or airplane."]}], "ಉಡ್ಡಾಡಿಸು": [{"type": "verb", "defs": ["to roll (an object) back and forth or all over on the ground."]}], "ಉಡ್ಡಾಡು": [{"type": "verb", "defs": ["to roll (oneself) back and forth or all over on the ground."]}], "ಉಡ್ಡಾಣ": [{"type": "noun", "defs": ["the fact, act or an instance of moving in the sky; a space-journey."]}], "ಉಡ್ಡಾಣಗೈ": [{"type": "verb", "defs": ["to move, fly in the sky; to jump into the space above."]}], "ಉಡ್ಡಾಣಮಾಡು": [{"type": "verb", "defs": ["to make a journey in the sky."]}], "ಉಡ್ಡಿ": [{"type": "noun", "defs": ["a heap or pile, esp. the one in which three things are kept closely in the shape of a triangle shape and another kept above them."]}, {"type": "noun", "defs": ["the tree Dolichandrone falcata of Bignoniaceae family."]}, {"type": "noun", "defs": ["(dial.) the act of colliding or coming together with sudden, violent force; collision."]}], "ಉಡ್ಡಿಗ": [{"type": "noun", "defs": ["the nut of areca tree, Areca catechu of Arecaceae family."]}], "ಉಡ್ಡಿಗಜುಗ": [{"type": "noun", "defs": ["a small heap of three seeds of Indian filbert (Caesalpinia bonducell or C. bonduc) kept closely in the shape of a triangle and an other kept above them."]}], "ಉಡ್ಡಿಯಾಣ": [{"type": "noun", "defs": ["= ಉಡ್ಡಿಯಾಣಬಂಧ."]}], "ಉಡ್ಡಿಯಾಣಬಂಧ": [{"type": "noun", "defs": ["one of the three process of self-control in haṭha yōga ( a mode of abstract contemplation, forcing the mind to abstain from external objects)."]}], "ಉಡ್ಡೀಣ": [{"type": "noun", "defs": ["a jumping up; the act of projecting or propelling (an object or oneself) into the space above."]}], "ಉಡ್ಡೀನ": [{"type": "adjective", "defs": ["flying or moving in the sky."]}, {"type": "noun", "defs": ["a soaring or flying up; a space journey.", "one of the eight kinds of flight of birds."]}], "ಉಡ್ಡು": [{"type": "verb", "defs": ["to confront or act in opposition; to oppose."]}], "ಉಡ್ಯಾಣ": [{"type": "noun", "defs": ["= ಉಡ್ಡಾಣ."]}], "ಉಡ್ಯಾಣಚೇಷ್ಟೆ": [{"type": "noun", "defs": ["the magical art of moving in the sky (without using any external means)."]}], "ಉಡ್ಯಾನ": [{"type": "noun", "defs": ["= ಉಡ್ಡಾಣ."]}], "ಉಣ್": [{"type": "verb", "defs": ["= ಉಣ್ಣು.", "ಉಣನೀಡು uṇanīḍu to offer food; to serve a meal; ಉಣಬಡಿಸು uṇabaḍisu = ಉಣನೀಡು; ಉಣಬರು uṇabaru to come for having a meal; ಉಣಲಿಕ್ಕಿಸು uṇalikkisu to cause to serve food; ಉಣಲಿಕ್ಕು uṇalikku = ಉಣನೀಡು; ಉಣಲಿಡು uṇaliḍu = ಉಣನೀಡು; ಉಣಲುಳ್ಳಂ uṇaluḷḷan he who has (sufficient) resouses for his living; ಉಣಲ್ಕೀ uṇalkī = ಉಣನೀಡು; ಉಣಲ್ಪಡೆ uṇalpaḍe to be lucky to get one's meal; ಉಣವೇಳ್ಕುಂ uṇavēḷkum (one) has to have his food 2. to accept the consequences of one's actions (whether pleasant or not); ಉಣಿಯೆಕೊಡು uṇiyekoḍu to let another have food or enjoy the benefits of one's action."]}], "ಉಣಚಿ": [{"type": "noun", "defs": ["any of small, usu. gregarious toothed whales of the Phocoenidae family, found in most seas, with a torpedo-shaped body and a blunt snout; a porpoise."]}, {"type": "noun", "defs": ["the spike of the ear of a plant (as rāgi, jowar etc.)."]}], "ಉಣವು": [{"type": "noun", "defs": ["(dial.) that which is fed as food, esp. the coarse food for cattle, horse, sheep, etc.; fodder."]}], "ಉಣಾಮಿಣಿ": [{"type": "noun", "defs": ["the plant Uvaria narum of Annonaceae family; biserrate nutmeg."]}], "ಉಣಿಕ": [{"type": "noun", "defs": ["= ಉಣ್ಣಿ1."]}], "ಉಣಿಕೆ": [{"type": "noun", "defs": ["the act or an instance of having one's meal; taking a meal."]}], "ಉಣಿಸು": [{"type": "verb", "defs": ["to cause to take a meal; to make one eat.", "to cause to suck at the breast or udder; to nurse; to suckle.", "to cause or help another, enjoy the fruits of the effort."]}, {"type": "verb", "defs": ["a thing fit to be eaten; any eatable."]}], "ಉಣು": [{"type": "verb", "defs": ["= ಉಣ್ಣು."]}], "ಉಣುಂಗು": [{"type": "noun", "defs": ["= ಉಣುಗು."]}], "ಉಣುಗು": [{"type": "noun", "defs": ["= ಉಣ್ಣಿ1.", "any of tiny, sometimes microscopic, arachnids of the subclass of Acari, often parasitic upon animals, insects or plants or infesting prepared foods, including many species that transmit diseases; mite."]}], "ಉಣುಗೋಲ್": [{"type": "noun", "defs": ["= ಉಣುಗೋಲು."]}], "ಉಣುಗೋಲು": [{"type": "noun", "defs": ["a round stick or a bamboo that can move in the hole made in a wooden plank or beam."]}], "ಉಣುಮನೆ": [{"type": "noun", "defs": ["a room where meals are eaten; a dining room."]}], "ಉಣೆ": [{"type": "noun", "defs": ["a minus sign ' - ' that indicates subtraction; a sign preceding a negative figure."]}], "ಉಣ್ಣಗುಳಿ": [{"type": "noun", "defs": ["a person who greedily eats too much or very frequently; a glutton."]}], "ಉಣ್ಣಪಡಿಸು": [{"type": "verb", "defs": ["to cause another miss his food."]}], "ಉಣ್ಣಪಡು": [{"type": "verb", "defs": ["to abstain from taking food."]}], "ಉಣ್ಣವಳಿ": [{"type": "noun", "defs": ["a defectless thing; that which is free from any fault, flaw or blemish; a perfect thing.", "the quality of being big, large or great."]}], "ಉಣ್ಣಿ": [{"type": "noun", "defs": ["any of a super family (Ixodoidea order Parasitiformes) of wingless, bloodsucking mites, and is parasitic on cattle; a cattle-tick."]}, {"type": "noun", "defs": ["a bushy, hedge plant Lantana indica of Verbenaceae family; Indian lantana."]}], "ಉಣ್ಣಿಸು": [{"type": "verb", "defs": ["= ಉಣಿಸು1."]}], "ಉಣ್ಣು": [{"type": "verb", "defs": ["to put (food) in the mouth, chew if necessary, and swallow; to eat; to have a meal.", "to take (liquid) into the mouth and swallow it.", "to have the use or benefit of; have as one's lot or advantage; to enjoy.", "ಉಣ್ಣದರ್ (ಉಣ್ಣದವರು) uṇṇadar (uṇṇadavaru) (pl.) those who live without food; gods; ಉಣ್ಣಕ್ಕಿಲ್ಲದವನು ಬಣ್ಣ ಬಯಸಿದ uṇṇakkilladavanu baṇṇa bayasida (prov.) ask for luxuries when you do not have have even basic necessities like food; (like) starving woman wanting lipstick (instead of a loaf of bread); ಉಣ್ಣದರ ಬೀಯ uṇṇadara bīya (myth.) the food of the gods; ambrosia; ಉಣ್ಣದೂರು uṇṇadūru the city of gods; the heaven; ಉಂಡು ಉಪವಾಸಿ, ಬಳಸಿ ಬ್ರಹ್ಮಚಾರಿ uṇḍu upavāsi, baḷasi brahmacāri (pov .) the innate nature of a person engaged in carnal pleasures, but not influenced by such pleasures; ಉಂಡು ಹೋಗೋ ಮೂಳ ಎಂದರೆ, ಯಾರ ಮನೆ ಜೋಳ ಅಂದ uṇḍu hōgō mūḷa andare, yāra mane jōḷa anda (pov .) to find fault in something which is given as a charity (esp. in a difficult situation); ಉಂಡೂ ಹೋದ, ಕೊಂಡೂ ಹೋದ uṇḍū hōda, koṇḍū hōda (prov.) take all the advantages (often unbecomingly) from a host; ಉಂಡದ್ದೇ ಯುಗಾದಿ, ಮಿಂದದ್ದೇ ದೀವಳಿಗೆ uṇḍaddē yugādi, mindaddē dīvaḷige (prov.) (a consolation of the poor) festival day is the day one is cheerful and happy; ಉಂಡಮನೆ ಗಳವನ್ನು ಎಣಿಸು uṇḍa mane gaḷavannu eṇisu (prov.) = ಉಂಡ ಮನೆಗೆ ಎರಡು ಬಗೆ; ಉಂಡಮನೆಗೆ ಎರಡು ಬಗೆ uṇḍa manege eraḍu bage (prov.) to be ungrateful to another from whom timely help was received; cast dirt into the well that given you water; to be an ingrate; ಉಂಡರೆ ಉಬ್ಬಸ, ಹಸಿದಿದ್ದರೆ ಸಂಕಟ uṇḍare ubbasa, hasididdare saŋkaṭa (prov.) one's bodily nature to be too delicate (in respect of health); ಉಂಡವನು ಬಲ್ಲನೆ ಉಣದವನ ಬವಣೆಯ uṇḍavanu ballane uṇadavana bavaṇeya (prov.) he who is full, takes no care for him that is fasting; ಉಂಡವನಿಗೆ ಊಟ(ಕ್ಕಿಕ್ಕ) ಬೇಡ, ಗುಂಡುಕಲ್ಲಿಗೆ ಎಣ್ಣೆ (ಒತ್ತ) ಬೇಡ uṇḍavanige ūṭa(kkikka) bēḍa. guṇḍukallige eṇṇe (otta)bēḍa (prov.) the belly that is full may well fast; he sups ill, who eats up all at dinner; ಉಂಡೆಯೇನೋ ಗುಂಡ ಎಂದರೆ, ಮುಂಡಾಸು ಮೂವತ್ತು ಮೊಳ ಅಂದ uṇḍeyēnō guṇḍa endare, muṇḍāsu mūvattu moḷa anda (prov.) to talk or answer without any connection with a given matter; 'I ask for a fork and you bring me a rake'; ಉಂಬೋಕೆ ಉಡೋಕೆ ಅಣ್ಣಪ್ಪ, ಕೆಲಸಕ್ಕೆ ಮಾತ್ರ ದೊಣ್ಣಪ್ಪ umbōke uḍōke aṇṇappa, kelasakke mātra doṇṇappa (prov.) while one toils, another takes the benefits; asses carry the oats, and horses eat them; ಉಣ್ಣಕ್ಕೆ ಇಕ್ಕಿದ ಕೈಯನ್ನು ಕಚ್ಚು uṇṇkke ikkida kaiyannu kaccu (prov.) to be or become, an ingrate; ಅದೇ ಉಂಡೇನು ಕದ ತೆಗಿ adē uṇḍēnu kada tegi (prov.) I will compromise when inevitable'; ಮಾಡಿದ್ದು ಉಣ್ಣೋ ಮಹಾರಾಯ māḍiddu uṇṇō mahārāya (prov.) to accept the consequences of one's actions, however unpleasant they are; to face the music."]}], "ಉಣ್ಣೆ": [{"type": "noun", "defs": ["= ಉಣ್ಣಿ1."]}, {"type": "noun", "defs": ["wool - a) the soft, curly or crisped hair of sheep; b) the hair of some other animals, as goat or llama, having a similar texture."]}], "ಉಣ್ಣೆಜುಂಗು": [{"type": "noun", "defs": ["wool from shredded rags; reprocessed wool.", "a rough cloth made from this."]}], "ಉಣ್ದೇವ": [{"type": "noun", "defs": ["the god of food."]}], "ಉಣ್ಪು": [{"type": "noun", "defs": ["the act or an instance of having one's meal; taking a meal."]}], "ಉಣ್ಮಿಸು": [{"type": "verb", "defs": ["to cause to give out (splendour, talent, skill, etc.).", "to cause to manifest."]}], "ಉಣ್ಮು": [{"type": "verb", "defs": ["to come out; to send out; to ooze out.", "(one's skill, talent or ability) to become known to others.", "to expand; to be blown up.", "to be born.", "to be radiant as with joy; to be beaming.", "to happen; to occur; to befall."]}], "ಉಣ್ಮೆ": [{"type": "noun", "defs": ["existence - a) the state or fact of being; b) continuance of being; life; living."]}], "ಉತ": [{"type": "adjective", "defs": ["that is made into a fabric (by interlacing threads or yarns); woven; knit."]}], "ಉತಳಗಿ": [{"type": "noun", "defs": ["a basket-like apparatus for blowing the chaff from grains by wind or forced current of air; a winnow-basket."]}], "ಉತಳಫುಲ್ಗರ": [{"type": "noun", "defs": ["a variety in jowar (Sorghum Vulgare = Andropogon sorghum var. of Poacae family)."]}], "ಉತಾರ್‍ಪತ್ರಿಕೆ": [{"type": "noun", "defs": ["a document issued by the revenue department of a government, stating the source of water for a particular piece of agricultural land."]}], "ಉತಾರ": [{"type": "noun", "defs": ["a discount - a) a reduction from a usual or list price; b) a deduction from a debt, allowed for paying promptly or in cash.", "the interest deducted in advance by one who buys or lends money on, a bill of exchange, promissory note, etc.", "the rate of interest charged for discounting a bill, note, etc."]}], "ಉತಾರಿಸು": [{"type": "verb", "defs": ["to make a copy of (a written or printed matter); to copy."]}], "ಉತಾರು": [{"type": "noun", "defs": ["slope - a) a piece of ground that is not flat or level; falling ground; b) any inclined line, surface, position, etc.; slant.", "a going or coming down.", "a declining or becoming less, smaller, etc.", "a thing made just like another (chiefly written or printed matter); imitation of an original; full reproduction or transcription; a copy.", "a reduction in price (usu. to promote more sales).", "(dial.) an increase in or more than normal, yield from farming.", "in book-keeping, the figure, usu. the cumulative total, carried over to the next page.", "ಉತಾರು ಹಾಕು utāru hāku to deduct from the payment to be made to another; 2. to reduce in selling price (to promote sales); to discount."]}], "ಉತಾವಳಿ": [{"type": "adjective", "defs": ["acting or done suddenly with little thought; rash; impulsive; impetuous."]}, {"type": "noun", "defs": ["= ಉತಾವಳಿತನ."]}], "ಉತಾವಳಿತನ": [{"type": "noun", "defs": ["the quality or fact of being rash, impulsive or impetuous; impetuosity."]}], "ಉತಾವಿಳ": [{"type": "adjective", "defs": ["= ಉತಾವಳಿ1."]}, {"type": "noun", "defs": ["= ಉತಾವಳಿತನ."]}], "ಉತುಕೋಚ": [{"type": "noun", "defs": ["a loud announcement; the act of so announcing."]}], "ಉತುಕೋಚಿ": [{"type": "noun", "defs": ["a stupid fellow."]}], "ಉತುಪತಿ": [{"type": "noun", "defs": ["the act or process of producing; production.", "that which is produced; a product."]}], "ಉತುಪಾತ": [{"type": "noun", "defs": ["a flying up; a jumping up.", "something that portends an unfortunate event, calamity about to occur, as earthquake, meteor, etc."]}], "ಉತ್ಕ": [{"type": "adjective", "defs": ["full of, characterised by or showing zeal; ardently devoted to a purpose; fervent; enthusiastic.", "desirous of; longing for."]}], "ಉತ್ಕಂಟ": [{"type": "noun", "defs": ["the plant Echinops echinatus of Asteraceae; thistle."]}], "ಉತ್ಕಂಠ": [{"type": "adjective", "defs": ["having the neck uplifted.", "vehemently zealous; ardently eager."]}, {"type": "noun", "defs": ["raised voice; loud voice."]}], "ಉತ್ಕಂಠತೆ": [{"type": "noun", "defs": ["the state of holding the neck upward; the act of holding so.", "an instance of shouting aloud.", "great anxiety or impetuosity."]}], "ಉತ್ಕಂಠಿತ": [{"type": "adjective", "defs": ["having or showing anxiety; uneasy in mind; apprehensive; worried; anxious.", "feeling or showing keen desire; impatient or anxious to do or get; eager."]}, {"type": "noun", "defs": ["an anxious man.", "he who is eager."]}], "ಉತ್ಕಂಠಿತೆ": [{"type": "noun", "defs": ["an anxious woman.", "she who is eager."]}], "ಉತ್ಕಂಠೆ": [{"type": "noun", "defs": ["excessive eagerness.", "agony caused by separation of a beloved person.", "she who has keen or strong eagerness."]}], "ಉತ್ಕಂಪ": [{"type": "noun", "defs": ["the act or condition of quivering; tremor; tremble."]}], "ಉತ್ಕಂಪಿತ": [{"type": "adjective", "defs": ["that is quivering or trembling."]}], "ಉತ್ಕಚ": [{"type": "adjective", "defs": ["having the hairs of head standing erect."]}], "ಉತ್ಕಟ": [{"type": "adjective", "defs": ["characterised by excess; being too much or too great; immoderate; excessive.", "physically, morally or emotionally strong.", "of a violently cruel nature; savage; wild; fierce.", "having or showing great pride in oneself and disdain, contempt or scorn for others; proud; arrogant; supercilious; haughty.", "giving cause for concern; dangerous; serious; grave.", "outstandingly good of its kind; of exceptional merit, virtue, etc.; excellent."]}, {"type": "noun", "defs": ["excessiveness; abundance; plentifulness.", "action or conduct that goes beyond the usual, reasonable or lawful limit.", "the state or quality of being ferocious; dreadfulness; ferocity.", "the yellowish-brown spice made from the dried inner bark of several trees or shrubs (Cinnamomum zeylanicum of Lauraceae family).", "a very strong desire.", "an afflicted condition; high degree of pain or suffering."]}], "ಉತ್ಕಟತೆ": [{"type": "noun", "defs": ["the quality of being excessive, abundant or plentiful.", "the quality of going, acting beyond the usual, reasonable or lawful limit; the inclination of the mind to do so.", "the quality or state of being dreadful, ferocious, dreadful or causing such a condition.", "the condition or quality of being extremely difficult."]}], "ಉತ್ಕಟತ್ವ": [{"type": "noun", "defs": ["= ಉತ್ಕಟತೆ."]}], "ಉತ್ಕಟವೃತ್ತಿ": [{"type": "noun", "defs": ["a state charged with excessiveness of character, feeling, momentum, desire, etc."]}], "ಉತ್ಕಟಿಸು": [{"type": "verb", "defs": ["to have, driven by the impetus, strong desire, immoderate violence, etc."]}], "ಉತ್ಕರ": [{"type": "noun", "defs": ["a heap; a multitude; a pile.", "the act of splitting.", "the tree Anogeissus latifolia (=Conocarpus latifolia) of Combretaceae family; axle wood; (?)."]}], "ಉತ್ಕರಣ": [{"type": "noun", "defs": ["the art of carving wood, chiselling stone, casting or welding metal, moulding clay or wax, etc. into three-dimensional representations, as statues, figures, forms, etc.; sculpture."]}], "ಉತ್ಕರುಷ": [{"type": "noun", "defs": ["= ಉತ್ಕರ್ಷ."]}], "ಉತ್ಕರುಷವಂತ": [{"type": "noun", "defs": ["a prosperous, successful man.", "a man of eminence; a celebrity in a particular field."]}], "ಉತ್ಕರ್ಷ": [{"type": "noun", "defs": ["superiority in rank, position, character, achievement, etc.; elevation; greatness; celebrity; eminence.", "excellence; highest merit.", "prosperous condition; good fortune, wealth, success, etc.; prosperity.", "(in yogic exercises) a kind of controlled breathing."]}], "ಉತ್ಕರ್ಷಕ1": [{"type": "adjective", "defs": ["= ಉತ್ಕರ್ಷಣಕಾರಿ1."]}], "ಉತ್ಕರ್ಷಕ2": [{"type": "noun", "defs": ["= ಉತ್ಕರ್ಷಣಕಾರಿ2."]}], "ಉತ್ಕರ್ಷಣಕಾರಿ1": [{"type": "adjective", "defs": ["that helps or causes (something) go up or prosper.", "(said of chemicals) that increases the positive valence or decreases negative valence of an element."]}], "ಉತ್ಕರ್ಷಣಕಾರಿ2": [{"type": "noun", "defs": ["that which helps or causes (another thing) go up, succeed or prosper.", "(chem.) that helps combining with oxygen; that causes increase in the positive valence or decrease in the negative valence of an element or ion; an oxidiser."]}], "ಉತ್ಕರ್ಷಣೆ": [{"type": "noun", "defs": ["= ಉತ್ಕರ್ಷಣ."]}], "ಉತ್ಕರ್ಷತೆ": [{"type": "noun", "defs": ["= ಉತ್ಕರ್ಷ.", "the quality of being noble; nobility."]}], "ಉತ್ಕರ್ಷಿಸು": [{"type": "verb", "defs": ["to cause to go up; to elevate.", "to oxidise - a) to unite with oxygen, as in burning or rusting; b) to increase the positive valence or decrease the negative valence of (an element or ion)."]}], "ಉತ್ಕಲ": [{"type": "noun", "defs": ["a state in Eastern India, on the bay of Bengal; Orissa.", "an inhabitant of this state.", "a bird-catcher; a fowler.", "one who caries load on his head or back, for others; an unskilled labourer; a porter; a coolie.", "a door-keeper; a watchman."]}], "ಉತ್ಕಲಿ": [{"type": "noun", "defs": ["a long stick (crooked or attached with a small brush, at one end) for sweeping and accumulating grains, pulses, in the threshing-area in a field."]}], "ಉತ್ಕಲಿಕಾಪ್ರಾಯ": [{"type": "noun", "defs": ["a style of prose composition which abounds in complex sentences, long and hard compounds."]}], "ಉತ್ಕಲಿಕೆ": [{"type": "noun", "defs": ["excessive eagerness.", "a strong desire.", "agony caused by separation of a beloved person.", "she who has keen or strong eagerness.", "a small swelling or projection on a plant, from which a shoot, cluster of leaves or flower develops; a bud.", "sudden fear; fright.", "a small water-vessel, with a nozzle for pouring out the water.", "a bushy annual plant (Cicer arietinum) of the pea family, with short, hairy pods containing usually two seeds; the chickpea plant.", "its seed ; chickpea.", "any plant whose stem puts out tendrils or rootlets by which it can creep along a surface as it grows; a creeper.", "a ridge or swell moving along the surface of a liquid or body of water as a result of disturbance, as by wind; a wave."]}], "ಉತ್ಕಲ್ಲೋಲ": [{"type": "adjective", "defs": ["a large wave, caused by strong wind on the surface of the sea, that moves steadily without breaking."]}], "ಉತ್ಕಲ್ಲೋಳ": [{"type": "adjective", "defs": ["= ಉತ್ಕಲ್ಲೋಲ."]}], "ಉತ್ಕಳಿಕಾಪ್ರಪಂಚ": [{"type": "noun", "defs": ["the strong feeling of pain, and agony caused by the separation of a beloved person."]}], "ಉತ್ಕಳಿಕಾವಿಳಾಸ": [{"type": "noun", "defs": ["the elegance or beauty of flower buds in garden or open field; pulchritude of flowers.", "the complex condition of having various subtle feelings of agony caused by separation from a beloved person."]}], "ಉತ್ಕಳಿಕೆ": [{"type": "noun", "defs": ["= ಉತ್ಕಲಿಕೆ."]}], "ಉತ್ಕಳಿಕೆದೋಱು": [{"type": "verb", "defs": ["to put forth buds."]}], "ಉತ್ಕಾಂಕ್ಷಿಸು": [{"type": "verb", "defs": ["to aspire for greater achievements, heights."]}], "ಉತ್ಕಾಂಕ್ಷೆ": [{"type": "noun", "defs": ["an aspiration for higher achievements."]}], "ಉತ್ಕಾರ": [{"type": "noun", "defs": ["the act of blowing the chaff from grain by wind or a forced current of air; winnowing; winnow.", "heaping up of grains."]}], "ಉತ್ಕೀರ್ಣ": [{"type": "adjective", "defs": ["heaped or piled up; stacked one above the other.", "thrown up.", "engraved; carved; sculptured."]}], "ಉತ್ಕೀರ್ಣಿಸು": [{"type": "verb", "defs": ["to engrave - a) to cut or incise letters, designs, etc. in or on (a surface); b) to cut or incise (a picture, letters, etc.) into a metal plate, wooden block, etc. for printing."]}], "ಉತ್ಕೀಲಿಸು": [{"type": "verb", "defs": ["to put into soil, esp. into the ground; to set firmly as into the ground; to plant."]}], "ಉತ್ಕುಣ": [{"type": "noun", "defs": ["any of various members of wingless, bloodsucking hemipteran insects of Cimicidae family, esp. of Cimex lectularius species with a broad, flat, reddish-brown body and an unpleasant odour that infests beds, furniture, walls, etc., is active mainly at night, and may transmit a variety of diseases; a bug.", "any of small, flat, wingless insects of Anoplura order with sucking mouthparts, parasitic on the hair of humans and some other mammals; a louse."]}], "ಉತ್ಕೂಟ": [{"type": "noun", "defs": ["the crest or summit of a very high hill or mountain ending in a point.", "a shade, usually of cloth stretched over a folding radial frame, carried for protection against the rain or sun; an umbrella."]}], "ಉತ್ಕೃತಿ": [{"type": "noun", "defs": ["a metre having four lines of twenty six syllables each."]}], "ಉತ್ಕೃಷ್ಟ": [{"type": "adjective", "defs": ["drawn up or out.", "excelling another or others in quality or merit; excellent; exquisite."]}, {"type": "noun", "defs": ["a drawing back of the string of a bow before shooting an arrow."]}], "ಉತ್ಕೃಷ್ಟತೆ": [{"type": "noun", "defs": ["the state or quality of being superior or higher, greater, better, etc; superiority; surpassing goodness; excellence."]}], "ಉತ್ಕೆ": [{"type": "noun", "defs": ["the state of holding the neck upward; the act of holding so.", "an instance of shouting aloud.", "great anxiety or impetuosity."]}, {"type": "noun", "defs": ["an anxious woman.", "she who is eager (to meet her lover)."]}], "ಉತ್ಕೇಂದ್ರ": [{"type": "noun", "defs": ["an apparent, but not real centre of a circle."]}], "ಉತ್ಕೇಂದ್ರತೆ": [{"type": "noun", "defs": ["the state, quality or amount of being eccentric; eccentricity.", "the ratio of the distances from any point of a conic section to the focus and to the directrix."]}], "ಉತ್ಕೇಂದ್ರೀಯ": [{"type": "adjective", "defs": ["not having the same centre, as two circles one inside the other; going away from the centre; eccentric.", "not having the axis exactly in the centre; off-centre."]}], "ಉತ್ಕೇಂದ್ರೀಯ ದೂರ": [{"type": "noun", "defs": ["the distance between the centre of a shaft and the centre of its eccentric wheel; eccentricity."]}], "ಉತ್ಕೇತು": [{"type": "noun", "defs": ["a banner held high or flying high."]}], "ಉತ್ಕೋಚ": [{"type": "noun", "defs": ["a bending upwards.", "diffusion of thing pervading the space above.", "an act of making another deviate from the right path; anything, esp. money, given or promised to induce a person to do something illegal or wrong; a bribe.", "the quality of being not straightforward or dishonest, crookedness; dishonesty.", "a shouting aloud."]}], "ಉತ್ಕೋಚಿ": [{"type": "noun", "defs": ["a person who is influenced by bribing or who accepts bribes for favouring illegally another ."]}], "ಉತ್ಕ್ರಮ": [{"type": "noun", "defs": ["the act of going up; a moving in the space above; progressive increase.", "a wrong, illegal, extreme action or behaviour; a going astray."]}], "ಉತ್ಕ್ರಮಣ": [{"type": "noun", "defs": ["the act of going up or moving in the sky; ascent.", "a going to the region above; departure from this world; the flight of the soul; an instance of dying."]}], "ಉತ್ಕ್ರಮ ಶ್ರೇಣಿ": [{"type": "noun", "defs": ["a grade order or class of a body of people, animals or things ranked one above the other, with respect to authority or dominance, esp. in logical and scientific classifications."]}], "ಉತ್ಕ್ರಮಿಸು": [{"type": "verb", "defs": ["to go up; to step up; to ascend.", "to step beyond; to transgress; to violate.", "to step out of this world; to pass away; to die."]}], "ಉತ್ಕ್ರಾಂತಿ": [{"type": "noun", "defs": ["a going up or out; departure.", "the flight of the soul out of the body; death.", "(Dvaita phil.) the departure of the soul from the body through a particular passage called ಬ್ರಹ್ಮನಾಡಿ.", "process of development, as from a simple to a complex form or of gradual, progressive change, as in a social and economic structure; evolution.", "(in yogic exercises) a kind of controlled breathing."]}], "ಉತ್ಕ್ರಾಂತಿತತ್ತ್ವ": [{"type": "noun", "defs": ["the process or theory of evolution - a) the gradual cumulative change in the characteristics of organisms over many generations, which results in new species; b) any development from a simpler to a more complex or advanced form."]}], "ಉತ್ಕ್ರೋಶ": [{"type": "noun", "defs": ["a loud outcry; uproar; clamour.", "a vehement, continued expression of the general feeling or of public opinion; loud demand or complaint.", "a large, black-and-white diving bird of prey of Pandionidae family, (Pandion haliaetus species), which feeds mainly on fish; osprey.", "any of piciform birds of Picidae family, distinguished by stiff tail feathers used for support, a strong, pointed, chisel-shaped bill used for drilling holes in bark to get insects, and a long, protrusile tongue with a spearlike tip; woodpecker."]}], "ಉತ್ಕ್ಷಿಪ್ತ": [{"type": "adjective", "defs": ["thrown up; projected upwards; tossed.", "held up; placed high."]}, {"type": "noun", "defs": ["(dance) a lifting of the head with the face-looking at the sky as if look a thing moving in the sky or to indicate permission to take, go, jump up or fly away etc."]}], "ಉತ್ಕ್ಷೇಪ": [{"type": "noun", "defs": ["the act of throwing upwards; projection upwards by force."]}], "ಉತ್ಕ್ಷೇಪಕ": [{"type": "noun", "defs": ["one who or that which throws or tosses up.", "he who or that which elevates or raises.", "he who steals; a thief."]}], "ಉತ್ಕ್ಷೇಪಮಾಪಕ": [{"type": "noun", "defs": ["a suspended block for finding the velocity of projectiles; ballistic pendulum."]}], "ಉತ್ಕ್ಷೇಪಮಾಪನ": [{"type": "noun", "defs": ["a measuring of or the process of measuring, the velocity or projectiles."]}], "ಉತ್ಕ್ಷೇಪವಿಜ್ಞಾನ": [{"type": "noun", "defs": ["the science dealing with the motion and impact of projectiles, such as bullets, rockets, bombs, etc.; ballistics."]}], "ಉತ್ಖನನ": [{"type": "noun", "defs": ["excavation - a) an excavating or being excavated; b) a hole, depression, ditch or hollow made by excavating."]}], "ಉತ್ಖನನಕಾರ": [{"type": "noun", "defs": ["a man who excavates; an excavator."]}], "ಉತ್ಖಾತ": [{"type": "adjective", "defs": ["(root) taken out from the ground; uprooted.", "dug or turned out; excavated.", "drawn or pulled out from deep inside.", "eradicated or annihilated (completely)."]}, {"type": "noun", "defs": ["an excavated place.", "something unearthed by excavating; that which is got or recovered from excavation."]}], "ಉತ್ಖಾತ ಪ್ರತಿಕ್ರಿಯೆ": [{"type": "noun", "defs": ["(psych.) the process of bringing one's repressed emotions and memories to the conscious level and free expression of the same; abreaction."]}], "ಉತ್ತ": [{"type": "noun", "defs": ["a place or region which is neither too far nor too close; (literarally, in between those can be referred to with 'there' and 'here')."]}, {"type": "prepositional phrase", "defs": ["p.p. of the verb 'ಉಱು' (to be)."]}, {"type": "prepositional phrase", "defs": ["p.p. of the verb 'ಉರು' (to till, plough)."]}], "ಉತ್ತಂ": [{"type": "adverb", "defs": ["(coming, going) towards the central region, portion."]}], "ಉತ್ತಂಡ": [{"type": "noun", "defs": ["a golden necklace worn by women."]}], "ಉತ್ತಂಭಿತ": [{"type": "adjective", "defs": ["held up; supported (from below)."]}], "ಉತ್ತಂಸ": [{"type": "noun", "defs": ["an ornament, chaplet, a wreath etc., worn on the crown of the head.", "an ear-ring; an ornament for the ear.", "(fig.) the best or most excellent man (among)."]}], "ಉತ್ತಂಸಕ": [{"type": "noun", "defs": ["the most excellent man."]}], "ಉತ್ತಂಸಿತ": [{"type": "adjective", "defs": ["furnished with ornaments; ornamented; decorated.", "(fig.) exhibiting brilliant character or behaviour."]}], "ಉತ್ತಣ": [{"type": "noun", "defs": ["= ಉತ್ತ1."]}], "ಉತ್ತತ್ತಿ": [{"type": "noun", "defs": ["the sweet, fleshy fruit of the date palm (Phoenis dactylifera of Arecaceae family), having a large, hard seed; date.", "the tree itself."]}], "ಉತ್ತಪ್ತ": [{"type": "adjective", "defs": ["heated; characterised by a relatively or abnormally high temperature; hot."]}], "ಉತ್ತಪ್ಪ": [{"type": "noun", "defs": ["a kind of swollen cake made of rice etc."]}], "ಉತ್ತಮ": [{"type": "adjective", "defs": ["of a more excellent sort; surpassing another or others.", "more suitable, more desirable, more favourable, more profitable, etc. 3) improved in health or disposition.", "ಉತ್ತಮೋತ್ತಮ1 uttamōttama dupl. of ಉತ್ತಮ1."]}, {"type": "noun", "defs": ["an excellent man.", "the best or most excellent man.", "(myth.) one of the fourteen Manus who are regarded as successive progenitors or sovereigns of the earth.", "a sub-caste among weavers.", "ಉತ್ತಮೋತ್ತಮ2 uttamōttama dupl. of ಉತ್ತಮ2."]}], "ಉತ್ತಮತೆ": [{"type": "noun", "defs": ["= ಉತ್ತಮಿಕೆ."]}], "ಉತ್ತಮಪಾತ್ರ": [{"type": "noun", "defs": ["a man eligible for receiving gift or donation.", "a good character or role in a drama or cinema."]}], "ಉತ್ತಮಪುರುಷ": [{"type": "noun", "defs": ["(gram.) the person who is referred by the pronoun (as I) and who takes the verb (as am), (that is where the pronoun refers to the speaker or writer or, in the plural, also to those for whom the speaker or writer serves as spokesperson, corresponding to the 'first persoṇof English language).", "an excellent man."]}], "ಉತ್ತಮಬಿಸಿಗೆ": [{"type": "noun", "defs": ["= ಉತ್ತಮಬೀಸಿಗೆ."]}], "ಉತ್ತಮಬೀಸಿಗೆ": [{"type": "noun", "defs": ["the group of first twenty years (Prabhava to Vyaya) in the cycle of 60 years in Indian calendar system (the other two being ಮಧ್ಯಮಬೀಸಿಗೆ and ಅಧಮಬೀಸಿಗೆ)."]}], "ಉತ್ತಮಬೀಸು": [{"type": "noun", "defs": ["a group of first twenty things, items, etc."]}], "ಉತ್ತಮರ್ಣ": [{"type": "noun", "defs": ["a person who extends credit or to whom money is owed; a creditor."]}], "ಉತ್ತಮಶ್ಲೋಕ": [{"type": "noun", "defs": ["an excellent, famous, well known, glorious man."]}], "ಉತ್ತಮಾಂಗ": [{"type": "noun", "defs": ["the head, considered as the most important one among all the limbs."]}], "ಉತ್ತಮಾಗ್ರ": [{"type": "noun", "defs": ["a magnificent or splendid food or meal offered to a guest."]}], "ಉತ್ತಮಿಕೆ": [{"type": "noun", "defs": ["the state or quality of being superior, higher, greater or better; superiority."]}], "ಉತ್ತಮೀಕರಣ": [{"type": "noun", "defs": ["sublimation - a) the act, process or fact of improving or refining; b) the act, process or fact of diverting the expression of (an instinctual desire or impulse) from its primitive form to one that is considered more socially or culturally acceptable."]}], "ಉತ್ತಮೆ": [{"type": "noun", "defs": ["an excellent or virtuous woman."]}], "ಉತ್ತರ": [{"type": "adjective", "defs": ["situated far above the ground or some other level.", "of good quality; of higher class.", "later to; following; subsequent.", "exceeding; excessive."]}, {"type": "noun", "defs": ["that which follows another; the subsequent, later chapter, part or portion.", "left portion, part or region.", "a consequence that follows an action; the result; the product.", "something said or written in return to a question, argument, letter, etc.; an answer; a reply.", "(law) the defendant's answer to a plaintiff's replication; a rejoinder.", "a man belonging to the northern parts of a country.", "the resultant joy or satisfaction (that follows an action).", "(rhet.) a figure of speech in which a thing is delineated in the form of questions and compact answers.", "a variety in kissing - a kissing by sucking the upper lip of the man intensely by a woman.", "prosperous condition; good fortune, wealth, success, etc; prosperity.", "a crossing over of a river, sea, etc.", "the direction to the right of a person facing the sunset; direction of the North Pole from any other point on the earth's surface; the north direction.", "(astrol.) the tenth house in the zodiac chart.", "a character in the epic Mahābhārata, who was known for chicken-heartedness.", "(dial.) the reproductive fluid containing spermatozoa secreted by the male organs; semen;", "ಉತ್ತರನ ಪೌರುಷ ಒಲೆಯ ಮುಂದೆ uttarana pauruṣa oleya munde (prov.) one who assumes himself a gallant hero without being really so, though boasts himself, runs away from the problem when faced actually; every dog is a lion at home; ಉತ್ತರ ದಕ್ಷಿಣ ಧ್ರುವಗಳು uttara dakṣiṇa dhruvagaḷu (fig.) (pl.) two persons of exactly opposite qualities, taste, interest, etc. who can never mutually agree."]}, {"type": "noun", "defs": ["(dial.) a raised lining running at a height all round the inside of walls in buildings."]}], "ಉತ್ತರಂ": [{"type": "adverb", "defs": ["specially; especially; with an importance particularly to."]}], "ಉತ್ತರಂಗ": [{"type": "noun", "defs": ["the horizontal crosspiece of the door frame; the lintel."]}], "ಉತ್ತರಂಗುಡು": [{"type": "verb", "defs": ["= ಉತ್ತರಕೊಡು."]}], "ಉತ್ತರಂಗೆಡು": [{"type": "verb", "defs": ["to be unable to reply or answer."]}], "ಉತ್ತರಂಗೊಡು": [{"type": "verb", "defs": ["= ಉತ್ತರಕೊಡು."]}], "ಉತ್ತರಕರ್ಮ": [{"type": "noun", "defs": ["= ಉತ್ತರಕ್ರಿಯೆ."]}], "ಉತ್ತರಕಾಲ": [{"type": "noun", "defs": ["the time or period of time that follows (a particular point of time, incidence, etc.); subsequent time or period."]}], "ಉತ್ತರಕಿರೀಟ": [{"type": "noun", "defs": ["constellation between Hercules and Bootes; the Corona Borealis."]}], "ಉತ್ತರಕುಮಾರ": [{"type": "noun", "defs": ["a character in epic Mahābhārata, the ignominious role-model for cowards.", "(fig.) a coward, who boasts himself as a knight; a chicken-hearted hero; a cock on the dung hill; a carpet knight."]}], "ಉತ್ತರಕುರು": [{"type": "noun", "defs": ["one of the nine divisions of the world, in mythological era (said to have been to the north of Himalayas)."]}], "ಉತ್ತರಕೊಡು": [{"type": "verb", "defs": ["to answer - a) to reply in words, by an action, etc; b) to react to a stimulus; to respond to.", "to give answer arrogantly, without due respect to the other person."]}], "ಉತ್ತರಕೌಲ": [{"type": "noun", "defs": ["a follower of a particular mystical system in which woman's vulva is worshipped as the source of the entire phenomenal universe."]}], "ಉತ್ತರಕ್ರಿಯೆ": [{"type": "noun", "defs": ["(in pl.) funeral rites or ceremonies; obsequies.", "(used restrictively) any work that follows."]}], "ಉತ್ತರಕ್ಷಣ": [{"type": "noun", "defs": ["the next moment."]}], "ಉತ್ತರಗೊಡು": [{"type": "verb", "defs": ["= ಉತ್ತರಕೊಡು."]}], "ಉತ್ತರಜ್ನಾನಿ": [{"type": "noun", "defs": ["the person who knows the future events perfectly."]}], "ಉತ್ತರಡೊಕ್ಕರ": [{"type": "noun", "defs": ["a particular lock in wrestling."]}], "ಉತ್ತರಣ": [{"type": "noun", "defs": ["the act of crossing over a river, sea etc.", "the act of passing through a difficult situation or danger.", "an expelling of spiritual ignorance."]}], "ಉತ್ತರಣಿ": [{"type": "noun", "defs": ["= ಉತ್ತರಣೆ."]}], "ಉತ್ತರಣೆ": [{"type": "noun", "defs": ["the small plant Achyranthes aspera of Amaranthaceae family, (the sticks of which were used medicine, washing teeth, sacrificial and other religious purposes)."]}], "ಉತ್ತರತಪ": [{"type": "noun", "defs": ["(Jain.) one of the twelve types of religious penances."]}], "ಉತ್ತರದಾತ": [{"type": "noun", "defs": ["= ಉತ್ತರದಾಯಿ2."]}], "ಉತ್ತರದಾಯಿ": [{"type": "adjective", "defs": ["expected or obliged to account (for something, to someone); answerable; accountable; responsible."]}, {"type": "noun", "defs": ["one who gives or writes answers.", "he who is subject to being called to account; the responsible man."]}], "ಉತ್ತರದಾಯಿತ್ವ": [{"type": "noun", "defs": ["the condition, quality, fact or an instance of being responsible; obligation, accountability, responsibility."]}], "ಉತ್ತರದಿಗ್ವರ": [{"type": "noun", "defs": ["Kubēra, the regent of the north."]}], "ಉತ್ತರಧ್ರುವ": [{"type": "noun", "defs": ["the north pole - a) the place where the northern rotational axis intersects the surface of a planet, moon, etc.; b) the zenith of such a place, esp., the zenith (north celestial pole) of this place on the earth; c) that end of a straight magnet that points to the north when the magnet hangs free; north terrestrial pole."]}], "ಉತ್ತರಪಕ್ಷ": [{"type": "noun", "defs": ["the northern wing or side.", "the second fortnight of a lunar month.", "(log.) the second part of an argument, i.e. reply, the reason for the first statement on which a question (ಪೂರ್ವಪಕ್ಷ) is asked.", "(log.) a demonstrated truth or conclusion.", "a minor proposition in a syllogism."]}], "ಉತ್ತರ ಪತ್ರಿಕೆ": [{"type": "noun", "defs": ["the paper on which answers are written (by examinees) in an examination; an answer paper."]}], "ಉತ್ತರಪದ": [{"type": "noun", "defs": ["the second or following word in a compound word; a suffix.", "(math.) the second term, denominator or divisor of a ratio: distinguished from antecedent (ಪೂರ್ವಪದ) a consequent.", "(log.) the second term of a conditional proposition; a consequent."]}], "ಉತ್ತರಪಾಣಿ": [{"type": "noun", "defs": ["a kind of tāḷa, (keeping of time in music)."]}], "ಉತ್ತರಪೂಜೆ": [{"type": "noun", "defs": ["the concluding part in worshipping a deity."]}], "ಉತ್ತರ ಪ್ರತ್ಯಯ": [{"type": "noun", "defs": ["a letter, syllable or group of syllables added at the end of a word or word base to change its meaning, give it grammatical function or form a new word; a suffix."]}], "ಉತ್ತರಫಲ್ಗುನಿ": [{"type": "noun", "defs": ["the twelfth lunar mansion consisting of two stars; Denebola."]}], "ಉತ್ತರಭಾಗ": [{"type": "noun", "defs": ["the second of the two parts; the later part."]}], "ಉತ್ತರಭಾದ್ರಪದೆ": [{"type": "noun", "defs": ["the twenty sixth lunar mansion consisting of two stars."]}], "ಉತ್ತರಭಾರ": [{"type": "noun", "defs": ["condition, quality, fact or instance of being responsible; obligation, accountability, responsibility."]}], "ಉತ್ತರಭಾರವಾಹಿ": [{"type": "noun", "defs": ["he who is subject to being called to account; the responsible man."]}], "ಉತ್ತರಮಾರ್ಗ": [{"type": "noun", "defs": ["a path, way or means to cross over (a river or sea).", "(rhet.) one of the styles in Samskřta poetic composition (also called ಗೌಡಿ)."]}], "ಉತ್ತರಮೀಮಾಂಸೆ": [{"type": "noun", "defs": ["(literally, deep philosophical reflections or investigations, of later times) the philosophy of Upaniṣads and Brahmasūtras."]}], "ಉತ್ತರಮುಖಿ": [{"type": "noun", "defs": ["an instrument for showing direction, consisting of a magnetic needle swinging freely on a pivot and pointing to the magnetic north; a magnetic needle; a compass."]}], "ಉತ್ತರಮೇರು": [{"type": "noun", "defs": ["= ಉತ್ತರಧ್ರುವ."]}], "ಉತ್ತರರಕ್ಷೆ": [{"type": "noun", "defs": ["a group of later Vedic metaphysical treatises dealing with man in relation to the universe; Upanishads."]}], "ಉತ್ತರವಯಸ್ಸು": [{"type": "noun", "defs": ["the later or declining years of life."]}], "ಉತ್ತರವಾದಿ": [{"type": "noun", "defs": ["he who is subject to being called to account; the responsible man.", "(law) the party who responds to a petition, in a court of law; the defendant in a proceedings instituted against him or her; a respondent."]}], "ಉತ್ತರವಾದಿತ್ವ": [{"type": "noun", "defs": ["the condition, quality, fact or an instance of being responsible; obligation, accountability, responsibility."]}], "ಉತ್ತರವೀ": [{"type": "verb", "defs": ["to answer; to reply."]}], "ಉತ್ತರಶ್ವಾಸ": [{"type": "noun", "defs": ["the last breath of one's life.", "ಉತ್ತರ ಶ್ವಾಸಹೋಗುವಾಗ ಉಪ್ಪರಿಗೆ ಹಿಡಿದರೆ ತಡೆದೀತೆ? uttara śvāsa hōguvāga upparige hiḍidare taḍedīte (prov.) a drowning man catches, in vain, a hay."]}], "ಉತ್ತರಸ": [{"type": "noun", "defs": ["= ಉತ್ತರಾಸ."]}], "ಉತ್ತರಸಾಗರ": [{"type": "noun", "defs": ["ocean surrounding the North Pole, north of the Arctic Circle: c. 5,500,000 sq. mlies. (14,245,000 sq. km); Arctic Ocean."]}], "ಉತ್ತರಸಾಧಕ": [{"type": "noun", "defs": ["one who finishes what is remaining or following.", "an assistant; a helper."]}], "ಉತ್ತರಳ": [{"type": "adjective", "defs": ["vibrating or susceptible to vibration; unsteady; wavering; infirm.", "shining; resplendent."]}], "ಉತ್ತರಾಂಗ": [{"type": "noun", "defs": ["the horizontal crosspiece of the door frame; the lintel.", "a subsidiary or auxiliary department of science or any pursuit of knowledge, that comes for study later than the main branch of science.", "(log.) the second term of a conditional proposition; a consequent.", "(mus.) the second of the two divisions of a gamut which includes ಪ, ಧ and ನಿ ."]}], "ಉತ್ತರಾಂಶ": [{"type": "noun", "defs": ["a person or thing that succeeds or follows, another; a successor."]}], "ಉತ್ತರಾಜಿ": [{"type": "noun", "defs": ["a thing, subject or country that belongs to northern part of the country."]}], "ಉತ್ತರಾಣಿ": [{"type": "noun", "defs": ["the small plant Achyranthes aspera of Amaranthaceae family, used as an astringent depurative, as a remedy in dropsy and as an antidote to the venom of scorpion."]}], "ಉತ್ತರಾದಿ": [{"type": "adjective", "defs": ["of or belonging to north (esp. North India)."]}, {"type": "noun", "defs": ["a sub-sect among Brāhmaṇas."]}], "ಉತ್ತರಾದಿಸಂಗೀತ": [{"type": "noun", "defs": ["one of the two major systems of music in India, also known as Hindūstāni system."]}], "ಉತ್ತರಾಧಿ": [{"type": "noun", "defs": ["= ಉತ್ತರಾಧಿಕಾರಿ."]}], "ಉತ್ತರಾಧಿಕಾರ": [{"type": "noun", "defs": ["the right to succeed to an office, estate, etc.; succession."]}], "ಉತ್ತರಾಧಿಕಾರಿ": [{"type": "noun", "defs": ["a man who inherits or is legally entitled to inherit, through the natural action of the law, another's property or title upon the other's death; anyone who receives property of a deceased person either by will or by law; an heir; a successor."]}], "ಉತ್ತರಾಧಿಕಾರಿಣಿ": [{"type": "noun", "defs": ["a woman receiving or entitled by law to receive property or rank as the successor or legal representative of the former owner; a woman who receives property of a deceased person either by will or by law; an heir; a successor."]}], "ಉತ್ತರಾಪಥ": [{"type": "noun", "defs": ["the country to the north of Vindhya mountains (in the central India); Northern India.", "(rhet.) one of the styles in Samskřita poetic composition (also called -ಗೌಡಿ)."]}], "ಉತ್ತರಾಫಲ್ಗುನಿ": [{"type": "noun", "defs": ["the twelfth lunar mansion consisting of two stars."]}], "ಉತ್ತರಾಭಾದ್ರಪದ": [{"type": "noun", "defs": ["= ಉತ್ತರಾಭಾದ್ರೆ."]}], "ಉತ್ತರಾಭಾದ್ರೆ": [{"type": "noun", "defs": ["the twenty sixth lunar mansion consisting of two stars, Algenib and Alpheratz."]}], "ಉತ್ತರಾಭಾಸ": [{"type": "noun", "defs": ["a wrong answer seeming to be correct; an evasive or equivocal reply."]}], "ಉತ್ತರಾಭಿಮುಖ": [{"type": "noun", "defs": ["the state of being turned towards north."]}], "ಉತ್ತರಾಯಣ": [{"type": "noun", "defs": ["the progress of the sun to the north of the equator.", "summer solstice - a) the point on the celestial sphere where the sun is farthest north of the celestial equator; b) the moment or date of this annual event.", "the period or time of the summer solstice."]}], "ಉತ್ತರಾಯಿ": [{"type": "noun", "defs": ["a man who cannot be held responsible or accountable; an unconcerned man."]}], "ಉತ್ತರಾರಣಿ": [{"type": "noun", "defs": ["either of the two pieces of Śami (Acacia suma of Mimosae family) wood used in kindling the sacred fire."]}], "ಉತ್ತರಾರ್ಥ": [{"type": "noun", "defs": ["the meaning or sense that follows."]}], "ಉತ್ತರಾರ್ಧ": [{"type": "noun", "defs": ["the second of the two halves; the latter half.", "the upper part of t he body.", "the northern part (when divided east-west-wise)."]}], "ಉತ್ತರಾಶಾಧಿಪತಿ": [{"type": "noun", "defs": ["(myth.) Kubēra, the regent of the North."]}], "ಉತ್ತರಾಷಾಢ": [{"type": "noun", "defs": ["the twenty first lunar mansion consisting of three stars.", "ಉತ್ತರಾಷಾಢ ಪೂರ್ವಾಷಾಢ uttarāṣāḍha pūrvāṣāḍha (col. ) frequent vomiting and loose motion."]}], "ಉತ್ತರಾಸ": [{"type": "noun", "defs": ["the horizontal crosspiece of the door frame; the lintel.", "(dial.) a length of wood, masonry, etc. along the bottom of a doorway; threshold; door-sill."]}], "ಉತ್ತರಾಸಂಗ": [{"type": "noun", "defs": ["= ಉತ್ತರೀಯ."]}], "ಉತ್ತರಿ": [{"type": "noun", "defs": ["= ಉತ್ತರೀಯ.", "name of a plant.", "(mus.) a mode in Karnāṭaka system, derived from the main mode Vācaspati, having six and five notes in ascending and descending orders respectively."]}], "ಉತ್ತರಿಕೆ": [{"type": "noun", "defs": ["= ಉತ್ತರೀಯ."]}], "ಉತ್ತರಿಗೆ": [{"type": "noun", "defs": ["= ಉತ್ತರೀಯ."]}], "ಉತ್ತರಿಗೆಜನ್ನಿವರ": [{"type": "noun", "defs": ["the sacred thread worn passing over the left shoulder and under the right arm."]}], "ಉತ್ತರಿಸು": [{"type": "verb", "defs": ["to reply in words, by an action, etc.; to answer.", "to react to a stimulus; respond."]}, {"type": "verb", "defs": ["to go or extend from one side to the other; to cross over.", "to happen favourably; to be achieved.", "to make or help (another) walk forward or cross over.", "to cause to or help (another) prosper.", "to repay the debt.", "to live somewhere temporarily, as on a visit; to stay for a while; to sojourn.", "to hold (a thing) up.", "ಉತ್ತರಿಸವೇಳು uttarisavēḷu to advise order or inform to cross over from one side to the other."]}, {"type": "verb", "defs": ["to cut up or chop up (a thing) into very small pieces (as vegetables for cooking); to hash ."]}], "ಉತ್ತರೀಯ": [{"type": "noun", "defs": ["a loose long cloth to cover the upper portion of the body or worn loosely above the upper garment."]}], "ಉತ್ತರೀಯಕ": [{"type": "noun", "defs": ["= ಉತ್ತರೀಯ."]}], "ಉತ್ತರೀಯಾಂಶುಕ": [{"type": "noun", "defs": ["= ಉತ್ತರೀಯ."]}], "ಉತ್ತರೆ": [{"type": "noun", "defs": ["the twelfth lunar mansion consisting of two stars.", "the rain got or supposed to get during the period when the moon is closer to this mansion."]}], "ಉತ್ತರೇಣಿ": [{"type": "noun", "defs": ["= ಉತ್ತರಾಣಿ."]}], "ಉತ್ತರೋತ್ತರ": [{"type": "adjective", "defs": ["following the present time or coming or happening at a future time."]}, {"type": "noun", "defs": ["future time; the time that is to follow the present time.", "that which is in far north.", "one at the farthest end.", "a higher and higher position, status.", "success; welfare; prosperity.", "the most superior thing."]}, {"type": "adverb", "defs": ["in the following course of time."]}], "ಉತ್ತರೋತ್ತರತೆ": [{"type": "noun", "defs": ["the highest prosperity; welfare of highest order."]}], "ಉತ್ತರೋತ್ತರಸಿದ್ಧಿ": [{"type": "noun", "defs": ["the prosperity to be achieved or that would happen."]}], "ಉತ್ತರೋತ್ತರಾಭಿವೃದ್ಧಿ": [{"type": "noun", "defs": ["= ಉತ್ತರೋತ್ತರಸಿದ್ಧಿ."]}], "ಉತ್ತರ್ಯ": [{"type": "adjective", "defs": ["adorning beautifully."]}], "ಉತ್ತಲ್": [{"type": "adverb", "defs": ["towards or in a place or region which is neither too far nor too close; in between those can be referred to with 'there' and 'here'."]}]}