{"ಕೊಡತಿಮನ್ಯ": [{"type": "noun", "defs": ["a piece of land given to a carpenter, blacksmith for his livelihood."]}], "ಕೊಡತಿಮೀನು": [{"type": "noun", "defs": ["any of large, tropical sharks of Sphyrnidae family (Carcharhiniformes order), which have a mallet-shaped head with an eye near the centre of each end; a hammerhead."]}], "ಕೊಡತಿವಣ": [{"type": "noun", "defs": ["a professional tax levied on artisans, as carpenters, smiths, who use hammers."]}], "ಕೊಡತಿವಲೆ": [{"type": "noun", "defs": ["a kind of net for catching wild animals."]}], "ಕೊಡತಿವುೞು": [{"type": "noun", "defs": ["a kind of worm."]}], "ಕೊಡತೆ": [{"type": "noun", "defs": ["= ಕೊಡತಿ."]}], "ಕೊಡನಾರಿ": [{"type": "noun", "defs": ["the grass Cyperus rotundus ( = C. hexastachyus) of Cyperaceae family; sedge."]}], "ಕೊಡಪಾನ": [{"type": "noun", "defs": ["a round vessel made of metal, earthenware, with a narrow neck, for holding or drawing water (from a well)."]}], "ಕೊಡಪಾನೆ": [{"type": "noun", "defs": ["= ಕೊಡಪಾನ."]}], "ಕೊಡಪಿಸು": [{"type": "verb", "defs": ["to cause to shake off as to take the dust out."]}], "ಕೊಡಪು": [{"type": "verb", "defs": ["to shake (a piece of cloth, bag, etc.) off vehemently as to take the dust out.", "to remove; to take off.", "to churn (curd) to make butter.", "(dial.) to peck; to sting; to bite."]}], "ಕೊಡಮಳೆ": [{"type": "noun", "defs": ["a heavy rain or downpour."]}], "ಕೊಡಮಾವು": [{"type": "noun", "defs": ["the plant Artemisia maritima of Asteraceae family; (?)."]}], "ಕೊಡಮುರುಕ": [{"type": "noun", "defs": ["the small-sized deciduous tree Holarrhena antidysenterica of Apocynaceae family.", "the small sized deciduous tree Wrightia tinctoria of the same family."]}], "ಕೊಡಮುರ್ಕ": [{"type": "noun", "defs": ["= ಕೊಡಮುರುಕ."]}], "ಕೊಡಮೂಕ": [{"type": "noun", "defs": ["a kind of sorghum grown in India."]}], "ಕೊಡಮೆ": [{"type": "noun", "defs": ["a bamboo or cane basket used to catch fish in flowing water; a fish-trap."]}], "ಕೊಡರು": [{"type": "noun", "defs": ["the soft, murmuring sound of pigeons or doves.", "a sound imitating this."]}], "ಕೊಡರುಕೊಂಚೆ": [{"type": "noun", "defs": ["any of a family (Columbidae order Columbiformes) of birds with a small head, plump body, long, pointed wings, and short legs, and make cooing sound 'ಕೊಡರು, ಕೊಡರು'; a pigeon; a dove."]}], "ಕೊಡಲಿ": [{"type": "noun", "defs": ["a chopping tool, usu. of iron with a steel edge and wooden handle; an axe.", "ಕೊಡಲಿ ರಾಮ koḍali rāma = ಕೊಡಲಿಕಾಱ; ಕೊಡಲಿ ಹಾಕು koḍali hāku (fig.) to spoil otheṛs plan, progress, etc.; ಬುಡಕ್ಕೇ ಕೊಡಲಿ ಹಾಕು buḍakkē koḍali hāku (fig.) to destroy one's very existence ruthlessly."]}], "ಕೊಡಲಿಕಜ್ಜಾಯ": [{"type": "noun", "defs": ["any preparation made using animal flesh; a meat-food."]}], "ಕೊಡಲಿಕಡಿತ": [{"type": "noun", "defs": ["= ಕೊಡಲಿಗಡಿತ."]}], "ಕೊಡಲಿಕಾವು": [{"type": "noun", "defs": ["a long wooden handle of an axe; a helve.", "(fig.) one who destroys one's own family, race, etc.; ಕೊಡಲಿಕಾವು ಕುಲಕ್ಕೆ ಮೃತ್ಯು koḍali kāvu kulakke mřtyu (prov.) the axe goes to the wood, whence it borrowed its helve."]}], "ಕೊಡಲಿಕಾಱ": [{"type": "noun", "defs": ["(myth.) the axe-bearer, Paraśu Rāma, the sixth incarnation of Viṣṇu as a Brahmaṇa ascetic, who destroyed the arrogant military caste people, with his axe."]}], "ಕೊಡಲಿಗಡಿ": [{"type": "verb", "defs": ["to cut, chap off with or as with an axe."]}], "ಕೊಡಲಿಗಡಿತ": [{"type": "noun", "defs": ["the act or an instance of cutting with or as with an axe."]}], "ಕೊಡಲಿಗಾವು": [{"type": "noun", "defs": ["= ಕೊಡಲಿಕಾವು."]}], "ಕೊಡಲಿಗೊರವ": [{"type": "noun", "defs": ["= ಕೊಡಲಿಕಾಱ."]}], "ಕೊಡಲಿಮರ": [{"type": "noun", "defs": ["the tree Scolopia crenata of Flacourtiaceae family with very hard wood, the sour fruits of which are edible."]}], "ಕೊಡಲಿಮುರಕ": [{"type": "noun", "defs": ["the tree Ehretia auminata of Ehretiaceae family; heliotrope tree.", "another tree of the same family, Ehretia aspera."]}], "ಕೊಡಲಿಯ": [{"type": "noun", "defs": ["a man who cuts, chops off wood (with an axe)."]}], "ಕೊಡಲೆ": [{"type": "noun", "defs": ["= ಕೊಡಲಿ."]}, {"type": "noun", "defs": ["the lower part of the alimentary canal, extending from the stomach to the anus and consisting of the small intestine and the large intestine; the intestines."]}], "ಕೊಡವ": [{"type": "noun", "defs": ["a community mainly hailing from Koḍagu region of Karnāṭaka.", "a man belonging to this community or from this region.", "the language of these people."]}], "ಕೊಡವತಿ": [{"type": "noun", "defs": ["a woman belonging to koḍava community."]}], "ಕೊಡವಿ": [{"type": "noun", "defs": ["a woman whois sexually chaste; an unmarried woman; a virgin."]}], "ಕೊಡವಿಸು": [{"type": "verb", "defs": ["to cause to shake off as to take the dust out."]}], "ಕೊಡವು": [{"type": "verb", "defs": ["to shake (a piece of cloth, bag, etc.) off vehemently as to take the dust out.", "to remove; to take off.", "to churn (curd) to make butter."]}], "ಕೊಡವೆ": [{"type": "noun", "defs": ["a bamboo or cane basket used to catch fish in flowing water; a fish-trap."]}], "ಕೊಡಸ": [{"type": "noun", "defs": ["flesh of any animal cooked with little or no moisture, as in an oven, over an open fire."]}], "ಕೊಡಸಗ": [{"type": "noun", "defs": ["= ಕೊಡಸಿಗೆ."]}], "ಕೊಡಸಾರಿ": [{"type": "noun", "defs": ["the plant Apama siliquosa of Aristolochiaceae family."]}], "ಕೊಡಸಾಲೆ": [{"type": "noun", "defs": ["the grass Sorghum nitidum ( = Andropogon serratus) of Poaceae family."]}], "ಕೊಡಸಿಂಗಿ": [{"type": "noun", "defs": ["any of various large, ferocious cats, including the jaguar and snow leopard; esp., a species (Panthera pardus) usu. having a tawny coat spotted with black; a leopard."]}], "ಕೊಡಸಿಕೆ": [{"type": "noun", "defs": ["= ಕೊಡಸಿಗೆ."]}], "ಕೊಡಸಿಗ": [{"type": "noun", "defs": ["= ಕೊಡಸಿಗೆ."]}], "ಕೊಡಸಿಗೆ": [{"type": "noun", "defs": ["the tree Cleistanthus collinus of Euphorbiaceae family.", "the small sized, deciduous tree Holarrhena antidysentrica of Apocynaceae family.", "the small, deciduous tree Wrightia tinctoria ( = W. rothii) of Apocynaceae family."]}], "ಕೊಡಸೀಗೆ": [{"type": "noun", "defs": ["= ಕೊಡಸಿಗೆ."]}], "ಕೊಡಸು": [{"type": "verb", "defs": ["to take out the cerumen, the yellowish, waxlike secretion found in the canal of the external ear.", "to clean a vessel by rubbing its inside with the hand."]}, {"type": "noun", "defs": ["= ಕೊಡಸಿಗೆ."]}], "ಕೊಡಸೋಗೆ": [{"type": "noun", "defs": ["= ಕೊಡಸಿಗೆ."]}], "ಕೊಡಹು": [{"type": "verb", "defs": ["= ಕೊಡವು."]}, {"type": "noun", "defs": ["the act of shaking (a piece of cloth, bag, etc.) vehemently to take the dust out.", "that which is thrown out in this process."]}], "ಕೊಡಿ": [{"type": "noun", "defs": ["the tip or point.", "the foremost part of a creeper or of any of its branches.", "offspring; a child or children.", "the burning end of a wick (of a lamp)."]}, {"type": "noun", "defs": ["a piece of cloth attached by one edge to a staff and used by a leader (as a monarch or feudal lord) as his standard; a banner; a flag.", "such a cloth attached to the tip of the pillar in front of a temple."]}, {"type": "noun", "defs": ["capacity for exertion or endurance; strength."]}, {"type": "noun", "defs": ["(dial.) the eighth month in the Hindu calendar.", "ಕೊಡಿ ಹಬ್ಬ koḍi habba a festival observed on the 12th day of the eighth month in Hindu calendar."]}], "ಕೊಡಿ ಅರಿವೆ": [{"type": "noun", "defs": ["a piece of cloth made of strong threads; a strong cloth."]}], "ಕೊಡಿಕಲ್ಲು": [{"type": "noun", "defs": ["a strong piece of stone.", "(fig.) enduring nature of a person; a holding up under pain, fatigue, etc."]}], "ಕೊಡಿಗಿ": [{"type": "noun", "defs": ["= ಕೊಡಿಗೆ."]}], "ಕೊಡಿಗಿ ಇನಾಂ": [{"type": "noun", "defs": ["= ಕೊಡಿಗೆಮಾನ್ಯ."]}], "ಕೊಡಿಗೆ": [{"type": "noun", "defs": ["a land gifted as an endowment to a person, as a mark of recognition, which is exempt from paying tax."]}], "ಕೊಡಿಗೆದಾರ": [{"type": "noun", "defs": ["a man who is endowed with a land in recognition of his service."]}], "ಕೊಡಿಗೆಮಾನ್ಯ": [{"type": "noun", "defs": ["an arable land gifted to a person, as a mark of recognition, which is usu. exempt from paying tax."]}], "ಕೊಡಿತನ": [{"type": "noun", "defs": ["the quality of being morally bad; wickedness."]}], "ಕೊಡಿಮರ": [{"type": "noun", "defs": ["a pillar or post in front of a temple, that is attached with a banner at the top."]}], "ಕೊಡಿಮರಹುಲ್ಲು": [{"type": "noun", "defs": ["the grass Eragrostiella bifaria of Poaceae family."]}], "ಕೊಡಿಯ": [{"type": "noun", "defs": ["a strong, physically powerful man."]}], "ಕೊಡಿಯಾಲ": [{"type": "noun", "defs": ["the deciduous tree Mitragyna parvifolia ( = Stephegyne parvifolia) of Rubiaceae family; water cadamba tree."]}], "ಕೊಡಿಯೆಲೆ": [{"type": "noun", "defs": ["a plant leaf that is very young; a new leaf."]}], "ಕೊಡಿಸು": [{"type": "verb", "defs": ["to cause to give, gift, pay, etc."]}], "ಕೊಡು": [{"type": "verb", "defs": ["to give - a) to turn over the possession or control of to someone; b) to hand or pass over into the trust or keeping of someone; c) (a farm land, a plant, etc.) to produce; to yield.", "to give to some philanthropic or religious cause; to contribute; to donate.", "to present a gift to.", "to give (a girl) in marriage to.", "to favour graciously; to vouchsafe.", "to grant as a fruit, consequence or result for one's effort.", "to give consent to.", "to pay what is due or owed.", "to pay a fine or penalty imposed.", "(said of animals) to bring forth; to give birth to.", "to hand or pass over in exchange for something else; sell (goods, services, etc.) for a price or pay (a price) for goods, services, etc.", "(math.) to separate into equal parts by a divisor; to divide.", "(fig.) to give a blow; to strike; to beat.", "to bring out (the meaning, intention, etc.).", "ಕೊಟ್ಟವನು ಕೋಡಂಗಿ, ಈಸಿಕೊಂಡವನು ಈರಭದ್ರ koṭṭavanu kōḍangi, iskoṇḍavanu īrabhadra (prov.) he is a fool who gave a loan to a cheat; ಕೊಟ್ಟ ಸಾಲ ಕೇಳದೆ ಹೋಯಿತು, ಮಾಡಿದ ಆರಂಬ ನೋಡದೆ ಹೋಯಿತು koṭṭa sāla kēḷade hōyitu, māḍida āramba nōḍade hōyitu (prov.) negligence spoils the fruit of one's labour; ಕೊಟ್ಟ ಹೆಣ್ಣು ಕುಲಕ್ಕೆ ಹೊರಗು koṭṭa heṇṇu kulakke horagu (prov.) the girl given in marriage to another family, belongs to that family; ಕೊಟ್ಟು ಕುದಿಯಬೇಡ, ಇಟ್ಟು ಹಂಗಿಸಬೇಡ koṭṭu kudiyabēḍa, iṭṭu hangisabēḍa (prov.) do not ashame or put in an embarrassment position a person beause of the help you extended once to him or her; when you help, do so with pure philanthropic or humanitarian purpose; ಕೊಟ್ಟು ಬರುವ ನಿಷ್ಠುರಕ್ಕಿಂತ ಕೊಡದೆ ಬರುವ ಮುನಿಸು ಲೇಸು koṭṭu baruva niṣṭhurakkinta koḍade baruva munisu lēsu (prov.) give not money lest you lose it with relation; ಕೊಡಲಾರದ ಹೆಣ್ಣಿಗೆ ತೆರ ಕೇಳು koḍalārada heṇṇige tera kēḷu (prov.) to put forth false reasons or conditions, if you do not wish to part with something; ಕೊಡುವವನ ಕಂಡರೆ ಬೇಡುವವರು ಬಹಳ koḍuvavan kaṇḍare bēḍuvavaru bahaḷa (prov.) gifts make beggars bold; ಕೊಟ್ಟು ಕೆಟ್ಟವರಿಲ್ಲ, ತಿರಿದು ಬದುಕಿದವರಿಲ್ಲ koṭṭu keṭṭavarilla, tiridu badukidavarilla (prov.) alms-giving never made a man poor, nor beggary rich; ದೇವರು ಕೊಟ್ಟರೂ ಪೂಜಾರಿ ಕೊಡ dēvaru koṭṭarū pūjāri koḍa (prov.) it is always the mean middlemen that deny the favour bestowed from above; ಕೊಟ್ಟ ಮನೆ koṭṭa mane the family to which a girl is given in marriage."]}, {"type": "noun", "defs": ["absence of heat or lack of normal warmth; a low temperature; coldness."]}], "ಕೊಡುಕೊಳೆ": [{"type": "noun", "defs": ["the act, practice of giving and taking between two persons or among many; exchange.", "the giving of a girl in marriage to another family and bringing another girl from that family in marriage; mutual marriages.", "the relation established by such marriages."]}], "ಕೊಡುಕೊಳ್ಳಿ": [{"type": "noun", "defs": ["= ಕೊಡುಕೊಳೆ."]}], "ಕೊಡುಕೊಳ್ಳು": [{"type": "verb", "defs": ["to give something in exchange for something else; to exchange goods or services.", "to give a girl in marriage to another family and bring one from the same family."]}], "ಕೊಡುಗಯ್": [{"type": "noun", "defs": ["= ಕೊಡುಗೈ."]}], "ಕೊಡುಗೂಸು": [{"type": "noun", "defs": ["a girl of age below seven years."]}], "ಕೊಡುಗೂಸುತನ": [{"type": "noun", "defs": ["the state or time of being a girl (of age below seven years).", "the state or fact of being a virgin; maidenhood; sexual chastity; virginity."]}], "ಕೊಡುಗೆ": [{"type": "noun", "defs": ["= ಕೊಡಿಗೆ."]}, {"type": "noun", "defs": ["the act of giving, passing over the possession of something to another.", "that which is given.", "something given to show friendship, affection, support, etc.; a present; a gift.", "something contributed, as money to a charity.", "the result of a personś talent, intelligence, hard work, etc. given in gen. to the society; a contribution."]}], "ಕೊಡುಗೈ": [{"type": "noun", "defs": ["a person who gives, donates liberally.", "the quality of such a person."]}], "ಕೊಡುಗೈತನ": [{"type": "noun", "defs": ["the quality of being generous; generosity; magnanimity in giving mercifully."]}], "ಕೊಡುಗೈವೀರ": [{"type": "noun", "defs": ["a very generous man, who gives liberally to others; a philanthropist."]}], "ಕೊಡುವಳಿ": [{"type": "noun", "defs": ["= ಕೊಡುಗೆ2 - 1 & 2; a giving of a girl in marriage to another family."]}], "ಕೊಡುವಾಯಿ": [{"type": "noun", "defs": ["(dial.) a kind of fish."]}], "ಕೊಡುಹ": [{"type": "noun", "defs": ["= ಕೊಡುಗೆ2 - 1 & 2."]}], "ಕೊಡೆ": [{"type": "verb", "defs": ["to make a dent, wound with a pointed weapon (as a knife, dagger, etc.).", "to make or shape by or as by cutting, chipping, hewing, etc; to carve.", "to grind into shreds or particles by scraping; to grate.", "to feel pain, grief; to suffer.", "to become abnormally lean; to become emaciated."]}, {"type": "noun", "defs": ["a screen or shade, usu. of cloth stretched over a folding radial frame, carried for protection against the rain or sun; an umbrella; a parasol.", "an umbrella like thing used as a symbol of royal dignity.", "a ring of light that seems to encircle the sun, moon or other luminous body, which is the result of the refraction of light through ice crystals in our atmosphere; a halo.", "ಅಲ್ಪನಿಗೆ ಐಶ್ವರ್ಯ ಬಂದರೆ ಅರ್ಧ ರಾತ್ರಿಯಲ್ಲಿ ಕೊಡೆ ಹಿಡಿಸಿಕೊಂಡ alpanige aiśvarya bandare ardha rātriyalli koḍe hiḍisikoṇḍa (prov.) a petty man displays his vanity ostensibly or in a vulgar manner."]}, {"type": "noun", "defs": ["= ಕೊಡುಗೆ2 -1."]}], "ಕೊಡೆಕಲ್ಲು": [{"type": "noun", "defs": ["a domelike hemispherical stone erected on he tomb of the dead (by the people of iron-age, in western ghat region of India."]}], "ಕೊಡೆಗಟ್ಟಿ": [{"type": "noun", "defs": ["the large sized tree Dalbergia latifolia of Papilionaceae family; (=ತೊಡೆಗಟ್ಟ?)."]}], "ಕೊಡಗೆದರು": [{"type": "verb", "defs": ["to open and spread the screen of an umbrella."]}], "ಕೊಡೆಜಾಲಿ": [{"type": "noun", "defs": ["the middle-sized, umbrella-shaped tree Acacia planifrons of Mimoseae family."]}], "ಕೊಡೆತ": [{"type": "noun", "defs": ["the pain caused by contraction of a muscle or muscles from chill.", "the pain of a sore."]}], "ಕೊಡೆನೆಗೆ": [{"type": "verb", "defs": ["to jump, leap; to rise; to go up."]}], "ಕೊಡೆಮರ": [{"type": "noun", "defs": ["the palm tree Corypha umbraculifera of Araaceae family; umbrella palm; fan palm."]}], "ಕೊಡೆಮುಳ್ಳುಜಾಲಿ": [{"type": "noun", "defs": ["= ಕೊಡೆಜಾಲಿ."]}], "ಕೊಡೆಯಾಲ": [{"type": "noun", "defs": ["the deciduous tree Anthocephalus cadamba of Rubiaceae family."]}], "ಕೊಡೆಯೆಲೆ": [{"type": "noun", "defs": ["a broad leaf of a plant, that resembles the opened screen of an umbrella."]}], "ಕೊಡೆಯೊಡೆಯ": [{"type": "noun", "defs": ["a king, who has an umbrella as a symbol of his royal dignity."]}], "ಕೊಡೆವರ": [{"type": "noun", "defs": ["any tree that resembles an open umbrella."]}], "ಕೊಡೆಶಿಲೀಂಧ್ರ": [{"type": "noun", "defs": ["a fungus of the subdivision Basidiomycotina (formerly classified under Basidiomycetes), which includes the mushrooms, rusts, smuts, etc.; basidiomycete."]}], "ಕೊಡೆಹುಲ್ಲು": [{"type": "noun", "defs": ["any of various rapidly growing fleshy fungi, typically having a stalk capped with an umbrellalike top; esp., a gill or pore fungus; a mushroom."]}], "ಕೊಡ್ಸೀಗೆ": [{"type": "noun", "defs": ["the tree Cleistanthus collinus of Euphorbiaceae family.", "the small sized, deciduous tree Holarrhena antidysentrica of Apocynaceae family.", "the small-sized deciduous tree Wrightia tinctoria ( = W. rothii) of Apocynaceae family."]}], "ಕೊಣ": [{"type": "noun", "defs": ["a body of still water formed naturally or by hollowing or embanking; a pond; a lake.", "a tub, now usu. a bathroom fixture to take a bath in; a bath-tub."]}], "ಕೊಣಕ": [{"type": "noun", "defs": ["a kind of bird."]}], "ಕೊಣಕಿಡು": [{"type": "verb", "defs": ["to play or frolic in a boisterous lively way; to make merry."]}], "ಕೊಣಕು": [{"type": "verb", "defs": ["to move up and down frequently."]}, {"type": "noun", "defs": ["the act of moving up and down frequently; a jumping as from joy."]}], "ಕೊಣಗು": [{"type": "noun", "defs": ["the horny part of the foot of a horse, antelope or any other ungulates; the hoof."]}], "ಕೊಣತ": [{"type": "noun", "defs": ["a bottle-shaped club of wood, metal, etc. swung in the hand for exercise; an Indian club."]}], "ಕೊಣದಪ್ಪಲೆ": [{"type": "noun", "defs": ["a round, kitchen vessel with a wide mouth."]}], "ಕೊಣಪ": [{"type": "noun", "defs": ["a man-eating monster or giant; a demon."]}], "ಕೊಣಪಿ": [{"type": "noun", "defs": ["a farm tool consisting of a free-swinging stick tied to the end of a long handle, used to thresh grain; a flail."]}], "ಕೊಣಬಿಗ": [{"type": "noun", "defs": ["a man unduly devoted to style, smartness, and fashion in dress and appearance; a dandy."]}], "ಕೊಣಬಿಗೆ": [{"type": "noun", "defs": ["a round wooden dish used to knead dough in."]}], "ಕೊಣಬು": [{"type": "noun", "defs": ["showy display of one's dress, style, smartness, appearance, etc."]}, {"type": "noun", "defs": ["a liquid food made using vegetables, to be mixed usu. with rice."]}], "ಕೊಣಬುಗಾಸು": [{"type": "verb", "defs": ["to cook a liquid food made using vegetables."]}], "ಕೊಣಬೆ": [{"type": "noun", "defs": ["a large pile of straw, hay, etc., esp. one neatly arranged, as in a conical form, for outdoor storage; a stack."]}], "ಕೊಣಮಿಗೆ": [{"type": "noun", "defs": ["= ಕೊಣಬಿಗೆ."]}], "ಕೊಣಲು": [{"type": "noun", "defs": ["a bent or curving part, as of a road."]}], "ಕೊಣವಿಗೆ": [{"type": "noun", "defs": ["= ಕೊಣಬಿಗೆ."]}], "ಕೊಣಸು": [{"type": "noun", "defs": ["a young deer or antelope."]}, {"type": "noun", "defs": ["any of the series of rings or loops making up a chain; a link.", "a metal ornament tied round the legs of cow or oxen.", "a necklace made of several links; a chain."]}], "ಕೊಣಸುಮಱಿ": [{"type": "noun", "defs": ["= ಕೊಣಸು1."]}], "ಕೊಣು": [{"type": "verb", "defs": ["to take; to receive in one's hand; to accept."]}], "ಕೊತಂಬರಿ": [{"type": "noun", "defs": ["= ಕೊತ್ತುಂಬರಿ."]}], "ಕೊತಕೊತ": [{"type": "noun", "defs": ["an onomatopoeic term formed imitating the sound of bubbles bursting while a liquid is being boiled."]}], "ಕೊತಕೊತನೆ": [{"type": "adverb", "defs": ["(said of boiling liquid) with a bubbling sound.", "(fig.) bursting from wrath."]}], "ಕೊತಗುಡು": [{"type": "verb", "defs": ["to boil with bubbling sound."]}], "ಕೊತಮರಿ": [{"type": "noun", "defs": ["= ಕೊತ್ತುಂಬರಿ."]}], "ಕೊತವಾಲ": [{"type": "noun", "defs": ["a man guarding a fort; a fort-watchman.", "an officer in charge of guarding a town."]}], "ಕೊತುಂಬರಿ": [{"type": "noun", "defs": ["= ಕೊತ್ತುಂಬರಿ."]}], "ಕೊತ್ತಂಬರಿ": [{"type": "noun", "defs": ["= ಕೊತ್ತುಂಬರಿ."]}], "ಕೊತ್ತಣ": [{"type": "noun", "defs": ["= ಕೊತ್ತಳ1."]}], "ಕೊತ್ತಣಿ": [{"type": "noun", "defs": ["= ಕೊತ್ತೞಿ."]}], "ಕೊತ್ತನಗೊರಜಿ": [{"type": "noun", "defs": ["a plant."]}], "ಕೊತ್ತಮಲ್ಲಿ": [{"type": "noun", "defs": ["= ಕೊತ್ತುಂಬರಿ."]}], "ಕೊತ್ತರಿ": [{"type": "noun", "defs": ["= ಕೊತ್ತೞಿ - 1."]}], "ಕೊತ್ತಲ": [{"type": "noun", "defs": ["= ಕೊತ್ತಳ1."]}], "ಕೊತ್ತಲು": [{"type": "noun", "defs": ["= ಕೊತ್ತಳ1."]}], "ಕೊತ್ತವಾಲ": [{"type": "noun", "defs": ["= ಕೊತವಾಲ."]}], "ಕೊತ್ತಳ": [{"type": "noun", "defs": ["an earthwork or defensive wall; fortified rampart; a bulwark.", "a projection from a fortification, arranged to give a wider firing range; a bastion."]}, {"type": "noun", "defs": ["= ಕೊತ್ತಳಿ."]}], "ಕೊತ್ತಳದುಱುಬು": [{"type": "noun", "defs": ["a particular style of tying the hair with a projection upward or sideward."]}], "ಕೊತ್ತಳಿ": [{"type": "noun", "defs": ["an assemblage or flock of crows.", "an association of persons of different vocations."]}], "ಕೊತ್ತಳಿಕೆ": [{"type": "noun", "defs": ["(dial.) the long, woody part of coconut leaf."]}], "ಕೊತ್ತಳಿಗೆ": [{"type": "noun", "defs": ["= ಕೊತ್ತಳಿಕೆ."]}], "ಕೊತ್ತೞಿ": [{"type": "noun", "defs": ["= ಕೊತ್ತಳಿ."]}], "ಕೊತ್ತಿ": [{"type": "noun", "defs": ["the small, lithe, soft-furred animal, Felis cattus of Felidae family, domesticated since ancient times and often kept as a pet or for killing mice; a cat."]}, {"type": "noun", "defs": ["a small lever in a firearm, which when pressed back by the finger activates the firing mechanism; the trigger."]}], "ಕೊತ್ತಿಗಡ್ಡೆ": [{"type": "noun", "defs": ["a kind of plant.", "its tuberous root."]}], "ಕೊತ್ತಿಗೆಂಡೆ": [{"type": "noun", "defs": ["= ಕೊತ್ತಿಗಡ್ಡೆ."]}], "ಕೊತ್ತಿಗೆಡ್ಡೆ": [{"type": "noun", "defs": ["= ಕೊತ್ತಿಗಡ್ಡೆ."]}], "ಕೊತ್ತಿಬೀಜ": [{"type": "noun", "defs": ["the grass Coix lachryma-jobi of Poaceae family.", "its seed."]}], "ಕೊತ್ತಿಯಗೆಡ್ಡೆ": [{"type": "noun", "defs": ["= ಕೊತ್ತಿಗಡ್ಡೆ."]}], "ಕೊತ್ತು": [{"type": "verb", "defs": ["to break and turn up or remove (ground, etc.) with a spade or other tool or with hands, claws, snout, etc.; to dig.", "to cut into very small pieces; to chap; to mince."]}, {"type": "noun", "defs": ["a cluster of fruits or flowers; a bunch."]}], "ಕೊತ್ತುಂಬರಿ": [{"type": "noun", "defs": ["the annual herb Coriandrum sativum of Umbellifarae family; coriander.", "its strong-smelling, seed-like fruit, used in flavouring food and liqueurs; coriander seed."]}], "ಕೊತ್ತುಂಬುರಿ": [{"type": "noun", "defs": ["= ಕೊತ್ತುಂಬರಿ."]}], "ಕೊತ್ತುಮರಿ": [{"type": "noun", "defs": ["= ಕೊತ್ತುಂಬರಿ."]}], "ಕೊತ್ತುಮುರಿ": [{"type": "noun", "defs": ["= ಕೊತ್ತುಂಬರಿ."]}], "ಕೊತ್ತುರು": [{"type": "noun", "defs": ["a woody plant having many stems branching out low instead of one main stem or trunk; shrub; a bush."]}], "ಕೊತ್ಥಳಿ": [{"type": "noun", "defs": ["= ಕೊತ್ತಳಿ."]}], "ಕೊತ್ವಾಲ್": [{"type": "noun", "defs": ["= ಕೊತವಾಲ."]}], "ಕೊತ್ವಾಲ": [{"type": "noun", "defs": ["= ಕೊತವಾಲ."]}], "ಕೊತ್ವಾಲಿ": [{"type": "noun", "defs": ["office of the officer in charge of guarding a town or where he conducts the meetings, enquiries, etc."]}], "ಕೊದಂಟಿ": [{"type": "noun", "defs": ["a thick wooden piece tied to the neck of cattle as to swing between the forelegs, to prevent running fast.", "a tool for pounding, usu. consisting of a metal head fastened across one end of a handle; a hammer."]}], "ಕೊದಲ": [{"type": "noun", "defs": ["a man who stammers while speaking."]}], "ಕೊದಲು": [{"type": "verb", "defs": ["to speak (habitually or on occasion from embarrassment etc.) with halting articulation, esp. with pauses or rapid repetitions of the same syllable; to stammer."]}, {"type": "noun", "defs": ["a tendency to stammer.", "an instance of stammering.", "soft and sweet speech."]}], "ಕೊದಳ್": [{"type": "verb", "defs": ["= ಕೊದಲು1."]}, {"type": "noun", "defs": ["= ಕೊದಲು2."]}], "ಕೊದಳಿ": [{"type": "noun", "defs": ["the skin of the sesame seeds.", "the dried plant of sesame."]}], "ಕೊದಿಲು": [{"type": "noun", "defs": ["(dial.) a liquid food made using vegetables, to be mixed usu. with rice."]}], "ಕೊದೆ": [{"type": "noun", "defs": ["a bifurcated or forked stick or wood.", "a section of the trunk or of a large branch of a felled tree; a log."]}, {"type": "noun", "defs": ["an intense sexual desire or excitement.", "ಕೊದೆ ಹೆಚ್ಚಿ ಕೊರಮನನ್ನು ತಬ್ಬಿದಳು kode hecci koramanannu tabbidaḷu (prov.) excessive sexual desire makes the person blind."]}], "ಕೊದ್ದು": [{"type": "verb", "defs": ["to press or hold firmly."]}], "ಕೊದ್ದೆಲ್": [{"type": "noun", "defs": ["= ಕೊದಿಲು."]}], "ಕೊನಕಾಱ": [{"type": "noun", "defs": ["a person who cuts the clusters or bunches of coconuts or areca nuts and brings it down."]}], "ಕೊನಕೋಲು": [{"type": "noun", "defs": ["the systematic and rhythmic pronunciation of the sounds of a percussion instrument used in Karnāṭaka music."]}], "ಕೊನಬ": [{"type": "noun", "defs": ["a man unduly devoted to style, smartness, and fashion in dress and appearance; a dandy.", "a rogue; a scamp; a scoundrel."]}], "ಕೊನಬು": [{"type": "noun", "defs": ["showy display of one's dress, style, smartness, appearance, etc.; the act of trifling or dallying; coquetry.", "a man unduly devoted to style, smartness, and fashion in dress and appearance; a dandy.", "the quality of a mischievous, scoundrel person.", "the state of being crowded."]}], "ಕೊನಬುಗಾತಿ": [{"type": "noun", "defs": ["a girl or woman whomerely from vanity tries to get meṇs attention and admiration."]}], "ಕೊನಬುಗಾರ": [{"type": "noun", "defs": ["= ಕೊನಬ - 1."]}], "ಕೊನಬುಗಾರಿಕೆ": [{"type": "noun", "defs": ["= ಕೊನಬು - 1."]}], "ಕೊನಬುಗಾರ್ತಿ": [{"type": "noun", "defs": ["= ಕೊನಬುಗಾತಿ."]}], "ಕೊನಬುಗಾಱ": [{"type": "noun", "defs": ["= ಕೊನಬ - 1."]}], "ಕೊನಬುಗೋವಳ": [{"type": "noun", "defs": ["Křṣṇa, the cowherd and darling of many."]}], "ಕೊನಬುತನ": [{"type": "noun", "defs": ["= ಕೊನಬು - 1."]}], "ಕೊನಬುದೋಱು": [{"type": "verb", "defs": ["to display one's dress, style, smartness, etc.; to behave as a coquette; to flirt; to trifle or dally."]}], "ಕೊನಬೆ": [{"type": "noun", "defs": ["a limb of a tree or shrub springing from the trunk or stem; a branch."]}], "ಕೊನಮರ": [{"type": "noun", "defs": ["a kind of tree."]}], "ಕೊನರ್": [{"type": "verb", "defs": ["= ಕೊನರು1."]}, {"type": "noun", "defs": ["= ಕೊನರು2."]}], "ಕೊನರಿಡಿಸು": [{"type": "verb", "defs": ["to cause to put forth shoots; to cause to sprout.", "to cause to develop, prosper."]}], "ಕೊನರಿಡು": [{"type": "verb", "defs": ["= ಕೊನರು1."]}], "ಕೊನರಿಸು": [{"type": "verb", "defs": ["= ಕೊನರಿಡಿಸು."]}], "ಕೊನರು": [{"type": "verb", "defs": ["to put out a sprout or sprouts; to develop new growths or shoots; to germinate; to shoot; to sprout.", "(fig.) to be elated from joy; to be cheerful.", "(fig.) to grow or develop; to prosper; to thrive or succeed."]}, {"type": "noun", "defs": ["a shoot of a plant; a new leaf; young leaf; germination."]}], "ಕೊನರೆಣಿಕೆ": [{"type": "noun", "defs": ["a thought, opinion, idea etc. that is different or of unusual type."]}], "ಕೊನರೇಱು": [{"type": "verb", "defs": ["= ಕೊನರು1."]}], "ಕೊನರೊಡೆ": [{"type": "verb", "defs": ["= ಕೊನರು1."]}], "ಕೊನರ್ಮೀಸೆ": [{"type": "noun", "defs": ["the moustaches of a teen-aged boy."]}], "ಕೊನರ್ವೆರ್ಚಿಸು": [{"type": "verb", "defs": ["to cause to sprout in plenty."]}], "ಕೊನರ್ವೆರ್ಚು": [{"type": "verb", "defs": ["(new growth as sprout, young leaves etc.) to grow well and in plenty."]}], "ಕೊನವು": [{"type": "noun", "defs": ["= ಕೊನಬು."]}], "ಕೊನಷ್ಟೈ": [{"type": "noun", "defs": ["a behaving like a monkey; apish behaviour.", "a crooked, perverse behaviour; perversion."]}], "ಕೊನಾಳಿಗೆ": [{"type": "noun", "defs": ["a tube like passage for liquids; a channel."]}], "ಕೊನೆ": [{"type": "verb", "defs": ["to cause to grow, sprout.", "to cause to thrive or prosper.", "to praise highly; to laud; to extol.", "to be delighted; to be highly pleased; to rejoice.", "to have or show an overweening opinion of oneself, one's position, etc.; to become arrogant or haughty.", "to sprout; to grow (oneself).", "to succeed; to achieve; to accomplish.", "to be satisfied; to fulfil expectations, wishes or desires of oneself.", "ಕೊನೆದಾಟ konedāṭa the act, practice or an instance of praising (another) highly; ಕೊನೆದಾಡು konedāḍu to praise highly (often unduly)."]}, {"type": "noun", "defs": ["the outermost or utmost point or part; an end; an extremity.", "the tip of a creeper, branch of a plant, etc. that has new and young leaves.", "a limb of a tree or shrub springing from the trunk or stem; a branch.", "the root, rhizome of a plant.", "an ending; finish; completion; conclusion.", "the joint or place where two walls, not being in a straight line, meet.", "ಕೊನೆ ಮೀರು kone mīru to go beyond one's reach, control or authority; ಕೊನೆಬಾಳು kone bāḷu to last long; ಕೊಟ್ಟ ಕೊನೆ koṭṭa kone the far end; the last point; 2. a remote or farthest place."]}, {"type": "noun", "defs": ["a cluster, bunch of flowers, fruits, nuts, etc."]}], "ಕೊನೆಕಾಱ": [{"type": "noun", "defs": ["a person who cuts the clusters or bunches of coconuts or areca nuts and brings it down."]}], "ಕೊನೆಗಣ್": [{"type": "noun", "defs": ["the end or outer corner of an eye."]}], "ಕೊನೆಗಣ್ಚು": [{"type": "verb", "defs": ["to look from the corner of an eye; to have a side glance."]}], "ಕೊನೆಗತ್ತಿ": [{"type": "noun", "defs": ["a hook, knife or sickle attached to a long staff, used to pluck flowers, fruits, twigs, etc. from plants above one's reach."]}], "ಕೊನೆಗರ್ಚು": [{"type": "verb", "defs": ["to catch, seize the end (of something)."]}], "ಕೊನೆಗಾಣ್": [{"type": "verb", "defs": ["= ಕೊನೆಗಾಣು."]}], "ಕೊನೆಗಾಣಿಸು": [{"type": "verb", "defs": ["to bring to an end; to complete; to succeed in doing; to finish; to accomplish.", "to cause the death; to kill; to destroy."]}], "ಕೊನೆಗಾಣು": [{"type": "verb", "defs": ["to see the end; to be finished, completed, accomplished.", "to die or be killed; to be destroyed."]}], "ಕೊನೆಗಾಲ": [{"type": "noun", "defs": ["the time of death; the period of destruction."]}], "ಕೊನೆಗೊಡಂಕೆ": [{"type": "noun", "defs": ["the lower part of the lobe of an ear."]}], "ಕೊನೆಗೊನರು": [{"type": "verb", "defs": ["to sprout - a) to shoot forth, to develop shoots, to germinate; b) to grow, like the shoots of plants."]}], "ಕೊನೆಗೊಳಿಸು": [{"type": "verb", "defs": ["= ಕೊನೆಗಾಣಿಸು."]}], "ಕೊನೆಗೊಳ್ಳು": [{"type": "verb", "defs": ["to come to an end; to terminate; to end.", "to be completed; to be accomplished."]}], "ಕೊನೆಗೋಲು": [{"type": "noun", "defs": ["a series of rhythmic sounds, uttered by a person, which resemble the beatings of a classical percussion instrument."]}], "ಕೊನೆದೋಱು": [{"type": "verb", "defs": ["to put forth a sprout or sprouts; to develop new growths or shoots; to germinate; to shoot; to sprout."]}], "ಕೊನೆನಾಲಿಗೆ": [{"type": "noun", "defs": ["the tip of the tongue.", "the nature of making harsh, biting or severe remark, criticism, etc."]}], "ಕೊನೆನೋಟ": [{"type": "noun", "defs": ["a looking from the outer corner of an eye; a side glance."]}], "ಕೊನೆಬಾಳು": [{"type": "verb", "defs": ["to live long; to be alive for a long or longer time."]}], "ಕೊನೆಬಿಕ್ಕು": [{"type": "noun", "defs": ["the hiccup one gets at the time of death."]}], "ಕೊನೆಮಟ್ಟಿ": [{"type": "noun", "defs": ["the long, woody part of coconut leaf."]}], "ಕೊನೆಮೀಸೆ": [{"type": "noun", "defs": ["either of the pointed extremities of a moustache.", "the moustaches of a boy in his teen-age."]}], "ಕೊನೆಮುಟ್ಟ": [{"type": "adverb", "defs": ["till the end, final stage or point."]}], "ಕೊನೆಮುಟ್ಟಿಸು": [{"type": "verb", "defs": ["to bring to an end; to complete; to succeed in doing; to finish; to accomplish."]}], "ಕೊನೆಮುಟ್ಟು": [{"type": "verb", "defs": ["to come to or reach an end; to come to a final state.", "to be ended; to be finished; to be accomplished."]}], "ಕೊನೆಮುಳ್": [{"type": "noun", "defs": ["the tip of a thorn."]}], "ಕೊನೆಯಚ್ಚು": [{"type": "noun", "defs": ["that which is printed in a newspaper, at the final stage of its printing; latest news."]}], "ಕೊನೆಯುಸಿರು": [{"type": "noun", "defs": ["the last breath; the final moment of one's life.", "ಕೊನೆಯುಸಿರೆಳೆ koneyusireḷe to breathe one's last; to die."]}], "ಕೊನೆವರಿ": [{"type": "verb", "defs": ["to put forth or produce shoots, new leaf or leaves, etc.; to shoot forth, 2) to grow, like the shoots of plants; to develop; to prosper; to improve in status.", "to come to an end or final state; to end."]}], "ಕೊನೆವಲ್": [{"type": "noun", "defs": ["the end of a tooth.", "a sharp-pointed tooth on either side of the upper jaw and lower jaw, between the incisors and the bicuspids, having a long single root; a canine tooth."]}], "ಕೊನೆವಲ್ಲ": [{"type": "noun", "defs": ["a man having a sharp- pointed tooth on both sides of the upper jaw and lower jaw between the incisors and the bicuspids."]}], "ಕೊನೆವಾಡು": [{"type": "noun", "defs": ["the song sung at the end."]}], "ಕೊನೆವಾಲ": [{"type": "noun", "defs": ["the tip of a tail."]}], "ಕೊನೆವಾಸೆ": [{"type": "noun", "defs": ["the tip of the thin line of hair running from the breast down to the lower abdomen."]}], "ಕೊನೆವಾಳೆ": [{"type": "noun", "defs": ["a variety of paddy."]}], "ಕೊನೆವುಗುರ್": [{"type": "noun", "defs": ["the tip of one's finger nail."]}], "ಕೊನೆವೆರಲು": [{"type": "noun", "defs": ["= ಕೊನೆವೆರಳು."]}], "ಕೊನೆವೆರಳ್": [{"type": "noun", "defs": ["= ಕೊನೆವೆರಳು."]}], "ಕೊನೆವೆರಳು": [{"type": "noun", "defs": ["the tip of one's finger."]}], "ಕೊನೆವೆರ್ಚು": [{"type": "noun", "defs": ["(said of a plant) the act, fact of spreading the branches, creepers etc.", "development, spread of any thing."]}, {"type": "verb", "defs": ["to put forth or produce shoots, new leaf or leave, etc.; to shoot forth, 2) to grow, like the shoots of plants; to develop; to prosper; to improve in status."]}], "ಕೊನೆಸಾಗು": [{"type": "verb", "defs": ["to go to the final point or end.", "to be finished, accomplished."]}], "ಕೊನೆಸಾರ್": [{"type": "verb", "defs": ["= ಕೊನೆಸಾಗು."]}], "ಕೊನೆಸೊಕ್ಕು": [{"type": "verb", "defs": ["to become arrogant and be determined not to follow advice, but to do as one pleases."]}], "ಕೊನೆಹಲ್ಲು": [{"type": "noun", "defs": ["= ಕೊನೆವಲ್."]}], "ಕೊನೆಹಾಳೆ": [{"type": "noun", "defs": ["the sheath of the coconut flower."]}], "ಕೊನ್ನ": [{"type": "noun", "defs": ["a person who sins or has sinned; a sinner."]}], "ಕೊನ್ನಾರ": [{"type": "noun", "defs": ["a recess or hollow in a wall."]}, {"type": "noun", "defs": ["a deep, narrow ditch; a trench."]}], "ಕೊನ್ನಾರಿ": [{"type": "noun", "defs": ["the grass Cyperus rotundus ( = C. hexastachyus) of Cyperaceae family; sedge."]}], "ಕೊನ್ನಾರಿಗೆಡ್ಡೆ": [{"type": "noun", "defs": ["= ಕೊನ್ನಾರಿ."]}], "ಕೊಪರಿ": [{"type": "noun", "defs": ["= ಕೊಬ್ಬರಿ2."]}], "ಕೊಪಲ": [{"type": "noun", "defs": ["= ಕೊಪ್ಪಲು1."]}], "ಕೊಪ್ಪ": [{"type": "noun", "defs": ["a very small village; a hamlet."]}], "ಕೊಪ್ಪರ": [{"type": "noun", "defs": ["the joint between the forearm and the upper arm; the elbow.", "the joint between the thigh and the lower leg in humans; the knee.", "a particular hold in wrestling.", "a stroke, blow."]}, {"type": "noun", "defs": ["a big, metal boiler (usu. with rings for handles; a cauldron."]}, {"type": "noun", "defs": ["a man guilty or capable of great wickedness; a villain."]}], "ಕೊಪ್ಪರಿ": [{"type": "noun", "defs": ["= ಕೊಬ್ಬರಿ2."]}], "ಕೊಪ್ಪರಿಕೆ": [{"type": "noun", "defs": ["a large deep bowl-shaped vessel for boiling over an open fire; a cauldron."]}], "ಕೊಪ್ಪರಿಗೆ": [{"type": "noun", "defs": ["= ಕೊಪ್ಪರಿಕೆ."]}], "ಕೊಪ್ಪರಿಸು": [{"type": "verb", "defs": ["to strike bluntly, esp. with a closed fist.", "to prod or poke with a blunt object.", "to become excessive, unlimited."]}, {"type": "verb", "defs": ["to move suddenly and rapidly; to jump upward or forward; to spring.", "to cover from all or almost all sides.", "to raise and suddenly bang on the ground.", "to fall down; to tumble down; to collapse."]}], "ಕೊಪ್ಪಲ್": [{"type": "noun", "defs": ["= ಕೊಪ್ಪಲು1."]}, {"type": "noun", "defs": ["= ಕೊಪ್ಪು5."]}], "ಕೊಪ್ಪಲು": [{"type": "noun", "defs": ["a collection of things lying haphazardly one on another; a pile; a heap.", "a very small village; a hamlet.", "a small wood or group of trees.", "a small, crude or humble house; a hut."]}, {"type": "noun", "defs": ["= ಕೊಪ್ಪು5."]}], "ಕೊಪ್ಪಳ": [{"type": "noun", "defs": ["= ಕೊಪ್ಪಲು1; 5) (dial.) a garden plot; a seed bed."]}], "ಕೊಪ್ಪಾರಿ": [{"type": "noun", "defs": ["= ಕೊಪ್ಪು2."]}], "ಕೊಪ್ಪು": [{"type": "noun", "defs": ["the notched extremity of a bow.", "(gen.) the extreme end of anything."]}, {"type": "noun", "defs": ["a ear-ornament worn by women at the top of the helix.", "a kind of necklace."]}, {"type": "noun", "defs": ["a knot or coil of hair worn by women at the top of the head; a chignon.", "an ornamental metal plate worn by women on this."]}, {"type": "noun", "defs": ["decoration; embellishment.", "beauty; grace; attractiveness; charm."]}, {"type": "noun", "defs": ["a deep, wide pit for the capture of wild elephants."]}], "ಕೊಪ್ಪೆ": [{"type": "noun", "defs": ["a covering for the head and back, made of straw, gunny bag or blanket, used as a protection for the head and back against rain; a kind of hood."]}], "ಕೊಬರಿ": [{"type": "noun", "defs": ["= ಕೊಬ್ಬರಿ2."]}], "ಕೊಬಳು": [{"type": "noun", "defs": ["a small, crude house with two thatched roofs slanting on either sides.", "(dial.) the summit of a roof."]}], "ಕೊಬಿರಿ": [{"type": "noun", "defs": ["= ಕೊಬ್ಬರಿ2."]}], "ಕೊಬೆ": [{"type": "noun", "defs": ["the top portion of a palm tree."]}], "ಕೊಬ್ಬಟ್ಟು": [{"type": "noun", "defs": ["the husk or bran of rice, separated by pounding."]}], "ಕೊಬ್ಬರಿ": [{"type": "verb", "defs": ["to rush against with rash determination."]}, {"type": "noun", "defs": ["dried coconut kernel, from which oil is obtained.", "ಕೊಬ್ಬರಿ ತುಪ್ಪ kobbari tuppa = ಕೊಬ್ಬರಿಯೆಣ್ಣೆ; ಕೊಬ್ಬರಿ ಬಟ್ಟಲು kobbari battalu the half of the dried coconut kernel; ಕೊಬ್ಬರಿಯೆಣ್ಣೆ kobbariyeṇṇe oil obtained from the dried meat of coconuts, used for nourishing hair, making soap, as an edible fat, etc.; coconut oil; ಕೊಬ್ಬರಿ ಹಿಂಡಿ kobbari hiṇḍi the part of dried coconut left after the oil has been extracted; coconut-residue."]}], "ಕೊಬ್ಬಾಟ": [{"type": "noun", "defs": ["a behaving in an arrogant, overbearing manner; imperiousness."]}], "ಕೊಬ್ಬಿಗ": [{"type": "noun", "defs": ["an arrogant, haughty, imperious man."]}], "ಕೊಬ್ಬಿಲ": [{"type": "noun", "defs": ["a man lacking refinement, elegance, sophistication; a rustic fellow."]}], "ಕೊಬ್ಬಿಸು": [{"type": "verb", "defs": ["to cause to grow opulently; to make fat; to fatten.", "to grow opulently; to become fat."]}], "ಕೊಬ್ಬು": [{"type": "verb", "defs": ["to become more in number, increase.", "to become bigger in size; to become fat; to fatten or develop (oneself).", "to be excited (from joy, success, etc.).", "to become arrogant, proud or insolent, overbearing.", "ಕೊಬ್ಬು ಇಳಿಸು kobbu iḷisu to bring down another's undue pride, arrogance etc."]}, {"type": "noun", "defs": ["an increase; a growth; opulence.", "any of various mixtures of solid or semisolid triglycerides which are the chief components adipose animal tissue or of many seeds of plants, used in cooking and inthe manufacture of soaps; fat.", "the fact or quality of being arrogant; arrogance; overbearing pride.", "ಕೊಬ್ಬಿದ ಕೋಣಕ್ಕೆ ಕೊರಡೇ ಮದ್ದು kobbida kōṇakke koraḍē maddu (prov.) the more arrogant a man is, the more ruthless he be dealt with."]}], "ಕೊಬ್ಬುಜವ್ವನ": [{"type": "noun", "defs": ["the stage of life just before attaining full maturity; prime youth."]}], "ಕೊಬ್ಬುಜವ್ವನೆ": [{"type": "noun", "defs": ["a youthful woman."]}], "ಕೊಬ್ಬುದೆಕ್ಕೆ": [{"type": "noun", "defs": ["a heap of fat materials or tallow."]}], "ಕೊಬ್ಬುಳಿ": [{"type": "noun", "defs": ["= ಕೊಬ್ಬಿಗ."]}], "ಕೊಬ್ಬೇರು": [{"type": "verb", "defs": ["to become more corpulent, fatty.", "to become rough, coarse or arrogant.", "(fat in one's body) to become more.", "(one's arrogance) to become more evident."]}], "ಕೊಮ": [{"type": "noun", "defs": ["an elevated place; a mount; acclivity."]}], "ಕೊಮಟಿ": [{"type": "noun", "defs": ["a man belonging to a caste the main profession of the members of which is trading and business.", "(fig.) a stingy man.", "(fig.) a cheat; a deceiver."]}], "ಕೊಮಟಿಗ": [{"type": "noun", "defs": ["= ಕೊಮಟಿ."]}], "ಕೊಮರ": [{"type": "noun", "defs": ["a boy or man as related to either or both of his parents; a male descendant; a son.", "a young man.", "Śaṇmukha, son of Śiva."]}], "ಕೊಮರಕ": [{"type": "noun", "defs": ["a kind of plant."]}], "ಕೊಮರಿ": [{"type": "noun", "defs": ["a girl or woman as related to either or both of her parents; a female descendant; a daughter.", "a girl woman who has never had sexual intercourse; a virgin."]}], "ಕೊಮರಿಕೆ": [{"type": "noun", "defs": ["the plant Averrhoa carambola of oxalidaceae family.", "its edible fruit."]}], "ಕೊಮಾರ": [{"type": "noun", "defs": ["= ಕೊಮರ."]}, {"type": "noun", "defs": ["a flat piece of wood, often carved, placed in between a pillar and the beam of a house."]}], "ಕೊಮಾರತಿ": [{"type": "noun", "defs": ["= ಕೊಮರಿ.", "a girl before the age of puberty."]}], "ಕೊಮಾರತ್ತಿ": [{"type": "noun", "defs": ["= ಕೊಮಾರತಿ."]}], "ಕೊಮಾರಪೈಕ": [{"type": "noun", "defs": ["a sub-sect among those whose family-profession is drawing toddy from palm trees."]}], "ಕೊಮೆ": [{"type": "verb", "defs": ["to give off smoke or a smokelike substance.", "(fig.) (anger, jealousy, intolerance, etc.) to come to surface slowly or to be expressed indirectly."]}, {"type": "verb", "defs": ["to achieve; to succeed; to be successful."]}, {"type": "noun", "defs": ["the plant Desmodium umbellatum of Papilionaceae family."]}], "ಕೊಮ್ಮೆ": [{"type": "noun", "defs": ["a big container of earthenware or made of bamboo-splits, used for storing grain.", "(fig.) a fat and stout woman; a woman whois wide in the hips."]}, {"type": "noun", "defs": ["the plant Boerhaavia diffusa ( = B. procumbens, - B. repens) of Nyctaginaceae family.", "the climber Caesalpinia mimosoides of Caesalpiniaceae family.", "name of a clan."]}, {"type": "noun", "defs": ["= ಕೊಬ್ಬು2."]}], "ಕೊಮ್ಮೊ": [{"type": "noun", "defs": ["the plant Trianthema portulacastrum ( = T. monogyna, = T. obcordata) of Aizoaceae family."]}], "ಕೊಯ್": [{"type": "verb", "defs": ["to penetrate or wound with a sharp-edged instrument.", "to divide with a knife etc. and make into pieces.", "to pull out (as flowers, fruits, etc. from a plant); to pluck.", "(sarc.) to perform on or practice a violin."]}], "ಕೊಯಕ": [{"type": "noun", "defs": ["the act or an instance of cheating.", "a ridiculing; derision; a looking down.", "a cheat; a deceiver.", "one who derides another.", "a person or thing that is derided."]}], "ಕೊಯತ": [{"type": "noun", "defs": ["= ಕೊಯ್ತ."]}], "ಕೊಯಲಾಳಿ": [{"type": "noun", "defs": ["= ಕೊಯ್ಲಾಳಿ."]}], "ಕೊಯಲು": [{"type": "noun", "defs": ["= ಕೊಯ್ಲು."]}], "ಕೊಯಿ": [{"type": "verb", "defs": ["= ಕೊಯ್."]}], "ಕೊಯಿಕ": [{"type": "noun", "defs": ["= ಕೊಯ್ಕ2."]}], "ಕೊಯಿಕತನ": [{"type": "noun", "defs": ["= ಕೊಯ್ಕತನ."]}], "ಕೊಯಿಕೀರೆ": [{"type": "noun", "defs": ["name of various plants of Amaranthaceae family used as green vegetable."]}], "ಕೊಯಿಕೆ": [{"type": "noun", "defs": ["= ಕೊಯ್ತ."]}], "ಕೊಯೊಗೀರೆ": [{"type": "noun", "defs": ["= ಕೊಯಿಕೀರೆ."]}], "ಕೊಯಿಗುಱಿ": [{"type": "noun", "defs": ["= ಕೊಂiÀiು್ಗುಱಿ."]}], "ಕೊಯಿಗೆ": [{"type": "noun", "defs": ["= ಕೊಯ್ತ."]}], "ಕೊಯಿತ": [{"type": "noun", "defs": ["= ಕೊಯ್ತ."]}], "ಕೊಯಿಲ್": [{"type": "noun", "defs": ["= ಕೊಯ್ಲು."]}], "ಕೊಯಿಲಾಳಿ": [{"type": "noun", "defs": ["= ಕೊಯ್ಲಾಳಿ."]}], "ಕೊಯಿಲಾಳು": [{"type": "noun", "defs": ["= ಕೊಯ್ಲಾಳಿ."]}]}