{"ದೈತ್ಯತೆ": [{"type": "noun", "defs": ["the quality, condition of being a daemon.", "the quality or state of being awesomely gigantic; gigantism; hugeness."]}], "ದೈತ್ಯೆ": [{"type": "noun", "defs": ["(myth.) a female daemon.", "a kind of vegetable perfume."]}], "ದೈನಂದಿನ": [{"type": "adjective", "defs": ["daily - a) done, happening, published, required, etc. every day; b) calculated by the day."]}], "ದೈನಾಸ": [{"type": "noun", "defs": ["= ದೈನ್ಯ - 1.", "the act of begging earnestly or imploringly."]}], "ದೈನಾಸಪಡು": [{"type": "verb", "defs": ["to become pitiable; to become miserably humble."]}], "ದೈನಾಸಬಡು": [{"type": "verb", "defs": ["= ದೈನಾಸಪಡು."]}], "ದೈನಿಕ": [{"type": "noun", "defs": ["occurring, happening, made each day; daily; diurnal."]}, {"type": "noun", "defs": ["a newspaper published each day; a daily."]}], "ದೈನ್ಯ": [{"type": "noun", "defs": ["the condition of great wretchedness, suffering, helplessness, etc. and which is pitiable; misery.", "a man in such a condition.", "a man who is cheated or betrayed by another.", "(dance.) gloominess as expressed with a dull-face, (considered as a minor sentiment)."]}], "ದೈನ್ಯಂಬಡು": [{"type": "verb", "defs": ["to become pitiable; to become miserably humble.", "to request or beg imploringly."]}], "ದೈನ್ಯಭಾವ": [{"type": "noun", "defs": ["= ದೈನ್ಯ - 1.", "intense emotional suffering; grief; sadness."]}], "ದೈನ್ಯವಡು": [{"type": "verb", "defs": ["= ದೈನ್ಯಂಬಡು."]}], "ದೈನ್ಯವದನ": [{"type": "noun", "defs": ["a gloomy face expressing one's wretched condition.", "a man in a pitiable, miserable condition."]}], "ದೈನ್ಯವದನೆ": [{"type": "noun", "defs": ["a woman in a pitiable, miserable condition."]}], "ದೈನ್ಯವೃತ್ತಿ": [{"type": "noun", "defs": ["= ದೈನ್ಯ - 1."]}], "ದೈಘ್ರ್ಯ": [{"type": "noun", "defs": ["measurement of anything from end to end; length.", "measurement of the height of anything; tallness.", "the space or degree to which a thing extends; the area occupied by something; extent."]}], "ದೈವ": [{"type": "adjective", "defs": ["belonging to or coming from the gods; divine; celestial; godly."]}, {"type": "noun", "defs": ["the God or any god.", "any minor deity.", "one's master, lord or employer.", "the good or favourable effect of virtuous deeds of one's previous lives, being enjoyed in the present life.", "the supposed disembodied spirit of a dead person, believed to cause evil to human beings; a ghost; a devil.", "(dial.) a group of elders of a clan.", "much richness; wealth.", "ದೈವದ ಕೊಡಿ daivada koḍi a banner of a deity."]}], "ದೈವಕಾರ್ತಿ": [{"type": "noun", "defs": ["a woman supposedly having supernatural power by a compact with the devil or evil spirits; a sorceress; a witch."]}], "ದೈವಕಾಱ": [{"type": "noun", "defs": ["a man supposedly having supernatural power by a compact with the devil or evil spirits; a sorcerer."]}], "ದೈವಕೃತ": [{"type": "adjective", "defs": ["done, guided, bestowed by God.", "fortunate; lucky; blessed."]}], "ದೈವಕೃತಿ": [{"type": "noun", "defs": ["an act of god; a natural happening.", "a deed worthy of being lauded by gods."]}], "ದೈವಗತಿ": [{"type": "noun", "defs": ["a course of action that is caused, controlled or regulated by a god or gods or that which is beyond the control of human beings."]}], "ದೈವಗೇಡಿ": [{"type": "noun", "defs": ["a man on whom a god is or gods are not favourably inclined or disposed; he who has lost the grace of a god or gods."]}], "ದೈವಘಟನೆ": [{"type": "noun", "defs": ["= ದೈವಕೃತಿ - 1."]}], "ದೈವಜ್ಞ": [{"type": "noun", "defs": ["a man who professes to foretell events in the lives of other people; a fortune-teller; an astrologer."]}], "ದೈವಜ್ಞೆ": [{"type": "noun", "defs": ["a woman who professes to foretell events in other people's lives; a fortune-teller; an astrologer."]}], "ದೈವತ": [{"type": "adjective", "defs": ["of, relating to, caused by a god or gods; divine."]}, {"type": "noun", "defs": ["a god; a deity."]}], "ದೈವದತ್ತ": [{"type": "noun", "defs": ["that which is given, bestowed by a god or gods."]}], "ದೈವದುರ್ವಿಪಾಕ": [{"type": "noun", "defs": ["an unfortunate incident or happening (supposed to have been caused by the loss of goḍs grace)."]}], "ದೈವದೂರ": [{"type": "noun", "defs": ["= ದೈವಗೇಡಿ."]}], "ದೈವದ್ರೋಹ": [{"type": "noun", "defs": ["an offence against a god or gods or against anything related to gods (as temple, etc.)."]}], "ದೈವದ್ರೋಹಿ": [{"type": "noun", "defs": ["a man who has committed an offence against God or gods or misappropriated temple money, property, etc."]}], "ದೈವಪರ": [{"type": "noun", "defs": ["a man who believes in the existence of, and submits himself to, gods; theist.", "a man who strongly banks on luck (rather than human effort)."]}], "ದೈವಪುರುಷ": [{"type": "noun", "defs": ["a man having divine qualities, considered as a god-man."]}], "ದೈವಪ್ರೇರಣೆ": [{"type": "noun", "defs": ["the act or an instance of being supposedly urged, guided, directed by God into an action."]}], "ದೈವಬಲ": [{"type": "noun", "defs": ["physical, moral or psychological strength supposed to have been received or made stronger by Goḍs favour."]}], "ದೈವಬಳ": [{"type": "noun", "defs": ["= ದೈವಬಲ."]}], "ದೈವಭಕ್ತಿ": [{"type": "noun", "defs": ["the fact, quality or state of being devoted to god; devotion."]}], "ದೈವಮಾಯೆ": [{"type": "noun", "defs": ["the sport of God."]}], "ದೈವಯಂತ್ರ": [{"type": "noun", "defs": ["the control, regulation, check of a god or gods on the events, circumstance, etc. ."]}], "ದೈವಯಜ್ಞ": [{"type": "noun", "defs": ["any sacrifice performed to propitiate the God or gods."]}], "ದೈವಯೋಗ": [{"type": "noun", "defs": ["a lucky coincidence (considered as caused by the grace of the God)."]}], "ದೈವರೇಷೆ": [{"type": "noun", "defs": ["the seemingly favourably chance happening of events; good-luck; good-fortune."]}], "ದೈವದ್ರ್ಧಿ": [{"type": "noun", "defs": ["boundless grace of the God; a lot of luck."]}], "ದೈವವಂತ": [{"type": "noun", "defs": ["a lucky or wealthy man."]}], "ದೈವವಶ": [{"type": "noun", "defs": ["good luck; good fortune; prosperity."]}], "ದೈವವಶಾತ್": [{"type": "adverb", "defs": ["by luck; luckily."]}], "ದೈವವಾಣಿ": [{"type": "noun", "defs": ["the voice of the god; the voice of one's conscience that urges to do right; moral judgement."]}], "ದೈವವಾದ": [{"type": "noun", "defs": ["belief in the existence of God; theism."]}], "ದೈವವಿಡಂಬನೆ": [{"type": "noun", "defs": ["an unfortunate incident or happening (supposed to have been caused by the loss of goḍs grace)."]}], "ದೈವವಿದ": [{"type": "noun", "defs": ["= ದೈವಜ್ಞ."]}], "ದೈವವಿದೆ": [{"type": "noun", "defs": ["= ದೈವಜ್ಞೆ."]}], "ದೈವವಿಮುಖ": [{"type": "noun", "defs": ["= ದೈವಗೇಡಿ."]}], "ದೈವವಿಸೂತ್ರ": [{"type": "noun", "defs": ["the seemingly inevitable or necessary succession of events, the cause of which is ascribed to the will of God."]}], "ದೈವವಿಹೀನ": [{"type": "noun", "defs": ["an unfortunate man; a man who has lost goḍs grace."]}], "ದೈವವಿಹೀನೆ": [{"type": "noun", "defs": ["an unfortunate woman; a woman who has lost goḍs grace."]}], "ದೈವವ್ಯವಸಿತ": [{"type": "noun", "defs": ["= ದೈವವಿಸೂತ್ರ."]}], "ದೈವಶಾಲಿ": [{"type": "noun", "defs": ["a blessed, fortunate man."]}], "ದೈವಸಂಕಲ್ಪ": [{"type": "noun", "defs": ["the will of a god, which is the cause of all events, happenings and which cannot be avoided or changed by human effort."]}], "ದೈವಸಹಾಯ": [{"type": "noun", "defs": ["the grace or favourable disposition of the a god."]}], "ದೈವಸಾಕ್ಷಾತ್ಕಾರ": [{"type": "noun", "defs": ["the realisation of God in a physical form."]}], "ದೈವಸೂತ್ರ": [{"type": "noun", "defs": ["= ದೈವವಿಸೂತ್ರ."]}], "ದೈವಸೃಷ್ಟಿ": [{"type": "noun", "defs": ["that which is caused, created by the God."]}], "ದೈವಹೀನ": [{"type": "noun", "defs": ["= ದೈವವಿಹೀನ."]}], "ದೈವಹೀನೆ": [{"type": "noun", "defs": ["= ದೈವವಿಹೀನೆ."]}], "ದೈವಹೊಡಕ": [{"type": "noun", "defs": ["a man possessed by an evil spirit."]}], "ದೈವಹೊಡೆ": [{"type": "verb", "defs": ["(an evil spirit) to possess (a being)."]}], "ದೈವಾಧೀನ": [{"type": "noun", "defs": ["that which is under the control, command of the God (i.e. which cannot be avoided, changed by human effort).", "ದೈವಾಧೀನವಾಗು daivādhīnavāgu to die."]}], "ದೈವಾನ": [{"type": "noun", "defs": ["a man who has the grace, favour of the God; a fortunate or blessed man."]}], "ದೈವಾನುಕೂಲ": [{"type": "noun", "defs": ["= ದೈವಸಹಾಯ."]}], "ದೈವಾನುಕೂಲತೆ": [{"type": "noun", "defs": ["= ದೈವಸಹಾಯ."]}], "ದೈವಾನುಕೂಲ್ಯ": [{"type": "noun", "defs": ["= ದೈವಸಹಾಯ."]}], "ದೈವಾನುಗ್ರಹ": [{"type": "noun", "defs": ["God's grace."]}], "ದೈವಾಪರ": [{"type": "noun", "defs": ["a man who believes and trusts the God."]}], "ದೈವಾಪರೆ": [{"type": "noun", "defs": ["a woman who believes and trusts the God."]}], "ದೈವಾಯತ": [{"type": "noun", "defs": ["= ದೈವಾಧೀನ."]}], "ದೈವಾಯತ್ತ": [{"type": "noun", "defs": ["= ದೈವಾಧೀನ."]}], "ದೈವಿಕ": [{"type": "adjective", "defs": ["belonging to, coming from or bestowed by, the gods; divine; celestial; godly.", "got by chance or luck."]}, {"type": "noun", "defs": ["a divine power, virtue.", "an inevitable, often unfortunate, happening."]}], "ದೈವಿಕತೆ": [{"type": "noun", "defs": ["the quality or condition of being divine; divinity."]}], "ದೈವೀಕರಣ": [{"type": "noun", "defs": ["the act of exalting to the ranking of a god; deification."]}], "ದೈವೀಕೃಪೆ": [{"type": "noun", "defs": ["Goḍs grace."]}], "ದೈವೀಘಟನೆ": [{"type": "noun", "defs": ["an act of god, nature or providence; a divine action."]}], "ದೈವೀತ್ವ": [{"type": "noun", "defs": ["the condition of being or the quality a goddess; goddesshood."]}], "ದೈವೀಪ್ರವೃತ್ತಿ": [{"type": "noun", "defs": ["the manner, way in which the God acts.", "righteous, pious conduct, demeanour or deportment."]}], "ದೈವೀಪ್ರೇರಣೆ": [{"type": "noun", "defs": ["= ದೈವಪ್ರೇರಣೆ."]}], "ದೈವೀವಿರುದ್ಧ": [{"type": "adjective", "defs": ["that is offensive to the God or gods; that is against righteousness or piety."]}], "ದೈವೀಶಕ್ತಿ": [{"type": "noun", "defs": ["the power, strength or influence of the God or gods."]}], "ದೈವೀಸಂಪತ್ತು": [{"type": "noun", "defs": ["righteousness, virtuousness, godliness, that are considered as positive wealth."]}], "ದೈವೀಸ್ಫೂರ್ತಿ": [{"type": "noun", "defs": ["inspiration received from the God or deep meditation."]}], "ದೈವೇಚ್ಛೆ": [{"type": "noun", "defs": ["= ದೈವಸಂಕಲ್ಪ."]}], "ದೈವೋದಯ": [{"type": "noun", "defs": ["the dawn of a favourable period."]}], "ದೈವೋಪಹತ": [{"type": "adjective", "defs": ["struck by bad luck; unlucky."]}, {"type": "noun", "defs": ["an unlucky man."]}], "ದೈವೋಪಹತೆ": [{"type": "noun", "defs": ["an unlucky woman."]}], "ದೈಶಿಕ": [{"type": "adjective", "defs": ["of, pertaining to or occupying, space."]}, {"type": "noun", "defs": ["a manner, conduct, deportment etc. which is particular to a region or country."]}], "ದೈಹಿಕ": [{"type": "noun", "defs": ["of, pertaining to, born from or generated by the body; bodily."]}], "ದೈಹಿಕಶಿಕ್ಷಣ": [{"type": "noun", "defs": ["systematic instruction in physical exercise and in the care and hygiene of the human body, esp. a course in sports, gymnastics, athletics, etc.; physical education."]}], "ದೈಹಿಕಸುಖ": [{"type": "noun", "defs": ["bodily comfort.", "sensual enjoyment."]}], "ದೊಂಗರ": [{"type": "noun", "defs": ["= ದೊಗರು."]}], "ದೊಂಟೆ": [{"type": "noun", "defs": ["a thick piece of wood tied to the neck of a cow, ox, etc. with a rope to hinder motion or preventing it from running fast; a clog."]}], "ದೊಂಡಿ": [{"type": "noun", "defs": ["the bluish green sea-fish Clupea leigaster."]}], "ದೊಂಡುಳ": [{"type": "noun", "defs": ["the plant Physalis peruviana (= P. edulis) of Solanaceae family.", "its berry; cape gooseberry."]}], "ದೊಂಡೆ": [{"type": "noun", "defs": ["the condition of being tangled, interwoven in a disorderly manner.", "that which is so.", "that which is soft, shapeless (as soft mud from trampling)."]}, {"type": "noun", "defs": ["(mus.) a musical mode in Karnāṭaka system.", "sweet voice.", "the upper part of the passage leading from the mouth and nose to the stomach and lungs, including the pharynx and the upper larynx, trachea, and oesophagus; the throat."]}], "ದೊಂಡೆಗೆಸಱು": [{"type": "noun", "defs": ["wet mud softened by trampling."]}], "ದೊಂದಡಿ": [{"type": "noun", "defs": ["= ದೊಂದುಳಿ."]}], "ದೊಂದಣ": [{"type": "noun", "defs": ["= ದೊಂದುಳಿ."]}], "ದೊಂದಣಿ": [{"type": "noun", "defs": ["= ದೊಂದುಳಿ."]}], "ದೊಂದಿ": [{"type": "noun", "defs": ["= ದೊಂದೆ."]}], "ದೊಂದಿಮೀಸೆ": [{"type": "noun", "defs": ["disarranged, untidy or uncombed and untrimmed moustache."]}], "ದೊಂದುಳಿ": [{"type": "noun", "defs": ["a large number of persons, animals or things gathered together at a place; a group; a multitude.", "joy derived from being in a group of persons; mass enjoyment."]}], "ದೊಂದುಳಿಸು": [{"type": "verb", "defs": ["to come together in large number; to assemble.", "to make merry or enjoy the company of large number of persons."]}], "ದೊಂದೆ": [{"type": "noun", "defs": ["a bunch of cut stalks of grain, bound up in a bundle; a sheaf.", "a thick piece of resinous wood, dipped in tallow, flaming at one end; a lighted torch; a flambeau."]}], "ದೊಂಬ": [{"type": "noun", "defs": ["(masc.) a skilled performer of gymnastic feats, that requires skilful control of the body, as walking on a tightrope or swinging on a trapeze; an acrobat.", "a caste, members of which are generally engaged in acrobatics.", "ದೊಂಬರ ಕುಣಿತ dombara kuṇita artless, unskilled dancing; ದೊಂಬರ ಕೋಡಗ dombara kōḍaga (fig.) a person whose actions are prompted and controlled by another or others; a puppet; ದೊಂಬರಗಿತ್ತಿ dombaragitti a woman belonging to the caste of acrobats; ದೊಂಬರ ಲಾಗ dombara lāga the skilful tumbling of an acrobat.", "(fig.) all one's efforts (to achieve something) ದೊಂಬರಾಟ dombarāṭa a theatrical, sensational actions or course of an action, often hypocritical, done to impress others or gain some personal advantages."]}], "ದೊಂಬಿ": [{"type": "noun", "defs": ["a disorganised collection of persons; a crowd.", "a noisy and confused situation (esp. created by a crowd).", "an open, forcible or passive resistance to an authority, administration, etc.; a mutiny; a revolt.", "ದೊಂಬಿ ಎಬ್ಬಿಸು dombi ebbisu to cause a mutiny; to make other revolt; 2. to cause to ransack; ದೊಂಬಿ ಏಳು dombi ēḷu to revolt against 2. to ransack; to plunder; to pillage; ದೊಂಬಿಮಾಡು dombi māḍu = ದೊಂಬಿ ಏಳು; ದೊಂಬಿಯ ಜಗಳ dombiya jagaḷa = ದೊಂಬಿ ಜಗಳ."]}], "ದೊಂಬಿಗ": [{"type": "noun", "defs": ["= ದೊಂಬ 1.", "2.a man who creates uproar, disorderliness, rebellion in public.", "a man who attacks another violently."]}], "ದೊಂಬಿಗಾರ": [{"type": "noun", "defs": ["= ದೊಂಬಿಗ 2 & 3."]}], "ದೊಂಬಿಗೂಡು": [{"type": "verb", "defs": ["(a large number of persons) to assemble (in a disorderly manner)."]}], "ದೊಂಬಿಜಗಳ": [{"type": "noun", "defs": ["a street quarrel among a large number of persons."]}], "ದೊಂಬಿತಿ": [{"type": "noun", "defs": ["a woman belonging to the caste of acrobats."]}], "ದೊಂಬಿದಾಸ": [{"type": "noun", "defs": ["a male member of the caste the members of which are mainly engaged in wandering from place to place, singing folk songs, and enacting dramas."]}], "ದೊಂಬಿದುಳುಕು": [{"type": "noun", "defs": ["highly perturbed condition of water in a reservoir, tank, ocean etc."]}], "ದೊಂಬಿಯುದ್ಧ": [{"type": "noun", "defs": ["an attack by a large number of persons, conducted in a disorderly manner."]}], "ದೊಂಬಿಸಾಕ್ಷಿ": [{"type": "noun", "defs": ["a confused testimony or witness."]}], "ದೊಂಬೆ": [{"type": "noun", "defs": ["= ದೊಂಬಿ."]}], "ದೊಕ್ಕನೆ": [{"type": "adverb", "defs": ["with a heavy sound.", "immediately; suddenly."]}], "ದೊಕ್ಕರಿ": [{"type": "noun", "defs": ["a heavy, thrusting blow with the fist; a punch.", "a grip in wrestling, in which one holds and presses the neck between one's arm and the body, while striking his abdomen with both the legs alternatively."]}], "ದೊಕ್ಕರಿಗೊಳ್": [{"type": "verb", "defs": ["to be injured or collapse by punch or punches with another's fist.", "(in wrestling) to inflict heavy injuries by grappling one's opponent with a 'ದೊಕ್ಕರಿ' (see 'ದೊಕ್ಕರಿ - 2' above)."]}], "ದೊಕ್ಕರಿಸು": [{"type": "verb", "defs": ["= ದೊಕ್ಕರಿಗೊಳ್ - 2.", "to give a sharp thrust or blow to, with the fist or kick heavily with the foot.", "to squeeze wildly another persoṇs body (to render him injured, as in wrestling).", "to hold another's neck so as to shut off the breath."]}], "ದೊಕ್ಕೆ": [{"type": "noun", "defs": ["the physical structure, including the bones, flesh, and organs, of a person; the body.", "the abdomen; the belly.", "(fig.) the faculty in human beings that thinks, feels, etc.; the mind."]}], "ದೊಗರು": [{"type": "noun", "defs": ["a hollow place in the stem or a branch of a tree or a hollow in the ground.", "a depressed ground (where water gets stagnated); a pit."]}], "ದೊಗಲೆ": [{"type": "adjective", "defs": ["not fitting tightly; giving enough or more room; of oversize; loose."]}], "ದೊಗಳೆ": [{"type": "adjective", "defs": ["= ದೊಗಲೆ."]}], "ದೊಗೆ": [{"type": "verb", "defs": ["to make a hole or cavity or to take out the earth with the nails.", "to take out the serum from the ear with a finger-nail."]}, {"type": "noun", "defs": ["a hole or hollow made by digging with the nails."]}], "ದೊಗ್ಗ": [{"type": "noun", "defs": ["that which has the sharp, acid taste of lemon juice, vinegar, green fruit, etc.; a sour thing.", "a thick and sour porridge made using broken rice; a sour gruel."]}], "ದೊಗ್ಗಳೆ": [{"type": "noun", "defs": ["the potherb Amaranthus viridis of Amaranthaceae family."]}], "ದೊಗ್ಗಾಲಿಕ್ಕು": [{"type": "verb", "defs": ["to go down or rest on the knees (as in praying); to kneel.", "(fig.) to kneel before another in supplication; to make a humble request, by humiliating oneself."]}], "ದೊಗ್ಗಾಲು": [{"type": "noun", "defs": ["a standing or resting on one's knees; a kneeling."]}], "ದೊಗ್ಗಾಲು ಹಾಕು": [{"type": "verb", "defs": ["= ದೊಗ್ಗಾಲಿಕ್ಕು."]}], "ದೊಗ್ಗಾಲು ಸಲಾಂ": [{"type": "noun", "defs": ["a saluting by touching one's forehead with the tips of the right hand, standing on ones knees.", "(fig.) to bid farewell."]}], "ದೊಗ್ಗಾಲೂರು": [{"type": "verb", "defs": ["= ದೊಗ್ಗಾಲಿಕ್ಕು."]}], "ದೊಟ್ಟೆ": [{"type": "noun", "defs": ["(dial.) a device by which water is lifted from a well (usu. for irrigation purpose), operated manually or using bullocks."]}], "ದೊಠಾರ": [{"type": "noun", "defs": ["a courageous man (esp. a soldier).", "heavy scolding."]}], "ದೊಠಾರತನ": [{"type": "noun", "defs": ["courage; valour; bravery.", "the act or habit of scolding heavily."]}], "ದೊಠಾರಿಸು": [{"type": "verb", "defs": ["to exhibit one's valour; to fight bravely.", "to scold heavily."]}], "ದೊಡ್ಡ": [{"type": "adjective", "defs": ["big or bigger - a) taking up much space; bulky; b) enclosing much space; spacious; c) of great extent or amount.", "born or brought forth earlier than another or others; exceeding another in age; senior; older; elder.", "of longer standing or superior;", "ದೊಡ್ಡ ಕುದುರೆ ಚೇಷ್ಟೆ doḍḍa kudure cēṣṭe the manner of conducting or bearing oneself blindly following a wealthy man; the pretentious behaviour; ದೊಡ್ಡದು doḍḍadu that which is big, large or great; 2. large-heartedness; generosity; 3. that which is important, significant; 4. that which is difficult or impossible to do; ದೊಡ್ಡವನು doḍḍavanu a man exceeding another in age; an elder; 2. a rich, wealthy man; 3. a noble man; ದೊಡ್ಡದುಮಾಡು doḍḍadu māḍu to make (something) big or bigger; to enlarge; 2. to exaggerate; to overemphasise."]}], "ದೊಡ್ಡ ಅಂಚಿಹುಲ್ಲು": [{"type": "noun", "defs": ["the grass Aristida adscenscionis of Poaceae family.", "another kind of grass Themeda triandra of the same family."]}], "ದೊಡ್ಡ ಅಂಟುಪುರಲೆ": [{"type": "noun", "defs": ["the grass Setaria intermedia of Poaceae family."]}], "ದೊಡ್ಡ ಏಲಕ್ಕಿ": [{"type": "noun", "defs": ["the cardamom plant Amomum subulatum of Zingiberaceae family; large cardamom.", "its seed capsule or seeds."]}], "ದೊಡ್ಡಕಡಗ": [{"type": "noun", "defs": ["the tree Adina cordifolia of Rubiaceae family; yellow teak of Mysore."]}], "ದೊಡ್ಡಕಡವ": [{"type": "noun", "defs": ["a variety of Cadamba tree of Rubiaceae family."]}], "ದೊಡ್ಡಕರಂಬಳ": [{"type": "noun", "defs": ["the evergreen tree Dillenia indica of Dilleniaceae family, having dentate leaves, large fragrant flowers and fine-grained wood."]}], "ದೊಡ್ಡಕರುಳು": [{"type": "noun", "defs": ["the broad, shorter part of the intestines, comprising the caecum, colon, and rectum, that absorbs water from and eliminates the residues of digestion; the large intestine."]}], "ದೊಡ್ಡಕವಳಿ": [{"type": "noun", "defs": ["the plant Carissa carandas of Apocynaceae family."]}], "ದೊಡ್ಡಕಹಿಮೆಣಸು": [{"type": "noun", "defs": ["a kind of plant."]}], "ದೊಡ್ಡಕಳವಿ": [{"type": "noun", "defs": ["the ever green tree Averrhoa carambola of Oxalidaceae family.", "its berry; Chinese goose berry."]}], "ದೊಡ್ಡಕಳವಿಗೆ": [{"type": "noun", "defs": ["the leguminous twining shrub Clitoria ternatea of Papilionaceae family with blue flowers, the root of which is used as a dieretic and demulcent; butterfly-pea.", "its flower."]}], "ದೊಡ್ಡಕಳ್ಳಂಗಡಲೆ": [{"type": "noun", "defs": ["a variety of Indian abutilon plant of Malvaceae family."]}], "ದೊಡ್ಡಕಾಡುಮಲ್ಲಿಗೆ": [{"type": "noun", "defs": ["the jasmine plant Jasminum multiflorum (= J. pubescense) of Oleaceae family.", "its flower."]}], "ದೊಡ್ಡಕಾರೆ": [{"type": "noun", "defs": ["the plant Gardenia uliginosa (=Randia uliginosa) of Rubiaceae family.", "its fruit."]}], "ದೊಡ್ಡಕಾವಲಿ": [{"type": "noun", "defs": ["= ದೊಡ್ಡಕವಳಿ."]}], "ದೊಡ್ಡಕುಶೆ": [{"type": "noun", "defs": ["a kind of grass with long leaves."]}], "ದೊಡ್ಡಕೂವೆ": [{"type": "noun", "defs": ["the plant Curcuma leucorrhiza of Zingiberaceae family."]}], "ದೊಡ್ಡಕೊಟ್ಟೆ": [{"type": "noun", "defs": ["the plant Ziziphus xylopyrus of Rhamnaceae family; jujube."]}], "ದೊಡ್ಡಕ್ಕಿಹುಲ್ಲು": [{"type": "noun", "defs": ["the grass Digitaria longiflora of Poaceae family."]}], "ದೊಡ್ಡಕ್ಷರ": [{"type": "noun", "defs": ["the form of an alphabetical letter in the English language used to begin a sentence or proper name; a capital letter."]}], "ದೊಡ್ಡಖಚೋರ": [{"type": "noun", "defs": ["a kind of zedoary plant of Zingiberaceae family.", "the aromatic substance obtained from its rhizome."]}], "ದೊಡ್ಡಖರ್ಜೂರ": [{"type": "noun", "defs": ["a kind of wild date tree of Arecaceae family; ."]}], "ದೊಡ್ಡಗಟ್ಟು": [{"type": "noun", "defs": ["a large dam (across a river)."]}], "ದೊಡ್ಡಗರಿಕೆ": [{"type": "noun", "defs": ["the grass Eragrostis tenuifolia of Poaceae family."]}], "ದೊಡ್ಡಗಾದಾರಿ": [{"type": "noun", "defs": ["the plant Grangea maderaspatana of Asgteraceae family."]}], "ದೊಡ್ಡಗಿರಸ": [{"type": "noun", "defs": ["the tree Albizzia lebbeck of Mimosae family."]}], "ದೊಡ್ಡಗುಲಗಂಜಿ": [{"type": "noun", "defs": ["the large-sized, deciduous tree Adenanthera pavonia of Caesalpiniaceae family; red wood tree."]}], "ದೊಡ್ಡಗೂಗಿ": [{"type": "noun", "defs": ["= ದೊಡ್ಡಗೂಬೆ."]}], "ದೊಡ್ಡಗೂಗೆ": [{"type": "noun", "defs": ["= ದೊಡ್ಡಗೂಬೆ."]}], "ದೊಡ್ಡಗೂಬೆ": [{"type": "noun", "defs": ["the dark brown owl, Bubo bubo of Strigidae family with two erect feathers on the head resembling horns, saffron-coloured eyes, white brows, black hooked-beak, with dark and light brown wings, strong feathered-legs; Eurasian eagle-owl."]}], "ದೊಡ್ಡಗೋಣಿ": [{"type": "noun", "defs": ["the potherb Portulaca oleracea of Portulacaceae family; common Indian purslane."]}], "ದೊಡ್ಡಗೋರಂಟಿ": [{"type": "noun", "defs": ["= ದೊಡ್ಡಗೋರಂಟೆ."]}], "ದೊಡ್ಡಗೋರಂಟೆ": [{"type": "noun", "defs": ["the plant Gomphrena globosa of Amaranthaceae family.", "its flower."]}], "ದೊಡ್ಡಗೋರಟೆ": [{"type": "noun", "defs": ["= ದೊಡ್ಡಗೋರಂಟೆ."]}], "ದೊಡ್ಡಚಂಚು": [{"type": "noun", "defs": ["the castor plant Jatropha curcas of Euphorbiaceae family.", "its large bean."]}], "ದೊಡ್ಡಚಳ್ಳೆ": [{"type": "noun", "defs": ["the tree Cordia obliqua of Boraginaceae family."]}], "ದೊಡ್ಡಚಿರಾಯತ": [{"type": "noun", "defs": ["the plant Exacum bicolour of Gentianaceae family."]}], "ದೊಡ್ಡಚಿಲ್ಲ": [{"type": "noun", "defs": ["a kind of plant (related to Strychnos potatorum??)."]}], "ದೊಡ್ಡಚುಂಚು": [{"type": "noun", "defs": ["a kind of plant."]}], "ದೊಡ್ಡಜಡ": [{"type": "noun", "defs": ["= ದೊಡ್ಡಜ್ವರ."]}], "ದೊಡ್ಡಜಾಜಿಕಾಯಿಮರ": [{"type": "noun", "defs": ["the tree Myristica malabarica of Myristicaceae family.", "its seed used as an aromatic; Malabar nutmeg."]}], "ದೊಡ್ಡಜಾಪಾಲಜಪ್ಲೆ": [{"type": "noun", "defs": ["the tree Scolopia crenata of Flacourtiaceae family."]}], "ದೊಡ್ಡಜೀರಗೆ": [{"type": "noun", "defs": ["= ದೊಡ್ಡಜೀರಿಗೆ."]}], "ದೊಡ್ಡಜೀರಿಗೆ": [{"type": "noun", "defs": ["the herb Foeniculum vulgare (= Anethum pannori) of Apiaceae family; Indian sweet fennel.", "its seed."]}], "ದೊಡ್ಡಜೀವ": [{"type": "noun", "defs": ["an important person (esp. a pregnant woman in relation to her child yet to be born)."]}], "ದೊಡ್ಡಜೋಳ": [{"type": "noun", "defs": ["the grass zeal mayis of Poaceae family.", "its corn; Indian maize."]}], "ದೊಡ್ಡಜ್ವರ": [{"type": "noun", "defs": ["an acute, severe, infectious disease, caused by bacteria Vibrio cholerae, characterised by profuse diarrhoea, vomiting, dehydration, cramps, etc.; cholera."]}], "ದೊಡ್ಡಣ": [{"type": "adjective", "defs": ["big; large; bulky."]}], "ದೊಡ್ಡಣ್ಣ": [{"type": "noun", "defs": ["one's elder brother.", "(fig.) the state or some other organisation regarded as ruthlessly invading the privacy of individuals in seeking to exercise control over them; a big-brother."]}], "ದೊಡ್ಡತಂಗಡಿ": [{"type": "noun", "defs": ["the cassia shrub Cassia alata of Caesalpiniaceae family."]}], "ದೊಡ್ಡತಂದೆ": [{"type": "noun", "defs": ["an elder brother of one's father.", "the husband of an elder sister of one's mother."]}], "ದೊಡ್ಡತಗಚಿ": [{"type": "noun", "defs": ["the tree Morinda citrifolia of Rubiaceae family; turmeric timber tree.", "the under-shrub Cassia occidentalis of Caesalpiniaceae family.", "another plant of the same family Cassia tomentosa.", "another plant of the same family Cassia alata."]}], "ದೊಡ್ಡತಗಚೆ": [{"type": "noun", "defs": ["= ದೊಡ್ಡತಗಚಿ."]}], "ದೊಡ್ಡತನ": [{"type": "noun", "defs": ["reputation based on one's good character, behaviour, compassion, clemency, empathy, etc.", "virtue as good character, behaviour compassion, etc."]}], "ದೊಡ್ಡತಾಯಿ": [{"type": "noun", "defs": ["an elder sister of one's mother.", "the wife of an elder brother of one's father."]}], "ದೊಡ್ಡತಿಪ್ಪಲಿ": [{"type": "noun", "defs": ["the vine Rhapidophora pertusa of Araceae family; Indian ivy."]}], "ದೊಡ್ಡತುಂಬೆ": [{"type": "noun", "defs": ["the herb Leucas urticaefolia of Lamiaceae family."]}], "ದೊಡ್ಡತೊಪ್ಪೆ": [{"type": "noun", "defs": ["the middle to large sized tree Hymenodictyon excelsum of Rubiaceae family."]}], "ದೊಡ್ಡದಗರೆ": [{"type": "noun", "defs": ["the cassia plant Cassia grandis of Caesalpiniaceae family; horse cassia."]}], "ದೊಡ್ಡದತ್ತ ಉಮೆ": [{"type": "noun", "defs": ["= ದೊಡ್ಡದತ್ತೆಲೆ."]}], "ದೊಡ್ಡದತ್ತೆಲೆ": [{"type": "noun", "defs": ["the plant Psychotria bisculata of Rubiaceae family."]}], "ದೊಡ್ಡದನ": [{"type": "noun", "defs": ["well-bred cattle."]}], "ದೊಡ್ಡಧರ್ಭೆ": [{"type": "noun", "defs": ["a kind of grass with long blades."]}], "ದೊಡ್ಡ ನಲಾಂಚಿ": [{"type": "noun", "defs": ["the passerine bird Copsychus saularis of Muscicapiadae family with white belly, black head, neck, wings, and long white striped black tail; oriental magpie-robin."]}], "ದೊಡ್ಡನವಿಲುಬಾಲ": [{"type": "noun", "defs": ["the plant Adiantum melanacaulon of Polypodiaceae family."]}], "ದೊಡ್ಡನಾತದ ಗಿಡ": [{"type": "noun", "defs": ["the plant Callicarpa tomentosa ( - C. lantana) of Verbenaceae family."]}], "ದೊಡ್ಡನಾಯಿ": [{"type": "noun", "defs": ["a big sized dog.", "a tiger."]}], "ದೊಡ್ಡನಾಳಲು": [{"type": "noun", "defs": ["the grass Arundo bengalensis of Poaceae family."]}], "ದೊಡ್ಡನಿಂಬೆ": [{"type": "noun", "defs": ["the citrus plant Citrus medica of Rutaceae family (which has two varieties 'typica' and 'limoṇ).", "its fruit; lemon."]}], "ದೊಡ್ಡ ನೀರಂಜಿ": [{"type": "noun", "defs": ["the plant Pedalium murex (= P. indicum, = P. prostratum) of Pedaliaceae family."]}], "ದೊಡ್ಡನೀಲಿ": [{"type": "noun", "defs": ["a kind of plant."]}], "ದೊಡ್ಡನೂಲು": [{"type": "noun", "defs": ["stout or coarse thread."]}], "ದೊಡ್ಡನೆಕ್ಕರೆ": [{"type": "noun", "defs": ["the shrub Melastoma malabathricum of Melastomataceae family; Indian rhododendron.", "its purple flowers.", "the plant Memecylon malabaricum of the same family.", "its berry."]}], "ದೊಡ್ಡನೆಗ್ಗಿಲು": [{"type": "noun", "defs": ["= ದೊಡ್ಡ ನೀರಂಜಿ.", "the plant Emex australis of Polygonaceae family."]}], "ದೊಡ್ಡನೆಲದಾವರೆ": [{"type": "noun", "defs": ["a variety of hibiscus plant (details ?.", "its flower."]}], "ದೊಡ್ಡನೆಲ್ಲಿ": [{"type": "noun", "defs": ["the gooseberry tree Emblica officinalis of Euphorbiaceae family.", "its berry; the Indian gooseberry."]}], "ದೊಡ್ಡಪಟಿಕ": [{"type": "noun", "defs": ["the flowering plant Rhinacanthus nasuta ( = R. communis) of Acanthaceae family.", "its flower."]}], "ದೊಡ್ಡಪಡಪತ್ರೆ": [{"type": "noun", "defs": ["a kind of plant the medicinal substance obtained from which was used as an antidote."]}], "ದೊಡ್ಡಪತ್ರೆ": [{"type": "noun", "defs": ["the herb Anisochilus carnosus of Lamiaceae family.", "its thick leaf which is used as vegetable.", "another plant of the same family Coleus amboinicus (= C. aromaticus)."]}], "ದೊಡ್ಡಪರೀಕ್ಷೆ": [{"type": "noun", "defs": ["the final examination for promoting a student to the next higher class or for awarding a degree."]}], "ದೊಡ್ಡಪುರಲೆ": [{"type": "noun", "defs": ["the grass Eragrostis poaeoides of Poaceae family."]}], "ದೊಡ್ಡಪ್ಪ": [{"type": "noun", "defs": ["an elder brother of one's father.", "the husband of an elder sister of one's mother.", "a respectable man.", "ದುಡ್ಡಿದ್ದವನೇ ದೊಡ್ಡಪ್ಪ duḍḍiddavanē doḍḍappa (prov.) he who has money is a respectable man; money makes a person big."]}], "ದೊಡ್ಡಬಂಗು": [{"type": "noun", "defs": ["the plant Crotalaria laevigata of Papilionaceae family."]}], "ದೊಡ್ಡಬಸಲೆ": [{"type": "noun", "defs": ["the plant Basella rubra of Basellaceae family (?), the leaves of which are used as a vegetable."]}], "ದೊಡ್ಡಬಸಳೆ": [{"type": "noun", "defs": ["= ದೊಡ್ಡಬಸಲೆ."]}], "ದೊಡ್ಡಬಸುರಿ": [{"type": "noun", "defs": ["the ficus tree Ficus tsiela of Moraceae family; yellow barked fig tree."]}], "ದೊಡ್ಡಬಾಗೆ": [{"type": "noun", "defs": ["the tree Albizzia lebbeck of Mimosae family; the Siris tree."]}], "ದೊಡ್ಡಬಿಂದಿಗೆಗಿಡ": [{"type": "noun", "defs": ["the flowering plant Althaea coromandelina of Malvaceae family."]}], "ದೊಡ್ಡಬುಡ್ಡೆ": [{"type": "noun", "defs": ["the plant Physalis peruviana (= P. edulis) of Solanaceae family.", "its berry; cape goose berry."]}], "ದೊಡ್ಡಬೆಂಡೆ": [{"type": "noun", "defs": ["the plant Urena lobata (= U. sinuata) of Malvaceae family."]}], "ದೊಡ್ಡಬೆತ್ತ": [{"type": "noun", "defs": ["the cane Calamus rotang of Arecaceae family; slender rattan."]}], "ದೊಡ್ಡಬೆಲ್ಲಗೆಣಸು": [{"type": "noun", "defs": ["a variety of sweet potato of Convolvulaceae family, with huge, tuber-like root used as a vegetable."]}], "ದೊಡ್ಡಬೆಳ್ಳಿಹಣ": [{"type": "noun", "defs": ["an ancient monetary coin."]}], "ದೊಡ್ಡಬೇನೆ": [{"type": "noun", "defs": ["any of the acute, severe diseases."]}], "ದೊಡ್ಡಬೇವು": [{"type": "noun", "defs": ["the tree Ailanthus excelsa of Simaroubaceae family."]}], "ದೊಡ್ಡಮಣಿಮರ": [{"type": "noun", "defs": ["= ದೊಡ್ಡಬೇವು."]}], "ದೊಡ್ಡಮದ್ದು": [{"type": "noun", "defs": ["the root of Withania somnifera, used for medicinal purpose."]}], "ದೊಡ್ಡಮನೆ": [{"type": "noun", "defs": ["a big house; a mansion.", "(fig.) a jail; a prison."]}], "ದೊಡ್ಡಮಬ್ಬು": [{"type": "noun", "defs": ["the period preceding the dawn of the sun."]}], "ದೊಡ್ಡಮರ": [{"type": "noun", "defs": ["= ದೊಡ್ಡಬೇವು.", "the tree Calosanthes indica."]}], "ದೊಡ್ಡಮರದರಿಶಿನ": [{"type": "noun", "defs": ["the plant Berberis aristata of Berberidaceae family.", "the tree Coscinium fenestratum of Menispermaceae family; turmeric tree.", "the climber Menispermum fenestrate."]}], "ದೊಡ್ಡಮಾತು": [{"type": "noun", "defs": ["a speech, saying that has importance, effective influence or respectability."]}], "ದೊಡ್ಡಮಾರವಾಳಿ": [{"type": "noun", "defs": ["the grass Andropogon molliconus of Poaceae family."]}], "ದೊಡ್ಡಮಾರ್ಗ": [{"type": "noun", "defs": ["a highway; a main road.", "the honest, righteous path.", "a hardened, thickened place on the skin inside the thighs of elephants, horses, etc."]}], "ದೊಡ್ಡಮಾವು": [{"type": "noun", "defs": ["a kind of plant."]}], "ದೊಡ್ಡಮುಳ್ಳಿನಜಾಲಿ": [{"type": "noun", "defs": ["the shrub or small tree Acacia latronum of Mimoseae family."]}], "ದೊಡ್ಡಮೆಕ್ಕೆ": [{"type": "noun", "defs": ["the creeper Cucumis callosus (= C. tribonus) of Cucurbitaceae family.", "its fruit; bitter gourd."]}], "ದೊಡ್ಡಮೆಣಸಿನಕಾಯಿ": [{"type": "noun", "defs": ["the plant Capsicum grossum of Solanaceae family.", "its fruit used as a vegetable; giant capsicum."]}], "ದೊಡ್ಡಮೇದೆ": [{"type": "noun", "defs": ["the tree Erythrina indica of Papilionaceae family."]}], "ದೊಡ್ಡಮ್ಮ": [{"type": "noun", "defs": ["an elder sister of one's mother.", "the wife of an elder brother of one's father.", "an acute, highly contagious, febrile disease caused by variola virus, characterized by vomiting, and pustular eruptions that often leave pitted scars or pockmarks, when healed; smallpox.", "a folk-goddess, a form of Pārvati, who is believed to cause and remove this disease.", "an acute infectious viral disease of cattle, characterised by fever and by hemorrhagic inflammation and ulceration of the mucous membrane of the alimentary canal."]}], "ದೊಡ್ಡಯ್ಯ": [{"type": "noun", "defs": ["an elder brother of one's father.", "the husband of a sister of one's mother."]}], "ದೊಡ್ಡರತ್ನಗಂಧಿ": [{"type": "noun", "defs": ["the ornamental tree Delonix regia (= Poinciana regia) of Ceasalpiniaceae family; gold mohur; royal poinciana; flamboyant."]}], "ದೊಡ್ಡರಾಗಿ": [{"type": "noun", "defs": ["a variety of ragi (finger millet)."]}], "ದೊಡ್ಡರಾಜಾನ್ನ": [{"type": "noun", "defs": ["a variety of rice."]}], "ದೊಡ್ಡರಿಸಿನ": [{"type": "noun", "defs": ["the plant Curcuma aromatica of Zingiberaceae family.", "another plant of the same family, Curcuma xanthorrhiza.", "the substance obtained from the dried rhizome of these plants."]}], "ದೊಡ್ಡರೋಗ": [{"type": "noun", "defs": ["any of the acute, severe diseases affecting human beings.", "an acute infectious viral disease of cattle, characterised by fever and by hemorrhagic inflammation and ulceration of the mucous membrane of the alimentary canal."]}], "ದೊಡ್ಡಲಕ್ಕಿ": [{"type": "noun", "defs": ["the tree Vitex altissima (= v. alata) of Verbenaceae family; peacock chaste tree."]}], "ದೊಡ್ಡಲೀಕಾಯಿಗಿಡ": [{"type": "noun", "defs": ["the plant Atalantia monophylla (=Limonia monophylla) of Rutaceae family.", "its fruit; wild lime; hill lime."]}], "ದೊಡ್ಡವನಮುಗುಳಿ": [{"type": "noun", "defs": ["the plant Spilanthes acmella (var. oleraceae) of Asteraceae family."]}], "ದೊಡ್ಡವರಹ": [{"type": "noun", "defs": ["an ancient monetary coin."]}], "ದೊಡ್ಡವೂಸಿ": [{"type": "noun", "defs": ["rain that comes when during the period when the moon is closer to the star Puṣya, the Delta Cancer."]}], "ದೊಡ್ಡವ್ವ": [{"type": "noun", "defs": ["an elder sister of one's mother.", "the wife of an elder brother of one's father."]}], "ದೊಡ್ಡಶಣಬು": [{"type": "noun", "defs": ["= ದೊಡ್ಡsಸಣಬು."]}], "ದೊಡ್ಡಶರ": [{"type": "noun", "defs": ["a species of reed."]}], "ದೊಡ್ಡಸಂಪಿಗೆ": [{"type": "noun", "defs": ["the tree Michelia champaca of Magnoliaceae family.", "its flower; golden champa.", "another tree of the same family, Michelia nilagirica.", "its flower; white champa."]}], "ದೊಡ್ಡsಸಣಬು": [{"type": "noun", "defs": ["a species of jute plant (of Tiliaceae family) that yields a strong, glossy fibre, used for making sacks, mat, rope, etc."]}], "ದೊಡ್ಡಸರ್ಲೆಹಕ್ಕಿ": [{"type": "noun", "defs": ["the bird Sarcidiornis melanonotus, a species of duck.", "the long-necked, web-footed goose, Anser indicus of Anatidae family, with white head that has a black stripe, noted for its ability to fly over a height of 18,000 ft; a bar-headed goose."]}], "ದೊಡ್ಡಸಾಮೆ": [{"type": "noun", "defs": ["a kind of grass.", "its millet."]}], "ದೊಡ್ಡಸಾಸುವೆ": [{"type": "noun", "defs": ["a kind of mustard plant whose seeds are larger in size than the normal ones.", "its seed."]}], "ದೊಡ್ಡಸಿವನ್ನಿ": [{"type": "noun", "defs": ["the tree Gmelina arborea(= Premna arborea) of Verbenaceae family; white teak."]}], "ದೊಡ್ಡಸಿಹಿಗೆಣಸು": [{"type": "noun", "defs": ["a variety of sweet potato of Convolvulaceae family.", "its huge, tuber-like root used as a vegetable."]}], "ದೊಡ್ಡಸುದ್ದಿ": [{"type": "noun", "defs": ["an important news."]}], "ದೊಡ್ಡಸುರುಟಿ": [{"type": "noun", "defs": ["the plant Asteriastigma macrocarpa of Bixaceae family."]}], "ದೊಡ್ಡಸೂರಂಟೆ": [{"type": "noun", "defs": ["= ದೊಡ್ಡಸುರುಟಿ."]}], "ದೊಡ್ಡಸೊಳ್ತಿ": [{"type": "noun", "defs": ["= ದೊಡ್ಡಸುರುಟಿ."]}], "ದೊಡ್ಡಸೋಂಪು": [{"type": "noun", "defs": ["the plant Foeniculum vulgare(= Anethum pannori) of Apiaceae family).", "its seed."]}], "ದೊಡ್ಡಸೋರೆ": [{"type": "noun", "defs": ["the creeper akin to calabash (Lagenaria vulgaris).", "its fruit."]}], "ದೊಡ್ಡಸ್ತ": [{"type": "noun", "defs": ["a man of wealth, rank or having reputation based on character, honesty, etc."]}], "ದೊಡ್ಡಸ್ತನ": [{"type": "noun", "defs": ["reputation based on one's good character, behaviour, compassion, clemency, empathy, etc."]}], "ದೊಡ್ಡಸ್ತಿಕೆ": [{"type": "noun", "defs": ["= ದೊಡ್ಡಸ್ತನ.", "excessive pride in one's appearance, qualities, abilities, achievements, possessions, etc.; character or quality of being vain; conceit; vanity."]}], "ದೊಡ್ಡಸ್ತು": [{"type": "noun", "defs": ["= ದೊಡ್ಡಸ್ತನ."]}], "ದೊಡ್ಡಹಂಚೀಹುಲ್ಲು": [{"type": "noun", "defs": ["the grass Aristida adscenscionis of Poaceae family.", "another kind of grass Aristida setacea of the same family.", "another kind of grass Themeda triandra of the same family."]}], "ದೊಡ್ಡಹತ್ತಿ": [{"type": "noun", "defs": ["the cotton plant Gossypium hirsutum (= G. mexicanum) of Malvaceae family.", "cotton got from this."]}], "ದೊಡ್ಡಹನಿಚೆ": [{"type": "noun", "defs": ["the plant Casearia esculenta of Samydaceae family."]}], "ದೊಡ್ಡಹರಳು": [{"type": "noun", "defs": ["the castor plant Jatropha curcas of Euphorbiaceae family, grown as a hedge plant.", "its large bean."]}], "ದೊಡ್ಡಹಲ್ಲಿ": [{"type": "noun", "defs": ["a kind of flowering plant."]}], "ದೊಡ್ಡಹಾಲುಗುಂಬಳ": [{"type": "noun", "defs": ["a kind of plant of Cucurbitaceae family."]}], "ದೊಡ್ಡಹಾಲ್ಮೆಕ್ಕೆ": [{"type": "noun", "defs": ["the creeper Citrullus colocynthis (= Cucumis colocynthis) of Cucurbitaceae family.", "its fruit."]}], "ದೊಡ್ಡಹಿಂಗಿನಬಳ್ಳಿ": [{"type": "noun", "defs": ["the plant Ferula jaeschkeana (= F. northex) of Apiaceae family.", "the bad-smelling gum resin obtained from this, used in seasoning food."]}], "ದೊಡ್ಡಹಿಂಡಿಗಿಡ": [{"type": "noun", "defs": ["the plant Aerva tomentosa of Amaranthaceae family."]}], "ದೊಡ್ಡಹಿಟ್ಟಳಿಕ": [{"type": "noun", "defs": ["a kind of plant."]}], "ದೊಡ್ಡಹಿಪ್ಪಲಿ": [{"type": "noun", "defs": ["the creeper Scindapsus officinalis of Araceae family; monkey creeper."]}], "ದೊಡ್ಡಹೀರೆ": [{"type": "noun", "defs": ["a kind of plant."]}], "ದೊಡ್ಡಹುಳಕ": [{"type": "noun", "defs": ["a kind of sand-piper of Scolopacidae family having short, soft-tipped bill."]}], "ದೊಡ್ಡಹುಳಿ": [{"type": "noun", "defs": ["the plant Atalantia monophylla (=Limonia monophylle) of Rutaceae family.", "its fruit; wild lime; hill lime."]}], "ದೊಡ್ಡಹೆಂಡತಿ": [{"type": "noun", "defs": ["a woman as related to her husband, who has taken another wife subsequently."]}], "ದೊಡ್ಡಹೆಮ್ಮರ": [{"type": "noun", "defs": ["the tree Calosanthes indica."]}]}