{"ತಿರುಪಳಿ": [{"type": "noun", "defs": ["= ತಿರುಗುಳಿ."]}], "ತಿರುಪಾಟ": [{"type": "noun", "defs": ["a turning or rotating (a thing, another person, etc.) horizontally, parallel to the ground."]}, {"type": "noun", "defs": ["= ತಿರುಪಾಡು."]}], "ತಿರುಪಾಟು": [{"type": "noun", "defs": ["= ತಿರುಪಾಡು."]}], "ತಿರುಪಾಟ್ಟು": [{"type": "noun", "defs": ["= ತಿರುಪಾಡು."]}], "ತಿರುಪಾಡು": [{"type": "noun", "defs": ["a Tamil hymn or song in praise of a deity, esp. Śiva."]}], "ತಿರುಪು": [{"type": "verb", "defs": ["to turn or twist (something usu. on its axis); to cause to rotate.", "to cause to wander.", "to turn (something) to face another side; to make upside down.", "to turn or coil (string, ribbon, etc.) around itself to form a ball or around something else so as to encircle it closely; to twine; to wind.", "to turn back; to withdraw (oneself, as from facing a danger, battle, etc.).", "to stir (as something being cooked) with or as with a ladle as to mix thoroughly.", "to cause to wear, put on (as an ornament).", "to crush into fine particles in a mortar by grinding."]}, {"type": "noun", "defs": ["the act of turning or twisting (oneself).", "(mus.) a particular type of regulated movement from one note to another.", "the act of making another wander, roam about.", "(dance.) circular movement.", "a cover, lid that is threaded like a screw that can be tightened by turning in one direction and loosened by turning in another.", "the point or region where something is bent; a turn.", "a moving or going in a different (usu. unexpected) direction.", "a roaming around; wandering."]}, {"type": "noun", "defs": ["the tree Hopea parviflora of Dipterocarpaceae family; iron wood of Malabar."]}], "ತಿರುಪುಗೊಳು": [{"type": "verb", "defs": ["to turn one's body (as in dancing)."]}], "ತಿರುಪುನಿಚ್ಚಣಿಕೆ": [{"type": "noun", "defs": ["a spiral staircase, usu. having a handrail or balustrade."]}], "ತಿರುಪುಹೂ": [{"type": "noun", "defs": ["a kind of ornament fixed to the braided hair with the help of a screw."]}], "ತಿರುಪುಳಿ": [{"type": "noun", "defs": ["= ತಿರುಗುಳಿ."]}], "ತಿರುಪೆ": [{"type": "noun", "defs": ["the act or fact of wandering, roaming.", "a begging for food, help, etc.", "food or grains got as alms; ತಿರುಪೆ ಎತ್ತು tirupe ettu to ask for alms; to beg."]}], "ತಿರುಪೆಕೂಳು": [{"type": "noun", "defs": ["= ತಿರುಪೆ - 3."]}], "ತಿರುಪೆಗಾರ": [{"type": "noun", "defs": ["a man who begs or asks for charity, esp. one who lives by begging; a beggar."]}], "ತಿರುಪೆಗಾರ್ತಿ": [{"type": "noun", "defs": ["a woman who begs or asks for charity, esp. one who lives by begging; a beggar."]}], "ತಿರುಪ್ಪಣ್ಣಿ": [{"type": "noun", "defs": ["= ತಿರುಪಣಿ2."]}], "ತಿರುಪ್ಪಾಯಿ": [{"type": "noun", "defs": ["any verse in the devotional, literary work byānḍāḷin Tamil."]}], "ತಿರುಪ್ಪು": [{"type": "verb", "defs": ["= ತಿರುಪು1."]}], "ತಿರುಪ್ರಬಂಧ": [{"type": "noun", "defs": ["a devotional, poetic composition in Tamil in praise of Viṣṇu."]}], "ತಿರುಬೊಬ್ಬೆ": [{"type": "noun", "defs": ["a counter-shouting against a person to snub down."]}], "ತಿರುಬೋಕಿ": [{"type": "noun", "defs": ["a beggar's bowl.", "a beggar.", "a poor, destitute person."]}], "ತಿರುಮಂತ್ರ": [{"type": "noun", "defs": ["a sacred hymn.", "(fig.) a plan, scheme or action to counter another's; ಗುರುವಿಗೇ ತಿರುಮಂತ್ರ ಹೇಳು guruvigē tiru mantra hēḷu to counter, usu. disobediently, one's preceptor, elder, etc."]}], "ತಿರುಮಣ್": [{"type": "noun", "defs": ["= ತಿರುಮಣ್ಣು."]}], "ತಿರುಮಣಿ": [{"type": "noun", "defs": ["= ತಿರುಮಣ್ಣು."]}], "ತಿರುಮಣ್ಣು": [{"type": "noun", "defs": ["a kind of white powder used to put a vertical sectarian mark on the forehead."]}], "ತಿರುಮಲೆ": [{"type": "noun", "defs": ["a hill (or a range of seven hills) in Andhra Pradesh, in South India, famous centre for Hindu pilgrims; Tirupati hills."]}], "ತಿರುಮಾಲೆ": [{"type": "noun", "defs": ["a garland of flowers meant for a deity.", "a garland put on a deity or a piece of it given to a devotee."]}], "ತಿರುಮಾಳಿಗೆ": [{"type": "noun", "defs": ["a series of buildings along side of the compound wall of a temple.", "a room in a house where the idols of deities are kept for regular worship.", "a house of a respectable person."]}], "ತಿರುಮೀಸೆ": [{"type": "noun", "defs": ["the moustache the either end of which is twisted upward."]}], "ತಿರುಮು": [{"type": "noun", "defs": ["consciousness - a) the state of being conscious; awareness of one's own feelings, what is happening around one, etc.", "the totality of one's thoughts, feelings, and impressions; conscious mind."]}], "ತಿರುಮುಡಿ": [{"type": "noun", "defs": ["a tuft of long hair at the back of the head, left unshaven for religious purpose."]}], "ತಿರುಮುರಿ": [{"type": "noun", "defs": ["= ತಿರುವುಮುರುವು."]}], "ತಿರುಮುರುವು": [{"type": "noun", "defs": ["= ತಿರುವುಮುರುವು."]}], "ತಿರುಮುರುಹು": [{"type": "noun", "defs": ["= ತಿರುವುಮುರುವು."]}], "ತಿರುಮೂರ್ತಿ": [{"type": "noun", "defs": ["a sacred idol of a deity.", "a person whose body is considered sacred."]}], "ತಿರುವ": [{"type": "noun", "defs": ["the tree Xylia xylocarpa (= X. dolbariformis) of Mimosaceae family; Burma iron wood."]}], "ತಿರುವಂದಿಕಾಪು": [{"type": "noun", "defs": ["ceremonial rites for averting the evil eye at the close of daily worship or festival in a temple."]}], "ತಿರುವಡಿ": [{"type": "noun", "defs": ["sacred feet (of a deity, saint, sage, etc.).", "a sage or saint."]}], "ತಿರುವದಿ": [{"type": "noun", "defs": ["a festival observed in the Dhanu month (the ninth month of solar calendar year corresponding to December-January) in a Śiva temple."]}], "ತಿರುವಧ್ಯಾನ": [{"type": "noun", "defs": ["a reading or reciting of sacred literary works."]}], "ತಿರುವಮುದು": [{"type": "noun", "defs": ["boiled rice offered to an idol."]}], "ತಿರುವರಿಯಾಟ": [{"type": "noun", "defs": ["a small piece of cloth for dressing an idol of a deity."]}], "ತಿರುವಳಿ": [{"type": "noun", "defs": ["a kind of plant ."]}], "ತಿರುವಳೆಯಾಟ": [{"type": "noun", "defs": ["a play depicting the sacred sports of a deity."]}], "ತಿರುವಾಯ್": [{"type": "noun", "defs": ["the central point of the string of a bow."]}], "ತಿರುವಾಯ್ಗೊಳಿಸು": [{"type": "verb", "defs": ["= ತಿರುವಿಡು."]}], "ತಿರುವಾಯ್ವೊಣರ್ಚು": [{"type": "verb", "defs": ["to set a bow on a bow (to be shot)."]}], "ತಿರುವಾಸಿಲು": [{"type": "noun", "defs": ["a gate or doorway directly in front of the chief idol of a temple, through which the representative idol is brought in or taken out."]}], "ತಿರುವಿಡು": [{"type": "verb", "defs": ["to tie the string to a bow; to be ready to shoot (arrows)."]}], "ತಿರುವಿಸು": [{"type": "verb", "defs": ["to cause to change the course (of another's motion); to turn; to deflect."]}], "ತಿರುವೀಥಿ": [{"type": "noun", "defs": ["the main street in which the procession of temple deity is usu. taken."]}], "ತಿರುವು": [{"type": "verb", "defs": ["= ತಿರುಪು1."]}, {"type": "noun", "defs": ["= ತಿರುಪು2; 9) a point in time when a decisive change occurs: a turn; a turning point."]}, {"type": "noun", "defs": ["the string of a bow."]}], "ತಿರುವುಮುರುವು": [{"type": "noun", "defs": ["the state of being reversed of turned upside down.", "an adverse change of fortune; an utter failure of one's plan or scheme.", "a returning (something received earlier) or responding to another's action.", "a particular lock or hold in wrestling.", "a circular movement in dancing."]}], "ತಿರುವುವೊಯ್": [{"type": "verb", "defs": ["to pull the string of a bow (to produce a heavy sound)."]}], "ತಿರುವೆ": [{"type": "noun", "defs": ["memorisation of a passage by reading it repeatedly."]}, {"type": "noun", "defs": ["= ತಿರುವ."]}], "ತಿರುವೆಟ್ಟ": [{"type": "noun", "defs": ["any hill considered as religiously sacred."]}], "ತಿರುವೆಡೆ": [{"type": "noun", "defs": ["an offering made to a deity in the Dhanu month ( the nineth month of solar calendar year corresponding to December-January)."]}], "ತಿರುವೆಳಕು": [{"type": "noun", "defs": ["a votive lamp that burns continuously in the sanctum sanctorum of a temple."]}], "ತಿರುವೇರಿಸು": [{"type": "verb", "defs": ["to tie the string to a bow."]}], "ತಿರುವೊಡೆ": [{"type": "noun", "defs": ["a leather guard for the palm of left hand worn by an archer to avoid being hit by the string of a bow, when an arrow is shot."]}], "ತಿರುವೊಯ್": [{"type": "verb", "defs": ["= ತಿರುವುವೊಯ್."]}], "ತಿರುವೊಯ್ಲು": [{"type": "noun", "defs": ["a stroke of a bow-string; the act or an instance of pulling and releasing suddenly the bow-string to make a heavy sound."]}], "ತಿರುಸು": [{"type": "adjective", "defs": ["deviated; not straight; turned aside or across.", "looking askance or sidelong; squint."]}], "ತಿರುಸುಗಣ್ಣು": [{"type": "noun", "defs": ["an eye that is characterised by the disorder of the muscles in which it cannot be focused on the same point at the same time as the other eye; a squint eye."]}], "ತಿರುಹಾಡು": [{"type": "noun", "defs": ["a Tamil hymn or song in praise of a deity, esp. Śiva."]}], "ತಿರುಹಿಸು": [{"type": "verb", "defs": ["to cause to change the course (of another's motion); to turn; to deflect."]}], "ತಿರುಹು": [{"type": "verb", "defs": ["= ತಿರುಪು1."]}, {"type": "noun", "defs": ["= ತಿರುಪು2."]}], "ತಿರುಹುಮುರುಹು": [{"type": "noun", "defs": ["= ತಿರುವುಮುರುವು."]}], "ತಿರುಳ್": [{"type": "noun", "defs": ["= ತಿರುಳು."]}], "ತಿರುಳಳಿ": [{"type": "verb", "defs": ["to lose one's intrinsic, fundamental or most important quality; to lack vitality or spirit; to become insipid."]}], "ತಿರುಳಿ": [{"type": "noun", "defs": ["the shrub Capparis decidua (= C. aphylla) of Capparaceae family; common caper."]}, {"type": "noun", "defs": ["a kind of worm that makes dung, filth etc. into small balls and rolls them to its place.", "the moth caterpillars of Bombycidae family, that produce cocoons of silk fibre about itself; a silkworm."]}], "ತಿರುಳಿಗೆ": [{"type": "noun", "defs": ["= ತಿರುಳಿ1."]}], "ತಿರುಳು": [{"type": "noun", "defs": ["the inner, softer part of a nut, fruit pit, etc.; the kernel.", "the central, most important part of something; core; essence.", "ತಿರುಳ ಕನ್ನಡ tiruḷa Kannaḍa = ತಿರುಳ್ಗನ್ನಡ."]}], "ತಿರುಳುಣಿಸು": [{"type": "noun", "defs": ["a food that is rich in nutrition and nourishing; a nutritious food."]}], "ತಿರುಳೆತ್ತು": [{"type": "verb", "defs": ["to take out the kernel or essence from.", "(fig.) to take, epitomise the main or important points of a book, report, etc."]}], "ತಿರುಳೆಲೆ": [{"type": "noun", "defs": ["the central leaf in a cluster of leaves of a plant."]}], "ತಿರುಳ್ಗನ್ನಡ": [{"type": "noun", "defs": ["pure, forceful Kannaḍa language."]}], "ತಿರೆ": [{"type": "noun", "defs": ["the earth."]}], "ತಿರೋಧಾನ": [{"type": "noun", "defs": ["the act of hiding, concealing or covering with or as with a veil; concealment.", "the act or an instance of disappearing.", "something that is put forward to conceal a true purpose or object; an ostensible reason; an excuse; a pretext."]}], "ತಿರೋಧಾನತೆ": [{"type": "noun", "defs": ["= ತಿರೋಧಾನ - 1 & 2."]}], "ತಿರೋಧಾನಶಕ್ತಿ": [{"type": "noun", "defs": ["the divine power that encompasses the power of all knowledge and all human potential."]}], "ತಿರೋಧಾನಿಸು": [{"type": "verb", "defs": ["to keep something from being seen; to conceal; to hide."]}], "ತಿರೋಭಾವ": [{"type": "noun", "defs": ["= ತಿರೋಧಾನ - 2."]}], "ತಿರೋಹಿತ": [{"type": "adjective", "defs": ["removed or withdrawn from sight; concealed; hidden; covered; disappeared."]}, {"type": "noun", "defs": ["the act of disappearing; disappearance.", "(rhet.) a figure of speech in which one thing is described as enveloped, concealed or hidden by another that excels the former in a similar quality, influence, etc."]}], "ತಿರೋಹಿಸು": [{"type": "verb", "defs": ["to put out of sight; to cover or hide; to conceal."]}], "ತಿರ್ಗಾಸು": [{"type": "noun", "defs": ["a place where a road turns or takes a different direction; a turning."]}], "ತಿರ್ಚಿಲಿ": [{"type": "noun", "defs": ["the tree Albizzia lebbeck of Mimosae family; the siris tree."]}], "ತಿರ್ದಿಸು": [{"type": "verb", "defs": ["to cause to correct.", "to make right; to change from wrong to right; to remove errors from; to correct.", "to train (a person, animal); to make suitable for a particular purpose.", "to cause or train to write on a model letter to have a good control, and to master the art of writing.", "to distribute; to disperse."]}], "ತಿರ್ದು": [{"type": "verb", "defs": ["to make right; to change from wrong to right; to remove errors from; to correct.", "to make better by removing faults and defects; to reform.", "to train (a person, animal); to make suitable for a particular purpose.", "to make (things) tidy; to tidy up.", "to make ready; to prepare.", "to guide (another) to his or her improve knowledge, ability, skill, etc.", "to become apt, correct or favourable.", "to foretell something good or favourable.", "to settle a quarrel or dispute; to reconcile conflicting parties.", "to be warded off; to be prevented from happening.", "to cause to flow in or as in a stream.", "to break and turn up or remove (ground, etc.) with a spade or other tool or with hands, claws, etc.", "to kill by stabbing.", "to delineate something in or paint, a picture.", "to write on a model letter to have a good control, and to master the art of writing.", "to read and mark corrections on (printers' proofs, etc.); to correct one's or another's writing.", "to cut or incise letters, designs, etc. in or on (a surface); to engrave.", "to repay completely a loan.", "to come to an end.", "to lessen (another's) burden, unbearable responsibility, etc.", "to allay or relieve (pain, an ache, etc.); to assuage; to soothe.", "to distribute; to disperse."]}, {"type": "noun", "defs": ["the act of correcting, rectifying.", "that which is right, apt, proper, etc.", "a thing or happening supposed to foretell a future event, either good or evil; augury; an omen."]}], "ತಿರ್ದುವಡು": [{"type": "verb", "defs": ["to correct oneself (as one's writing, behaviour, position, etc.)."]}], "ತಿರ್ದುವರ್": [{"type": "verb", "defs": ["to be corrected or rectified."]}], "ತಿರ್ದುಹ": [{"type": "noun", "defs": ["the act of correcting, rectifying."]}], "ತಿರ್ಪು": [{"type": "noun", "defs": ["= ತಿರ್ಬು."]}], "ತಿರ್ಪೆ": [{"type": "noun", "defs": ["a heap of dung, sweepings, unusable articles, etc.; a dung hill.", "a place where such things are heaped."]}], "ತಿರ್ಪೆಸುಂಕ": [{"type": "noun", "defs": ["(obs.) tax levied on dunghills owned by individuals."]}], "ತಿರ್ಬು": [{"type": "noun", "defs": ["the string of a bow."]}], "ತಿರ್ಯಂಚ": [{"type": "noun", "defs": ["= ತಿರ್ಯಗ್ಗತಿ.", "an individual soul being in the stage of an animal."]}], "ತಿರ್ಯಕ್ಕು": [{"type": "adjective", "defs": ["going or lying crosswise, transversely or obliquely; oblique; transverse; horizontal; crooked; awry."]}, {"type": "noun", "defs": ["that which goes horizontally; an animal as opposed to man who walks erect; a brute.", "(dance.) the stretching of an arm, which is at the waist, sideways.", "a kind of kissing in which a woman licks the lips of the man."]}], "ತಿರ್ಯಕ್ಕುಂಚಿತ": [{"type": "noun", "defs": ["(dance.) putting one foot across in quick succession."]}], "ತಿರ್ಯಕ್ಪುಂಡ್ರ": [{"type": "noun", "defs": ["a horizontal sectarian mark on the forehead of a Śaiva."]}], "ತಿರ್ಯಗುನ್ನತ": [{"type": "noun", "defs": ["(dance.) a lifting up of the head that is bent crosswise (as in expressing the sentiment of affected indifference)."]}], "ತಿರ್ಯಗ್ಗತಿ": [{"type": "noun", "defs": ["the stage of being in a brute, as one of the four classes, considered as the stage of irrationality."]}], "ತಿರ್ಯಗ್ಜಂತು": [{"type": "noun", "defs": ["an irrational being as animal."]}], "ತಿರ್ಯಗ್ಜಾತಿ": [{"type": "noun", "defs": ["the class or race of irrational beings; the animal creation."]}], "ತಿರ್ಯಗ್ಡೀನ": [{"type": "noun", "defs": ["a flying crosswise."]}], "ತಿರ್ಯಗ್ಯೋನಿ": [{"type": "noun", "defs": ["= ತಿರ್ಯಗ್ಜಾತಿ."]}], "ತಿರ್ಯಙ್ಮುಖ": [{"type": "noun", "defs": ["(dance) a standing keeping the feet across with heels touching each other, and then moving quickly from right to left and left to right."]}], "ತಿರ್ಯಾಹಿತ": [{"type": "noun", "defs": ["a person selected to judge a dispute or settle differences; an arbitrator."]}], "ತಿರ್ರನೆ": [{"type": "adverb", "defs": ["(moving, rotating) in a whirling manner; whirlingly."]}], "ತಿಲ": [{"type": "noun", "defs": ["the plant Sesamum indicum (= S. orientale) of Pedaliaceae family; sesame; gingelly plant.", "its oil-yielding plant.", "(fig.) a quantity, size that is negligibly small.", "ತಿಲಕಾಷ್ಟ ಮಹಿಷ ಬಂಧನ tilakāṣṭa mahiṣa bandhana (fig.) an ostentatious show or display of a worthless thing, quality, etc.; ತಿಲಮಾತ್ರ tila mātra a negligibly small quantity, number, etc.; ತಿಲಾಂಶ tilāmśa a negligible part of something; ತಿಲಾರ್ಪಣೆ ಮಾಡು tilārpaṇe māḍu = ತಿಲಾಂಜಲಿ ಕೊಡು."]}], "ತಿಲಂಗ್": [{"type": "noun", "defs": ["name of a Hindustani musical mode."]}], "ತಿಲಕ": [{"type": "noun", "defs": ["the tree Clerodendrum phlomidis of Verbenaceae family.", "its beautiful flower.", "a small, congenital spot or blemish on the human skin, usu. of a dark colour; a mole.", "a vertical mark on the forehead made with vermilion etc.", "anything that is of excellent in its class.", "a man who is regarded as great for his excellent quality, calibre, etc.; an ideal, exemplary man.", "a horse whose forehead has hairs that look like a vertical mark.", "(pros.) a metre having six groups of four syllables each.", "one of the seven stages of sexual excitement of an elephant."]}], "ತಿಲಕಗುದುರೆ": [{"type": "noun", "defs": ["a horse whose forehead has hairs that look like a vertical sectarian mark."]}], "ತಿಲಕಪ್ರಾಯ": [{"type": "adjective", "defs": ["bringing pride to a class; highly ideal; exemplary."]}], "ತಿಲಕಾಲಕ": [{"type": "noun", "defs": ["a small, congenital spot on the human skin, usu. dark- in colour."]}], "ತಿಲಕಿತ": [{"type": "adjective", "defs": ["= ತಿಲಕಪ್ರಾಯ.", "having a vertical mark on the forehead (made with vermilion etc.)."]}, {"type": "noun", "defs": ["one of the seven stages of sexual excitement of an elephant."]}], "ತಿಲಕಿಸು": [{"type": "verb", "defs": ["to make a black vertical mark on the forehead.", "to exude black liquid from the temple (as an elephant in rut)."]}], "ತಿಲಗಾತಕ": [{"type": "noun", "defs": ["= ತಿಲಘಾತಕ."]}], "ತಿಲಘಾತಕ": [{"type": "noun", "defs": ["a man who extracts oil from sesame seeds; an oil-man."]}], "ತಿಲಜ": [{"type": "noun", "defs": ["oil extracted from sesame seeds; sesame oil."]}], "ತಿಲತಂಡುಲಕ": [{"type": "noun", "defs": ["a mixture of two different things that maintain their separate identities; an imperfect blend."]}], "ತಿಲತಂಡುಲಿತ": [{"type": "noun", "defs": ["= ತಿಲತಂಡುಲಕ."]}], "ತಿಲತರ್ಪಣ": [{"type": "noun", "defs": ["= ತಿಲಾಂಜಲಿ.", "ತಿಲತರ್ಪಣ ಕೊಡು tila tarpaṇa koḍu = ತಿಲಾಂಜಲಿ ಕೊಡು."]}], "ತಿಲತೈಲ": [{"type": "noun", "defs": ["= ತಿಲಜ."]}], "ತಿಲಪರ್ಣಿ": [{"type": "noun", "defs": ["the red sandal tree Pterocarpus santalinus of Papilionaceae family."]}], "ತಿಲಪಿಂಜ": [{"type": "noun", "defs": ["a sesame seed that is not properly developed or is hollow."]}], "ತಿಲಪೇಜ": [{"type": "noun", "defs": ["= ತಿಲಪಿಂಜ."]}], "ತಿಲಪ್ರತಿಮಾದಾನ": [{"type": "noun", "defs": ["a puppet made of sesame seed filled with gold pagodas and presented as an offering to a brāhmaṇa."]}], "ತಿಲಯಂತ್ರ": [{"type": "noun", "defs": ["an oil mill."]}], "ತಿಲವಿಘಾತಕ": [{"type": "noun", "defs": ["= ತಿಲಘಾತಕ."]}], "ತಿಲವಿಷ್ಟೆ": [{"type": "noun", "defs": ["the remains of sesame seeds after the oil is extracted."]}], "ತಿಲಸ್ಮಾತಿ": [{"type": "noun", "defs": ["magic - a) the use of charms, spells, and rituals in seeking or pretending to cause or control events or govern certain natural or supernatural forces; b) the art or performing skill of producing baffling effects or illusions by sleight of hand, concealed apparatus, etc."]}], "ತಿಲಾಂಜಲಿ": [{"type": "noun", "defs": ["an offering or oblation of water mixed with sesame made to one's dead parents or ancestors.", "a giving up of all the hopes (about something).", "to give up something permanently; ತಿಲಾಂಜಲಿ ಕೊಡು tilānjali koḍu to give up all hopes.", "to give up something permanently."]}], "ತಿಲಾಂಬು": [{"type": "noun", "defs": ["= ತಿಲಾಂಜಲಿ - 1."]}], "ತಿಲಾಸ್ಥಿ": [{"type": "noun", "defs": ["a bone or cartilage shaped like a sesame seed, esp. any of certain small cartilaginous nodules in the nose; a seamed."]}], "ತಿಲಿತ್ಸ": [{"type": "noun", "defs": ["a large snake of the Boidae family that crush their prey in their coils; a boa."]}], "ತಿಲುವನಿ": [{"type": "noun", "defs": ["= ತಿಲೋಣಿ (?)."]}], "ತಿಲೋಣಿ": [{"type": "noun", "defs": ["the strong smelling annual herb Gynandropsis pentaphylla of Capparidaceae family."]}], "ತಿಲೋತ್ತಮೆ": [{"type": "noun", "defs": ["(myth.) one of the celestial courtesans and dancers."]}], "ತಿಲೋದಕ": [{"type": "noun", "defs": ["= ತಿಲಾಂಜಲಿ - 1."]}], "ತಿಲೌದನ": [{"type": "noun", "defs": ["a kind of boiled rice made with rice, sesame seeds, ghee, spices, etc."]}], "ತಿಲ್ಯ": [{"type": "noun", "defs": ["a field where sesame is grown."]}], "ತಿಲ್ಲ": [{"type": "noun", "defs": ["the tree Excoecaria agallocha of Euphorbiaceae family."]}], "ತಿಲ್ಲಾಣ": [{"type": "noun", "defs": ["= ತಿಲ್ಲಾನ."]}], "ತಿಲ್ಲಾಣಿಸು": [{"type": "verb", "defs": ["to swing in a sweet tone.", "to experience with joy; take pleasure in."]}], "ತಿಲ್ಲಾನ": [{"type": "noun", "defs": ["a kind of brilliant musical composition that use mnemonic syllables, sung or played briskly, and used esp. for dancing to."]}], "ತಿಲ್ಲಿ": [{"type": "noun", "defs": ["= ತಿಲ - 1 & 2."]}], "ತಿಲ್ಲಿ ಎಣ್ಣೆ": [{"type": "noun", "defs": ["= ತಿಲಜ."]}], "ತಿಲ್ವ": [{"type": "noun", "defs": ["the tree Symplocos racemosa of Symplocaceae family."]}], "ತಿವಂಚ": [{"type": "noun", "defs": ["a score of five getting three times successively in the game of dice."]}], "ತಿವಟಿಗೆ": [{"type": "noun", "defs": ["a three-legged stool of low height; a tripod."]}], "ತಿವದಿ": [{"type": "noun", "defs": ["(pros.) a metre having three rhyming lines."]}], "ತಿವದಿಗೆ": [{"type": "noun", "defs": ["= ತಿವಟಿಗೆ."]}], "ತಿವದೆ": [{"type": "noun", "defs": ["= ತಿವದಿ."]}], "ತಿವಳಿ": [{"type": "noun", "defs": ["three folds of the skin just above the navel of a woman (regarded as a beauty).", "any of the three signs or marks (as foot print, undried dung, damage done to the plants) left by the passage of a wild animal by which its movements can be traced."]}, {"type": "noun", "defs": ["a kind of drum, a percussion instrument."]}], "ತಿವಳೆ": [{"type": "noun", "defs": ["= ತಿವಳಿ2."]}], "ತಿವಾಶಿ": [{"type": "noun", "defs": ["= ತಿವಾಸಿ."]}], "ತಿವಾಸಿ": [{"type": "noun", "defs": ["a thick, heavy fabric of wool, cotton or synthetic fibres for covering a floor, stairs, etc.; a carpet.", "an embroidered cloth.", "a pillow or cushion used as a support to lean on while sitting."]}], "ತಿವಿ": [{"type": "verb", "defs": ["to punch, strike or push with the fist; to box; to pummel.", "to pierce or gore with a sharp edged or pointed weapon (as a dagger, sword, horn, etc.).", "to push or jab with a stick, finger, etc.; to prod; to poke.", "to rush (oneself) out or in suddenly and vehemently.", "to drive, cause to run violently.", "to unfasten a hunting dog."]}, {"type": "noun", "defs": ["= ತಿವಿತ."]}], "ತಿವಿಗತ್ತಿ": [{"type": "noun", "defs": ["a sharp, pointed weapon attached to the barrel of a rifle."]}], "ತಿವಿಗುಳು": [{"type": "noun", "defs": ["a heavy punch delivered with the fist or a stout object."]}], "ತಿವಿಗೆ": [{"type": "noun", "defs": ["= ತಿವಟಿಗೆ."]}], "ತಿವಿಗೋಲು": [{"type": "noun", "defs": ["a stick or rod used to poke with."]}], "ತಿವಿಟಿಕೆಬುಲ್ಲು": [{"type": "noun", "defs": ["= ತಿವುಟಿಗೆಹುಲ್ಲು."]}], "ತಿವಿತ": [{"type": "noun", "defs": ["the act of stabbing, piercing, prodding or poking."]}], "ತಿವಿದಿ": [{"type": "noun", "defs": ["= ತಿವದಿ."]}], "ತಿವಿನುಡಿ": [{"type": "noun", "defs": ["pungent speech; biting remarks."]}], "ತಿವಿನುಡಿಗಾರ": [{"type": "noun", "defs": ["a man who makes (habitually) cutting remarks to wound the feelings of others."]}], "ತಿವಿರ್": [{"type": "noun", "defs": ["= ತಿವುರು2."]}], "ತಿವಿರು": [{"type": "noun", "defs": ["= ತಿವುರು2."]}], "ತಿವಿಸು": [{"type": "verb", "defs": ["to cause to pierce, stab, prod or poke."]}], "ತಿವಿಳಿ": [{"type": "noun", "defs": ["= ತಿವಳಿ2."]}], "ತಿವುಟಿಗೆ": [{"type": "noun", "defs": ["= ತಿವಟಿಗೆ."]}], "ತಿವುಟಿಗೆಬುಲ್ಲು": [{"type": "noun", "defs": ["= ತಿವುಟಿಗೆಹುಲ್ಲು."]}], "ತಿವುಟಿಗೆಹುಲ್ಲು": [{"type": "noun", "defs": ["a kind of grass ."]}], "ತಿವುಡು": [{"type": "verb", "defs": ["to sharpen by rubbing or grinding; to hone; to whet.", "to rub on; to apply an unguent, ointment or oily liquid to; to anoint.", "to represent pictorially; to sketch; to delineate.", "to move the palm over another's head, body, etc. as in showing affection, mitigating pain, distress, etc.", "to compress or squeeze.", "to strike; to beat; to thrash.", "to put out a lamp, fire, etc.; to extinguish; to quench.", "to be moved by; to feel.", "to write on a model alphabet to improve or master writing.", "to set right by correcting mistakes; to rectify.", "to cause to happen.", "to be sent out (as rays of light); to be emitted.", "to wish or desire.", "to rub as to cause friction."]}, {"type": "noun", "defs": ["the broken outer coat or husk, of grains of rice, wheat, etc. separated from the flour after grinding, as by sifting; bran.", "powdered material (fine enough to be easily suspended in air); dust.", "the outer chaff of grains (as paddy separated by pounding) or skin of fruits.", "(fig.) a useless thing."]}], "ತಿವುಡುಗಳೆ": [{"type": "verb", "defs": ["to remove the husk (of grains)."]}], "ತಿವುಡೆ": [{"type": "noun", "defs": ["= ತಿವದಿ."]}, {"type": "noun", "defs": ["(mus.) a measure of time in music having one beat followed by varying number of counts, two units having one beat and one count each.", "a particular kind of gait in dancing."]}], "ತಿವುರ್": [{"type": "noun", "defs": ["= ತಿವುರು2."]}], "ತಿವುರ": [{"type": "noun", "defs": ["(pl.) the three mythological cities destroyed by Śiva."]}], "ತಿವುರು": [{"type": "verb", "defs": ["to apply, anoint, smear perfume (on the body).", "to clean or wash by rubbing; to scrub."]}, {"type": "noun", "defs": ["any fragrant substance, prepared from the extracts of flowers of made synthetically, used as a body-perfume.", "a substance smearing of which would act as an antidote on the body."]}], "ತಿವುಳ": [{"type": "noun", "defs": ["a man belonging to Tamil Nadu, in South India or a Tamil-speaking man chiefly in Tamil Nadu or Sri Lanka."]}], "ತಿವುೞ್ನಾಡು": [{"type": "noun", "defs": ["the name of one of the southern states in India, with Tamil as its official language; Tamil Nadu."]}], "ತಿಶ್ರ": [{"type": "noun", "defs": ["= ತಿಸರ2."]}], "ತಿಷ್ಠಿಸು": [{"type": "verb", "defs": ["to establish oneself in a place, office, etc."]}], "ತಿಷ್ಠೆ": [{"type": "noun", "defs": ["the act of settling oneself in a place, position; a staying in a place for considerably long period; establishment."]}], "ತಿಷ್ಯ": [{"type": "noun", "defs": ["the eighth of the twenty seven lunar asterisms.", "the tenth month in the lunar calendar in which the moon comes in conjunction with this asterism.", "the current mythological age which is classified as the fourth and the age of misery."]}], "ತಿಷ್ಯಫಲ": [{"type": "noun", "defs": ["= ತಿಷ್ಯಫಲೆ.", "its berry."]}], "ತಿಷ್ಯಫಲೆ": [{"type": "noun", "defs": ["the tree Emblica officinalis of Euphorbiaceae family; emblic myrobalan; myrobalan."]}], "ತಿಸರ": [{"type": "noun", "defs": ["a necklace having three strings."]}, {"type": "noun", "defs": ["sharp disagreement or opposition (as of interests or ideas; conflict; disagreement; friction; clash.", "a difficult situation; a formidable condition; trouble; difficulty."]}], "ತಿಸರಿ": [{"type": "noun", "defs": ["a kind of stringed musical instrument."]}], "ತಿಸರು": [{"type": "noun", "defs": ["= ತಿಸರ2."]}], "ತಿಸು": [{"type": "noun", "defs": ["a sound imitating murmuring, grumbling sound."]}], "ತಿಸುಗುಟ್ಟು": [{"type": "verb", "defs": ["to utter words indistinctly or in a low tone, often as if talking to oneself; to murmur; to grumble."]}], "ತಿಸುಳ": [{"type": "noun", "defs": ["a hand-held weapon consisting of a long metal or bamboo shaft having three-pronged, pointed head, for piercing."]}], "ತಿಸುಳಿ": [{"type": "noun", "defs": ["Śiva, who holds a three-pronged weapon."]}, {"type": "noun", "defs": ["= ತಿಸುಳ."]}], "ತಿಸ್ರ": [{"type": "noun", "defs": ["= ತಿಸರ2."]}], "ತಿಹುರ": [{"type": "noun", "defs": ["= ತಿವುರ."]}], "ತಿಹುರಿ": [{"type": "noun", "defs": ["a rotating horizontal disk upon which clay is moulded into pots, bowls, by a potter, turned by foot or by a motor."]}], "ತಿಳ": [{"type": "noun", "defs": ["the plant Sesamum indicum (= S. orientale) of Pedaliaceae family; sesame; gingelly plant.", "its oil-yielding plant.", "(fig.) a quantity, size that is negligibly small."]}], "ತಿಳಕ": [{"type": "noun", "defs": ["the tree Clerodendrum phlomidis of Verbenaceae family.", "its beautiful flower.", "a small, congenital spot or blemish on the human skin, usu. of a dark colour; a mole.", "a vertical mark on the forehead made with vermilion etc.", "anything that is of excellent in its class.", "a man who is regarded as great for his excellent quality, calibre, etc.; an ideal, exemplary man.", "a horse whose forehead has hairs that look like a vertical mark.", "(pros.) a metre having six groups of four syllables each.", "one of the seven stages of sexual excitement of an elephant."]}], "ತಿಳಕಿಸು": [{"type": "verb", "defs": ["to make a black vertical mark on the forehead.", "to exude black liquid from the temple (as an elephant in rut)."]}], "ತಿಳಕೆ": [{"type": "noun", "defs": ["one of the seven stages of sexual excitement of an elephant."]}], "ತಿಳಜ": [{"type": "noun", "defs": ["oil extracted from sesame seeds; sesame oil."]}], "ತಿಳತೈಳ": [{"type": "noun", "defs": ["= ತಿಳಜ."]}], "ತಿಳಲಿ": [{"type": "noun", "defs": ["a particular kind of game of boys."]}], "ತಿಳಲು": [{"type": "noun", "defs": ["the inner, softer part of a nut, fruit pit, etc.; the kernel or kernel.", "the central, most important part of something; core; essence."]}], "ತಿಳಿ": [{"type": "verb", "defs": ["to become pure, clear or limpid.", "to shine with sparkling light.", "to overcome one's own anger, wrath.", "to get knowledge or skill in (by study, experience or instruction); to learn; to know; to understand.", "to become known, understood, perceived.", "to arrive at conclusions or to make decisions by using one's intellect, judging capacity or reasoning.", "to feel; to become aware of.", "to come out of sleep.", "to realise one's own arrogance, mistake in argument, etc.", "to be extinguished, quenched.", "to see; to perceive through the eyes."]}, {"type": "adjective", "defs": ["clear, transparent or pellucid, as water, crystal or air.", "calm; trouble-free."]}, {"type": "noun", "defs": ["the condition or quality of being clean, pure, limpid or transparent; cleanliness; purity; limpidity.", "that part of a liquid in a container or water in a liquid, in which the thicker portion or sediments are not perturbed.", "that which is not intense, profound (as a light sleep).", "the condition of the mind that is not influenced by anger, passion, etc.; calmness of the mind.", "knowledge; awareness; understanding;", "ತಿಳಿಯಾಗು tiḷiyāgu to become clear or limpid (after the thicker materials, sediments settle down; 2. (the sky) to become cloudless or free from rain; 3. (a condition marked by disagreement, conflict, etc.) to become calm, agreeable; 4. (anger, wrath) to be extinguished.", "to become easy to understand; to become lucid."]}, {"type": "noun", "defs": ["a container for drinking, as a glass, small mug, etc."]}], "ತಿಳಿಗಂಪು": [{"type": "noun", "defs": ["a perfume, fragrance unaffected by any other perfume or fragrance."]}], "ತಿಳಿಗಚ್ಚು": [{"type": "noun", "defs": ["a thin mixture of water with cement, lime, etc."]}], "ತಿಳಿಗಣ್ಣು": [{"type": "noun", "defs": ["the ability to draw inference or conclusions from reasoning, knowledge, experience, etc."]}], "ತಿಳಿಗನ್ನಡ": [{"type": "noun", "defs": ["the lucid Kannaḍa language."]}], "ತಿಳಿಗಳ್": [{"type": "noun", "defs": ["an un-adulterated spirituous liquor."]}], "ತಿಳಿಗಾಸು": [{"type": "verb", "defs": ["to boil (something) until (it becomes) clean or clarified."]}], "ತಿಳಿಗೇಡಿ": [{"type": "noun", "defs": ["an ignorant and stupid person; an ignoramus; a fool; an idiot."]}], "ತಿಳಿಗೇಡಿತನ": [{"type": "noun", "defs": ["the quality of a stupid fellow; stupidity."]}], "ತಿಳಿಗೈ": [{"type": "verb", "defs": ["to remove dirt, impurities etc.; to make clean; to clean up."]}], "ತಿಳಿಗೊಳಿಸು": [{"type": "verb", "defs": ["to make (something) clear, clean.", "to cause (the sediments in a liquid) to settle down; to make limpid.", "to make (something) simple (as to be understood easily).", "to calm down a noisy, unruly or turbulent situation."]}], "ತಿಳಿಗೊಳು": [{"type": "verb", "defs": ["= ತಿಳಿಗೊಳ್ಳು."]}], "ತಿಳಿಗೊಳ್ಳು": [{"type": "verb", "defs": ["to be or become clean; to be cleansed.", "to understand fully; to realise.", "(a turbulent, boisterous condition) to be calmed down."]}], "ತಿಳಿತಳ": [{"type": "noun", "defs": ["the state or quality of being cool; coolness."]}], "ತಿಳಿನಗೆ": [{"type": "noun", "defs": ["an expressing of one's pleasant mood (as friendliness, pleasure, amusement, etc.) with a light smile.", "such an expression."]}], "ತಿಳಿನಿದ್ರೆ": [{"type": "noun", "defs": ["a light sleep; doze; nap."]}], "ತಿಳಿನೀರ್": [{"type": "noun", "defs": ["= ತಿಳಿನೀರು."]}], "ತಿಳಿನೀರು": [{"type": "noun", "defs": ["clean, clear, transparent water.", "the watery portion in curd, ghee, etc."]}], "ತಿಳಿನೀಲಿ": [{"type": "adjective", "defs": ["of light blue colour."]}, {"type": "noun", "defs": ["the light blue colour."]}], "ತಿಳಿನುಡಿ": [{"type": "noun", "defs": ["a language that is clear, easily understood."]}], "ತಿಳಿನೋಟ": [{"type": "verb", "defs": ["a looking at (something) without prejudiced mind; a clear sight."]}], "ತಿಳಿಪು": [{"type": "verb", "defs": ["to become clear, clean, etc.", "to pacify; to calm down (an angered person, a boisterous situation, etc.).", "to gratify the wishes of; to indulge; to please by giving in to the demands of.", "to explain in detail as to convince.", "to train or develop knowledge, skill, mind or character of; to educate; to instruct.", "to bring back to (another's) memory; to remind; to cause to remember."]}, {"type": "noun", "defs": ["that which is in a liquid or watery condition.", "the condition or quality of being thin; thinness.", "the condition or quality of being clean, pure, limpid."]}], "ತಿಳಿಬಗೆ": [{"type": "noun", "defs": ["unaffected, childlike demeanour."]}], "ತಿಳಿಬಣ್ಣ": [{"type": "noun", "defs": ["any light colour."]}], "ತಿಳಿಬೆಳಕು": [{"type": "noun", "defs": ["simple, but clear (as opp. to gaudy) light."]}], "ತಿಳಿಬೆಳಗು": [{"type": "noun", "defs": ["= ತಿಳಿಬೆಳಕು."]}], "ತಿಳಿಮಜ್ಜಿಗೆ": [{"type": "noun", "defs": ["the liquid left after churning butter from milk; buttermilk."]}], "ತಿಳಿಮಣ್ಣು": [{"type": "noun", "defs": ["a fine-grained earth."]}], "ತಿಳಿಮೆ": [{"type": "noun", "defs": ["the condition or quality of being clean, pure, limpid.", "knowledge - a) the fact or state of knowing; b) acquaintance with facts; range of information, awareness or understanding."]}], "ತಿಳಿಮೆಗೊಳ್ಳು": [{"type": "verb", "defs": ["to become clean, limpid or simple."]}], "ತಿಳಿಮೆಯಡಿಕೆ": [{"type": "noun", "defs": ["the thirst or appetite for knowledge."]}], "ತಿಳಿಯಿಡು": [{"type": "verb", "defs": ["to make (something) clean; to cleanse."]}], "ತಿಳಿಯೆಣ್ಣೆ": [{"type": "noun", "defs": ["an unadulterated oil; a pure oil."]}], "ತಿಳಿಲು": [{"type": "noun", "defs": ["= ತಿಳಲು."]}], "ತಿಳಿಲುಮಾತು": [{"type": "noun", "defs": ["a meaningful, significant words or speech."]}], "ತಿಳಿವಟ್ಟಲ್": [{"type": "noun", "defs": ["a container for drinking, as a glass, small mug, etc."]}], "ತಿಳಿವಡೆ": [{"type": "verb", "defs": ["= ತಿಳಿಮೆಗೊಳ್ಳು."]}], "ತಿಳಿವಳಿಕಸ್ತ": [{"type": "noun", "defs": ["a man of knowledge and who possesses common sense, practical judgement and discernment."]}], "ತಿಳಿವಳಿಕಸ್ತೆ": [{"type": "noun", "defs": ["a woman of knowledge and who possesses common sense, practical judgement and discernment."]}], "ತಿಳಿವಳಿಕೆ": [{"type": "noun", "defs": ["acquaintance with facts; range of information, awareness or understanding; knowledge.", "the power of discerning; keen perception or judgement; insight; acumen; discernment.", "information, announcement or warning, as a formal announcement or warning; notice."]}], "ತಿಳಿವಿಕೆ": [{"type": "noun", "defs": ["= ತಿಳಿವಳಿಕೆ."]}], "ತಿಳಿವಿಗ": [{"type": "noun", "defs": ["= ತಿಳಿವಳಿಕಸ್ತ."]}], "ತಿಳಿವು": [{"type": "noun", "defs": ["= ತಿಳಿವಳಿಕೆ.", "the state or fact of (one's anger) being calmed down; calmness of the mind."]}], "ತಿಳಿವುಟ್ಟು": [{"type": "verb", "defs": ["(something) to be realised, understood thoroughly; (enlightenment) to happen."]}], "ತಿಳಿವೆಳಕು": [{"type": "noun", "defs": ["= ತಿಳಿಬೆಳಕು."]}], "ತಿಳಿವೆಳಗು": [{"type": "noun", "defs": ["= ತಿಳಿಬೆಳಕು."]}], "ತಿಳಿಸು": [{"type": "verb", "defs": ["to inform; to bring to the notice of; to convey (a message); to intimate.", "to teach; to instruct.", "to explain; to clarify."]}], "ತಿಳಿಹಸುರು": [{"type": "adjective", "defs": ["of light green colour."]}, {"type": "noun", "defs": ["the light green colour."]}], "ತಿಳಿಹು": [{"type": "verb", "defs": ["= ತಿಳಿಪು1."]}], "ತಿಳಿಹೇಳು": [{"type": "verb", "defs": ["to clarify or explain with an intention to convince."]}], "ತಿಳುಪು": [{"type": "verb", "defs": ["= ತಿಳಿಪು1."]}, {"type": "noun", "defs": ["= ತಿಳಿಪು2."]}], "ತಿಳುಪೇಱು": [{"type": "verb", "defs": ["to become lean, thin.", "to lose freshness, moisture; to fade; to wither."]}], "ತಿಳುವಳಿಕಸ್ತ": [{"type": "noun", "defs": ["= ತಿಳಿವಳಿಕಸ್ತ."]}], "ತಿಳುವಳಿಕಸ್ತೆ": [{"type": "noun", "defs": ["= ತಿಳಿವಳಿಕಸ್ತೆ."]}], "ತಿಳುವಿಕೆ": [{"type": "noun", "defs": ["= ತಿಳಿವಳಿಕೆ."]}], "ತಿಳುವು": [{"type": "noun", "defs": ["= ತಿಳಿವು."]}], "ತಿಳುಹಿಸು": [{"type": "verb", "defs": ["= ತಿಳಿಸು.", "to pacify (another or anther's anger); to calm down."]}], "ತಿಳುಹು": [{"type": "verb", "defs": ["= ತಿಳಿಪು1."]}, {"type": "noun", "defs": ["= ತಿಳಿಪು2."]}], "ತಿಳ್ಳಿ": [{"type": "noun", "defs": ["name of a particular game of boys."]}], "ತಿಱಿಕಲ್": [{"type": "noun", "defs": ["= ತಿಱಿಕಲ್ಲು."]}], "ತಿಱಿಕಲ್ಲಾಟ": [{"type": "noun", "defs": ["a play with pebbles."]}], "ತಿಱಿಕಲ್ಲಾಡು": [{"type": "verb", "defs": ["to throw pebbles up from the back of the palm and catch them in the palm."]}], "ತಿಱಿಕಲ್ಲು": [{"type": "noun", "defs": ["a pebble (used in a play) kept on the back of the palm, tossed and caught."]}], "ತಿಱಿಕುಳಿ": [{"type": "noun", "defs": ["= ತಿಱಿಕೊಱೆ."]}], "ತಿಱಿಕೊಱೆ": [{"type": "noun", "defs": ["a person who tends to pick up the left over grains on the agricultural field; a person who lives on such collection; a gleaner."]}], "ತಿಱಿಕೊಱೆಗೊಳ್": [{"type": "verb", "defs": ["to glean, collect."]}], "ತಿಱಿತರ್": [{"type": "verb", "defs": ["to collect (flowers, fruits, etc.) from plants."]}], "ತಿಱಿಸೇವಗೆ": [{"type": "noun", "defs": ["a kind of pasta in the form of slender, solid threads, thinner, cut into small pieces of usu. of uniform length."]}], "ತಿಱು": [{"type": "verb", "defs": ["to give to; to pass over into another's hand; to hand over.", "to pay (a sum of money)."]}], "ತಿಱುಕೆ": [{"type": "noun", "defs": ["the act of giving something."]}], "ತಿಱುವಂಗಡಿ": [{"type": "noun", "defs": ["a series of buildings along side of the compound wall of a temple.", "a room in a house where the idols of deities are kept for regular worship.", "a house of a respectable person."]}], "ತಿಱಱಗೆ": [{"type": "adverb", "defs": ["= ತಿಱಱನೆ"]}], "ತಿಱಱನೆ": [{"type": "adverb", "defs": ["(moving, rotating) in a whirling manner; whirlingly."]}], "ತಿೞ್ದು": [{"type": "verb", "defs": ["to make right; to change from wrong to right; to remove errors from; to correct.", "to make better by removing faults and defects; to reform.", "to train (a person, animal); to make suitable for a particular purpose.", "to make (things) tidy; to tidy up.", "to make ready; to prepare.", "to guide (another) to improve knowledge, ability, skill, etc.", "to become apt, correct or favourable.", "to foretell something good or favourable.", "to settle a quarrel or dispute; to reconcile conflicting parties.", "to be warded off; to be prevented from happening.", "to cause to flow in or as in a stream.", "to break and turn up or remove (ground, etc.) with a spade or other tool or with hands, claws, etc.", "to kill by stabbing.", "to delineate something in or paint, a picture.", "to write on a model letter to have a good control, and to master the art of writing.", "to read and mark corrections on (printers' proofs, etc.); to correct one's or another's writing.", "to cut or incise letters, designs, etc. in or on (a surface); to engrave.", "to repay completely a loan.", "to come to an end.", "to lessen (another's) burden, unbearable responsibility, etc.", "to allay or relieve (pain, an ache, etc.); to assuage; to soothe.", "to distribute; to disperse."]}], "ತೀಂಟು": [{"type": "verb", "defs": ["= ತೀಟು."]}], "ತೀಂಟೆ": [{"type": "noun", "defs": ["= ತೀಟೆ."]}, {"type": "noun", "defs": ["a piece of land higher than its adjacent land; a natural elevation of land.", "the raising ground on either side of a river, around a lake, pond or adjoining an ocean; shore or bank.", "a group of things placed, thrown or lying one on another; a heap.", "a raised platform.", "a raised seat.", "the top portion or section of anything."]}], "ತೀಂಟೆತ್ತು": [{"type": "verb", "defs": ["(the feeling of itching ) to be felt."]}], "ತೀಂತೆ": [{"type": "noun", "defs": ["= ತೀಟೆ."]}], "ತೀಂತೇರಾ": [{"type": "noun", "defs": ["= ತೀನತೇರ."]}], "ತೀಕು": [{"type": "verb", "defs": ["to move forward by or as by crawling.", "to exert oneself vigorously; to work hard; to struggle.", "(in marble game) to push the marble with one's knuckle.", "to take out grass, weeds, etc. by loosening the soil with a hoe or spade."]}], "ತೀಕೆ": [{"type": "noun", "defs": ["the plant Tridax procumbense of Asteraceae family."]}], "ತೀಕ್ಷ್ಣ": [{"type": "adjective", "defs": ["having a sharp edge or point; that can cut well; sharp; keen; fine edged; incisive.", "having or giving off heat; having a high temperature; hot.", "severe - a) harsh; unnecessarily extreme; b) serious or stern in manner or appearance; c) grave; critical.", "sharply affecting the organs of taste or smell, as if by a penetrating power; biting; acrid; pungent.", "vigorous; energetic; intense.", "feeling or showing keen desire; impatient or anxious to do or get; ardent; eager."]}, {"type": "noun", "defs": ["= ತೀಕ್ಷ್ಣತೆ.", "an instrument or device of any kind used to injure or kill; a weapon.", "a substance with an inherent property that tends to destroy life or impair health; poison.", "iron or steal.", "a conflict carried on by force of arms, as between nations or between parties within a nation; a war."]}], "ತೀಕ್ಷ್ಣಗಂಧಕ": [{"type": "noun", "defs": ["the tree Moringa Oleifera (= M. pterygosperma, = Hyperanthera moringa) of Moringaceae family; drum-stick tree.", "its slender, long edible fruit, used as a vegetable."]}], "ತೀಕ್ಷ್ಣಗು": [{"type": "noun", "defs": ["= ತೀಕ್ಷ್ಣಾಂಶು."]}], "ತೀಕ್ಷ್ಣಗೊಳಿಸು": [{"type": "verb", "defs": ["to make sharp or sharper; to sharpen; to hone; to whet.", "to make intense or more intense; to increase; to aggravate; to intensify."]}], "ತೀಕ್ಷ್ಣತೆ": [{"type": "noun", "defs": ["the quality of being sharp, keen; sharpness.", "the quality of having a high temperature; hotness.", "strictness; harshness; severity.", "the quality of being intense - a) extreme degree of anything; b) great energy or vehemence of emotion, thought, motion or activity."]}], "ತೀಕ್ಷ್ಣದೃಷ್ಟಿ": [{"type": "noun", "defs": ["the quality or fact of being sharp and quick in seeing; a keen vision; the probing attitude."]}], "ತೀಕ್ಷ್ಣಧಾರೆ": [{"type": "noun", "defs": ["the sharp blade of a weapon as a sword."]}], "ತೀಕ್ಷ್ಣಬುದ್ಧಿ": [{"type": "noun", "defs": ["= ತೀಕ್ಷ್ಣಮತಿ."]}], "ತೀಕ್ಷ್ಣಮತಿ": [{"type": "noun", "defs": ["quick, acute or penetrating intellect; acute cleverness; shrewdness.", "a person having sharp intelligence."]}], "ತೀಕ್ಷ್ಣಾಂಶು": [{"type": "noun", "defs": ["the sun, whose rays of light are hot."]}], "ತೀಕ್ಷ್ಣಾಗ್ನಿ": [{"type": "noun", "defs": ["the digestive faculty, esp. the bile that helps in digestion."]}], "ತೀಕ್ಷ್ಣಾಪಾಂಗ": [{"type": "noun", "defs": ["a piercing look from the corner of an eye that affects sharply the feelings of another."]}], "ತೀಕ್ಷ್ಣೀಕರಣ": [{"type": "noun", "defs": ["the act of making (something) sharp or sharper."]}]}