{"ನೀಲಿಬಳ್ಳಿ": [{"type": "noun", "defs": ["the plant Indigofera glabra of Papilionaceae family."]}], "ನೀಲಿಬೆಲ್ಲಡಕಿಲು": [{"type": "noun", "defs": ["the plant Trianthema portulacastrum (= T. monogyna, T. obcordata) of Aizoaceae family."]}], "ನೀಲಿಮರ": [{"type": "noun", "defs": ["the tree Bischofia javanica of Euphorbiaceae family."]}], "ನೀಲಿಮಾತು": [{"type": "noun", "defs": ["(fig.) a false statement; a lie."]}], "ನೀಲಿಮೆ": [{"type": "noun", "defs": ["the blue colour.", "the quality of being blue; blueness."]}], "ನೀಲಿರಂಗುಮರ": [{"type": "noun", "defs": ["the tree Haematoxylon campechianum of Caesalpiniaceae family; log wood."]}], "ನೀಲಿವಾರ್ತೆ": [{"type": "noun", "defs": ["a baseless, false news."]}], "ನೀಲಿಸಮಾಚಾರ": [{"type": "noun", "defs": ["= ನೀಲಿವಾರ್ತೆ."]}], "ನೀಲಿಸ್ಫಟಿಕ": [{"type": "noun", "defs": ["the plant Barleria lawii of Acanthaceae family; blue nail dye.", "its blue flower."]}], "ನೀಲೆ": [{"type": "noun", "defs": ["= ನೀಲಿ2 - 4 & 9."]}], "ನೀಲೋತ್ಪಲ": [{"type": "noun", "defs": ["the lotus plant Nymphaea stellata of Nymphaeaceae family.", "its flower; blue lotus."]}], "ನೀವ": [{"type": "noun", "defs": ["= ನೀವೆ."]}], "ನೀವರಣ": [{"type": "noun", "defs": ["that which prevents, hinders."]}], "ನೀವಳಿ": [{"type": "noun", "defs": ["= ನೀವಾಳಿ."]}], "ನೀವಳಿಗರೆ": [{"type": "verb", "defs": ["to throw out salt, dried pods of red-chilli, rice, water coloured with saffron, etc. waved before a person, for removing the bad effects of or driving out evil look, bad spirit, etc."]}], "ನೀವಳಿವಟ್ಟ": [{"type": "noun", "defs": ["complete destruction; annihilation."]}], "ನೀವಳಿವಟ್ಟಂಗೆಯ್": [{"type": "verb", "defs": ["to destroy completely; to annihilate."]}], "ನೀವಾಕ": [{"type": "noun", "defs": ["the condition of being in great demand, as of food items during famine.", "extreme and general scarcity of food, as in a country or a large geographical area; famine."]}], "ನೀವಾರ": [{"type": "noun", "defs": ["the grass Eragrostis deccanense (= E. spicata) of Poaceae family.", "its grain."]}], "ನೀವಾರಬಲಿ": [{"type": "noun", "defs": ["boiled grains of Eragrostis deccanensis, offered as an oblation."]}], "ನೀವಾಳಿ": [{"type": "noun", "defs": ["a waving before a person, of small quantities of salt, dried pods of red-chilli, rice, water coloured with saffron, etc. (for removing, driving out evil look, bad spirit, etc.).", "any of the things (as salt, rice, etc.) used in waving so 3. a votive lamp waved before a deity.", "a device for holding votive lamps while waving.", "a present given to a king of person of rank, as an expression of one's appreciation, submission, etc."]}], "ನೀವಾಳಿತೆಗೆ": [{"type": "verb", "defs": ["= ನೀವಾಳಿಸು - 1.", "(fig.) to look down upon; to treat contemptuously."]}], "ನೀವಾಳಿಯೆತ್ತು": [{"type": "verb", "defs": ["to wave before a person, small quantities of salt, dried pods of red-chilli, rice, water coloured with saffron, etc. (for removing the bad effects of or driving out evil look, bad spirit, etc.).", "to wave a votive lamp or lamps before a deity."]}], "ನೀವಾಳಿಸು": [{"type": "verb", "defs": ["to wave before a person, small quantities of salt, dried pods of red-chilli, rice, water coloured with saffron, etc. (for removing, driving out evil look, bad spirit, etc.).", "to wave a votive lamp or lamps before a deity.", "to move (something as a flag) up and down or back and forth.", "to shine brightly.", "(fig.) to swing and throw away."]}], "ನೀವಿ": [{"type": "noun", "defs": ["a knot tied to hold the sari (sire,a garment worn by Hindu women, consisting of a long piece of cotton or silk wrapped around the body with one end draped over the head or over one shoulder) at the waist.", "wealth (money or property) owned or used in business by a person, corporation, etc.; capital.", "something, esp. money, bet, as in a wager, game or contest.", "a narrow, long piece of unstitched cloth for tying round the waist."]}], "ನೀವಿಬಂಧ": [{"type": "noun", "defs": ["= ನೀವಿ - 1."]}], "ನೀವೀಬಂಧ": [{"type": "noun", "defs": ["= ನೀವಿ - 1."]}], "ನೀವೀಬಂಧನ": [{"type": "noun", "defs": ["= ನೀವಿ - 1."]}], "ನೀವೀಭರ": [{"type": "noun", "defs": ["= ನೀವಿ - 1."]}], "ನೀವು": [{"type": "verb", "defs": ["to give a massage to; to massage.", "to rub or pass over with a cloth, mop, etc., as for cleaning or drying; to clean or dry in this manner; to wipe.", "to pierce into; to stab; to pass into or through."]}, {"type": "pronoun", "defs": ["(pl.) the persons to whom one is speaking or writing (this is in the nominative case form)."]}], "ನೀವೆ": [{"type": "noun", "defs": ["the tree Garcinia xanthochymus (= G. pictoria, G. tinctoria, = Xanthochymus pictorius) of Guttiferae family."]}], "ನೀವ್ರ": [{"type": "noun", "defs": ["the overhanging lower edge of a roof; the eves.", "the roof of a building."]}], "ನೀಶಾರ": [{"type": "noun", "defs": ["a warm cloth or outer garment.", "a very fine cloth mesh or a curtain made of this, for keeping out mosquitoes.", "a cloth partition of or a wall-like vertical cover in, a tent."]}], "ನೀಸರ": [{"type": "noun", "defs": ["the main entrance into a fortified place."]}], "ನೀಸು": [{"type": "verb", "defs": ["to move in water by movements of the limbs, fins, tail, etc.; to swim.", "to bring about or succeed in accomplishing, sometimes despite difficulty or hardship; to manage.", "to have and use with satisfaction; have the benefit of; to enjoy."]}], "ನೀಹಾರ": [{"type": "noun", "defs": ["a large mass of water vapour condensed to fine particles, at or just above the earth's surface; thick, obscuring mist; fog.", "a discharging of waste matters from the bowels."]}], "ನೀಹಾರಕ": [{"type": "noun", "defs": ["a cloud of interstellar gas or dust; a nebula."]}], "ನೀಹಾರಕರ": [{"type": "noun", "defs": ["the moon, whose rays are cool."]}], "ನೀಹಾರಕಾಲ": [{"type": "noun", "defs": ["the coldest season of the year; winter."]}], "ನೀಹಾರಿಕೆ": [{"type": "noun", "defs": ["= ನೀಹಾರಕ."]}], "ನೀಳ್": [{"type": "verb", "defs": ["to be long or longer; to be elongated.", "to become longer as to take more time to be utter (as a syllable).", "to extend (as one's limb) as to reach out something.", "to be distributed over a wide area or through out.", "to gain importance; to become influential.", "to make long or longer; to elongate.", "to move forward vehemently.", "to become more, excessive.", "to hand over the possession to; to give.", "to excel (another in merit)."]}], "ನೀಳ": [{"type": "noun", "defs": ["the quality or fact of being long, longer; lengthiness.", "elevation or distance above a given level, as above the surface of the earth or sea; altitude; height.", "the measure of a bounded region on a plane or of the surface of a solid; area; ನೀಳದು nīḷadu that which is long or lengthy."]}, {"type": "adjective", "defs": ["having the colour of the clear sky or the deep sea; blue."]}, {"type": "noun", "defs": ["the colour of the clear sky or the deep sea; blue.", "any colour between green and violet in the spectrum; indigo.", "the plant Turpinia cochinchinensis (= T. nepalensis) of Staphyleaceae family.", "any of a genus (Indigofera) of plants, esp. Indigofera tinctoria, of Papilionaceae; indigo plant.", "the blue dye obtained from this plant.", "a clear, deep-blue variety of corundum, valued as a precious stone; sapphire.", "(myth.) one of the nine treasures of Kubēra, the Regent of Wealth.", "the bird Coracias benghalensis of Coraciidae family with brown body having blue wings and head; Indian roller.", "the sky.", "a horse which has white ears."]}], "ನೀಳಂಬಿಸು": [{"type": "verb", "defs": ["to draw out to greater length; to lengthen; to elongate."]}], "ನೀಳಕಾಯ": [{"type": "noun", "defs": ["a tall body.", "a man with tall body."]}], "ನೀಳಗಳ": [{"type": "noun", "defs": ["any male peafowl, esp., one of a species (Pavo cristatus) with black or dark blue neck; peacock.", "Śiva, whose neck is blue."]}], "ನೀಳಗಿರಿ": [{"type": "noun", "defs": ["a range of mountains situated between south-eastern parts of Karnāṭaka and forming the border between this state and Tamil Nāḍu.", "any of a genus (Eucalyptus) of tall, aromatic, evergreen trees (as Eucalyptus diversicolour, E, globulus, E. citriodora, E. tereticornis, etc.) of Myrtaceae family, bearing pendent leaves and umbels of white, red or pink flowers and valued for their timber, gum."]}], "ನೀಳಚೇಳ": [{"type": "noun", "defs": ["= ನೀಳಪಟ -1."]}], "ನೀಳಪಟ": [{"type": "noun", "defs": ["a piece of blue or dark-blue cloth.", "a sect of tāntrics (worshippers of the Power-aspect of the Supreme).", "a member of this sect."]}], "ನೀಳಮಣಿ": [{"type": "noun", "defs": ["= ನೀಳ3 - 6."]}], "ನೀಳರತ್ನ": [{"type": "noun", "defs": ["= ನೀಳ3 - 6."]}], "ನೀಳಾಳಕಿ": [{"type": "noun", "defs": ["a woman with dark hair."]}], "ನೀಳಾಳಕೆ": [{"type": "noun", "defs": ["= ನೀಳಾಳಕಿ."]}], "ನೀಳಿ": [{"type": "adjective", "defs": ["= ನೀಲಿ1."]}, {"type": "noun", "defs": ["= ನೀಲಿ2."]}], "ನೀಳಿಕೆ": [{"type": "noun", "defs": ["the quality, condition or fact of being long or longer."]}, {"type": "noun", "defs": ["= ನೀಲಿಕೆ."]}], "ನೀಳಿತು": [{"type": "noun", "defs": ["that which long, longer or lengthy."]}], "ನೀಳು": [{"type": "verb", "defs": ["= ನೀಳ್."]}], "ನೀಳೋತ್ಪಳ": [{"type": "noun", "defs": ["= ನೀಲೋತ್ಪಲ."]}], "ನೀಳ್ಕರಿಸು": [{"type": "verb", "defs": ["= ನೀಳಂಬಿಸು.", "to put off action; to linger; to loiter; to delay.", "to cause to give or let out (something).", "to be distributed over, occupy, a wide area.", "to extent (as one's limb) as to reach out something.", "to make loose or looser; to make less taut, less compact, etc.", "to become more; to grow in number, quantity or degree."]}, {"type": "verb", "defs": ["to ignore; to disregard; to ignore; to treat contemptuously.", "to ward off; to fend off (an evil).", "to become stiff, hard or rigid."]}], "ನೀಳ್ಕು": [{"type": "verb", "defs": ["to reach (something) by stretching one's hand.", "to be got, obtained or reached.", "to be recollected; to be called back to mind successfully.", "to go and reach (a place or stage).", "to rub or strike against.", "to hold out; to reach out; to stretch (as one's hand).", "to stand on one's toes, stretching the body upward.", "to wait in anticipation; to look for.", "to attain, gain or achieve.", "to start; to commence; to begin.", "to be seen; to appear.", "to become longer; to become elongated.", "to step beyond (the limit set); to transgress; to trespass.", "(in wrestling) to hold the opponent quickly and with force."]}], "ನೀಳ್ಕುಳಿಗೊಳ್": [{"type": "verb", "defs": ["to take into one's control; to seize; to capture.", "to be drawn towards; to be attracted by."]}], "ನೀಳ್ಕೆಯ್ಸು": [{"type": "verb", "defs": ["= ನೀಳಂಬಿಸು.", "to put off action; to linger; to loiter; to delay."]}], "ನೀಳ್ಕೊಳಿ": [{"type": "noun", "defs": ["(fig.) an agitating or being agitated; violent motion or stirring; agitation.", "emotional disturbance or excitement."]}], "ನೀಳ್ಗತೆ": [{"type": "noun", "defs": ["a prose narrative midway between the novel and the short story in length and scope."]}], "ನೀಳ್ಗಬ್ಬ": [{"type": "noun", "defs": ["= ನೀಳ್ಗವಿತೆ."]}], "ನೀಳ್ಗವನ": [{"type": "noun", "defs": ["= ನೀಳ್ಗವಿತೆ."]}], "ನೀಳ್ಗವಿತೆ": [{"type": "noun", "defs": ["a longer, usu. narrative, poem."]}], "ನೀಳ್ಗೈ": [{"type": "noun", "defs": ["a long arm.", "a device for lifting and moving heavy weights in suspension; a crane."]}], "ನೀಳ್ಪು": [{"type": "noun", "defs": ["the quality, condition or fact of being long, longer or lengthy.", "distance upward from a given level to a fixed point; height.", "the measure of a bounded region on a plane or of the surface of a solid; area."]}], "ನೀಳ್ಪುವಡೆ": [{"type": "verb", "defs": ["to become long, longer; to be drawn out to a greater length; to be elongated."]}], "ನೀಳ್ಪುವೆಱು": [{"type": "verb", "defs": ["= ನೀಳ್ಪುವಡೆ.", "to grow or rise to reach a higher level, position, etc."]}], "ನೀಱ": [{"type": "noun", "defs": ["a good-looking, handsome man.", "a beloved man.", "a courageous man."]}], "ನೀಱತನ": [{"type": "noun", "defs": ["the quality or fact of being good looking; handsomeness.", "physical or mental to venture, preserve and withstand danger, fear or difficulty; courage."]}], "ನೀಱತೆ": [{"type": "noun", "defs": ["= ನೀಱತನ."]}], "ನೀಱಲು": [{"type": "noun", "defs": ["the large-sized, evergreen tree Syzygium cumini (= Eugenia jambolana) of Myrtaceae family.", "its plum."]}], "ನೀಱು": [{"type": "noun", "defs": ["any solid substance reduced to a state of fine, loose particles by crushing, grinding, disintegration, etc.; powder.", "ashes of dry cow dung, used to smear on the body with the three fingers (forefinger, middle finger and ring finger of the right hand) as a sectarian mark."]}], "ನೀಱೆ": [{"type": "noun", "defs": ["a beautiful, charming woman.", "a beloved woman.", "a woman as related to a man whom she is married to; a wife."]}], "ನೀಱೆತನ": [{"type": "noun", "defs": ["that which is characteristic of or fit for a woman; feminine quality."]}], "ನೀಱೆರಕಲು": [{"type": "noun", "defs": ["a pouring or sprinkling of water.", "water falling from a height; a waterfall."]}], "ನೀೞ್ಕರಿಸು": [{"type": "verb", "defs": ["= ನೀಳ್ಕರಿಸು1."]}, {"type": "verb", "defs": ["= ನೀಳ್ಕರಿಸು2."]}], "ನುಂಗಣೆ": [{"type": "noun", "defs": ["the act of swallowing."]}], "ನುಂಗಿ": [{"type": "verb", "defs": ["the person who swallows; a swallower.", "that which can be swallowed."]}], "ನುಂಗಿಸು": [{"type": "verb", "defs": ["to cause to swallow (as a pill)."]}], "ನುಂಗು": [{"type": "verb", "defs": ["to take into the stomach food, drink or other substances, etc. by drawing through the throat and oesophagus with a series of voluntary muscular action.", "to conceal, hide something within oneself.", "to eat, consume, etc. as food.", "to destroy, wipe out completely.", "to kill; to end another's life.", "to cover with or as with a veil.", "to restrain, keep in check or suppress deliberate (as one's feelings, anger, etc.).", "to swindle, misappropriate another's money, property, illegally, under false pretences, etc.", "ನುಂಗಲಾರದ ಗುಳಿಗೆ nungalārada guḷige (fig.) an unacceptable, unfavourable solution to a problem imposed on; ನುಂಗಲಾರದ ತುತ್ತು nungalārada tuttu that which is unmanageable (esp. something that is imposed on). 2. that which is very hard to understood; ನುಂಗಿಕೊಳ್ಳು nungikoḷḷu to swallow (as a food item, drink, etc.). 2. to refrain from expressing (one's anger, reaction against humiliation, etc.); to hold back; to suppress; ನುಂಗಿ ನೀರು ಕುಡಿ nungi nīru kuḍi = ನುಂಗಿಹಾಕು; 2. to spoil or destroy completely; ನುಂಗಿ ನೊಣೆ nungi noṇe = ನುಂಗಿ ನೀರು ಕುಡಿ – 2; ನುಂಗಿಹಾಕು nungi hāku to swindle, misappropriate another's or other's money, property, etc. illegally or under false pretences."]}, {"type": "noun", "defs": ["a piece of cloth used to cover or conceal something; a veil."]}, {"type": "noun", "defs": ["the palm tree Borassum flbellifer (= B. flabelliformis) of Arecaceae family."]}], "ನುಂಗುಂಗಣ್ಣು": [{"type": "noun", "defs": ["a looking gazingly, with harsh, harmful intention."]}], "ನುಂಗುಹ": [{"type": "noun", "defs": ["= ನುಂಗಣೆ."]}], "ನುಂಚರ": [{"type": "noun", "defs": ["a melodious sound or tone.", "the pleasing sound of the anklets."]}], "ನುಂಪಡರ್": [{"type": "verb", "defs": ["to become tender, nice, smooth, etc.", "to be or become beautiful or attractive."]}], "ನುಂಪಿಡಿ": [{"type": "noun", "defs": ["= ನುಂಪಡರ್."]}], "ನುಂಪಿಸು": [{"type": "verb", "defs": ["to make something tender, nice, smooth, etc.", "to make attractive; to beautify."]}], "ನುಂಪು": [{"type": "noun", "defs": ["the quality or condition of being tender; tenderness.", "the quality or condition of being smooth; smoothness.", "the quality or condition of being bright, lustrous; brightness; lustre.", "the quality or condition of being delightful; loveliness; charm.", "the act, fact or tendency of slipping, sliding (as on a smooth, wet, oily surface).", "pleasing sounds or arrangement of sounds in sequence or musical quality, as in the arrangement of words; melody.", "a substance used for polishing.", "a pretending or cheating."]}], "ನುಕಸಾನಿ": [{"type": "noun", "defs": ["= ನುಕ್ಸಾನು."]}], "ನುಕಸಾನು": [{"type": "noun", "defs": ["= ನುಕ್ಸಾನು."]}], "ನುಕ್ಸಾನು": [{"type": "noun", "defs": ["the act of losing possession.", "the harm or privation resulting from loss or separation; loss.", "an instance of losing; loss.", "a thing or an amount that is lost; loss."]}], "ನುಗಿಸು": [{"type": "verb", "defs": ["to cause to exert pressure or force to move an object, person, etc.", "to thrust forcefully as to move in the required direction; to push; to shove.", "to push or force (something) to enter into."]}], "ನುಗುತೆ": [{"type": "noun", "defs": ["the act of entering (into)."]}], "ನುಗುತೆಗಂಡಿ": [{"type": "noun", "defs": ["the point of entering; an entrance, esp. relatively narrow one."]}], "ನುಗುಳ್": [{"type": "verb", "defs": ["= ನುಗುಳು."]}], "ನುಗುಳಿಸು": [{"type": "verb", "defs": ["= ನುಗಿಸು - 3."]}], "ನುಗುಳು": [{"type": "verb", "defs": ["to enter (into) (esp. forcefully or with difficulty).", "to slip away; to escape secretly."]}], "ನುಗುಳುಗಂಡಿ": [{"type": "noun", "defs": ["= ನುಗುತೆಗಂಡಿ."]}], "ನುಗುಳ್ಚು": [{"type": "verb", "defs": ["= ನುಗುಳು - 1."]}], "ನುಗುೞ್": [{"type": "verb", "defs": ["= ನುಗುಳು."]}], "ನುಗ್ಗಡಿ": [{"type": "noun", "defs": ["a part broken away from a whole; a broken piece; a fragment."]}], "ನುಗ್ಗರಿ": [{"type": "verb", "defs": ["to break and reduce into very small pieces."]}], "ನುಗ್ಗರೆ": [{"type": "verb", "defs": ["to reduce to dust or powder, as by pounding or grinding."]}], "ನುಗ್ಗಾಟ": [{"type": "noun", "defs": ["a headlong rush or flight of a large group of people as from fear or confusion."]}], "ನುಗ್ಗಾಡು": [{"type": "verb", "defs": ["to make a way and enter with difficulty in to a large group of people standing closely together.", "(a large group of people) to rush headlong as from confusion or fear."]}], "ನುಗ್ಗಿ": [{"type": "noun", "defs": ["= ನುಗ್ಗೆ."]}], "ನುಗ್ಗಿಸು": [{"type": "verb", "defs": ["to push or force (something) to enter into."]}], "ನುಗ್ಗು": [{"type": "verb", "defs": ["to move into, with difficulty, a group of people standing closely together or pass through a relatively narrow passage.", "to enter (into).", "to rush forword or toward vehemently."]}, {"type": "verb", "defs": ["to break and reduce into very small pieces.", "(one's growth, development) to be checked; to be stunted.", "to be broken and reduced into very small pieces.", "to have experience of and be accustomed to; to experience and be seasoned.", "to press from opposite or all sides; to squeeze.", "to subdue; to subjugate.", "to become suitable for (after undergoing certain process or experience)."]}, {"type": "noun", "defs": ["= ನುಗ್ಗಾಟ."]}, {"type": "noun", "defs": ["broken pieces of something.", "that which is weak, and which has fallen or likely to fall in to pieces.", "a person of little or no importance or of inferior quality.", "(dial.) flattened and dried cow dung,", "ನುಗ್ಗಾಗು nuggāgu to be reduced to pieces; to be broken into small pieces; 2. to lose strength, lustre; to become pale from weakness; ನುಗ್ಗು ನುಚ್ಚುಮಾಡು nuggu nuccu māḍu = ನುಗ್ಗುಗುಟ್ಟು; ನುಗ್ಗು ಮಾಡು nuggu māḍu to weaken; 2. to impair the form or shape of, as by blowing heavily, squeezing, etc.; ನುಗ್ಗು ಹಾಕು nuggu hāku to pile up flattened and dried cow dung."]}], "ನುಗ್ಗುಗುಟ್ಟು": [{"type": "verb", "defs": ["to reduce to very small particles; to pulverise.", "to shatter, demolish to destroy completely."]}], "ನುಗ್ಗುಗೆಯ್": [{"type": "verb", "defs": ["= ನುಗ್ಗುಗುಟ್ಟು."]}], "ನುಗ್ಗುಗೈ": [{"type": "verb", "defs": ["= ನುಗ್ಗುಗುಟ್ಟು."]}], "ನುಗ್ಗುನುರಿ": [{"type": "noun", "defs": ["the condition of being pulverised to very small pieces or particles.", "that which is shattered and utterly weakened."]}], "ನುಗ್ಗುನುಸಿ": [{"type": "noun", "defs": ["= ನುಗ್ಗುನುರಿ.", "ನುಗ್ಗುನುಸಿ ಮಾಡು nuggu nusi māḍu = ನುಗ್ಗುಗುಟ್ಟು; ನುಗ್ಗುನುಸಿಯಾಗು nuggu nusiyāgu to be reduced to very small particles; to be pulverised; 2. to be shattered, demolished completely."]}], "ನುಗ್ಗುನುಱಿ": [{"type": "noun", "defs": ["= ನುಗ್ಗುನುರಿ."]}], "ನುಗ್ಗುನೆರೆ": [{"type": "noun", "defs": ["an heavy flood inundating a large area."]}], "ನುಗ್ಗುಮೊನೆ": [{"type": "noun", "defs": ["the leading group of an army that goes ahead in an endeavour, esp. in an attack; spearhead."]}], "ನುಗ್ಗುವೊಯ್": [{"type": "verb", "defs": ["to break (something) into pieces, as by a blow."]}], "ನುಗ್ಗೆ": [{"type": "noun", "defs": ["the small or medium sized, deciduous tree Moringa Oleifera (= M. pterygosperma, = Hyperanthera moringa) of Moringaceae family, with tripinnate leaves (used as vegetable), and smooth, but weak, wood; drum stick tree.", "its slender, long fruit, which is used as vegetable; drum stick."]}], "ನುಗ್ಗೇಳು": [{"type": "verb", "defs": ["to be reduced to very small particles; to be pulverised.", "to be defeated humiliatingly."]}], "ನುಗ್ಗೊತ್ತು": [{"type": "verb", "defs": ["to press, squeeze, using heavy pressure.", "to conquer and make subservient; to subjugate.", "to be pressed or squeezed intensely."]}], "ನುಚ್ಚಕ್ಕಿ": [{"type": "noun", "defs": ["broken grains of rice."]}], "ನುಚ್ಚು": [{"type": "noun", "defs": ["small broken pieces chiefly of grains.", "a kind of gruel made of broken grains of rice, jowar etc.", "a man of inferior quality or worthy of little regard."]}], "ನುಚ್ಚುಗ": [{"type": "noun", "defs": ["= ನುಚ್ಚು - 3."]}], "ನುಚ್ಚುಗಳ್ಳ": [{"type": "noun", "defs": ["a man who commits petty thefts; a petty thief."]}], "ನುಚ್ಚುಗುಟ್ಟು": [{"type": "verb", "defs": ["to smash into pieces; to pulverise; to demolish; to destroy."]}], "ನುಚ್ಚುಗೂಳು": [{"type": "noun", "defs": ["= ನುಚ್ಚು - 2."]}], "ನುಚ್ಚುಗೂೞ್": [{"type": "noun", "defs": ["= ನುಚ್ಚು - 2."]}], "ನುಚ್ಚುಗೋಣಿ": [{"type": "noun", "defs": ["= ನುಚ್ಚುಗೋಳಿ."]}], "ನುಚ್ಚುಗೋಳಿ": [{"type": "noun", "defs": ["the prostrate, annual potherb Portulaca oleracea of Portulacaceae family; common Indian purslane."]}], "ನುಚ್ಚುಗೋಳಿಪಲ್ಯ": [{"type": "noun", "defs": ["= ನುಚ್ಚುಗೋಳಿ."]}], "ನುಚ್ಚುದಱಿ": [{"type": "verb", "defs": ["to mince or chop up into very small pieces."]}], "ನುಚ್ಚುನುಗ್ಗಡಿ": [{"type": "noun", "defs": ["= ನುಗ್ಗುನುರಿ."]}], "ನುಚ್ಚುನುರಿ": [{"type": "noun", "defs": ["= ನುಗ್ಗುನುರಿ."]}], "ನುಚ್ಚುನುಱಿ": [{"type": "noun", "defs": ["= ನುಗ್ಗುನುರಿ."]}], "ನುಚ್ಚುನೂರು": [{"type": "noun", "defs": ["= ನುಗ್ಗುನುರಿ."]}], "ನುಚ್ಚುನೂಱು": [{"type": "noun", "defs": ["= ನುಗ್ಗುನುರಿ."]}], "ನುಚ್ಚುಬಡಿ": [{"type": "verb", "defs": ["= ನುಗ್ಗುಗುಟ್ಟು."]}], "ನುಚ್ಚುಮಲ್ಲಿಗೆ": [{"type": "noun", "defs": ["a variety of jasmine plant.", "its flower."]}], "ನುಜುಗು": [{"type": "adjective", "defs": ["of very ordinary or inferior quality."]}], "ನುಜ್ಜು": [{"type": "noun", "defs": ["the condition of being crushed, squashed."]}], "ನುಡಿ": [{"type": "verb", "defs": ["to express audible sounds, syllables, words, thoughts, etc.; to utter.", "to repeat a hymn or verse (as in worship).", "to foretell (a future event) by or as by the influence of divine guidance; to prophesy; to predict.", "(a musical instrument) to produce a sound or note.", "to regard with scorn; to treat with contempt.", "to give, in words, a detailed account of; to describe.", "to make a promise; to promise.", "to object; to express one's objection in (harsh) words."]}, {"type": "noun", "defs": ["that which is uttered as a word or words; an utterance.", "all the vocal sounds, words, and ways of combining them common to a particular nation, tribe or other speech community; a language.", "a sentence or statement made or written by someone quoted often by others; a quotation.", "a short, traditional saying that expresses some obvious truth or familiar experience; a proverb; an adage.", "the art of using words effectively and fluently in speaking or writing; eloquence.", "a harsh censure or blame.", "a command, direction or instruction, backed by authority; an order.", "a foretelling; prediction of the future; prophecy.", "a group of lines of a verse forming one of the divisions of song."]}], "ನುಡಿಕಟ್ಟು": [{"type": "noun", "defs": ["= ನುಡಿಗಟ್ಟು."]}], "ನುಡಿಕಾರ": [{"type": "noun", "defs": ["the quality of sound, musical note, etc. (produced vocally or by playing on a musical instrument) that is clear, distinct and accurate.", "a man who can speak forcefully, fluently and gracefully; an eloquent man."]}], "ನುಡಿಕಾರ್ತಿ": [{"type": "noun", "defs": ["a woman who can speak forcefully, fluently and gracefully; an eloquent woman."]}], "ನುಡಿಕಾಱ": [{"type": "noun", "defs": ["= ನುಡಿಕಾರ - 2."]}], "ನುಡಿಕೆ": [{"type": "noun", "defs": ["= ನುಡಿಕಾರ - 1."]}], "ನುಡಿಕೊಡು": [{"type": "verb", "defs": ["= ನುಡಿಗೊಡು."]}], "ನುಡಿಗ": [{"type": "noun", "defs": ["a man who foretells a future event (under the supposed divine influence); a prophesier."]}], "ನುಡಿಗಟ್ಟು": [{"type": "noun", "defs": ["a phrase, construction or expression that is considered as a unit, whose intended meaning is different from and more effective than the literal meaning of its individual words or words that make the unit."]}], "ನುಡಿಗಣ್ಣು": [{"type": "noun", "defs": ["an eye that expresses or conveys an idea effectively by its movement."]}], "ನುಡಿಗಬ್ಬ": [{"type": "noun", "defs": ["a prose composition."]}], "ನುಡಿಗಲ್": [{"type": "verb", "defs": ["= ನುಡಿಗಲಿ."]}], "ನುಡಿಗಲಿ": [{"type": "verb", "defs": ["to learn to talk.", "to learn a language."]}], "ನುಡಿಗಲಿಸು": [{"type": "verb", "defs": ["to help (a child, parrot, etc.) to learn talking.", "to teach a language."]}], "ನುಡಿಗಾರ": [{"type": "noun", "defs": ["= ನುಡಿಕಾರ - 2."]}], "ನುಡಿಗಾರಿಕೆÉ": [{"type": "noun", "defs": ["the art of using language with fluency and effectiveness."]}], "ನುಡಿಗಾಱ": [{"type": "noun", "defs": ["= ನುಡಿಕಾರ - 2."]}], "ನುಡಿಗಾಱಿಕೆ": [{"type": "noun", "defs": ["= ನುಡಿಗಾರಿಕೆ."]}], "ನುಡಿಗುಂದು": [{"type": "verb", "defs": ["to fail to talk, communicate or answer."]}], "ನುಡಿಗುಡು": [{"type": "verb", "defs": ["= ನುಡಿಗೊಡು."]}], "ನುಡಿಗೆಡು": [{"type": "verb", "defs": ["= ನುಡಿಗುಂದು; 2.to be above being described in words."]}], "ನುಡಿಗೇಡು": [{"type": "noun", "defs": ["ineffective, erroneous or inaccurate speech or saying.", "the act or an instance of breaking one's promise."]}], "ನುಡಿಗೇಡುಗ": [{"type": "noun", "defs": ["a man who does not keep his promise."]}], "ನುಡಿಗೇಳ್": [{"type": "verb", "defs": ["= ನುಡಿಗೇಳು."]}], "ನುಡಿಗೇಳು": [{"type": "verb", "defs": ["to listen to; to hear.", "to pay close attention to another's advice."]}], "ನುಡಿಗೊಡು": [{"type": "verb", "defs": ["to express one's thought, feeling, idea, etc. in words; to give words to.", "to make a promise; to promise."]}], "ನುಡಿಜಾಣ": [{"type": "noun", "defs": ["= ನುಡಿಕಾರ - 2."]}], "ನುಡಿಜಾಣೆ": [{"type": "noun", "defs": ["= ನುಡಿಕಾರ್ತಿ."]}], "ನುಡಿಜಾಣ್ಮೆ": [{"type": "noun", "defs": ["= ನುಡಿಗಾರಿಕೆ."]}], "ನುಡಿತ": [{"type": "noun", "defs": ["= ನುಡಿಕಾರ - 1."]}], "ನುಡಿತಟ್ಟೆ": [{"type": "noun", "defs": ["a thin, flat, grooved disc on which a speech, music etc. are recorded; an audio record."]}], "ನುಡಿತೆ": [{"type": "noun", "defs": ["that which is uttered as a word or words; an utterance."]}], "ನುಡಿದಪ್ಪು": [{"type": "verb", "defs": ["to break one's promise; to fail to keep one's words."]}, {"type": "noun", "defs": ["a breaking one's promise; failure to keep one's words."]}], "ನುಡಿದೊಡು": [{"type": "verb", "defs": ["to make a solemn resolution to do, get, etc.; 2 to promise solemnly."]}], "ನುಡಿಯಾಟ": [{"type": "noun", "defs": ["the act or manner of speaking."]}], "ನುಡಿಯಾಡು": [{"type": "verb", "defs": ["to speak; to utter.", "to foretell; to predict a future event."]}], "ನುಡಿಯಿಸು": [{"type": "verb", "defs": ["= ನುಡಿಸು."]}], "ನುಡಿಯುಡುಗು": [{"type": "verb", "defs": ["(one's speaking, answering ability) to fail; to become impaired."]}], "ನುಡಿಲಿಂಗ": [{"type": "noun", "defs": ["a Śaiva mendicant, considered as Śiva himself."]}], "ನುಡಿವಕ್ಕಿ": [{"type": "noun", "defs": ["a parrot, that can learn to imitate human speech."]}], "ನುಡಿವಡೆ": [{"type": "verb", "defs": ["to produce a sound or sounds."]}], "ನುಡಿವಲ್ಮೆ": [{"type": "noun", "defs": ["the effectiveness, forcefulness and attractiveness of speech; eloquence."]}], "ನುಡಿವಳಿ": [{"type": "noun", "defs": ["the act of communicating through spoken words.", "the manner or style of speaking.", "a declaration that something will or will not be done, given, etc., by one, often made solemnly; a promise."]}], "ನುಡಿವಳಿಕಾಱ": [{"type": "noun", "defs": ["a man who can speak forcefully, fluently and gracefully; an eloquent man."]}], "ನುಡಿವಳಿಕೆ": [{"type": "noun", "defs": ["= ನುಡಿವಳಿ - 1 & 2."]}], "ನುಡಿವಳ್ಳ": [{"type": "noun", "defs": ["= ನುಡಿವಾಳ."]}], "ನುಡಿವಾಳ": [{"type": "noun", "defs": ["a very talkative man; he who is fond of talking."]}], "ನುಡಿವೆಣ್": [{"type": "noun", "defs": ["= ನುಡಿವೆಣ್ಣು."]}], "ನುಡಿವೆಣ": [{"type": "noun", "defs": ["(fig) a useless, worthless, incompetent man; a corpse-like man."]}], "ನುಡಿವೆಣ್ಣು": [{"type": "noun", "defs": ["Sarasvati, the Goddess of speech."]}], "ನುಡಿವೇಟ": [{"type": "noun", "defs": ["a strong desire, roused by hearing the voice of person of opposite sex, to have sexual relation.", "satisfaction or sexual pleasure derived from listening to another's voice."]}], "ನುಡಿಸಲ್ಗೆ": [{"type": "noun", "defs": ["the fact of being lenient in talking or deliberately allowing another to speak to one freely and without inhibitions."]}], "ನುಡಿಸು": [{"type": "verb", "defs": ["to cause to speak.", "to speak to.", "to produce a sound or series of notes by playing a musical instrument.", "to pluck the string of a bow as to make a vibrant sound."]}], "ನುಡಿಸುಹ": [{"type": "noun", "defs": ["the act of speaking or making another speak.", "a playing of a musical instrument."]}], "ನುಡಿಹ": [{"type": "noun", "defs": ["= ನುಡಿಸುಹ - 1."]}], "ನುಡಿಹೀನ": [{"type": "noun", "defs": ["a person who is poor in speaking or in the art of using the language."]}], "ನುಣಾಮರ": [{"type": "noun", "defs": ["the shrub or small tree Morinda citrifolia of Rubiaceae family.", "another of the same family Morinda tinctoria.", "another of the same family Morinda umbellata."]}], "ನುಣಿಚು": [{"type": "verb", "defs": ["= ನುಣುಚು1."]}], "ನುಣುಚು": [{"type": "verb", "defs": ["to move, flow, pass or go smoothly or easily; to glide; to slide; to slip (as from the fingers).", "to escape secretly."]}, {"type": "noun", "defs": ["the act of slipping down or away smoothly.", "the quality being evasive or elusive."]}], "ನುಣುಪು": [{"type": "noun", "defs": ["the quality or condition of being tender; tenderness.", "the quality or condition of being smooth; smoothness.", "the quality or condition of being bright, lustrous; brightness; lustre.", "the quality or condition of being delightful; loveliness; charm.", "the act, fact or tendency of slipping, sliding (as on a smooth, wet, oily surface).", "pleasing sounds or arrangement of sounds in sequence or musical quality, as in the arrangement of words; melody.", "a substance used for polishing.", "a pretending or cheating."]}], "ನುಣುಪುಗೊಳಿಸು": [{"type": "verb", "defs": ["to make smooth and glossy, esp. by friction or rubbing with some substance as a polishing agent."]}], "ನುಣ್ಗಟಕಿ": [{"type": "noun", "defs": ["a cutting or pungent remark; a sarcastic saying."]}], "ನುಣ್ಗೊರಲ್": [{"type": "noun", "defs": ["= ನುಣ್ಗೊರಳು."]}], "ನುಣ್ಗೊರಲ": [{"type": "noun", "defs": ["= ನುಣ್ಗೊರಳ."]}], "ನುಣ್ಗೊರಲು": [{"type": "noun", "defs": ["= ನುಣ್ಗೊರಳು."]}], "ನುಣ್ಗೊರಳ್": [{"type": "noun", "defs": ["= ನುಣ್ಗೊರಳು."]}], "ನುಣ್ಗೊರಳ": [{"type": "noun", "defs": ["a man having sweet voice.", "a man whose neck is beautiful."]}], "ನುಣ್ಗೊರಳು": [{"type": "noun", "defs": ["a beautiful neck.", "sweet or melodious voice."]}], "ನುಣ್ಚರ": [{"type": "noun", "defs": ["a melodious sound or tone.", "the pleasing sound of the anklets."]}], "ನುಣ್ಚು": [{"type": "verb", "defs": ["= ನುಣುಚು1."]}], "ನುಣ್ಣಗೆ": [{"type": "adverb", "defs": ["smoothly.", "beautifully; attractively.", "turning in to fine particles.", "completely.", "ನುಣ್ಣಗೆ ಮಾಡು nuṇṇage māḍu to smoothen (the surface of) and make glossy; 2. to shave (another's head) completely; 3. to erase, obliterate or destroy completely; 4. (fig.) to spend another's money completely without latters's approval or liking; ನುಣ್ಣಗಾಗು nuṇṇagāgu to be ground to fine particles; to become very fine; 2. to become melodious; 3. to become subtle."]}], "ನುಣ್ಣನೆ": [{"type": "adverb", "defs": ["= ನುಣ್ಣಗೆ."]}], "ನುಣ್ಣನೆಯ": [{"type": "adjective", "defs": ["consisting of minute particle; fine.", "free from projections or unevenness of surface; not rough; smooth.", "pleasing to the ear; delicate, pleasant or agreeable (said of sound); musical."]}], "ನುಣ್ಣಮಾತು": [{"type": "noun", "defs": ["sweet, delicately persuasive speech."]}], "ನುಣ್ಣಿತು": [{"type": "adjective", "defs": ["= ನುಣ್ಣನೆಯ.", "shining; bright; reflecting keenly.", "beautiful; attractive.", "having an agreeable manner, appearance, etc.; amiable; pleasant.", "much loved; beloved.", "sharp; cutting; keen."]}, {"type": "noun", "defs": ["that which is - a) smooth, tender; b) bright, shining; c) beautiful, attractive; d) agreeable, amiable; e) sharp, keen; e) loveable; f) musical, melodious."]}], "ನುಣ್ಣಿತ್ತು": [{"type": "adjective", "defs": ["= ನುಣ್ಣಿತು1."]}, {"type": "noun", "defs": ["= ನುಣ್ಣಿತು2."]}], "ನುಣ್ಣಿರ್": [{"type": "verb", "defs": ["to be very smooth or fine (as having very minute particles or perfectly even surface)."]}], "ನುಣ್ಣಿಸು": [{"type": "verb", "defs": ["to smoothen (the surface of).", "to make glossy or bright.", "to make beautiful or attractive.", "to daub; to smear with.", "to touch or cause to touch.", "to sharpen; to whet.", "to make (something) suitable, fit, etc.", "to reduce to fine particles by or as by grinding."]}], "ನುಣ್ಣುಡಿ": [{"type": "noun", "defs": ["= ನುಣ್ಣಮಾತು."]}], "ನುಣ್ದನಿ": [{"type": "noun", "defs": ["= ನುಣ್ಚರ - 1."]}], "ನುಣ್ದನಿವಿಡು": [{"type": "verb", "defs": ["to speak or sing in a sweet voice."]}], "ನುಣ್ಪಡರ್": [{"type": "verb", "defs": ["to become tender, nice, smooth, etc.", "to be or become beautiful or attractive."]}], "ನುಣ್ಪಡಸು": [{"type": "verb", "defs": ["to be lustrous, shining or glittering.", "to be or become beautiful."]}], "ನುಣ್ಪಿಕ್ಕು": [{"type": "verb", "defs": ["= ನುಣ್ಣಿಸು."]}], "ನುಣ್ಪಿಡಿ": [{"type": "verb", "defs": ["to become tender, nice, smooth, etc.", "to be or become beautiful or attractive."]}], "ನುಣ್ಪಿಡು": [{"type": "verb", "defs": ["= ನುಣ್ಣಿಸು."]}], "ನುಣ್ಪು": [{"type": "noun", "defs": ["= ನುಣುಪು."]}], "ನುಣ್ಪುವಡು": [{"type": "verb", "defs": ["= ನುಣ್ಪಿಡಿ.", "to become melodious."]}], "ನುಣ್ಪುವಡೆ": [{"type": "verb", "defs": ["= ನುಣ್ಪುವಡು."]}], "ನುಣ್ಪುವೆಱು": [{"type": "verb", "defs": ["= ನುಣ್ಪುವಡು."]}], "ನುಣ್ಪೆಸೆ": [{"type": "verb", "defs": ["= ನುಣ್ಪಿಡಿ."]}], "ನುಣ್ಪೇಳು": [{"type": "verb", "defs": ["= ನುಣ್ಪಿಡಿ."]}], "ನುಣ್ಪೇಱು": [{"type": "verb", "defs": ["= ನುಣ್ಪಿಡಿ."]}], "ನುಣ್ಬೊದೆ": [{"type": "verb", "defs": ["= ನುಣ್ಪಿಡಿ."]}], "ನುಣ್ಮಾತು": [{"type": "noun", "defs": ["= ನುಣ್ಣಮಾತು."]}], "ನುಣ್ಸರ": [{"type": "noun", "defs": ["= ನುಣ್ಚರ."]}], "ನುತ": [{"type": "adjective", "defs": ["praised; lauded.", "excellent.", "famous; well-known; renowned."]}, {"type": "noun", "defs": ["= ನುತಿ - 1."]}], "ನುತಿ": [{"type": "noun", "defs": ["the act of praising; praise; commendation; laudation.", "a worshipping; a religious service.", "a recognition of talent, merit, goodness, etc.", "the state of being well known; wide and favourable recognition; renown; fame."]}], "ನುತಿಗೆಯ್": [{"type": "verb", "defs": ["= ನುತಿಸು."]}], "ನುತಿಗೈ": [{"type": "verb", "defs": ["= ನುತಿಸು."]}], "ನುತಿಗೊಡು": [{"type": "verb", "defs": ["= ನುತಿಸು - 1."]}], "ನುತಿಯಿಸು": [{"type": "verb", "defs": ["= ನುತಿಸು."]}], "ನುತಿವಡೆ": [{"type": "verb", "defs": ["to become famous; to get wide and favourable recognition.", "to be praised, commended (for something)."]}], "ನುತಿವಾದ": [{"type": "noun", "defs": ["a speech in praise of someone."]}], "ನುತಿವೆಱು": [{"type": "verb", "defs": ["= ನುತಿವಡೆ."]}], "ನುತಿಸು": [{"type": "verb", "defs": ["to commend the worth of; to admire; to praise; to laud.", "to flatter untruly in order to get a favour."]}], "ನುತ್ತ": [{"type": "adjective", "defs": ["pushed, driven out; expelled.", "despatched; sent."]}, {"type": "noun", "defs": ["that which is pushed, driven out or expelled.", "the thing that is despatched or sent."]}], "ನುನುನ್ನಿಗಿಡ": [{"type": "noun", "defs": ["the plant Kalanchoe floribunda of Crassulaceae family."]}], "ನುನ್ನ": [{"type": "noun", "defs": ["= ನುತ್ತ2 - 2.", "(math.) a finding the difference between two numbers of quantities; subtraction."]}], "ನುನ್ನಿತ": [{"type": "adjective", "defs": ["that has gone; passed; elapsed."]}], "ನುರಿ": [{"type": "verb", "defs": ["to be reduced to small pieces or fine particles; to be pulverised or ground.", "to reduce to small pieces or fine particles; to pulverise or grind.", "to be well trained (as in a trade, art, etc.).", "ನುರಿತ ಕೈ nurita kai a person of skill and experience; a well-trained person."]}, {"type": "noun", "defs": ["fine lose particles (as pulverised or ground); powder."]}], "ನುರಿಗ": [{"type": "noun", "defs": ["the plant Hibiscus cannabinus of Malvaceae family."]}], "ನುರಿನುಳ್ಗು": [{"type": "verb", "defs": ["to be reduced to very small particles; to be pulverised.", "to be shattered, demolished completely."]}], "ನುರಿವಡೆ": [{"type": "verb", "defs": ["= ನುರಿನುಳ್ಗು - 1."]}], "ನುರಿಸು": [{"type": "verb", "defs": ["= ನುರಿ1 - 2.", "to train well (in a trade, art, etc.).", "to turn (something) over in the mind; to meditate (on).", "to grind (food) with the teeth."]}], "ನುರುಕು": [{"type": "verb", "defs": ["= ನುರುಗು."]}], "ನುರುಗು": [{"type": "verb", "defs": ["to break and reduce into very small pieces.", "to be broken and reduced into very small pieces.", "(one's growth, development) to be checked; to be stunted.", "to have experience of and be accustomed to; to experience and be seasoned.", "to press from opposite or all sides; to squeeze.", "to subdue; to subjugate.", "to become suitable for (after undergoing certain process or experience)."]}], "ನುರುಜು": [{"type": "noun", "defs": ["a loose mixture of pebbles and rock fragments coarser than sand, often mixed with clay, etc.; gravel; grit."]}], "ನುರುಜುಕಲ್ಲು": [{"type": "noun", "defs": ["a small piece of stone that is smooth and round in shape."]}], "ನುರುಜುಗಲ್ಲು": [{"type": "noun", "defs": ["= ನುರುಜುಕಲ್ಲು."]}], "ನುರುಹು": [{"type": "verb", "defs": ["= ನುರಿ1 - 2."]}], "ನುರ್ಗಾಡು": [{"type": "verb", "defs": ["to break or split into pieces."]}], "ನುರ್ಗಿಸು": [{"type": "verb", "defs": ["to reduce to small pieces or fine particles; to pulverise or grind.", "to cause to pulverise or grind."]}], "ನುರ್ಗು": [{"type": "verb", "defs": ["to move into, with difficulty, a group of people standing closely together or pass through a relatively narrow passage.", "to enter (into).", "to rush oneself toward or forward vehemently."]}, {"type": "verb", "defs": ["= ನುರುಗು."]}, {"type": "noun", "defs": ["broken pieces of something.", "that which is weak, and which has fallen or likely to fall in to pieces.", "a person of little or no importance or of inferior quality.", "(dial.) flattened and dried cowdung."]}], "ನುರ್ಗುಗುಟ್ಟು": [{"type": "verb", "defs": ["to reduce to very small particles; to pulverise.", "to shatter, demolish to destroy completely."]}], "ನುರ್ಗುನುಱಿ": [{"type": "noun", "defs": ["the condition of being pulverised to very small pieces or particles.", "that which is shattered and utterly weakened."]}], "ನುರ್ಗುನೂಂಕು": [{"type": "noun", "defs": ["the condition or quality of being shattered completely."]}], "ನುರ್ಗೆ": [{"type": "noun", "defs": ["the small or middle sized, deciduous tree Moringa Oleifera (= M. pterygosperma, = Hyperanthera moringa) of Moringaceae family, with tripinnate leaves (used as vegetable), and smooth, but weak, wood; drum stick tree.", "its slender, long fruit, which is used as a vegetable; drum-stick."]}], "ನುರ್ಗೊತ್ತು": [{"type": "verb", "defs": ["to press, squeeze, using heavy pressure.", "to conquer and make subservient; to subjugate.", "to be pressed or squeezed intensely."]}], "ನುರ್ಚು": [{"type": "noun", "defs": ["small broken pieces chiefly of grains.", "a kind of gruel made of broken grains of rice, jowar etc.", "a man of inferior quality or worthy of little regard."]}], "ನುರ್ಚುನುರಿ": [{"type": "noun", "defs": ["= ನುರ್ಗುನುಱಿ."]}], "ನುರ್ಚುನುಱಿ": [{"type": "noun", "defs": ["= ನುರ್ಗುನುಱಿ."]}], "ನುರ್ಚುನೂಱು": [{"type": "noun", "defs": ["= ನುರ್ಗುನುಱಿ."]}], "ನುಲಿ": [{"type": "verb", "defs": ["to wind (two or more threads or strands) around one another, as by spinning.", "to wind two or more threads or strands of (cotton, silk, etc.) around one another so as to produce thread or cord.", "to produce (thread, cord, etc.) in this way.", "to coil, twist or entwine around; to wrench.", "to be coiled, twisted or entwined around; to be wrenched.", "to turn (as a screw).", "(fig.) to feel severe pain (in the intestines or emotionally).", "to twist the body or a part as in dancing."]}, {"type": "noun", "defs": ["a cord made of intertwisted stands of fibre; a thin rope.", "a sharp pain in the intestines.", "a severe emotional pain."]}], "ನುಲಿಕೆ": [{"type": "noun", "defs": ["= ನುಲಿ2 - 1.", "the condition of being intertwined or curled.", "a thing that is curled."]}], "ನುಲಿಗ": [{"type": "noun", "defs": ["a kind of plant."]}], "ನುಲಿಗಡಗ": [{"type": "noun", "defs": ["= ನುಲಿಗೆಕಪ್ಪ."]}], "ನುಲಿಗಪ್ಪ": [{"type": "noun", "defs": ["= ನುಲಿಗೆಕಪ್ಪ."]}], "ನುಲಿಗೆ": [{"type": "noun", "defs": ["= ನುಲಿಕೆ -2."]}], "ನುಲಿಗೆಕಪ್ಪ": [{"type": "noun", "defs": ["a golden or silver armlet having the design of a twisted cord."]}], "ನುಲಿಗೊಳ್ಳು": [{"type": "verb", "defs": ["to twist or wind (oneself) around."]}], "ನುಲಿಚು": [{"type": "verb", "defs": ["to twist or wind.", "(fig.) to cause to suffer a sudden and sharp emotional pain."]}], "ನುಲಿತ": [{"type": "noun", "defs": ["the act of twisting, wrenching of winding."]}], "ನುಲಿಮಂಚ": [{"type": "noun", "defs": ["a cot with a corded bottom."]}], "ನುಲಿವು": [{"type": "noun", "defs": ["a twisting or being twisted; an intertwining or curling about."]}], "ನುಲಿಸು": [{"type": "verb", "defs": ["to cause to be twisted or intertwined."]}], "ನುಲುವಾಲೆ": [{"type": "noun", "defs": ["a kind of plant."]}], "ನುಲುಹು": [{"type": "noun", "defs": ["= ನುಲಿಕೆ -2."]}], "ನುಶಿ": [{"type": "noun", "defs": ["= ನುಸಿ2."]}], "ನುಸಿ": [{"type": "verb", "defs": ["to enter or pass through a relatively narrow entrance.", "to push oneself into a mob.", "to affect distressingly as if by a wrench; to wrench."]}, {"type": "noun", "defs": ["the condition of being crushed, squashed.", "matter in the state of fine particles; powder.", "a kind of very small moth that destroys cloth, paper, etc.", "any very small moth that destroys grains.", "any of various families of four-winged, chiefly night-flying lepidopteran insects, that is attracted by light; a kind of moth.", "any of a large family (Culicidae) of two-winged dipteran insects, the females of which have skin-piercing mouthparts used to extract blood from animals, including humans, and a few varieties carry certain diseases; a mosquito.", "a kind of small insect, esp. dipterous fly, that flies around human eyes and abound in mango season; an eye-fly.", "a very petty, insignificant fellow; ನುಸಿ ಹಿಡಿ nusi hiḍi (cloth, paper, etc.) to be destroyed by certain kind of moth."]}], "ನುಸಿಗುಳಿಗೆ": [{"type": "noun", "defs": ["a small ball of naphthalene which is used as moth and cockroach repellents."]}], "ನುಸಿಗೊಳ್": [{"type": "verb", "defs": ["to condemn and turn down or reject."]}], "ನುಸಿಬಲೆ": [{"type": "noun", "defs": ["a net or screen for keeping out mosquitoes; a mosquito net."]}], "ನುಸಿಸು": [{"type": "verb", "defs": ["to cause to enter (into a narrow passage) or through (a narrow entrance)."]}], "ನುಸುಕು": [{"type": "", "defs": ["= ನುಸಿ1 - 1."]}], "ನುಸುಕುವ್ಯಾಪಾರ": [{"type": "noun", "defs": ["a trade that is illegal or is carried on without paying due excise or import duty; smuggling; contraband."]}], "ನುಸುಕುವ್ಯಾಪಾರಿ": [{"type": "noun", "defs": ["a person engaged in contraband trade; smuggler; a contrabandist."]}], "ನುಸುಗು": [{"type": "verb", "defs": ["= ನುಸಿ1 - 1."]}]}